{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.28.25 - Notice of Legal Clarification-1.pdf",
  "base_name": "03_28_25_notice_of_legal_clarification_1",
  "page_count": 12,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 233- 765358- 25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE COURT:  \n Petitioner, CHARLES DUSTIN MYERS, files this Notice o f Clarification , and in support \nthereof, shows the following:  \n1. Despite the strong legal position of the Petitioner, his self -represented status seems to \ntake priority in the eyes of the court regarding adjudication.  \n2. This notice is to provide the court with statutory context, Texas precedent, and to \nremind the court that his presence here is not out of naivety or misunderstanding of the law but indeed is derived from a thorough understanding of the facts that continue to be disregarded based on his self -represented status.  \n3. Even if a response were ordered by this court from the opposition, COOPER L. CARTER would not be able to produce any valid opposition, which is why she resorts to conduct that leverages her status as a licensed attorney such as what transpired on March 28\nth, 2025, before this very court. \n4.  Despite the court’s feelings towards pro- se litigants, the undersigned’s facts prevail.  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n Notice of Legal Clarification  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-28",
      "char_length": 1266
    },
    {
      "page_number": 2,
      "text": "I. Prohibited Ex Parte Contact During TRO Hearing \n5. It is improper for an attorney to communicate with a court about a matter pending \nwithout including or giving notice to the opposing party. Texas Disciplinary Rule of Professional \nConduct 3.05(b) expressly forbids a lawyer from communicating ex parte with a tribunal to \ninfluence a pending matter , except in very limited circumstances (e.g. in writing with prompt \ndelivery of a copy to the other side, or orally with adequate prior notice to the other side) . \nContacting the judge during the TRO hearing to announce an intended motion (such as consolidation) without the opponent’s knowledge or presence would violate this rule. As the Texas ethics rules explain, ex parte contacts outside these exceptions are strictly controlled due to \ntheir potential for abuse . In short, unless permitted by law and with proper notice, one party’s \nlawyer cannot privately influence the court about a case . \n“A lawyer shall not… communicate ex parte with a tribunal for the purpose of \ninfluencing that entity or person concerning a pending matter” except in the course of \nofficial proceedings or with notice to the opposing side ” - Tex. R. Disc. Prof'l. Cond. \n3.05 \n \n 6. In the instant case, this is exactly what occurred. Without informing the Petitioner \nabout her availability issues, she skipped over these rules to  influence proceedings to which she \ndid not respond to, raise objection to, or provide any valid argument against. Instead, she \nrequested to contact the judge during an emergency TRO, which was not only permitted by the Associate Judge of the 233\nrd District Court, but directly influenced the proceedings in violation \nof the above rules.   \n7. This kind of off -the-record communication is also inconsistent with the judge’s ethical \nduties. The Texas Code of Judicial Conduct prohibits judges from initiating or permitting ex",
      "char_length": 1905
    },
    {
      "page_number": 3,
      "text": "parte communications about the merits  of a pending case . - Canon 3.B(8)  Texas Code of \nJudicial Conduct . In an ethics opinion, the judge’s act of discussing a case with one lawyer (even \nat the judge’s own initiative) was deemed a violation of Canon 3(B)(8) . Exhibit 1  \n8. Accordingly, a lawyer who calls or messages the court during an opponent’s hearing \n(without proper notice) is engaging in an impermissible ex parte contact. Such conduct has been \ncondemned as undermining the fairness of proceedings and can subject the lawyer to discipline under Rule 3.05(b) . Tex. Comm. On Professional Ethics, Op. 604 (2011) . The proper course \nwould be to file any motion (like consolidation) through normal procedures and ensure the other party has notice or an opportunity to be heard, ra ther than attempting to sway the judge in \nprivate.  \n9. In the instant case, the proper course was not followed. In fact, the proper course has \nnot been followed throughout the entirety of the litigation from Ms. Carter. At the last minute, \nCOOPER L. CARTER requested to be ‘patched in’ to the EMERGENCY TRO hea ring on March \n28, 2025, by contacting court staff after hours rather than contacting Petitioner directly. Furthermore, after Petitioner traveled to the 233\nrd District Court on March 28th, 2025, to present \nhis motion – the Judge used these ex -parte communic ations to deprive the Petitioner of his due \nprocess rights, and allowed Ms. Carter to declare the EMERGENCY TRO ‘improper’ despite \nproviding no argument or counter -argument to Petitioner’s objection. \n10. Given that the TRO was a true emergency and the ex -parte communications directly \nimpacted the Petitioner’s due process rights, the court effectively denied Petitioner the right to be \nheard from the unsworn testimony of an attorney who, despite claiming she would file a motion \nto consolidate, never did so. This is a blatant disregard for Texas law and an attempt to \nundermine the Petitioner’s position and the best interests of the children, which was successful.",
      "char_length": 2046
    },
    {
      "page_number": 4,
      "text": "II. Effect of a Pending Rule 12 Motion to Show Authority  \n 11. Under Texas law, when an attorney’s authority to act in a case is challenged by a Rule \n12 motion, the attorney may not act on behalf of the client until the court resolves that \nmotion . Texas Rule of Civil Procedure 12 allows any party to require an attorney to “show \nauthority” to represent a client. At the Rule 12 hearing, the burden is on the challenged attorney to prove his authority; if he fails, the court “shall refuse to permit the attorney to appear in the cause”  and shall strike any pleadings fi led without authority . See In Re: Freeman \nGRAVITT  (2012) . \n 12. Texas courts have held that once a question is raised about an attorney’s authority, the \nRule’s requirements are mandatory and must be strictly followed. Id. In In re Salazar , the Fort \nWorth Court of Appeals emphasized that “once the trial court finds the challenged attorney has not met his burden of proof, it is mandatory that the trial court follow Rule 12’s requirements .”\nId. 315 S.W.3d 279, 283 (Tex.App. -Fort Worth 2010, orig. proceeding) . This means the attorney \ncan no longer represent the party in that case unless and until he demonstrates authority. \n 13. Importantly, during the pendency of a Rule 12 motion (before it is decided), the \nattorney’s power to act for the client is suspended or at least highly questionable. Texas courts discourage any further action by that lawyer until the challenge is resolved, to avoid \nunauthorized filings or proceedings. For example, in Sloan v. Rivers  (Fort Worth Court of \nAppeals), an attorney admitted he had no authority from the named party; the court noted this admission “vitiates the petition”  that had been filed, re ndering it a nullity . In re B.E.A.R. , No. \n05–02–01493–CV , 2003 WL 21544507 (Tex.App. -Dallas 2003, July 10, 2003, no pet.) (mem. \nop.).",
      "char_length": 1873
    },
    {
      "page_number": 5,
      "text": "14. In other words, actions taken by a lawyer without authority have no effect. Thus, if an \nattorney is facing a Rule 12 motion, any attempt to participate in hearings, file additional \npleadings, or otherwise act on the client’s behalf before the court rules on the motion is improper. The proper procedure is to halt such participation until the attorney proves his authority at the Rule 12 hearing. Only after the court is satisfied that the attorney is authorized should the attorney resume acting for the cl ient. In Re: Freeman GRAVITT  (2012) . Failure  to abide by this \ncould result in the attorney’s filings being stricken and even dismissal of claims if no authorized person is pursuing them . \n 15. In the instant case, COOPER L. CARTER’s authority has not only been pending \nbefore the 322\nnd District Court since September 20, 2024, but remains un- opposed, unanswered, \nand unadjudicated. All of these facts were pointed out in both the emergency TRO that the court refused to hear and actually un- set for a hearing which the court refused to look at. The same \napplies to this court. Promptly after the incorrect consolidation motion was filed by COOPER L. CARTER in this court, it was objected to and summa rily ignored by the court. \n 16. In essence, the court not only permitted ex- parte communications in violation of \nprofessional and judicial ethics but permitted her to do so while her authority remained in question in both courts. COOPER L. CARTER has not provided any meaningful insights into \nthe core issues of this case – the children’s best interests. Rather, she has continued to ask favors from the bench which have been entertained at the expense of the best interest of the children named in this suit. Petitioner reminds this court that he opened this suit to escape this exact situation and allowed the same attorney with no legal position to influence proceedings she failed \nto participate in.",
      "char_length": 1934
    },
    {
      "page_number": 6,
      "text": "17. Finally, when raising the proper argument before the tribunal, the law came second to \npolitics, and the Petitioner’s pro- se status rendered his valid position ‘improper’ arbitrarily and \nprompted the tribunal to redefine Rule 237a of the Texas Rules of  Civil Procedure and deny him \nthe ability to be heard.  \nIII. RULE 237A OF THE TEXAS RULES OF CIVIL PROCEDURE  \n 18. Contrary to the court’s claims, Rule 237a of the Texas Rules of Civil Procedure is \nmandatory, regardless of how the case was removed or if the removal was proper.  \n19. Under Rule 237a, the procedure  is that the plaintiff (after remand ) must file a \ncertified copy of the federal remand order with the state court and give written notice of that \nfiling to the defendant . HBA East, Ltd. v. JEA Boxing Co., 796 S.W.2d 534, 537 (Tex. App. \n1990)  (“The plain wording of rule 237a gives a defendant 15 days from the receipt of the \nplaintiff's notice of the filing of the order of remand to file an answer in state court, without reference to whether the original removal was provident. Were we to hold that actual notice of an order of remand wa s sufficient to cause the 15 -day period to commence, not only would we \nrender meaningless the language of rule 237a, but we would cause confusion among practitioners concerning the \"start\" date from which the 15 -day answer deadline is determined after a cause is \nremanded to state court from federal court.”) .  \n20. Other courts have agreed with the HBA East  approach. In Kashan v. McLane Co., \nfor example, the Austin Court of Appeals overturned a post -remand default judgment, reiterating \nthat “the plain language of Rule 237a places the burden on the plaintiff to file the remand order with the state court and to provide written notice  to the defendant,”  and that a defendant’s actual \nnotice from the federal proceedings does not excuse non- compliance . Id. NO. 03- 11-00125- CV , 7",
      "char_length": 1923
    },
    {
      "page_number": 7,
      "text": "(Tex. App. Jun. 7, 2012) . Even an improper or frivolous removal invokes this rule because, \nduring the period of removal, the state court had no jurisdiction; once the case returns, fairness \ndictates the defendant get a reasonable time to answer in state court.  In short, Rule 237a is \nmandatory and applies in all removal scenarios , as the language unambiguously states. \n21. In the instant case, the court, off the record, made the argument contrary to the above. \nNothing in Texas law supports the notion that “improperly removed cases by pro- se litigants \ndon’t apply” or that improperly removed cases do not divest the state c ourt of jurisdiction. \nCommon law and the face of rule 237a contradict this notion outright. Despite this, the court chose to apply the law incorrectly due to one of the following reasons:  \n a. The ex -parte communications made between COOPER L. CARTER and the tribunal;  \n b. The deep -seated antagonism against self -represented litigants; \n c. The presumption that the pro- se litigant doesn’t know his legal position. \nOther than these three reasons, the court had nothing before it to come to this conclusion, and declared the TRO improper.  \n 22. Therefore, the court’s directive to ‘file the TRO in the 322\nnd district court’ fails \nbecause they do not have jurisdiction over the divorce matter given COOPER L. CARTER’S \ninability to follow proper procedure.  \n 23. Despite these failures by COOPER L. CARTER, the children and the Petitioner suffer \nthe consequences . \n 24. Had the court even taken a cursory review at the emergency TRO, these facts would \nhave been apparent. However, the court chose not to act for reasons not supported by Texas law.",
      "char_length": 1698
    },
    {
      "page_number": 8,
      "text": "IV . Dilatory Tactics and False Promises of Consolidation (Rule 3.02 and Sanctions)  \n 24. Texas Disciplinary Rule 3.02 obligates attorneys to avoid tactics that unreasonably \ndelay or burden the legal process. The rule states: “In the course of litigation, a lawyer shall not \ntake a position that unreasonably increases the costs or other burdens of the case or that \nunreasonably delays resolution of the matter.”  Falsely promising to file a motion (such as a \nmotion to consolidate cases) with no intent to actually do so – merely to delay a proceeding – violates this ethical mandate. Such behavi or is considered a dilatory tactic with no substantial \npurpose other than to frustrate the opposing party or the court schedule. The comments to Rule 3.02 note that “Dilatory practices indulged in merely for the convenience of lawyers”  or for \nstrategic delay are “normally… ‘unreasonable’ within the meaning of this Rule.”  \n 25. In other words, an attorney cannot feign intent to take a legal step (like consolidation) \nas a ploy to push back a hearing or gain an unfair time advantage. Doing so not only breaches professional ethics (Rule 3.02) but can also run afoul of procedural rules that guard against bad-faith litigation conduct.  \n 26. If an attorney engages in delay for delay’s sake or other bad- faith litigation tactics, \nTexas courts have tools to sanction such conduct. Rule 13 of the Texas Rules of Civil \nProcedure  authorizes sanctions against attorneys who file pleadings or motions that are \ngroundless and brought in bad faith or for the purpose of harassment.  \n 27. Likewise, Chapter 10 of the Civil Practice & Remedies Code (Tex. Civ. Prac. & \nRem. Code §§10.001–.004) requires that every pleading or motion be warranted by good faith legal arguments and not filed for an “improper purpose,” which expressly includes causing unnecessary delay. An attorney who, for example, files a frivolous motion or makes false",
      "char_length": 1944
    },
    {
      "page_number": 9,
      "text": "representations to postpone proceedings can be sanctioned with penalties ranging from fee \nawards to contempt. \n 28. Texas case law provides examples of sanctions for dilatory or bad -faith tactics. In \nBradt v. Sebek , 14 S.W.3d 756 (Tex. App.—Houston [1st Dist.] 2000, pet. denied), an attorney \nwas sanctioned under Rule 13 for pursuing litigation tactics that were not aimed at resolving the \ncase on the merits, but rather at harassing the opponents and causing undue del ay. The court \nfound the attorney had acted in “bad faith”, which it defined as more than mere bad judgment – “it implies the conscious doing of a wrong f or a dishonest, discriminatory, or malicious \npurpose.”  \n 29.\n Specifically, the attorney in Bradt  made sweeping allegations and dragged out the \nproceedings without evidence – conduct which the trial court concluded “was to abuse or harass \nthe defendants in bad faith with frivolous claims ”.  Upholding a $100,000 sanction, the First \nCourt of Appeals agreed that the attorney’s pleadings were groundless and brought in bad faith or to harass . This case underlines that courts will penalize lawyers who use legal processes as a \nweapon of delay or obstruction rather than to adjudicate genuine disputes.  \n 30. Importantly, deliberately misleading the court or the other party about one’s \nintentions  (such as claiming “I will file a consolidation motion” to induce the court to halt the \nopponent’s hearing, and then never following through) is the type of bad- faith conduct that can \ntrigger sanctions. Courts look to whether an attorney’s statements or fi lings had any reasonable \nbasis or were simply a sham. If there was no legal or factual basis to consolidate (and the attorney never actually intended to seek consolidation), representing otherwise is arguably a false statement to the tribunal as well as a dilatory tactic. This could violate not only Rule 3.02 but",
      "char_length": 1914
    },
    {
      "page_number": 10,
      "text": "also Rule 3.01 (prohibiting frivolous filings) and Rule 3.03 (candor toward the tribunal), and \nwould justify sanctions under Texas law.  \n 31. For instance, in Darnell v. Broberg, 565 S.W.3d 450 (Tex. App.—Texarkana 2018, \npet. denied), the court affirmed sanctions where a party’s pleadings were made in bad faith for improper purposes. The court echoed the standard that bad faith means the conscious doing of a wrong for a dishonest purpose, and it found that standard met when a party persisted in groundless tactics that served only to delay and needlessly increase the cost of litigation.  \n 32. Similarly, in Herring v. Welborn , 27 S.W.3d 132 (Tex. App.—San Antonio 2000, \npet. denied), the court explained that an objective lack of basis combined with an improper motive (such as delay or harassment) warrants sanctions: “filing a pleading with no basis in fact or law, for the purpose of delay, is sanctionable as bad faith.”  (See id. at 143). \n 33. In summary, Texas Disciplinary Rule 3.02 forbids lawyers from needlessly delaying \nlitigation, and using a ruse of “planned consolidation” to derail a hearing would violate this duty. Additionally, Rule 13, Texas R.Civ.P., and Chapter 10, CPRC  provide courts the power to \nsanction filings or arguments made in bad faith or for delay. Texas appellate decisions demonstrate that courts will sanction attorneys for dilatory tactics  – i.e., conduct with no \nsubstantive purpose except to delay or thwart the proce edings . \n 34. In the instant case, this is exactly how COOPER L. CARTER has been handling these \nmatters. She has provided no substance in either court, has filed no responsive pleadings, has failed to show her authority, and continuously side -steps the rules of procedure to the detriment \nof both the Petitioner and his children.",
      "char_length": 1808
    },
    {
      "page_number": 11,
      "text": "35. If COOPER L. CARTER had any valid legal position, she would have asserted it after \n14 months of litigation. Instead, she has continuously utilized her status as a licensed attorney to \nleverage improper and unethical practices to avoid accountability f or her client.  \n 36. If the tables were turned, the EMERGENCY TRO would have been granted without \nquestion today by the Associate Judge, and the pro- se litigant would have been reprimanded for \nthe conduct outlined above.  \n 37. Instead, despite the Petitioner’s legal position being accurate and in- line with Texas \nprecedent, the court chose to deny due process and favor the attorney without even glancing at \nthe motion. \nCONCLUSION \n The 233rd District Court of Tarrant County should re -address this situation immediately, \nas the actions taken in the face of a true emergency are unacceptable, unlawful, and leaves the children in this matter without the relief that  has been desperately and diligently sought for the \npast year.  \n Pro-se litigant or not, this court has a duty to uphold the law, and today, it utterly failed in \nthis prospect by choice by enabling the conduct of COOPER L. CARTER to continue at the expense of the children.  \n Despite the clear bias towards self -representation – the Petitioner has made his legal \nposition clear. The court cannot just waive his arguments in favor of unethical legal practices and deny him the opportunity to be heard. Because in the end, the consol idation motion was never \nfiled. This notice, alongside the brief oral statement given in open court, explains why. Despite \nthis, the court chose politics over Texas law in this matter, and the children bear the fallout .",
      "char_length": 1696
    },
    {
      "page_number": 12,
      "text": "Respectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court, Watauga Texas 76148  \n 817-546-3693",
      "char_length": 131
    }
  ]
}