{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\01.31.24 - Amended Counterpetition for Divorce-1.pdf",
  "base_name": "01_31_24_amended_counterpetition_for_divorce_1",
  "page_count": 19,
  "pages": [
    {
      "page_number": 1,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 1 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx CAUSE NO. 322-744263-23 \n \nIN THE MATTER OF THE § IN THE DISTRICT COURT\nMARRIAGE OF §\n §MORGAN MICHELLE MYERS §AND § 322ND JUDICIAL DISTRICTCHARLES DUSTIN MYERS § §AND IN THE INTEREST OF §MARA EVONNE MYERS AND CAROLINE ROSE MYERS, CHILDREN §§§ TARRANT COUNTY, TEXAS\n  \nFIRST AMENDED COUNTERPETITION FOR DIVORCE \nDiscovery Control Plan \n1.  Pursuant to Rule 190 of the Tex as Rules of Civil Procedure,  discovery is intended to \nbe conducted in this suit under Level 2. \nObjection to Associate Judge \n2.  CHARLES DUSTIN MYERS, Count erpetitioner, objects to an asso ciate judge \nhearing a trial on the merits o r presiding at a jury trial. \nNature of the Suit \n3.  This suit is brought by CHARLES DUSTIN MYERS, Counterpetitioner, against \nMORGAN MICHELLE MYERS, Counterre spondent, seeking dissolution of their marriage and \nresolution of issues affecting the  parent-child r elationship. \nCHARLES DUSTIN MYERS’s Information \n4.  The last three numbers of CHAR LES DUSTIN MYERS's Texas driv er’s license \nnumber are 608. The last three num bers of CHARLES DUSTIN MYERS' s Social Security \nnumber are 963   322-744263-23 FILED\nTARRANT COUNTY\n1/31/2024 2:51 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1530
    },
    {
      "page_number": 2,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 2 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx Service of Citation \n5.  No service of citation on MORGA N MICHELLE MYERS is requeste d at this time. \nDivorce Jurisdiction \n6.  MORGAN MICHELLE MYERS and CHA RLES DUSTIN MYERS have been \ndomiciliaries of this state for the preceding six-month period. MORGAN MICHELLE MYERS \nhas been a resident of Tarrant  County for the preceding ninety- day period. CHARLES DUSTIN \nMYERS has been a resident of Tarrant County for the preceding n inety-day period. \nDates of Marriage and Separation \n7.  MORGAN MICHELLE MYERS and CHA RLES DUSTIN MYERS married on o r \nabout June 20, 2015 in Watauga, Texas and separated on or about December 18, 2023. \nGrounds for Divorce \n8.  The marriage has become insupportable because of discord or  a conflict of \npersonalities between MORGAN MI CHELLE MYERS and CHARLES DUSTIN MYERS that \ndestroys the legitimate ends of the marriage relationship and p revents any reasonable expectation \nof reconciliation. Children of the Marriage \n9.  MORGAN MICHELLE MYERS and CHARL ES DUSTIN MYERS are parents of the \nfollowing children born or adopted o f this marriage who are und er 18 years of age or who are \notherwise entitled to support as provided by Chapter 154 of the  Texas Family Code:  \nName: MARA EVONNE MYERS \nGender: Female SSN (last 3): XXX Birth Date: 06/20/2016 Home State: Texas  Name: CAROLINE ROSE MYERS Gender: Female \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1695
    },
    {
      "page_number": 3,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 3 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx SSN (last 3): XXX \nBirth Date: 04/12/2018 Home State: Texas  \nContinuing Jurisdiction \n10.  No court has continuing juris diction of the suit affecting  the parent-child \nrelationship. \nNo Court-Ordered Relationships \n11.  There are no court-ordered rel ationships for the children of this suit. \nUCCJEA Statement \n12.  Each party to this suit resid es in Texas. The information required under Section \n152.209 of the Texas Family Code is not applicable. Health Insurance \n13.  The information require d under Section 154.181(b) and Sect ion 154.1815 of the \nTexas Family Code will be filed with this Court before any hearing on Temporary Orders or a \nFinal Order. \nChildren’s Property \n14.  CHARLES DUSTIN MYERS states  that there is no property of value owned or \npossessed by the children t he subject of the suit. \nNo Protective Order \n15.  No protective order under Title 4 of the Texas Family Code  or order for emergency \nprotection under Article 17.292 of t he Texas Code of Criminal P rocedure is in effect in regard to \na party to this suit or a child of a party to this suit, and no  applications for such orders are \npending before the Court.   \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1498
    },
    {
      "page_number": 4,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 4 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx Appointment of Joint Managing Conservators \n16.  It is in the best interest o f the children that CHARLES DU STIN MYERS and \nMORGAN MICHELLE MYERS be appointed as joint managing conservato rs of the children. \nCHARLES DUSTIN MYERS petitions t he Court to appoint CHARLES DUS TIN MYERS and \nMORGAN MICHELLE MYERS as joint managing conservators of MARA EV ONNE MYERS \nand CAROLINE ROSE MYERS with a ll the rights and duties of a par ent appointed as a \nconservator of a child. \nPrimary Residence Designation \n17.  CHARLES DUSTIN MYERS petitions  this Court to designate him the conservator \nwho has the exclusive right to determine the primary residence of the children within Tarrant and \ncontiguous counties, Texas. \nProperty of the Parties \nAgreed Division of Marital Estate \n18.  CHARLES DUSTIN MYERS expects to enter into a written agree ment with \nMORGAN MICHELLE MYERS concerning the division of the marital es tate. If a written \nagreement concerning division of t he marital estate is submitted, CHARLES DUSTIN MYERS \npetitions this Court to approve t he agreement and order divisio n of the marital estate as the \nparties have agreed. If an agree ment dividing the property is n ot reached, CHARLES DUSTIN \nMYERS petitions this Court to ord er a division of the estate of the parties in a manner that this \nCourt deems just and right, havi ng due regard for the rights of  each party and any children of the \nmarriage, and as provided by law. \nTemporary Relief \nCombined Family Code Temporary Restraining Order and Injunction \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1875
    },
    {
      "page_number": 5,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 5 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx 19.  CHARLES DUSTIN MYERS petitions this Court to dispense with the issuance of a \nbond, grant a temporary restraini ng order without notice to MORGAN MICHELLE MYERS for \nthe preservation of the property of the parties and the protect ion of the parties as necessary and, \nafter notice and heari ng, render an order gr anting a temporary injunction for the preservation of \nthe property and protection of the parties as deemed necessary and equitable and including, but \nnot limited to, an order prohibi ting MORGAN MICHELLE MYERS from  engaging in any of the \nfollowing conduct: \na.  intentionally communicati ng in person or in any other manne r, including by telephone \nor another electronic voice tran smission, video chat, in writin g or electronic messaging, \nwith the other party by use of vul gar, profane, obscene, or ind ecent language or in a \ncoarse or offensive manner, with  intent to annoy or alarm the o ther party; \nb.  threatening the other part y, in person or in any other manner, including by telephone \nor another electronic voice tran smission, video chat, in writin g, or electronic messaging, \nto take unlawful action agai nst any person, intending by this action to annoy or alarm the \nother party; \nc.  placing a telephone call, anonymously, at an unreasonable h our, in an offensive and \nrepetitious manner, or without a  legitimate purpose of communic ation with the intent to \nannoy or alarm the other party; d.  intentionally, knowingly, or reck lessly causing bodily inju ry to the other party or to a \nchild of either party; e.  threatening the other party or a child of either party with  imminent bodily injury; \nf.  intentionally, knowingly, or recklessly destroying, removin g, concealing, \nencumbering, transferring, or otherwise harming or reducing the value of the property of \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2158
    },
    {
      "page_number": 6,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 6 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx the parties or a protected part y with intent to obstruct the Co urt’s authority to divide the \nparties’ estate in a manner that  this Court deems just and righ t, having due regard for the \nrights of each party and any ch ildren of the marriage; \ng.  intentionally falsi fying a writing or record, including an electronic record, relating to \nthe property of either party; \nh.  intentionally misrepresenti ng or refusing to disclose to th e other party or to the Court, \non proper request, the existence , amount, or location of any ta ngible or intellectual \nproperty of the parties or either party, including electronically stored or recorded information; i.  intentionally or knowingly dama ging or destroying the tangi ble or intellectual property \nof the parties or either party, including electronically stored  or recorded information; \nj.  intentionally or knowingly tampe ring with the tangible or i ntellectual property of the \nparties or either party, incl uding electronically stored or rec orded information, causing \npecuniary loss or substantial in convenience to the other party; \nk.  except as specifically author ized by order of this Court: \ni.  selling, transferring, assi gning, mortgaging, encumbering, or in any other \nmanner alienating any of the prop erty of the part ies or either party, regardless of \nwhether the property is: \n(1)  personal property, real prope rty, or intellect ual property ; or  \n(2)  separate or community property; \nii.  incurring any debt, other than  legal expenses in connectio n with this suit for \ndissolution of marriage; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1920
    },
    {
      "page_number": 7,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 7 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx iii.  withdrawing money from any checking or savings account in  any financial \ninstitution for any purpose; \niv.  spending any money in either pa rty’s possession or subject  to either party’s \ncontrol for any purpose; v.  withdrawing or borrowing in any m anner for any purpose from  any retirement, \nprofit-sharing, pension, death, or other employee benefit plan, employee savings plan, individual retirement account, or Keogh account of either  party; \nvi.  withdrawing or borrowing in any manner all or any part of the cash surrender \nvalue of a life insurance po licy on the life of either party or  a child of the parties; \nl.  entering any safe deposit box i n the name of or subject to the control of the parties or \neither party, whether individua lly or jointly with others; \nm.  changing or in any manner alt ering the beneficiary designat ion on any life insurance \npolicy on the life of e ither party or a chil d of the parties; \nn.  canceling, altering, faili ng to renew or pay premiums on, o r in any manner affecting \nthe level of coverage that existed at the time the suit was fil ed of, any life, casualty, \nautomobile, or health insurance  policies insuring the parties’ property or persons \nincluding a child of the parties; o.  opening or diverting mail, e-mail, or any other electronic communication addressed to \nthe other party; p.  signing or endorsing the other party’s name on any negotiab le instrument, check, or \ndraft, such as tax refunds, insur ance payments, and dividend, o r attempting to negotiate \nany negotiable instrument payabl e to the other party without th e personal signature of the \nother party; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1985
    },
    {
      "page_number": 8,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 8 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx q.  taking any action to terminate or limit credit or charge cr edit cards in the name of the \nother party; \nr.  discontinuing or reducing the w ithholding for federal incom e taxes from either party’s \nwages or salary; s.  destroying, disposing of, or a ltering any financial records  of the parties, including a \ncanceled check, deposit slip, and oth er records from a financia l institution, a record of \ncredit purchases or cash advan ces, a tax return, and a financial statement; \nt.  destroying, disposing of, or a ltering any e-mail, text mess age, video message, or chat \nmessage or other electronic data or electronicall y stored infor mation relevant to the \nsubject matter of the suit for  dissolution of marriage, regardl ess of whether the \ninformation is stored on a hard dr ive, in a removable storage device, in cloud storage, or \nin another electronic storage medium; u.  modifying, changing, or alteri ng the native format or metad ata of any electronic data \nor electronically stored inform ation relevant to the subject ma tter of the suit for \ndissolution of marriag e, regardless of whether the information is stored on a hard drive, in \na removable storage device, in cloud storage, or in another electronic storage medium; \nv.  deleting any data or content from any social network profil e used or created by either \nparty or a child of the parties; w.  using any password or persona l identificati on number to gai n access to the other \nparty’s e-mail account, bank account, social media account, or any other electronic account; x.  terminating or in any manner a ffecting the service of water , electricity, gas, telephone, \ncable television, or other contra ctual service, including secur ity, pest control, \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2078
    },
    {
      "page_number": 9,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 9 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx landscaping, or yard mai ntenance at the resid ence of either par ty, or in any manner \nattempting to withdraw any deposit paid in connection with any of those services; \ny.  excluding the other party from the use and enjoyment of a specifically identified \nresidence of the other party; \nz.  entering, operating, or exercis ing control over a motor veh icle in the possession of the \nother party; and aa.  tracking or monitoring personal property or a motor vehicl e in the possession of a \nparty, without that party’s ef fective consent, including by:  \ni.  using a tracking applicati on on a personal electronic devic e in the possession of \nthat party or using a tracking device; or  ii.  by physically following that  party or causing another to p hysically follow that \nparty. \nCombined Family Code Temporary Restraining Order and Injunction \n20.  CHARLES DUSTIN MYERS petitions this Court to dispense with the issuance of a \nbond, grant a temporary restraini ng order without notice to MORGAN MICHELLE MYERS for \nthe safety and welfare of the children and, after notice and hearing, that this Court may render an appropriate order, including the granting of a temporary injunc tion for the safety and welfare of \nthe children as deemed necessar y and equitable and including, b ut not limited to, an order \nprohibiting MORGAN MICHELLE MYERS  from engaging in any of the f ollowing conduct: \na.  disturbing the peace of the children or another party; b.  disrupting or withdrawing the  children from the school or d ay-care facility where the \nchildren are presently enrolled, without the written agreement of both parents or an order of this Court; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1997
    },
    {
      "page_number": 10,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 10 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx c.  hiding or secreting the childre n from the other party or changing the children's current \nplace of abode without the writt en agreement of both parents or  an order of this Court; \nd.  making disparaging remarks regarding t he other party or the  other party’s family in \nthe presence or within the hearing of the children; and \ne.  being present within the same residence as the children bet ween 8:00 p.m. and 8:00 \na.m. with an unrelated adult wit h whom a party has an intimate relationship. \nTemporary Authorizations \n21.  CHARLES DUSTIN MYERS petitions  this Court to authorize MOR GAN \nMICHELLE MYERS to do the following: \na.  to make expenditures and incur  indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medic al care. \nb.  to make expenditures and incur  indebtedness for reasonable attorney's fees and \nexpenses in connecti on with this suit. \nc.  to make withdrawals from acc ounts in financial institutions  only for the purposes \nauthorized by this Court. \nTemporary Orders and Injunction \nFamily Code Temporary Orders and Injunction \n22.  CHARLES DUSTIN MYERS petitions  this Court, after notice an d hearing, to \ndispense with the issuance of a  bond and render a n appropriate order granting a temporary \ninjunction for the preservation of the property and protection of the parties as deemed necessary \nand equitable, including, but not  limited to, an order prohibit ing MORGAN MICHELLE \nMYERS from engaging in any of  the following conduct: \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1869
    },
    {
      "page_number": 11,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 11 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx a.  intentionally communicati ng in person or in any other manne r, including by telephone \nor another electronic voice tran smission, video chat, in writin g or electronic messaging, \nwith the other party by use of vul gar, profane, obscene, or ind ecent language or in a \ncoarse or offensive manner, with  intent to annoy or alarm the o ther party; \nb.  threatening the other part y, in person or in any other manner, including by telephone \nor another electronic voice tran smission, video chat, in writin g, or electronic messaging, \nto take unlawful action agai nst any person, intending by this action to annoy or alarm the \nother party; \nc.  placing a telephone call, anonymously, at an unreasonable h our, in an offensive and \nrepetitious manner, or without a  legitimate purpose of communic ation with the intent to \nannoy or alarm the other party; d.  intentionally, knowingly, or reck lessly causing bodily inju ry to the other party or to a \nchild of either party; \ne.  threatening the other party or a child of either party with  imminent bodily injury; \nf.  intentionally, knowingly, or recklessly destroying, removin g, concealing, \nencumbering, transferring, or otherwise harming or reducing the value of the property of \nthe parties or a protected part y with intent to obstruct the Co urt’s authority to divide the \nparties’ estate in a manner that  this Court deems just and righ t, having due regard for the \nrights of each party and any ch ildren of the marriage; \ng.  intentionally falsi fying a writing or record, including an electronic record, relating to \nthe property of either party; h.  intentionally misrepresenti ng or refusing to disclose to th e other party or to the Court, \non proper request, the existence , amount, or location of any ta ngible or intellectual \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2139
    },
    {
      "page_number": 12,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 12 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx property of the parties or either party, including electronically stored or recorded \ninformation; i.  intentionally or knowingly dama ging or destroying the tangi ble or intellectual property \nof the parties or either party, including electronically stored  or recorded information; \nj.  intentionally or knowingly tampe ring with the tangible or i ntellectual property of the \nparties or either party, incl uding electronically stored or rec orded information, causing \npecuniary loss or substantial in convenience to the other party; \nk.  except as specifically author ized by an order of this Court : \ni.  selling, transferring, assi gning, mortgaging, encumbering, or in any other \nmanner alienating any of the prop erty of the part ies or either party, regardless of \nwhether the property is: \n(1)  personal property, real prope rty, or intellect ual property ; or  \n(2)  separate or community property; \nii.   incurring any debt, other than  legal expenses in connection with this suit for \ndissolution of marriage; iii.  withdrawing money from any checking or savings account in  any financial \ninstitution for any purpose; iv.  spending any money in either pa rty’s possession or subject  to either party’s \ncontrol for any purpose; v.  withdrawing or borrowing in any m anner for any purpose from  any retirement, \nprofit-sharing, pension, death, or other employee benefit plan, employee savings plan, individual retirement account, or Keogh account of either  party; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1820
    },
    {
      "page_number": 13,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 13 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx vi.  withdrawing or borrowing in any manner all or any part of the cash surrender \nvalue of a life insurance po licy on the life of either party or  a child of the parties; \nl.  entering any safe deposit box i n the name of or subject to the control of the parties or \neither party, whether individua lly or jointly with others; \nm.  changing or in any manner alt ering the beneficiary designat ion on any life insurance \npolicy on the life of e ither party or a chil d of the parties; \nn.  canceling, altering, faili ng to renew or pay premiums on, o r in any manner affecting \nthe level of coverage that existed at the time the suit was fil ed of, any life, casualty, \nautomobile, or health insurance  policies insuring the parties’ property or persons \nincluding a child of the parties; \no.  opening or diverting mail, e-mail, or any other electronic communication addressed to \nthe other party; p.  signing or endorsing the other party’s name on any negotiab le instrument, check, or \ndraft, such as tax refunds, insur ance payments, and dividend, o r attempting to negotiate \nany negotiable instrument payabl e to the other party without th e personal signature of the \nother party; q.  taking any action to terminate or limit credit or charge cr edit cards in the name of the \nother party; r.  discontinuing or reducing the w ithholding for federal incom e taxes from either party’s \nwages or salary; s.  destroying, disposing of, or a ltering any financial records  of the parties, including a \ncanceled check, deposit slip, and oth er records from a financia l institution, a record of \ncredit purchases or cash advan ces, a tax return, and a financial statement; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2014
    },
    {
      "page_number": 14,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 14 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx t.  destroying, disposing of, or a ltering any e-mail, text mess age, video message, or chat \nmessage or other electronic data or electronicall y stored infor mation relevant to the \nsubject matter of the suit for  dissolution of marriage, regardl ess of whether the \ninformation is stored on a hard dr ive, in a removable storage device, in cloud storage, or \nin another electronic storage medium; \nu.  modifying, changing, or alteri ng the native format or metad ata of any electronic data \nor electronically stored inform ation relevant to the subject ma tter of the suit for \ndissolution of marriag e, regardless of whether the information is stored on a hard drive, in \na removable storage device, in cloud storage, or in another electronic storage medium; \nv.  deleting any data or content from any social network profil e used or created by either \nparty or a child of the parties; w.  using any password or persona l identificati on number to gai n access to the other \nparty’s e-mail account, bank account, social media account, or any other electronic \naccount; \nx.  terminating or in any manner a ffecting the service of water , electricity, gas, telephone, \ncable television, or other contra ctual service, including secur ity, pest control, \nlandscaping, or yard mai ntenance at the resid ence of either par ty, or in any manner \nattempting to withdraw any deposit paid in connection with any of those services; \ny.  excluding the other party from the use and enjoyment of a specifically identified \nresidence of the other party; z.  entering, operating, or exercis ing control over a motor veh icle in the possession of the \nother party; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1994
    },
    {
      "page_number": 15,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 15 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx aa.  tracking or monitoring personal property or a motor vehicl e in the possession of a \nparty, without that party’s ef fective consent, including by:  \ni.  using a tracking applicati on on a personal electronic devic e in the possession of \nthat party or using a tracking device; or  \nii.  by physically following that  party or causing another to p hysically follow that \nparty; \nbb.  interfering with the other party's sp ending of funds for r easonable and necessary \nliving expenses; and cc.  interfering with the other party’s en gaging in acts reasonable and necessary to \nconduct that party ’s usual business and occupation. \nFamily Code Temporary Orders and Injunction \n23.  CHARLES DUSTIN MYERS petitions  this Court, after notice an d hearing, to \ndispense with the issuance of a bond, and render an appropriate  order, including the granting of a \ntemporary injunction f or the safety and welfare of the children  as deemed necessary and \nequitable, including, but not limited to, an order prohibiting MORGAN MICHELLE MYERS \nfrom engaging in any of the following conduct: \na.  disturbing the peace of the children or another party; b.  disrupting or withdrawing the  children from the school or d ay-care facility where the \nchildren are presently enrolled w ithout the written agreement o f both parents or an order \nof this Court; c.  hiding or secreting the childre n from the other party or changing the children's current \nplace of abode without the writt en agreement of both parents or  an order of this Court; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1873
    },
    {
      "page_number": 16,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 16 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx d.  making disparaging remarks regarding t he other party or the  other party’s family in \nthe presence or within the hearing of the children; and \ne.  being present within the same residence as the children bet ween 8:00 p.m. and 8:00 \na.m. with an unrelated adult wit h whom a party has an intimate relationship. \nTemporary Orders for Use of Property \n24.  CHARLES DUSTIN MYERS petitions  this Court, after notice an d hearing, to render \nan appropriate order including, but not limited to, the followi ng: \na.   awarding CHARLES DUSTIN MYERS exclusive control and manage ment over the \npossession, use, and occupancy of  the residence at 6641 Anne Co urt, Watauga, Tarrant \nCounty, Texas 76148, including all furniture, furnishings, and other personal property located at the residence during t he pendency of the case; and \nb.   awarding CHARLES DUSTIN MYERS exclusive control and manage ment over the \npossession and use of 2021 Mazda 3 Sedan. \nTemporary Orders Regarding Children \n25.  CHARLES DUSTIN MYERS petitions  this Court, after notice an d hearing, to render \ntemporary orders including, but not  limited to, the following: \na.  appointing CHARLES DUSTIN MYERS and MORGAN MICHELLE MYERS a s \ntemporary joint managing cons ervators of the children; \nb.  designating CHARLES DUSTIN MYER S as the conservator who has  the temporary \nexclusive right to determine the  primary residence of MARA EVON NE MYERS and \nCAROLINE ROSE MYERS; and c.  restricting the area within w hich the children’s primary re sidence shall be maintained \nto Tarrant and contiguous counties, Texas. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1927
    },
    {
      "page_number": 17,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 17 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx Other Requested Relief \nAttorney’s Fees Request \n26.  CHARLES DUSTIN MYERS engaged Daniel R. Bacalis, a licensed attorney, to \nprepare and prosecute this suit . As part of the just and right division of the community estate, as \nwell as for the prosecution of this suit affecti ng the parent child relationship, CHARLES \nDUSTIN MYERS petitions this Court to render judgment for reason able attorney's fees, \nexpenses, and costs through tri al and appeal in his favor and a gainst MORGAN MICHELLE \nMYERS, and order the judgment to  be paid directly to Daniel R. Bacalis. CHARLES DUSTIN \nMYERS petitions the Court to award post-judgment interest as pe rmitted by law. \nPrayer \nCHARLES DUSTIN MYERS prays the Court to grant a divorce and all  other relief \nrequested in this  Counterpetition. \nCHARLES DUSTIN MYERS prays that t his Court immediately grant a temporary \nrestraining order restraining MORGAN MICHELLE MYERS, in conform ity with the allegations \nof this Counterpetition, from the acts set forth above, and tha t, upon notice and hearing, this \ntemporary restraining order be made a temporary injunction. \nCHARLES DUSTIN MYERS prays that  this Court, in addition to the temporary \nrestraining order and temporary injunction prayed for above, up on notice and hearing, grant a \ntemporary injunction enjoining M ORGAN MICHELLE MYERS from the a cts set forth above \nwhile this case is pending. \nCHARLES DUSTIN MYERS prays th at this Court, upon notice and hea ring, grant \ntemporary orders as requested in this Counterpetition. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1876
    },
    {
      "page_number": 18,
      "text": "FIRST AMENDED COUNTERPETITION FOR DIVORCE – PAGE 18 \n\\\\MYCLOUDEX2ULTRA\\Ldrive\\Documents\\Clients\\MYERS, CHARLES\\First  Amended Counterpetition for \nDivorce 1-25-24 tj.docx CHARLES DUSTIN MYERS prays that  he be awarded a judgment agains t MORGAN \nMICHELLE MYERS for reasonable attorney's fees. \nCHARLES DUSTIN MYERS prays for general relief. \n \nRespectfully submitted, \n Daniel R. Bacalis PC 669 Airport Freeway \nSuite 307 \nHurst, TX 76053  Office Phone: (817) 498-4105 Fax: (817) 282-0634  \n \n/s/ Daniel R. Bacalis         \nDaniel R. Bacalis Attorney for CHARLES DUSTIN MYERS State Bar No: 01487550 \nEmail: dbacalis@dbacalis.com \n  \n \nCertificate of Service \nI certify that a true copy of this document was served in accordance with Rule 21a of the \nTexas Rules of Civil Procedure on the following on January 31, 2024. \nMorgan Michelle Myers by electr onic filing manager at morganmw0 2@gmail.com. \n \n/s/ Daniel R. Bacalis         \nDaniel R. Bacalis Attorney for CHARLES DUSTIN MYERS \n \n  \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1160
    },
    {
      "page_number": 19,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nTammy Johnson on behalf of Daniel Bacalis\nBar No. 1487550\ntjohnson@dbacalis.com\nEnvelope ID: 84003319\nFiling Code Description: Amended Filing\nFiling Description: First Amended Counterpetition for Divorce\nStatus as of 2/1/2024 9:08 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERSBarNumber Email\nmorganmw02@gmail.comTimestampSubmitted\n1/31/2024 2:51:39 PMStatus\nSENT\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 942
    }
  ]
}