{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\01.08.2024_FROM 322-744538-23  ATTACHMENT DOCUMENTATION FOR CONTINUANCE-1.pdf",
  "base_name": "01_08_2024_from_322_744538_23_attachment_documentation_for_continuance_1",
  "page_count": 4,
  "pages": [
    {
      "page_number": 1,
      "text": "DKT (38)\n*** FROM 322-744538-23 *** (ATTACHMENT)\nDOCUMENTATION FOR CONTINUANCE\nFILED ON: 01/08/2024\nFEE: $0.00\nFILER/REQUESTOR: CHARLES DUSTIN MYERSM.152 M.152\nM.152 M.152 M.152 M.152",
      "char_length": 183
    },
    {
      "page_number": 2,
      "text": "322-744538-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER      DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine SaenzM.153 M.153\nM.153 M.153 M.153 M.153Charles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148 [Phone Number] \nChuckdustin12@gmail.com \n2024-01-06 \nIN THE DISTRICT COURT OF TARRANT COUNTY, TEXAS \nBEFORE THE 322ND COURT \nMorgan Michelle Myers, Plaintiff, \nvs. \nCharles Dustin Myers, Defendant. \nCAUSE NO. 322-744538-23 \nMOTION FOR CONTINUANCE \nTO THE HONORABLE JUDGE OF SAID COURT: \nComes now Charles Dustin Myers, Defendant in the above-entitled and numbered cause, respectfully \nrequests that the Court grant a continuance in the protective order case, and as grounds therefore would \nshow the following: \n1. Family Priorities During Holidays: The recent holiday season and the children's break from school \nhave been my priority. Ensuring their stability and spending quality time with them has been of \nutmost importance, impacting my ability to prepare adequately for this case. \n2. Motion for Consolidation: I have recently filed a motion for consolidation to combine this case \nwith two others due to their intertwined nature. This motion has been accepted by the court but \nnot yet ruled upon by the judge. A decision on this matter could significantly impact the \nproceedings of this case. The relevant cases that are intertwined are cause numbers: 322-\n744263-23 (DIVORCE) and JP01-23-E00102017 (EVICTION). \n······R······ . ·. \n:·~ <=.\\ :u ~: \n~ .-c:: \n·.. _.: \n···.' ........ ~--··",
      "char_length": 1557
    },
    {
      "page_number": 3,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \nDISTRICT CLERK  \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine SaenzM.154 M.154\nM.154 M.154 M.154 M.1543. Unfounded Claims in Eviction Suit and Protective Order: Both the eviction suit and the protective \norder claims are unfounded. The eviction suit lists the violation of the lease as \"granddaughter \ndivorced\" and prematurely references the protective order as a secondary reason for eviction \ngrounds. Additional time is needed to address these premature and baseless claims. There is no \nimmediate danger to the Plaintiff, or the children -and has never been any incident of family \nviolence that has occurred within our home. Attached is a copy of my criminal history obtained \nby the Texas Department of Public Safety that highlights my clean record. \n4. Time to appropriately answer the divorce: The parent case in the request to consolidate is the \ndivorce, which I have yet to answer due to the concurrent proceedings (eviction suit and \nprotective order) which were both filed due to the claims that I possess a history of family \nviolence, waiving the 60-day period for service and making the timeframe unreasonable -\nespecially considering the lack of communications from the Plaintiffs-to formulate a plan that \nbest suits our children's interests. \n5. Lack of Cooperation in Providing Lease Agreement: Despite requests, the Plaintiff has not \nprovided a copy of the lease agreement necessary for my defense. More time is needed to \nacquire these critical documents, especially given the unlawful nature of the eviction. \n6. Potential for Amicable Resolution: Given more time to prepare and the pending decision on the \nconsolidation of cases, there is a potential for a more amicable resolution to be reached. The \nintertwined nature of the cases suggests that a holistic approach to resolution may be more \nappropriate and beneficial for all parties involved. \nConsidering the above reasons, continuity is necessary to ensure a fair and just resolution of this matter. \nI assure the Court that this request is not for the purpose of delay, but to allow for adequate preparation \nand the pursuit of justice. \nWHEREFORE PREMISES CONSIDERED, I, Charles Dustin Myers, respectfully request that the Court grant a \ncontinuance for the protective order case. \nRespectfully submitted, \n······R······ . ·. \n:·~ <=.\\ :u ~: \n~ .-c:: \n••. ~l ···.' ........ ~····",
      "char_length": 2444
    },
    {
      "page_number": 4,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \nDISTRICT CLERK  \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine SaenzM.155 M.155\nM.155 M.155 M.155 M.155CERTIFICATE OF SERVICE \nI certify that a true and correct copy of this Motion for Continuance was served on Morgan Michelle \nMyers, Plaintiff, at morganmw02@gmail.com on 2024-01-06.",
      "char_length": 362
    }
  ]
}