{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\01.14.2025_CASE MEMORANDUM AND PLEA FOR JUDICIAL REVIEW-1.pdf",
  "base_name": "01_14_2025_case_memorandum_and_plea_for_judicial_review_1",
  "page_count": 55,
  "pages": [
    {
      "page_number": 1,
      "text": "DKT(254) \nCASE \nMEMORANDUM AND \nPLEA FOR JUDICIAL \nREVIEW 01.14.2025DKT(254)  BRIEF  M.1465 M.1465\nM.1465 M.1465 M.1465 M.1465",
      "char_length": 126
    },
    {
      "page_number": 2,
      "text": "1 NO. 24 -0395  \nNO. ___ SW3d ___, 04-10 -24  \nNO. 322 -744263-23 & NO. 322- 744538 -23 \n Morgan Michelle Myers v Charles Dustin Myers\nCASE  \nMEMORANDUM  \nIn the 322nd District Court of Tarrant County, Texas  \nHonorable Judges:  \nJames B. Munford, Jeff Kaitcer, Justice Lee Gabriel, and \nRegional Presiding Judge David L. Evans  \n200 E. Weatherford St. 4th Floor \nFort Worth, TX  \nTel.: (817) 884-1427 \nRespectfully submitted by:  \nCharle s Dustin Myers, Respondent  M.1466 M.1466\nM.1466 M.1466 M.1466 M.1466",
      "char_length": 508
    },
    {
      "page_number": 3,
      "text": "2 To:   Honorable Judges James Munford and Jeff Kaitcer of the 322nd Judicial District Court of \nTarrant County, Visiting Retired Justice Lee Gabriel, the Honorable Davi d L. Evans, and \nopposing counsel Cooper L. Carter \nRe:  Charles Dustin Myers (Respondent) \nDate:  01/14/2025 \nSubj:  Case Memorandum  \nNo#:   322-744263-23  \nI.INTRODUCTION\n1.A Year  of Unjust Exile\nOn January 16, 2024, this Court authorized the removal of Respondent from his own \nhome—a decision that, to this day (January 1 3, 2025), remains unexplained. Despite \nRespondent’s diligent pursuit of relief from multiple courts and encountering numerous judicial \nofficers ( including the Second Court of Appeals, the Supreme Court of Texas, the Honorable 8th \nAdministrative  Regional Judge, t he H onorable Justice Lee Gabriel, the  Northern D istrict of  \nTexas, and now the Western District of Oklahoma), not one venue has addressed the glaring \ninconsistencies and fraud unde rpinning the orders that separated a father from his children \nwithout justification.   \n2.Complete Lack of Opposition or Defense\nNo one—neither the Petitioner, M organ M ichell e Myers , nor her counsel—has bothered \nto dispute Respondent’s sworn allegations or offer any substantive defense . They have failed to \nparticipate in discover y, neglected to provide legitimate service , and have offered no rebuttal to \nthe detailed f actual r ecord es tablishing fra ud. This utter silence speaks volumes, particularly \ngiven the life-altering stakes for Respondent and the children who have lost a parent’s day-to-day \npresence in contrast to this State’s policy. See Tex. Fam. Code sec. 153.001. M.1467 M.1467\nM.1467 M.1467 M.1467 M.1467",
      "char_length": 1690
    },
    {
      "page_number": 4,
      "text": "3 3.Unprec edented and Ongoing Harm\nRespondent has lost his family, his home, and his means of earning a livelihood. He has \nalso lost precious, irreplaceable time in his children’s lives. This Court’s removal order \neffectively r ewarded P etitioner’s de ceptive pleadings —pleadings  that all evide nce shows w ere \npurpose-built to conceal her own misconduct and to deny Respondent even a semblance of due \nprocess or  a say in the dissolution of his eight- year marriage. \n4.Urgent Appeal for Corrective Action\nRespondent implores this Honorable Court—a nd any judicial authority reading this \nrecord—t o immediately rectify this travesty. The legal system’s core responsibility is to \nprotect children’s best interests and uphold fairness  in family disputes . Here, neither principle \nhas been honored. This matter demands an urgent remedy. See  Tex. Fam. Code sec. 153.002 \nII.DECEPTION UPON THE CO URT\n5.Four Filings in Rapi d Succession\nThe Petitioner, MORGAN MICHELLE MYERS, approached the 322nd District Court of  \nTarrant County a total of three times between December 14th, 2023, and December 22nd, 2023, \nwhere she requested an e x-parte order of protection, f iled an affidavit of inability to pay court \ncosts, an original petition for divorce , and a n application for a standard protective order. A true \nand accurate copy of these documents has been attached for reference. True and accurate copies \nof these documents have been attached hereto. \n6.Covert Preparations and Assistance\nImmediately a fter the  first filing  (December 14, 20 23), Petitioner opened a new bank \naccount. She then traveled t o Yukon, Oklahoma , where her relative, D an Branthoover , admitte dly \nassisted her in prepari ng subsequent filings designed to achieve the very result we see today—M.1468 M.1468\nM.1468 M.1468 M.1468 M.1468",
      "char_length": 1830
    },
    {
      "page_number": 5,
      "text": "4 Respondent’s abrupt removal from his home. Mr. Branthoover is now facing a suit  in the Western \nDistrict of Oklahoma for his pivotal role in perpetuating the fraud that has so grievously harmed \nRespondent and the children and wit h clear malicious intent.  \nF ALSE REPRESENTATION OF THE CASE BEING UN -CONTESTED  \n7.Illusion of Agreement from the Start\nThe first knowingly false document presented came in the form of a request for an \nattorney to revi ew the Petitioner’ s paperwork where she claimed that the case was uncontested. \nThis only came after an emergency protective order request, calling into question her credibility from the start.  \nAFFIDAVIT OF INABILITY TO P AY COURT COSTS  \n8.Sworn Misrepresentations\nThe Petitioner, Morgan Michelle Myers , declared under penalty of perjury that she \ncould not afford the $400 filing fee for divorce and that the children “relied solely on her income.” Yet the record conclusively shows that Respondent  was the primary provider. Further, \nPetitioner’s own texts confirm she had far more than enough funds at the time of filing. Specifically:   \n1.On December 16, 2023, Petitioner and her relative, Dan Branthoover, both openly\nadmitted via text message that Petitioner moved marital funds into her personal\naccount. This is corroborated by statements from both Branthoover and Petitioner\nacknowledging the transfer via text message.\n2.Petitioner then proceeded to lie on the December 18, 2023, Affidavit of Inability to\nPay, claiming she had “only $20” in her bank account.\n9.The Conversion of $1,576.00 and Additional DeceptionsM.1469 M.1469\nM.1469 M.1469 M.1469 M.1469",
      "char_length": 1630
    },
    {
      "page_number": 6,
      "text": "5 Supported by bank statements and text message evidence, there is no doubt Petitioner had \nmore than sufficient resources to cover court costs at the time she claimed indigency. These facts \nhave been pleaded numerous times without any rebuttal from Petitioner. As such, the case should be dismissed under § 13.001 of the Texas Civil Practice & Remedies Code , because her affidavit \nwas indisputably falsified. 10. Fictitious Expenses\nIn her affidavit, Petitioner also represented to the Court that she personally paid for both \ncar payments —a 2023 Mazda CX-5 and a 2020 Mazda3 as well as $800 in monthly rent plus \nutilities . These statements are demonstrably untrue. Bank records prove that Respondent, not \nPetitioner, was the primary financial manager covering these obligations. Moreover, Respondent is currently paying for these same vehicles that Petitioner claimed she alone was financing , one \nof which has been damaged by the Petitioner. Not only was Petitioner never solely responsible for these payments, but her own text messages show that on December 16, 2023, she withdrew or transferred significant funds to herself and then declared under oath—just two days later —that \nshe was penniless and could not afford the $400 court costs. \nTaken together, these glaring contradictions demolish the veracity of Petitioner’s \n“indigency” claim  and warrant dismissal.  \nTHE ORIGINAL PETITION FOR DIVORCE  \n11.Petitioner’ s Contradictory Statements\nThe divorce petition, filed on December 18, 2023, contained allegations that a protective \norder had been requested on December 14 but remained undecided, while simultaneously asserting that an “active” protective order existed finding family violence, thus justifying a 60-day waiver. These allegations are inconsistent and should have alerted the Court to Petitioner’s M.1470 M.1470\nM.1470 M.1470 M.1470 M.1470",
      "char_length": 1873
    },
    {
      "page_number": 7,
      "text": "6 lack of credibility. Moreover, Texas Family Code § 6.405(b) requires attaching any protective \norder referenced in a divorce petition, which Petitioner failed to do. 6.405(b)’ s protections were \noverlooked by the court, as no hearing should have ever taken place on January 16th, 2024, given \nthis claimed order of protection was never could not ever have been presented to the court because it has never existed.  \n12.Critical Misstep by the Court\nHad the Court recognized these glaring inconsistencies—or merely reviewed the \nsupporting documents—it would have avoided its own January 16, 2024, order expelling Respondent from the marital residence.  \nTHE APPLICATION FOR PROTECTIVE ORDER \n13.The Second, Frivolous R equest\nOn December 22, 2023, Petitioner pursued yet another protective order, despite having \njust claimed —four days earlier —that she already had one in effect. This confounding behavior \nshows that Petitioner was bent on amassing multiple orders to ensure Respondent’s removal, despite no demonstrable threat or legitimate need  to do so. \n14.Contradictory Conduct That Undermines Credibility\n Text messages and photographs from December 22, 2023, depict Petitioner laughing and \nplaying with the children in the marital home alongside Respondent—the very person she allegedly “feared.” No credible evidence has ever been presented to support her allegations of family violence. Instead, the protective- order filings clearly appear more  like strategic \nmaneuvers to lock in “temporary orders,” later, which is exactly wha t occurred . Perhaps most \nalarming is that the current orders are purported to be agreed , just as the case was first purported \nto be uncontested. The level of injustice  here must be addressed.  M.1471 M.1471\nM.1471 M.1471 M.1471 M.1471",
      "char_length": 1788
    },
    {
      "page_number": 8,
      "text": "7 THE CURRENT TEMPORARY ORDERS  \n15.Mischaracterized “Agreed” Orders\nThese temporary orders cite a motion never served on Respondent and a hearing that \nnever occurred. The orders erroneously state Respondent “agreed,” yet only Petitioner’s \nsignature appears. This deficiency alone robs the orders of procedural validity. 16.Lack of Substantive Participation by Petitioner’ s Counsel\nPetitioner’s counsel filed no substantive pleadings and participated minimally in court—\nmainly through baseless objections blocking Respondent’s right to cross- examine Petitioner. \nUnsurprisingly, these “temporary” orders contain multiple factual inaccuraci es and remain \nuncontested only because Petitioner and her counsel have refused to litigate the matter on the merits.   \n17.An Engineered Narrative to Justify Removing Respondent\nRespondent’s evidence—bank statements, text logs, phone records—reveals Petitioner’s \ntrue motive: to conceal her misconduct, secure the marital residence, and isolate Respondent from the children during the holidays, all while ignoring basic rules of discovery and honesty to live out a fantasy that had been culminating for over a year. \nIII. PETITIONER’S MOTIVE\nDEBBIE PRICE AND DAMEN KAZLAUSKAS  \n18.Why Go to Such Extremes?\nWhy woul d a spouse fabricate claims of needing protection, systematically lie under oath \nabout her finances, and manipulate the judicial system? The answer emerged on December 12 , \n2023, when Respondent discovered over 16,500 text messages between Petitioner and two individuals outside the marriage, Debbie Price and Damen Kazlauskas . Faced with the imminent M.1472 M.1472\nM.1472 M.1472 M.1472 M.1472",
      "char_length": 1658
    },
    {
      "page_number": 9,
      "text": "8 \n exposure of her extramarital relationships—and the looming scrutiny of the courts—Petitioner \nembarked on a frantic quest to lock Respondent out of the marital home and silence any questions about her own wrongdoing. 19. Sudden Divorce Announcement  \nOn December 1, 2023, Petitioner abruptly told Respondent she intended to divorce him, \nwithout any prior discussion or warning. Initially, she claimed her dissatisfaction stemmed solely from how he “talked” to her, only to expand her grievances to the entire marriage—including family vacations once touted as joyful. This immediate about- face suggests Petitioner was \nalready laying the groundwork for her broader scheme. 20. The Phone Records and AT&T Data  \n \nBy December 12, 2023, Respondent delved into the couple’s joint AT&T account, \nrecalling Petitioner’s previous infidelity  to seek answers  given her unwillingness to \ncommunicate . The phone and text logs—registered under Petitioner’s grandmother’s name at the \ntime—confirmed an enormous volume of messages with Price and Kazlauskas, rendering \nPetitioner’s evolving divorce rationales unconvincing. \n \nTEXT RECORD S (VOLUME)  \n \nThe data from the text records are presented from a volume standpoint alone and  does not \ncontain the context of the m essages. Given the sheer amount of communication that has taken \nplace between the Petitioner, Price, an d Kazlauskas – the context of the messages is \novershadowed by the massive level of communication between these parties.  \n21. The Text Dataset Structure  \nThe structure of the text data is presented in the following format found in the table \nbelow. Petitioner is aware o f this dis covery, an d has been presented the charts below. M.1473 M.1473\nM.1473 M.1473 M.1473 M.1473",
      "char_length": 1751
    },
    {
      "page_number": 10,
      "text": "9 A true and accurate copy of these raw text logs can be found on file with the Clerk and \nwas f iled with the Emergency Motion for Reconsideration filed on February 8, 2024. \nANALYZING THE TEXT RECORDS  \n22.Respondent’ s Data Expertise\nRespondent’s professional background in data solutions allowed him to compile these \nlogs into visually compelling evidence—demonstrating Petitioner’s exponentially increasing communications with Price and Kazlauskas from late 2022 onward. \nEach line tracks Petitioner’s interactions with her top 25 contacts between October 2022 \nand December 2023 . The lines labeled “debbie” and “damen” soar above the rest, confirming \ntens of thousands of texts exchanged. A “flat line” appears after December 15, 2024—the same weekend Dan Branthoover  purchased Petitioner a secondary phone, ostensibly for “protection,” \nbut in reality to hide her continuing communications. M.1474 M.1474\nM.1474 M.1474 M.1474 M.1474Column \nName \nSNO \nDate \nTime \nAM/PM \nContact \nType \nDescription Description \nSequence number for each \ncommunication within the month. Resets \nat the beginning of each month. \nDate of communication \nTirne of communication (HH:MM \nformat) \nSpec,f1es whether the communication \noccurred in the morning (AM) or \nafternoon/evening (PM) \nName or phone number of the person \ninvolved in the commun1c.at1on \nSpec,f1es 1f the communication was \nIncoming or Outgoing \nfurther details about the communication \n(e.g .. \"Mobile to Mobile\") Details \nIndicates the order of the communication \nwithin the month (e.g., SNO of 100 means \nthe 100th communication in that month) \nRange: October 9. 2022 -December 21. \n2023 \nExact time of each interaction \nAM/PM indicator \nTop contacts are listed separately \nDirection of commun1c.at1on \nCommunication method or mode",
      "char_length": 1791
    },
    {
      "page_number": 11,
      "text": "10 FIGURE 1 : TOTAL CUMULATIVE INTERACTIONS – TOP 25 CONTACTS  \n23.Astonishing Communication Volume\nOver  10,000 messages with Debbie and more than 6,000 with Damen spell out a deeply \ninvolved relationship that overshadows all other contacts. In a typical marriage, one might expect \nthe most communication to be  with family, but here, it is with two outsiders —raising the strong \ninference of intimacy  and influence. \n24.Disregard for Family Obligations\nThe slope of these lines proves that Petitioner’s daily communications revolved around \nthese individuals, at the expense of her responsibilities as a spouse and mother. Once discovered, Petitioner hastened to block Respondent from accessing more evidence by obtaining a second phone. 25.“Emotional Support” Doesn ’t Explain Away These InteractionsM.1475 M.1475\nM.1475 M.1475 M.1475 M.1475Cumulative Interactions for Top 25 Contacts \nContact \n10000 -debh1e \n-damen \n-817.559.2042 \n-817.994.3974 \n-678.643.0319 \n-roxle \n8000 -t.1:111 \n-Sl~.868.2219 \nse-rena \n\"' C: \n0 ·;;:; \nV 6000 ~ \n\"' £ ., \n.2 \n1o \n3 \nE 4000 \n::, u -817,304.0909 \n-papaw \n-\"\"\" -817.201.S307 \n-;.,n \n-chatlie \n-meme \nmadelyn \n-817.564,1916 \n-817,917.8696 \n-619,865.9401 \n-817.715.5628 \n-214,870.1879 \n2000 -817,897.2896 \n-817.313.3122 \n929.217.1731 \n0 \nDate",
      "char_length": 1284
    },
    {
      "page_number": 12,
      "text": "11 No reasonable spouse would shrug off these communications as harmless. Damen is now \na near -constant presence around the children. Petitioner cannot simply label this as “support” \nwhen the data proves a staggering level of day- and-night messaging on a daily basis. \nFIGURE 2 : PETITIONER’S TOTAL INTERACTIONS WITH TOP 25 CONTACTS – PIE \nCHART  \n26.Nearly Half of All Texts to “debbie” and “damen”\nI.FIGURE 2 above shows the percentage breakdown of all those messages across the\ntop 25 contacts. The largest slices belong to “debbie” (27.3%) and “damen” (16.9%). That means  \nnearly half of her text -message volume is dominated by just two individuals—neither of whom is M.1476 M.1476\nM.1476 M.1476 M.1476 M.1476debble \ndamen Total Interactions by Top 25 Contacts \n9BIQl~6 \ncharlie \njan \n817.201.5307 \nerin \npapaw \n817 .304.0909 \nserena \n515.866.2219 \nkelll \nroxre \n678.643.0319 \n817.994.3974 \n817.559.2042",
      "char_length": 912
    },
    {
      "page_number": 13,
      "text": "12 the spouse. The pattern diverges from the norm of spreading casual messages among many \nfriends and relatives , especially when considering she would frequent the residence of Debbie \nPrice where Damen Kazlauskas would be present 18 hours per week on average.  \nFIGURE 3  -UNUSUAL TIME -OF-DAY INTERACTIONS  – TOP 25 CONTACTS  \n27.Unusual  Late -Night M essages\nFIGURE 3 zeroes in on overnight or e arly-morning texting patterns. We see that  \n“damen” has over 2,000 messages between 10 PM and 6 AM. These are hours typically \nreserved for work or private time with one’s spouse.  Repeated overnight messaging to the \nsame individuals points to late-night conversations, which might indicate romantic o r intimate \nexchanges, or at the very least a strong emotional bond that compels this person to stay \nconnected in the middle of the night. Such nocturnal communication is a classic warning sign M.1477 M.1477\nM.1477 M.1477 M.1477 M.1477~ 214.870.1879 \n515.868.2219 \n619.865.9401 \n678.643.0319 \n817 .201.5307 \n817 .304.0909 \n817.313.3122 \n817.559.2042 \n817 .564.1916 0 \n817 .897 .2896 \n817.917.8696 \n;:; 817.994.3974 \nOJ \ng 929.217 .1731 ... \n0 0 \n0 Number of Interactions \nI\\J \n0 \n0 0 w \n0 \n0 0 .,. \n0 \n0 0 \nC ::, \nC \nVI \nC \n!ll \n~ \n3 \n11) \n0 ,., \n0 \n!ll \n'< \n::, ,... \n11) .... \n!ll n ,... o· ::, \nVI \no' .... \n~ -0 \nN \nV1 \nn \n0 ::, ,.... \n!ll n ,.. \nVI \nt-' \n0 \n-0 :s: \n°' :i> :s:",
      "char_length": 1388
    },
    {
      "page_number": 14,
      "text": "13 when exploring marital fidelity or emotional boundaries. Consistent late-night contact that \ndwarfs normal daytime communication with the spouse suggests secrecy or intimacy. This is \nespecially concerning when you add in that the Petitioner would visit these individuals on average 18 hours per week leading up to the divorce announcement on December 1, 2023. \nFIGURE 4   \nTEXTING FREQUENCY BY HOUR – TOP 25 CONTACTS  \n28.All-Hours Engagement\nFIGURE 4  shows how message volume changes hour-by-hour across the entire day. \nNotice that some contacts see surges in messages early in the morning or late at night; others peak during midday. “debbie” and “damen” appear to have high levels of communication during typical sleeping hours and again in the morning, which could imply a pattern of continuous or recurring contact across day and night. Combined with the overnight activity from FIGURE 3 , M.1478 M.1478\nM.1478 M.1478 M.1478 M.14781200 \n1000 \n800 \ntl X \n~ \n0 \n:;; \n.0 \nE 600 \n:::, z \n400 \n200 \n0 \n0 2 Texting Frequency by Hour for Top 25 Contacts \n4 6 \nHour of the Day 8 -debbie \n-damen \n-8]7.559.2042 \n-8]7.994.3974 \n-678.643-0319 \n-roxie \n-kelli \n-515.868.2219 \n-serena \n-817.304.0909 \n-papaw \n-enn \n-817.201.5307 \n-i•n \n-charlie: \n-meme \nmadelyn \n-817.564.]916 \n-817.917.8696 \n-6]9.865.9401 \n-817.715.5628 \n-214.870.1879 --8]7.897.2896 \n817 .313.3122 \n-929.217.173] \n10",
      "char_length": 1383
    },
    {
      "page_number": 15,
      "text": "14 we see consistent contact patterns that align with possible romantic or emotionally entangled \nbehavior. Rarely do mere acquaintances demand such frequent or around-the- clock attention. \nFIGURE 5 – DAILY INTERACTION TIMES WITH \nDEBBIE PRICE AND DAMEN KAZLAUSKAS  \n29.Constant Communication Erodes Parenting\nFIGURE 5 illustrates the hourly distribution of interactions with Debbie and Damen, \nrevealing that communication with these individuals was not limited to specific times of day but \noccurred almost constantly. The data highlights a consistent pattern of engagement a cross most \nwaking hours, with significant activity spilling into late-night and early-morning periods—times \ntraditionally reserved for rest, family, or private matters.  The overwhelming focus on these \nindividuals detracted from her time and energy for familial responsibilities, including her duties \nas a spouse and parent. This imbalance calls into question her priorities during this period, and M.1479 M.1479\nM.1479 M.1479 M.1479 M.14792000 \nt1SO \n1500 \n~ \n°B t2S0 \nB \n.E lOOO 0 I ISO \ni \nsoo \n2'0 °\"'\"a \n-d•f1\\o:!l'I \n-dl!lffl!C' \n. •--0 0 Hourly Distribution of Interactions with Debbie and Darnen \nI I I \n~;::~~ \nHour-of Day",
      "char_length": 1214
    },
    {
      "page_number": 16,
      "text": "15 given the facts regarding her intentional deception, should call into question her ability to  parent \naffectively  when factored in together.  \nFIGURE 6: OUTLIER DETECTION  \n30.Identifying Key Spikes\nIn data analysis, an outlier  is a data point that significantly differs from the rest of the \ndataset. It represents an unusual or extreme event that stands out from typical patterns or trends. \nOutliers often indicate anomalies, irregular behavior, or important events that warrant clo ser \nexamination. \n Here, outliers in the data correspond to events critical to Petitioner’s agenda—such as \nDecember 12 (Respondent’s discovery of these messages) and December 14 (her initial ex parte request). These spikes illustrate reactionary upticks in communication designed to manage or conceal her wrongdoing and appear in red and purple . \nThe evidence is clear and troubling. Data reveals a sustained and excessive pattern of \ncommunication between the Petitioner and Debbie Price and Damen Kazlauskas, far exceeding M.1480 M.1480\nM.1480 M.1480 M.1480 M.1480Outlier Detection in Interaction Trends \nDebbie X \nDarnen X X \nX Debbie Outhe,s )( )( \n100 )( )( )( Oamen Outlie.rs X X \n80 )( \n\"' C: \n0 X ,'f )( \n·.:; \n~ )( )( xx \n.!J 60 x )( \nE )( X \n)( \n0 )( .. \noi X \",i<x )( .c X \nE 40 >;c :, z l \nII> \n20 \" t 11X jl \nX '\"' \n0 \n2022-09 2022-11 2023-01 2023-03 2023-05 2023-07 2023-09 2023-ll 2024-01 \nDate",
      "char_length": 1404
    },
    {
      "page_number": 17,
      "text": "16 casual relationships. These interactions, often late at night and early morning, detracted from her \nfamily responsibilities and raises serious concerns about her priorities and judgment. 31.Introducing Strangers to the Children\nAdding to the concern, Kazlauskas is now frequently around the children and has taken \nthem places alone—behavior that is unprecedented and raises questions about the appropriateness of his involvement, and is particularly  sickening given he was rarely involved in \ntheir lives prior to this litigation  commencing. \n32.Accountability in Silence\nPetitioner’s refusal to address these factual allegations,  and the failure of her counsel to \ndefend the claims against her  combined with her legal maneuvers evidences a strategy of \nobfuscation and evasion. This Court must not allow a litigant to exploit its processes for such improper ends. \nIV .RELIEF AS A MATTER OF LAW\nDespite Respondent’s diligent, repeated pleas, the Court has yet to intervene. The record \nestablishes a prima facie case for relief as a matter of law —no reasonable factfinder  could view \nthese undisputed facts and deny the injustice at hand. The current situation contradicts these mandates, as the children who once had continuous and frequent access to both parents now only have access to one.  \nTexas law prioritizes frequent, meaningful contact between children and both parents. \nCurrently, the children see Petitioner’s new associate (Kazlauskas) more than their own father, who has been shut out without any legitimate legal foundation. The Respondent urges the reviewing body of this document to swiftly restore justice  and peace to  the Children’s lives.  M.1481 M.1481\nM.1481 M.1481 M.1481 M.1481",
      "char_length": 1718
    },
    {
      "page_number": 18,
      "text": "17 V . CONCLUSION\nRespondent was the primary caregiver for his children, yet on January 16, 2024, he was \nsummarily ousted from their lives —based on Petitioner’s fabricated affidavits and contradictory \nstatements. The fiasco has destroyed the family’s financial stability and subjected the children to \nconfusion and distress. The P etitioner  has lied to the Court, her own family, and, worst of all, her \nchildren. She has leveraged erroneous judicial rulings to further her clandestine relationships with Debbie Price and Damen Kazlauskas , evidencing a profound disregard for her children’s \nneeds.  Time and again, Respondent has requested only transparency and proper procedure— yet \ntime continues to pass, compounding the damage. The situation remains stuck where it began, with the Court’s unexamined orders fueling Petitioner’s unscrupulous agenda at the children’s expense.  This court now possesses all of the facts necessary to restore wha t has been wrongfully \ntaken.  \nVI. PRAYER FOR EXPEDITED  RELIEF\nWHEREFORE, PREMISES CONSIDERED, Respondent Charles Myers  respectfully \nrequests this Court grant the following expedited relief, in line with the children’s best interests: \n1. Order Respondent’s return to 6641 Anne Court, Watauga, Texas 76148, with the option\nfor Petitioner to cohabit or move next door while Respondent transitions to nearby housing and re-establishes his business. This arrangement corrects the current unjust separation and ensures \nboth parents remain available to the children during the pendency of the case.  \n2. The respondent respectfully requests that the court t ake notice that Petitioner’s counsel\nhas, at no point, engaged in discovery, conferred properly, or produced substantive filings in contravention of fundamental procedural rules. M.1482 M.1482\nM.1482 M.1482 M.1482 M.1482",
      "char_length": 1833
    },
    {
      "page_number": 19,
      "text": "18 3. Recognize Petitioner’s unequivocal lies to the Court—her false claims of indigency,\nmisrepresentations about protective orders, and reliance on outside assistance to engineer \nfraudulent pleadings. \n4.Note that Petitioner converted joint-marital funds shortly before perjuring herself\nregarding alleged poverty. Such conduct warrants immediate dismissal or sanctions under Tex. \nCiv. Prac. & Rem. Code § 13.001. \n5. Grant any additional relief, legal or equitable, that the Court deems just and proper\nunder these extraordinary circumstances.  \nRespectfully submitted,  \n/s/ CHARLES DUSTIN MYERS  \nCharles Dustin Myers \n6641 Anne Court, Watauga, TX 76148 Chuckdustin12@gmail.com  \n817-507-6562M.1483 M.1483\nM.1483 M.1483 M.1483 M.1483",
      "char_length": 740
    },
    {
      "page_number": 20,
      "text": "CERTIFICATE OF SERVICE\nDefendant, CHARLES DUSTIN MYERS, hereby certifies that on 01/13/24 a true and \naccurate copy of the Case Memo / Plea For Emergency Relief was served on the following parties \nvia email and the Texas Supreme Court-approved electronic filing manager (EFM):\nCooper L. Carter (Counsel for Plaintiff)\nEmail: COOPERCARTER@MAJADMIN@COM\nMorgan Michelle Myers (Plaintiff)\nEmail: MORGANMW02@GMAIL.COM\nHolly L. Hayes, Texas Office of the Attorney General\nEmail: 914-filer@texas.oag.gov\nRespectfully submitted,\n/s/ Charles Dustin Myers\nCHARLES DUSTIN MYERS\nPro-se\n6641 Anne Court, Watauga TX, 76148\n817-507-6562\nChuckdustin12@gmail.comM.1484 M.1484\nM.1484 M.1484 M.1484 M.1484",
      "char_length": 687
    },
    {
      "page_number": 21,
      "text": "EXHIBIT 1\nOVERDRAFT \nNOTICE FROM \nPNC BANK - \nDECEMBER \n16, 2023. 5:01 \nA.M.M.1485 M.1485\nM.1485 M.1485 M.1485 M.1485",
      "char_length": 117
    },
    {
      "page_number": 22,
      "text": "M.1486 M.1486\nM.1486 M.1486 M.1486 M.148612/10/24, 1 :19 AM Gmail -Low Cash Mode decisions are available. \nM Gmail Charlie Vids <chuckdustin12@gmail.com> \nLow Cash Mode decisions are available. \nnoreply.pncalerts@pnc.com <pncalerts@pnc.com> \nReply-To: noreply.pncalerts@pnc.com \nTo: CHUCKDUSTIN12@gmail.com \nAlert \nLow Cash Mode -3 decisions are available for your review. \nHere's what's happening: Sat, Dec 16, 2023 at 5:01 AM \nLow Cash Mode is on for your account ending in X8826. You have 3 decisions to review as of December 16, 2023 6:00 a.m. \nET. Your Available Balance is -$822.14. \nHere's what you need to do: \nSign on to the PNC Mobile app1 to review your options. \nManage your alert settings in the PNC Mobile app. \n1 Standard message and data rates may apply . \n.. \nAbout this email \nPlease do not reply to this email. This mailbox is not monitored . \nThis message was sent as a service email to inform you of a transaction or matter affecting your account. PNC will never ask \nyou to send confidential information by unsecured email. \nContact Us Sign On Privacy Policy Security \n2021 The PNC Financial Services Group, Inc. All rights reserved. PNC Bank, National Association . Member FDIC \nALRDLC03 d70bfa3e-6c70-40fb-9361-f86d83ae62ea \nThe contents of this email are the property of PNC. If it was not addressed to you, you have no legal right to read it. If you \nthink you received it in error, please notify the sender. Do not forward or copy without permission of the sender. This \nmessage may be considered a commercial electronic message under Canadian law or this message may contain an \nadvertisement of a product or service and thus may constitute a commercial electronic mail message under US law. You \nmay unsubscribe at any time from receiving commercial electronic messages from PNC at https://cloud.e.pnc.com/ \nglobalunsub \nhttps://mail .google.com/mail/u/0/?ik= 13839461 f7 &view=pt&search=all&permmsgid =msg-f: 1785436020400394285&simpl=msg-f: 1785436020400394285 1 /2",
      "char_length": 1996
    },
    {
      "page_number": 23,
      "text": "EXHIBIT 2\nRESPONDENT'S REQUEST \nFOR THE $1,576 \nTRANSFERRED TO \nPETITIONER ON DEC. 15, \n2023M.1487 M.1487\nM.1487 M.1487 M.1487 M.1487",
      "char_length": 133
    },
    {
      "page_number": 24,
      "text": "�iiii;'.,:;_-.. A CERTIFIED COPY \n</,\\ ATTEST: 04/16/2024 \n� � THOMAS A. WILDER \n,<f DISTRICTCLERK \n� /TARRANT COUNTY, TEXAl \n\":•••• BY; Isl Catherine Saenz ...... M.1488 M.1488\nM.1488 M.1488 M.1488 M.1488",
      "char_length": 205
    },
    {
      "page_number": 25,
      "text": "M.1489 M.1489\nM.1489 M.1489 M.1489 M.1489f:~i.i~.. A CERTIFIED COPY \nCi,\\ ATTEST; 04/16/2024 \n~~THOMASA.W ILDER \n•\"':-DISTRICT CLERK \n• :YP./TARRANT COUNTY, TEXA: \n<;!;·· BY: Isl Catherine Saenz ••·•••",
      "char_length": 201
    },
    {
      "page_number": 26,
      "text": "EXHIBIT 3\nTEXT CONFIRMING \nMONEY TRANSFER  \nTO PETITIONER ON \nDECEMBER 16, 2023  M.1490 M.1490\nM.1490 M.1490 M.1490 M.1490",
      "char_length": 122
    },
    {
      "page_number": 27,
      "text": "M.1491 M.1491\nM.1491 M.1491 M.1491 M.1491Community",
      "char_length": 50
    },
    {
      "page_number": 28,
      "text": "EXHIBIT 4\nRESPONDENT'S BANK \nSTATEMENT FROM \nDECEMBER, 2023, \nSHOWING THE \nTRANSACTION TO DANIEL \nBRANTHOOVER'S PAYPALM.1492 M.1492\nM.1492 M.1492 M.1492 M.1492",
      "char_length": 159
    },
    {
      "page_number": 29,
      "text": "Virtual Wallet Spend Statement\nFor the period 12/02/2023 to 01/02/2024\nFor 24-hour information,sign on to PNC Bank Online Banking CHARLES MYERS\non pnc.com Primary account number:\nAccount Number: - continued\nBanking/Debit Card Withdrawals and Purchases - continued\nDate Amount Description\n12/15 1.33 3117 Debit Card Purchase Paypal \n12/18 1,576.00 3117 Debit Card Purchase Paypal \n12/18 10.65 3117 Recurring Debit Card Microsoft*Xbox\nGame P\n12/19 80.00 3117 Debit Card Purchase Google\n*Svcs753f2d7d-7\n12/19 3.19 POS Purchase Google *Google Mountain Vie\nCa\n12/20 9.73 3117 Debit Card Purchase Prime Video\n*Zb2Ax6Hc3\n12/20 1.00 3117 Debit Card Purchase Elevenlabs.Io\n12/21 12.99 3117 Recurring Debit Card Abcmouse.Com*\n12/21 38.86 3117 Debit Card Purchase DD Doordash\nSonicdriv\n12/21 80.00 3117 Debit Card Purchase Google\n*Svcs07659609-d\n12/21 14.02 3117 Debit Card Purchase Wmt Plus Dec\n2023\n12/26 55.17 3117 Debit Card Purchase Amzn Mktp\nUS*R35H22C73\n12/26 138.38 3117 Debit Card Purchase Amzn Mktp\nUS*Ui1Wh8M23\n12/26 31.37 3117 Debit Card Purchase Amzn Mktp\nUS*1I3TH8Gf3\n12/26 15.14 3117 Recurring Debit Card Google\n*Youtubepremiu\n12/26 80.72 3117 Recurring Debit Card Att*Bill Payment\n12/26 188.35 3117 Recurring Debit Card Openai\nHttpsopenai C\n12/26 52.89 3117 Recurring Debit Card Discord*\n10Xserverboo\n12/26 118.43 3117 Recurring Debit Card Klarna\nKlarna.Com\n12/27 80.00 3117 Debit Card Purchase Google\n*Svcsd05bfd7b-1\n12/28 25.40 3117 Debit Card Purchase Til*Pl Cicis 22\nHurst\n12/28 20.00 3117 Debit Card Purchase Cicis Pizza 22\nArcade\n12/28 16.85 3117 Debit Card Purchase Big Z  Watauga Tx\n12/28 6.99 3117 Recurring Debit Card Atom Finance, Inc.\n12/28 2.10 3117 Debit Card Purchase Ism, Inc. DBA\nAirup\n12/28 5.32 3117 Debit Card Purchase\nAmznfreetime*Xl50U2M73\n12/29 10.00 3117 Debit Card Purchase Big Z  Watauga Tx\n12/29 17.16 3117 Debit Card Purchase Shell Oil\n57543389001\n12/29 2.80 3117 Debit Card Purchase Shell Oil\n57543389001\nBanking/Debit Card Withdrawals and Purchases continued on next pagePage 4 of \n6M.1493 M.1493\nM.1493 M.1493 M.1493 M.1493-",
      "char_length": 2060
    },
    {
      "page_number": 30,
      "text": "EXHIBIT 5\nTEXT MESSAGE \nEVIDENCE SHOWING \nTHE PETITIONER \nRECEIVED HELP \nDRAFTING HER \nPLEADINGSM.1494 M.1494\nM.1494 M.1494 M.1494 M.1494",
      "char_length": 137
    },
    {
      "page_number": 31,
      "text": "M.1495 M.1495\nM.1495 M.1495 M.1495 M.1495",
      "char_length": 41
    },
    {
      "page_number": 32,
      "text": "EXHIBIT 6\nTEXT MESSAGE EVIDENCE \nPROVING PETITIONER \nTRANSFERRED FUNDS TO \nHERSELF PRIOR TO HER CLAIMS \nOF INDIGENCY MADE UNDER \nOATHM.1496 M.1496\nM.1496 M.1496 M.1496 M.1496",
      "char_length": 174
    },
    {
      "page_number": 33,
      "text": "M.1497 M.1497\nM.1497 M.1497 M.1497 M.1497",
      "char_length": 41
    },
    {
      "page_number": 34,
      "text": "M.1498 M.1498\nM.1498 M.1498 M.1498 M.1498",
      "char_length": 41
    },
    {
      "page_number": 35,
      "text": "EXHIBIT 7\nEXCERPTS OF DOCUMENTS PREPARED BY PETITIONER AND \nDANIEL BRANTHOOVER IN YUKON OKLAHOMA \nCONTAINING KNOWINGLY FALSE STATEMENTSM.1499 M.1499\nM.1499 M.1499 M.1499 M.1499",
      "char_length": 176
    },
    {
      "page_number": 36,
      "text": "M.1500 M.1500\nM.1500 M.1500 M.1500 M.1500REQUIREMENTS FOR UNCONTESTED CASES INVOI,VlN!, \nSELF REPRESENTED LITIGANT WITH Cllll,DREN \nTHE COURT REQUIRES YOU SUBMIT A COPY OF YOURPAPER\\VORK TO TIIE DRO ON THE zN!> \nFLOOR OF THE FAMJLY LAW CENTER OR AT DRO-Lcgal(,lltarrantconntytx.gov \nAn attorney employed by Tarrant County will review your papenvork, This process will ensure that the form of your order \nmeets the Court's standards. The attorney does not represent you or your sp0use. The attorney will not give you legal advice. \nThe attorney \\\\ill inform you of the policies. and preferences of the Court and wilJ work with you to meet the court's \nexpectations, Providing information does not constitute an attorney client relationship between you and the DRO. You may \nseek independent legal counsel at any time. You may also consult wwv,,,te;uslgwbs;huu:g for legal information. By signing \nbelow) you acknowledge thet rpos1/of is service to the court and understand the instructions as outlined below. \nPetitioner's Signature . Date: l\"Z-{18 f ?OZ2 \nPhone Number (~\\1) C\\4D • O&S'2. CauseNo. 32'2. 7'\\\"12(,:, '2.3 \nPetitioner's Emoil morwi I 31@ ~ . (.!'.!YYl \nTHE ATTORNEY WILL ONLY REVIE\\V UNCONTESTED CASfi§~ ~ \nAGREED: Your case is uncontested if you and the other party agree on all terms oft.he cii&:>R ~ \nDEFAULT: Your case is uncontested if you meet all requirements for a default jud~f.r-, --;; \n-. \"' ,..,_,; ~ \nBEFORE YOU SEND IN THE PAPERWORK. YOU MUST DO THESE TR~S: l?, \n-;;:,O \nI) Show the Court that the other party has notice of the lawsuit by either: ~ ~\\ ~ \na. Getting the other party to sign, notarize, and file a Waiver of Service v.'lth the Court, OR \nb. Getting the other party to file an A.ttswer with the Court, OR \nc. Getting the other party fonna11y served with the paperwork by either: \n\\ i_ Getting the oonstable or a private process server to serve the other party, OR \nii. Getting the Court to approve a method of alternative service, and then proving to the Court that you have \nfulfilled the requirements for that alternative service, \nliQif: If you serve your spouse by publication. there are many steps that must be completed. Please see \nhttps:/ftexrud;,,whelp&mfart;icle/service-by-puhlication-when-you-cant-find-the-other-oarent. \n2) Complete the mandatory waiting period before submitting your final paperwork. \na. In divorce cases, you MUST wait 60 days after you filed the petition. \nb. In other default cases, you may have to wait 27 days after service was completed. \nWHEN YOU SEND IN THE PAPERWORK, !!O THESE THINGS: \nl) Leave a completed Final Order on 2nd floor of Family Law Center or email to DRQ-Jcgal@tarrantcountytx.gov \n2) Include a possession schedule. You can find templates at texaslawhelp,org. \n3) Include an Austin Form. \n4) Include a signed copy of this document v.1th your case information on it. \n5) Include a copy of any prior orders involving the children. \n6) For default judgements, include proof of service as filed with the court, a signed Certificate of Last Knoi,vn Address, \nand• signed M.ilit>iy Status Affidavit. \n7) If your case involves child support, include both a completed Record of Child Support and Income Withholding Order, \n8) Only scanned copies wm be accepted. Photos of the paperwork will be rejected. \nAFIER YOU SEND IN THE P APER\\VORK: An attorney or Legal Support Officer will contact you in around l O days \nto start the review. After the re\\fiew is complete, the attorney will forward your paperwork to the judge for approval or give \nyou further instructions on how to present your paperwork to the Court.",
      "char_length": 3601
    },
    {
      "page_number": 37,
      "text": "M.1501 M.1501\nM.1501 M.1501 M.1501 M.1501NOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA \nAVISO: ESTE DOCUMENTO CONTIENE INFORMACl6N \nCONFlDENCIAL \n. . . p~ \nStatement of Inability to Afford Paymenti? \nof Court Costs or an Appeal Bond 'i?i \n'.A) \nDeclaraci6n sobre lncapacidad de Pago de Costas \nde Tribunal o de una Fianza de Apelaci6n \ncause Number \nNUmero de Caso 322 7 't ,, 2 6 3 23 \nThe Clerk's office will fill in the Cause Number when you file this form. \nEl Secretarlo de! Tribunal anotara el Numero de Caso cuando usted presenle este \nformulario. \nM oi<GA tJ NI 1C-lffU,,£ J\"\\i fll. c; \nv. Copy Information listed at !he top left of \n!he petition here. \nGopie aqul la informacion ublcada en la \nparte superior izquierda del escrlto de la \ndemanda. \nCopy information listed at the top right of !he pelition here. \nGopie aqu[ la informaci6n ublcada en la parte superior derecha del escrito de la \ndemanda. \nCourt Number \nNumero del Tribunal \n_-f,;_A-_e.~ic_A~,-.,_-r ______ ,Texas \nCounty \nCondado tll'... District Court \nTribunal de Distrito \n□ County Court \nTribunal del Condado \nD County Court at Law \nTribunal Estatutario \n□ Justice Court \nJuzgado de Paz \na Probate Court \nJuzgado Sucesorio \npg. 1 Qf 12 Approved by the Supreme Court of Texas in Misc, Oocket No, 22-9090",
      "char_length": 1280
    },
    {
      "page_number": 38,
      "text": "M.1502 M.1502\nM.1502 M.1502 M.1502 M.15021. Your lnfonnation / Su lnformaci6n \n► My full legal name is / Mi nombr~ legal completo es \n,vJ ht2.GA,J Nl ICHfUlf #\\YEJ2S \nFirst Middle --Last • / Nombre de· Pila Segundo Nom~re ·A_p~llido . \n► My date of birth is / Mi fecha de nacimiento es \nMonth Day Year· -I Mes Dia Ano \n► My address is/ Mi direcci6n es \nHome/Domicilio lt~+I ArJrJf c-r WA-1A]JGA,1t 1ft 1+i' \nMailing / Direcci6n Postal _ __..S'\"'\"'A-..,_N\\;..a..;...f ..... A ..... S.._.:..:A13~P~V -=t'-:--------\n► My phone number I Mi numero telef6nlco ( j '1) OJ 1-b -o g S 2 \n► My email I check often / Mi correo electr6nico que reviso con frecuencia \n_mof wi 131@~ .w-w, \nGo to next page \nPase a la siguiente pagina \npg. 2 of 12 Approved by the Supreme Court of Texas In Misc. Docket No. 22-9090",
      "char_length": 799
    },
    {
      "page_number": 39,
      "text": "M.1503 M.1503\nM.1503 M.1503 M.1503 M.1503-· \n·•, ··-2. About My_ Dependents/ Mis Oependientes \n\"The peop.le who.depend on me financially are listed below.\" Use initials only for \nchildren urider 18. If needed, attach a separate piece of paper to list more \ndependents. \n\"Las perso,:i-as a contini.Jaci6n dependen econ6micamente d~ mL\" Use iniciales para \nlos menores C,e 18 aiios y, si es necesario, anexe una hoja por separado para \neriumerar a todos sus dependientes. \nName Age Relationship to me \nNombre Edad Parentesco Conmigo \n-,. DA'\\J6i-t7~ \ns PAv c; tt Tf\"'R. \n• 3. Are you represented by Legal Aid? lEsta siendo r!3presentado por alguna \nentidad de asistencia legal? \nCheck only one box. Sel~ccione solo una casilla. \n□ I am being represented in this case for free by an attorney who works for a legal \naid provider or who received my case through a legal aid provider. I have attached \nthe certificate the legal aid provider gave me as \"Exhibit: Legal Aid Certificate.\" \n. Me esta rep~esentando gratuitamente un abogado que trabaja para una entidad \nde asistencia legal o que recibi6 mi caso de una entidad de asistencia legal. El \ncertificado que la entidad de asistencia legal me entreg6 lo adjunto bajo el tftulo, \n\"Anexo: Certificado de Asistencia Legal.\" \nor Io \nIt(_ I am not represented by legal aid. \nNo me esta representando ninguna entidad de asistencia legal. \npg. 3 of 12 Approved by the Supreme Court of Texas In Misc. Docket No. 22-9090",
      "char_length": 1460
    },
    {
      "page_number": 40,
      "text": "M.1504 M.1504\nM.1504 M.1504 M.1504 M.1504I 4. Public Benefits/ Benelicios de Asistencia Publica \n► Do you .or any of your dependents receive public benefits? \ntRecibe usted o sus dependientes benefic/os de asistencia pub/lea? \n□ Yes/SI l5li, No/No \n► If you answered yes, check all that apply and attach prooHo this fonn, such as \na copy of an eligibility fonn or check. \nSI respondi6 con un Si, marque todas las casillas que apliquen y adjunte a \neste formularlo comprobantes, tales como una copia de la carta aulorizando \n• que reclba estos beneficlos o una copia del cheque que recibe . . \n□ Food stamps/SNAP \n. Cupones de comlda/SNAP \n□ Medicaid \n□ SSIISSDI \n□ Lifeline \n□ Low-Income Home Energy \nAssistance \nAsistencia con Energia \nElectrica \n□ LIS In Medicare (\"Extra Help\") \nSubsidlo Adlcional de Medicare \nbajo el Programa LIS \n□ Child Care Assistance under \nChild Care and Development \nBlock Grant \nAsistencla con Guarderia oajo \nel Programa CCOBG \n□ Other/ Olros beneficios □ TANF \n□ CHIP \n□ WIC \n□ Public Housing or Section 8 Housing \nAsistencia de Vivienda / Programa de \nVivlenda bajo Secci6n 8 \n□ Community Care via HHS \nAyuda Comunltaria bajo HHS \n□ Needs-based VA Pension \nPension para Veteranos de Guerra en , \nfuncl6n a necesidades • i \n□ County Assistance, County Health I \nCare, or General Assistance (GA) \nAsistencia del Condado, Aslstencia \nModica del Condado, o Asistencia \nGenera! (GA) \n□ Other/ Otros beneficios \npg.4of12 Appro,od by the Sup,eme Court of Texas fn M;,e, 00.:kel N~",
      "char_length": 1505
    },
    {
      "page_number": 41,
      "text": "M.1505 M.1505\nM.1505 M.1505 M.1505 M.15055. What are your monthly income sources? t,Cuales son sus fuentes de \ningrn$OS mensuales? \n► My take-home pay is $ ] 4 4 in monthly wages. \nMi pago neto es $,___ en sueldo mensual. \n.-A1<.•· 11N1f Rl:Cl:!•1¼7•&\"' \n► I work as a /ISSIS]ntJT (your Job title) for Ct1'1 of WA1AV61¼ (your \nemployer). \nYo trabajo como _______ {tltulo de su puesto) para \n________ (compai\\la o jefe). 1----~---------·------_,_1 \n► $ 144 , is my lolal monthly Income/ son mis ingresos totales al mes. \nI \nThese are my income sources. Estas son mis fuentes de ingresos. \n► $ __ I({ ____ In unemployment/ en beneficlos de desempleo. \nI have been unemployed since _ _,['I.,_,_/ A\"'--__ (date). \nHe estado desempleado desde (indique fecha). \n► $ ___ \\1~ __ in public benefits/ en beneficios de Asistencia Publica. \n► $_, __ ¢~_-from people in my household other than my spouse/ de \ningresos de otras personas en mt hogar que no son de mi c6nyuge. I \nI \n► $_~¢ ___ from retirement or pension/ de Jubilaci6n o pensi6n. \n► $_~p ___ from tips or bonus/ de proplnas o bones. \n► $. _ __,If,_ __ , from disabhlty / de dlscapacldad. \n► $ __ ¢~ __ from worker's comp/ de compensaci6n al trabajador. \n► $, __ ..ct'>c... __ from social security/ de seguro social. \npg. 5 of 12 • Approwd by the Supreme Court of Texas in Misc. Docket No. 22·9090",
      "char_length": 1347
    },
    {
      "page_number": 42,
      "text": "M.1506 M.1506\nM.1506 M.1506 M.1506 M.1506I ► . $_~¢~ __ from military housing/ de vivienda.militar. \n► $. __ ,,\\i2c_ __ from dividends, interest, or royalties/ de dMdendos. \ninleres,,s, o regallas. \n► $ jl from child or spousal support/ de manutenci6n de ' ' menores o manutenci6n conyugal raciblda. \n► Answer only if your spouse is not your opponenl Responda tan solo si su \ncc6nyuge no es parte conlraria en esta causa legal.$_~P~ __ from \nmy spouse's income I de lngresos de ml c6nyuge. \n► $ __ ,.,/i~-- from other Jobs/sources of income I de otros trabajos/ \nfuentes de ingresos. \nDescribe I describa: \nGo to· next page \nPase a la siguiente pagina \npg.6of12 Approved by tt,e Suprei:ne Court of Texas in Misc. Doeket No. 22·9090",
      "char_length": 731
    },
    {
      "page_number": 43,
      "text": "M.1507 M.1507\nM.1507 M.1507 M.1507 M.1507.. \nI 6. What is the value of your assets or property? lcual es el valor de sus bienes I \nl I o propiedades? --My property includes: Value/ Valor \nMis blenes incluyen: _ The value Is lhe amount the Item would sell \nfor less the amounl you still owe on I~ ff_ \nanything. \nEl valor de sus bienes es la cantidad por la \nque la propledad 0 pertenencia se I venderia, menos el monto que aU:n se \nadeuda. si lo hubiera. -I l \n► Cash \n1$ r/ i Dlnero en efectlvo l \n► Bank accounts, other financial assets l \nCuenlas bancarias, otros bienes financleros I \n..f,l-11\\'l.1< SAtJK [$ 21. 00 \n$ \nl Is ' -, ► Cars and boats (make and year) I Automoviles, lanchas (mode lo y ano) \n. \nt./\\(\\1.Df\\ C~5 'Z.O'ZS $ 45 1 . •• / µtotJTI-I \n$ \n$ \n► Other property like jewelry, stocks, Ian , a second house. (Do not list your \nhomestead.) \nOtros bienes coma joyas, acciones, terrenos, una segunda casa. (No indique su \nhogar familiar.) ---\nr,..1\\~ l$ \ns -I \n:--· -is I \nTotal Value of Property \nI$ i~~ Valor Total de Sus Bienes \npg, 7of12 Approved by !he Supreme C-OUrt of Texas ff'! Misc, Oockel No. 22-9090",
      "char_length": 1126
    },
    {
      "page_number": 44,
      "text": "M.1508 M.1508\nM.1508 M.1508 M.1508 M.1508,. \n17. What are your monthly expenses that are not deducted from your paycheck? :i \n, (;CuSle& son sus gastos mensuales que no son descontados de su eheque de· l \n; sueldo? . , \nMy monthly expenses are: \nMis gastos mensuales son: \n► Rent/house payments; maintenance \nAlquiler/hipoteea; mantenimiento de \ncasa \n► Food and household suppTies \nAlimentos y articulos para el hogar \n► Utilities and telephone . , Luz. gas, agua y telefono \nI, ► Clothing and laundiy \nRopa y lavado de ropa \n•► Medical and dental expenses \nGastos medicos y dentales \n► Insurance (lffe, health, auto, etc.) \nSeguros (de vlda, medico, \nde autom6vil etc.) \n► School and childcare \n• Escuelas y guarderfas \n► Transportation, auto rePaif, gas \nTransportacl6n, reparaciones de auto-\nmoviles, gasoline \n► Child/Spousal support \nManutenci6n a Menores/Manutenci6n \nConyugal \n► Debt payments to (11st): I Amount \nCantidad \n$ 'i/()0 \n1$ ioo \n$ I so \nII --\n1$ fl I \n$ /i \n' $ I p \n$ p \n$ f5 \n' \nPagos par deudas hechas a (indiquelos): \niJ '~-I$ \ni $ \n► Wages wilhheld by court order ~ . . . Sueldo retenldo por orden Jud1c1al \n/ ► Other expenses (list): ! Otros gastos (lndiquelos ): \nTotal Monthly Expenses \n1 Gastos Totales Mensuales --\n-\n-\n-· \npg,8of12 Approved by the Supreme Court ofTexas ln Misc. Docket No. 22--9090 -i • \n-I ! \n'",
      "char_length": 1343
    },
    {
      "page_number": 45,
      "text": "M.1509 M.1509\nM.1509 M.1509 M.1509 M.1509.. \ns. Are there debts or other facts explaining your financial situation? \nlHay delidas u otros factores que expliquen su sltuaei6n eeon6mlca? \nMy debts Include (list debt and amount owed): \nMis duedas inciuyen {indique deuda y la cantidad que debe): \nN\\A-iPA c~ S 'l.023 I$ 4'51 / Mo1'f1// \nAAA?,t;>A Ct~ 201,1 $ s 1, r / fvlnNrH . \n$ \n' $ \n$ . \nIf you want the court to consider other facis, such as unusual medical expenses, \nfamily emergencies, etc., attach another page to this fonn labeled \"Exhibit: Additional \nSupporting Facts: \nSi usted desea que el tribunal consldere otros factores, tales como gastos medicos \nexcepcfonales. emergencias fammares, etc., adjunte al formulario otra hoja con esta \ninfonnaci6n y bajo el titulo, \"Anexo: lnfonnaci6n Adicional de Apoyo.\" \n' \n19. Ablllty to Pay Court Costs, Declaraci6n sobre su Habilldad de \nPagar Costas de Tribunal \nCheck only one box. Selecclone tan solo una casilla. \nili. I cannot afford to pay court costs. No puedo pagar las costas de tribunal. \n□ I cannot furnish an appeal bond or pay a cash deposit to appeal a justice court \ndecision, and I cannot afford to pay court costs. \nNo puedo aportar una fianza de apelacion ni pagar un dep6sito en efectivo \npara apetar la decision judicial de un magistrado, y no puedo pagar costas de \ntribunal. \nGo to next page \nPase a la siguiente pagina \npg. 9 or 12 Approved by the Supreme Court of Texas fn r,1risc. Docket N<>. 22-0090 ' i \n!",
      "char_length": 1484
    },
    {
      "page_number": 46,
      "text": "M.1510 M.1510\nM.1510 M.1510 M.1510 M.1510t \n10. Declaratlon/Aflldavlt. Dectaracl6n Escrita Bajo Juramento. • l \nFill out only one box, I( you fill out the Declaration. you· will not need to sign the form \nj in front of a notary pubfic. If you do not want to 11st your address for privacy or safety 1 \n, concerns, take the form and photo Identification, and fill out the Affidavit box in front of I I a notary public. • \nLlene tan solo una opcl6n. Si usted lleoa la Declaraci6n, no necesitara finnar el • \nformutario ante un notario. Si usted no qulere que aparezca su domlcilio en el \ndocumento para conservar su prlvacidad o por motivos de su seguridad, lleve et \nfonnulario y una identificaci6n con fotografia y Ilene la seccion de la Deciaracion \nEscrila Bajo Juramenlo ante un Notario. \nGo to next page \nPase a la siguiente pagina \npg.10of12 Approved by the Supreme Court of Texas ifl Mi$C:. Docket No. 22-0090",
      "char_length": 914
    },
    {
      "page_number": 47,
      "text": "M.1511 M.1511\nM.1511 M.1511 M.1511 M.1511.t \nOption 1 / Opci6n 1 \nDeclaration: I d~ctare under penalty of perjury that the foregoing is true·. . \nand correct. . . . \nDeclaraci6n: Yo declare bajo pena de perjurio que l?t.informaci6n a \ncontinuaci6n es correcta y verdadera. • • \n► My name is / Mi nombre es \n► My date of birth is / Mi fecha de nacimiento es \n► My address is / Mi domicilio es \nlt~4\\ Ar-JtJE • c-r wNrA'VGA, 1'1-1v1t<i \nStreet, city, zip, country \nCalle y numero, ciu ad, estado, c6digo postal, pais \n► \n► 1i/1vl1.e>23 \nDate (month, day, year) \nFecha (mes, dia, ano) \n► TA~f2.Ar,rr, TX. \nCounty, state \nCondad9, estado \nGo to next page \nPase a la siguiente pagina \npg. 11 of 12 Approved by the Supreme Court of Texas in Misc. Docket No. 22-9090",
      "char_length": 759
    },
    {
      "page_number": 48,
      "text": "M.1512 M.1512\nM.1512 M.1512 M.1512 M.1512,, . \nOption 2·/ Opci6n 2 \nAffidavit: I swear under penalty of.perjury that the foregoing is true and \ncorrect. \nDeclaraci6n Escrita Bajo Juramento: Yo juro ·bajo pena de perjurio, \nque lo que precede. es correcto y verdadero. \nYou fill outthis section. • \nUsted llena esta secci6n. \n► N\\ORGAtJ M\\vlt'£11,E M'/E~S \nYour printed name \n►-Su~olde \nYour signatur \nSu firma • \nThe notary fills out this section. \nEl Notario llena esta seccl6n. \n► \nSubscribed before me this day of \nJuramentado y suscrito ante mi el dia de hoy del mes de \n-----------~ 20 __ \nNOTARY \nNOTARIO \npg. 12 of 12 Approved by the Supreme Court of Texas in Misc. Docket No. 22-9090",
      "char_length": 691
    },
    {
      "page_number": 49,
      "text": "M.1513 M.1513\nM.1513 M.1513 M.1513 M.151314 \nCause No.:322 7 4 4 5 -3 8 2 3 \nApplicant: ___ i{\\__......,~t'..__;;b;;..,..(\\ __ r-1_____._f{\\_\\...,..C ......... \\11 ....... 1 ........ LE..__._M-'-i ...... E'..._(? s-'--_ § \n§ \n§ \n§ \n§ \n§ \n§ ln the \nV. \nRespondent: (J\\Ag,lJ S D1/~1IN M'(t,PS \nApplication for Protective Order \n1 Parties \nName: County of Residence: \nApplicant: M~&GAcl MtU\\HL( MYEf2-<; 'IA(l\\\"2..AN r \nRespondent: C,\\\\A(lL\\;S DVS1'\\cl Mjf(l..S ~AACZ.A N1 \nRespondent's address for service: _,\\,1:..e\\p\"\"--'4----'\\--L..:A.u.N::.iN.:::.E\"'--\"G<-'f__,yJc::..w.A. 1....:....:.._A.....:\\J\"\"\"Ge<eA--.:iJ,_1.1-'f....,,___:]i.;lp..,__._ l 1::S(....,___,. _________ _ \nCheck all that apply: . \n'lL The Applicant .and Respondent are or were members of the same family or household. \nd7L The Applicant and Resp~ndent are parents of the same child or children. \nO The Applicant and Respondent used to be married. \nO The Aoplicant and Respondent are or were dating. \n0 The Applicant is an adult asking for protection for the Children named below from child abuse and/or \n·family or dating violence. \n0 The Applicant is dating or married to a person who was married to or dating the Respondent. \n2 Children: The Applicant is asking for protection for these Children under age 18: \nName: Is Respondent the biological parent? County of Residence: \na. _____ ~ '(es D No __ -,.~ft~t~<L_A~r-J~f ______ _ \nb. _____ 121...Yes O No __ 1'_,_,_frt.._.{Lc;;;..:..Jf±u.rJ~T ____ __ _ \nc. ________________ 0 Yes D No \nd. ___ __________ ___ 0 Yes O No \nCheck all that apply: \n0 Other children are listed on a sheet attached to this Application. \nRI The Children are or were members of the Applicant's family or household. \nD The Children are the subject of a court order affecting access to them or their support. \n3 Other Adults: The Applicant is asking for protection for these Adults, who are or were members of the \nApplicant's family or household , or are in a dating or marriage relationship with the Applicant. \nName: County of Residence: \na. \nb. \n4a Other Court Cases: Are there other court cases. like divorce, custody. support, involving the Applicant. Respondent, \nor the Children? \n() Yes D No \nIf \"'Yes,'' say what kind of case and if the case is active or completed. \nDhtD&Cf -A CT1v£ \nIf \"completed,'' (check all that apply): □ A copy of the final order is atta.ched. \nA:;plical:or 'or Protective Orde~ \nForm Aoprcved by the Suoreme Courl oi Texas O A copy of the final order will be filed before the hearing on this Applicaiion. \nD The Texas Office of the Attorney General Child Support Division has been \ninvolved with a child support case. List the agency cast' -·.-.-;:.\\~.:.:--each \n. -••m•o~11' ~••. ACERTIFIEDCOPY open case, 1f known. Case Number: :\"§- r0\\ ATTEST: 0411512024 \n. . ·f8 ~ \\\\ THOMASA.WILDER \n~t •~-• --<:-DISTRICTCLERK \n• \\~'ls 1 ,'£.lT AlffiANJ CQIJfl!,TY, TEXAS \n• ••?. ...... ~••• s'f:~thMrnllSaenz",
      "char_length": 2924
    },
    {
      "page_number": 50,
      "text": "M.1514 M.1514\nM.1514 M.1514 M.1514 M.151415 \n4b Presumption of Family Violence: Has the Respondent ever been convicted of or placed on deferred adjudication \ncommunity supervision for any crime under Title 5 or Title 6 of the Texas Penal Code? (see list of crimes at the • \nend of the kit) • \n□Yes filNo \nIf \"Yes/ say what kind of case: \nIf the Respondent was convicted or placed on community supervision for a Title 5 crime. did the Court make a \nfinding that the crime involved family violence? \nOYes ONo \nWas the crime against a child listed in this petition under Number 2 ''Children~? \n□Yes ONo • \nHave the Respondent's parental rights to this child been terminated? \n□Yes □No \nIs the Respondent seeking or attempting to seek contact with this child? \n□Yes □No \n5 Grounds: Why is the Applicant asking for this Protective Order?.Check one or both: \n}i' The Respondent committed family violence. \nD The Respondent violated a prior Protective Or~er that expired, or wlll expire in 30 days or less. A copy of the \nOrder is (check one):· • □ Attached, or • \n□ Not available now but will be filed before the hearing on this Application \nThe Appli~ant requests a PROTECTIVE -ORDER and asks the Court to make all Orders marked with a check V \n6 v Orders to Prevent Family Violence \nThe Applicant asks the Court to order the Respondent to (Check all that apply): \na. ti.' Not commit family violence against any person named on page 1 of this form. \nb. ~ Not communicate in a threatening or harassing manner with any person named on page 1 of this form. \nc. Ef Not communicate a threat through any person to any person named on page 1 of this form. \n• d. ef Npt communicate or attempt to communicate in any mahner with (Check all that apply): \nEl Applicant □ Children □ Other Adults named on page 1 of this form. \nThe Respondent may communicate through: _____ ______ _ or other person the Court \nappoints. Good cause exists for prohibiting the Respondent's direct communications. \ne. ref N9t go within 200 yards of the (Check all that apply): • \n13 Applicant D Children D Other Adults named on page 1 of this form. \nf. r/ Not go within 200 yards of the residence, workplace. or school of the (Check alf that apply): \nief Applicant □ Other Adults named on page 1 of this form. \ng. rJ Not.go within 200 yards of the Children's residence , child-care facility, or school. except as specifically \nJ authorized in a possession schedule entered by the Court. \nh. l?:l Not stalk, follow. or engage in conduct directed specifically to anyone named on page 1 of this form that is \nreasonably likely to harass, annoy, alarm, abuse, torment. or embarrass .them. including tracking or \nmonitoring a car or other property. • \nThe Applicant asks the Court to: \ni. [l, Suspend any license to carry a handgun issued to the Respondent by the State of Texas. • \nj. ~ Require the Respondent to complete a battering intervention and prev~ntion program; or if no such program \nis available, counseling with a social worker, family service agency, physician. psychologist . licensed \ntherapist, or licensed professional counselor;· and pay all costs for the counseling or treatment ordered. \nk. D Prohibit the Respondent from taking, harming, threatenin g, or interfering with the care, custody, or control \nof the following pet, companion animal,' or assistance animal: _________ (describe the \nanimal). \nI. D Require the Respondent to follow these provisions to prevent or reduce the likelihood of family violence: \nThe law requires a trial court issuing a protective order to prohibit the Respondent from possessing a firearm or \nammunition, unless the Respondent is a peace officer actively engaged in employment as a swo ·•'.;;t~~:·•.. )aid \nI f I t 1·1· I bd' • • ·•mo\"\"-\"\">-'· A CERTIFIED COPY emp oyee o a s a e agency or po 1 ,ca su IvIsIon. . /s _.. '9;.·. ATTEST: 0411512024 \n. :8 ~ ~: THOMASA.WILDER \nAppl:c;:ibon 'or Prohir.tive Orde· ~t :~.. -<l ,PISTRICTCLERK \nForm Approved by the Suoreme Court ofTe\"<c1s • ·-~~ 1 \n~n::lrAAA'KIJt~Ntv . TEXAS \n·•?. ....... ••·• BY. ls/ Catherme Saenz",
      "char_length": 4072
    },
    {
      "page_number": 51,
      "text": "M.1515 M.1515\nM.1515 M.1515 M.1515 M.151516 \n7 ~Property Orders \nThe Residence located at: lu\\.Q4\\ /\\iJNE c:f Wf\\f P<\\)GA, T'X ]\\o \\Af \n(Check one): g.i~ jointly owned or leased by the Applicant and Responden t; \nD is solely owned or leased by the Applicant: or \nO is solely owned or leased by the Respondent: and the Respondent is obligated to support the Applicant \nor a child in the Applicant's possession. \nThe Applicant also asks the Court to make these orders (Check all that apply): a The Applicant to have exclusive use of the Residence identified above, and the Respondent must vacate \nthe Residence. \ntL The sheriff, constable, or chief of police shall provide a law enforcement officer lo accompany the Applicant to the \nResidence , to inform the Respondent that the Court has ordered the Respondent excluded fron: the Residence . to \nprovide protection while the Applicant takes possession of the Residence and the Respondent removes any neces­\nsary personal property, and, if the Respondent refuses to vacate the Residence, to remove the Respondent from \nthe Residence and arrest the Respondent for violating the Court's Order. \n\"©. The Applicant to have exclusive use of the following proper that the Applicant and Responden t jointly own or lease: I • T \n~ The Respondent must not damage, transfer, encumber, or otherwise dispose of any property jointly owned or \nleased by the parties, except in the ordinary course of business or for reasonable and necessary living expenses, \nincluding. bul not limited to, removing or disabling any ·,ehicle o•.•med or possessed ty !he Applicant er joiGtly \nowned or possessed by the parties (whether so titled or not). \n• 8 tJ. Spousal Support Order \nThe Applicant is married to the Respondent or otherwise legally entitled to support from the Respondent and asks \nthe Court to order the Respondent to pay support in an amount set by the Court. \n9 &!_Orders Related to Removal , Possession, and Support of Chil \nT the following of the Applicant's children: \nAnd, the Applicant asks for these O~ders in the best interest of the people named on page 1 of this form. \nCheck all that apply: \nc& The Respondent must not remove the children from the Applicant\" s possession or from their child-care facility or \nschool. except as specifically authorized in a possession schedule entered by the Court. \n~ The Respondent must not remove the children from the jurisdiction of the Court. \n0-Establish or modify a schedule for the Respondent's possession of the Children, subject to any terms and conditions \nnecessary for the safety of the Applicant or·the Cliildren. R Require the Respondent to pay child support in an amount set by the Court. \n10 vi°emporar y Ex Pa rte PROTECTIVE ORDER \nBase.don the information in ·the attached Affidavit or Declaration. there is a clear and present danger of family violence \nthat will cause the Applicant, Children, or Other Adults named on page 1 of this form immediate and irreparable injury. \nloss, and damage, for which there is no adequafe remedy at 1aw. Applicant asks the Court to issue a Temporary Ex Parte \nProtective Order immediately without bond, notice, or hearing. \n11 filx Parte Order: Vacate Residence Immediate I¥ • \nThe Applicant now lives with the Respondent at: ~lef\\ A~tJr; er WtiU\\:VGA ,-r-1. ,t? \\4& or has resided at this \nResidence within the 30 days prior to filing this Application. The Respondent committed family violence against a \nmember of the household within the 30 days prior to the filing of this Application, as described in the attached \nAffidavit or Declaration. There is a clear and present danger that the Respondent is likely to cr ..... \"':'.;,t..~:\"';i., violence \n• ~-~~A~~ • ls ~.. i-.. AnEsT. 0411s12024 • :8 • ~~ THOMAS.A. WILDER \nApphcat1cn for P·otec:1ve Or-Jer ~t -<l OISTRICTCLERK \n. Ferm Aooroved by the Supreme Court of Tex::is ··~., 1 \"':lTA~a9f~ . TEXAS ·•.:o ~-BY. Isl Catherine Saenz \n••······ ••",
      "char_length": 3936
    },
    {
      "page_number": 52,
      "text": "M.1516 M.1516\nM.1516 M.1516 M.1516 M.1516.. \nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA \nCause Number. 322 7 4 '• 2 6 3 23 \nIn the Matter of the Marriage of \nIn the ____ _ \nPetitioner: Morgan Michelle Mvers (Court Number) \nPrint first, middle and last name of the spouse who flied for divorce. \nAnd 19--District Court D County Court at Law \nRespondent: Chartes Dustin Myers \nPrint first, middle and last name of other spouse. \nAnd in the Interest of: \n(Print the Initials of each child you and your spouse have together who is under 18 or still In high school.) \n1. \n4. ____ 2. \n----------- 5. ----- 3. \n------------ 6. \nOriginal Petition for Divorce \nPrint your answers. \nMy name is: Morgan Michelle Myers \nFirst \nI am the Petitioner, the person asking for a divorce. Middle Tarrant County.Texas \nwt \nThe last three numbers of my driver's license number are ■ ..................... My driver's license was \n-Issued in (State): ___ Te=xa=.:..s _______ _ \nor O I do not have a driver's license number. \nThe last three numbers of my social security number are: -\nor O I do not have a social security number. \nMy spouse's name is:..;;;C_h.;;..a..c...r1e;;..;sc.....D_u;...;s;..;;.tin__,;_.M.;.,.y-'-e-'rs _____ ___________ ____ _ _ \nFirst Middle Last \nMy spouse is the Respondent \n1. Discovery Level \nThe discovery level in this case, if needed, is Level 2. \n2. Legal Notice (Check one box.) \n0 I think my spouse will sign a Waiver of Service (or Answer). Do not send a sheriff, constable, or \nprocess server to serve my spouse with a copy of this Petition for Divorce at this time. \n19' I will have a sheriff, constable, process server or clerk serve my spouse with this Petition for Divorce \nhere: \n6641 Anne Court. Watauga, Texas 76148 \nStreet Address City State Zip \nIf this is a work address, name of business: _______ __________ ___ _ \nI ask ttie clerk to issue a Citation of Service (the form necessary to provide legal notice to my spouse by \nMOfficial Service of Process·). I understand that I will need to pay the fee (or file a Statement of Inability \nto Afford Payment of Court Costs if I am unable to pay the fee) and arrange for service. \n0 I cannot find my spouse. I ask that my spouse be served by publication. I understand I must file an )> -n -n -0 \n~ -; \n0 ,, -z \n)::, \nco -r-\n~ \nAffidavit for Citation by Publication and hire a lawyer to serve as attorney ad litem form .. -~;;.;R~.. A CERTIFIED coPv \n;°l'-E'~ 'o\\ ATTEST: 04/15/2024 :8. \\;1rHOMASA .WILDER \n~t . --<:-DISTRICTCLERK \n•-~J>. ~/TARRANT COUNTY, TEXAS \n•••?. ......... ·• BY: Isl Catherine Saenz",
      "char_length": 2577
    },
    {
      "page_number": 53,
      "text": "M.1517 M.1517\nM.1517 M.1517 M.1517 M.1517. . \n9. Protective Order Statement (Check the appropriate boxes. Fill in the requested infonnation .) \n9A. No Protective Order \nD I do not have a protectiv~ order against my spouse and I have not asked for one. \nD My spouse does not have a protective order against me and has not asked for one. \n9B. Pending Protective Order \n~ I have filed paperwork at the courthouse asking for a protective order against my spouse, but a \njudge has not decided if I should get il I asked for a protective order on ..:.1:::::21:..:.1.;;:;4/2=0.:::;23:::-___ _ \nDate Filed \nIn Tarrant County, Texas . The cause number is. __________ _ \nCounty State Cause Number \nIf I get a protective order, I will file a copy of it before any hearings in this divorce. \nD My spouse has filed paperwork asking for a protective order against me, but a judge has not \ndecided if my spouse will get it. My spouse asked for a protective order on _______ _ \nDate Flied \nin. _______ County,, _____ . The cause number is __________ _ \nCounty State Cause Number \nIf my spouse gets a protective order, I will file a copy of it before any hearings in this divorce. \n9C. Protective Order In Place \nD I do have a protective order against my spouse. I got the protective order in ____________ county,, __________ on, _______ _ , \nCounty State Date Ordered \nThe cause number for the protective order is. _______ __________ _ \nCause Number \nEither I have attached a copy of the protective order to this petition or I will file a copy of it with the \ncourt before any hearings in this divorce. \nD My spouse does have a protective order against me. The protective order was made in _____________ County, __________ on. _______ _ \nCounty State Date Ordered \nThe cause number for the protective order is __________________ _ \nCause Number \nEither I have attached a copy of the protective order to th is petition or I will file a copy of it with the \ncourt before any hearings in this divorce. \n10. Waiver of Waiting Period Based on Family Violence (Check only if applicable .) \n~ I ask the Court to waive the 60-day·waiting period for divorce because: (Check one box.) \nD My spouse has been convicted of or received deferred adjudication for a crime involving family \nviolence against me or a member of my household . \n5¥ I have an active protective order or an active magistrate's order for emergency protection against \nmy spouse because of family violence during our marriage. The order includes a finding that my \nspouse committed family violence. \n. .• ~;~i:iiii~;:;_.., A CERTIFIED COPY \n:°:,.,_.1111• 'c,\\ ATTEST: 04/15/2024 \n[8: ~_,.; ,11™0MASA .WILDER \n~t, .:~.. '\": DISTRICTCLERK ••i., ' ,...~/r ARRANT COUNTY , TEXAS \n••:?. ...... ~~••· BY; Isl Catherine Saenz",
      "char_length": 2761
    },
    {
      "page_number": 54,
      "text": "EXHIBIT 8\nTHE RESULTING ORDER FROM THE  PETITIONER'S \nFRAUDULENT PLEADINGSM.1518 M.1518\nM.1518 M.1518 M.1518 M.1518",
      "char_length": 115
    },
    {
      "page_number": 55,
      "text": "M.1519 M.1519\nM.1519 M.1519 M.1519 M.1519322-744263-23 \n322ND FAMILY DISTRICT COURT 11.l,,,,cf,/.,~ FILED \n\":SSifO :IA'l'M 1tfOqR'S RP§ffl'ff ,WI_ r TARRANTcouNTY n. ► ~ • ~ t/17/2024 2:28 PM . 1 //I /6 :l, ~ \"'\\ \"ll THOMAS A. WILDER CAUSE NUMBER: 322 -'t\"T .J -~:, ! DISTRICT CLERK \nITMOTMO/INRE ~Z2· 7'/1/ ,_\":J-\"3 • \n/nt; r50.-11 (II}• fily~r$ IN THE DISTRICT COURT \n, TARRANT COUNTY, TEXAS § \n§ § § \n322ND JUDICIAL DISTRICT frl1,,~ § \nRESET DATE AND TIME: _ ___;~..=..:~:....:....:Jt~IJ£,=--:....-r''f_,__J._~-1-./--1ri::...a..;b=--=~~c/_:_.._a~f-=-- ....:...,_.;;.__;;___i=;___ -\nI. Appearances: \nrs/ Petitioner/Movant appeared in person and\"' a:tto1ne~_n ___ /'0 __ $ __ :_,. ________ _ \n[!(°'Respondent appeared in person and by attu1ney __ r'-_.,,_~ __ 5_~----------\n□-------------------------------- -\n□ Child Support □ Health Insurance □ CPS \n~(/()~I'~•' \n3. Order(s) or Agreeme : __ JJ_~ ______ f»........-,_-{r_c _____ l_ll.____ ____________ ,,.,_' \"--'•...,..-'--~ -'-=- ........ A-=-o ........ u_$_~_ \nAGREED AS TO FORM AND SUBSTANCE : \nAttorney for Petitioner Attorney for Respondent \nPetitioner Respondent \nDERE~ \nDate ••m•;;;;Ak~•.. A CERTIFIED COPY f §' ~ ri:•. A 11 ES I. 041 1512024 \n:8 ,~.. ~: THOMASA .WILDER \n~I}. 1 ·\"f OISTRICTCLERK \n\\~'ls ,'£.: TARRANT COUNTY, TEXAS \n•••? ~-•• BY: Isl Catherine Saenz \n•••··•••",
      "char_length": 1336
    }
  ]
}