{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\04.04.2025_COMPREHENSIVE LEGAL ANALYSIS IN SUPPORT OF DISMISSAL-1.pdf",
  "base_name": "04_04_2025_comprehensive_legal_analysis_in_support_of_dismissal_1",
  "page_count": 20,
  "pages": [
    {
      "page_number": 1,
      "text": "322-744263-23\nCOMPREHENSIVE \nLEGAL ANALYSIS IN \nSUPPORT OF \nDISMISSAL \n04.04.25M.1975 M.1975\nM.1975 M.1975 M.1975 M.1975",
      "char_length": 120
    },
    {
      "page_number": 2,
      "text": "NO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HONORABLE  JUDGE OF THE 322ND  DISTRICT COURT OF TARRANT \nCOUNTY: \nEXECUTIVE S UMMARY \nThis l egal ana lysis exa mines t he case of  Charles Dustin M yers ( \"Respondent\") aga inst \nMorgan M ichelle M yers (\"Petitioner\") and her attorney Cooper L. Carter . Based on thorough \nresearch of Texas law and the facts presented, there are multiple compelling legal grounds \nsupporting the Respondent's entitlement to relief for his children and establishing attorney \nmisconduct by Ms. Carter. This summary was prepared by CHARLES DUSTIN MYERS, who is \nof sound mind and attests to the validity of all claims, accusations, and statements herein as true \nto the best of his know ledge unde r penalty of perjury. ITMOMO  \n(AITIO M.E.M., C.R.M., two children) \nMORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , RESPONDENT’S COMPREHENSIVE \nLEGAL ANALYSIS IN FA VOR OF \nDISMISSAL  \nRespondent.  \n2025 -04-04 322-744263-23 FILED\nTARRANT COUNTY\n4/4/2025 9:12 AM\nTHOMAS A. WILDER\nDISTRICT CLERKM.1976 M.1976\nM.1976 M.1976 M.1976 M.1976",
      "char_length": 1113
    },
    {
      "page_number": 3,
      "text": "The analysis concludes that:  \n1. The divorce case should be dismissed for want of prosecution due to Petitioner's failure \nto advance the case for nearly a year  \n2. The current orders are void due to lack of consent and improper adoption by the referring court \n3. The 322nd District Court never acquired continuing exclusive jurisdiction over the children  \n4. The new SAPCR was properly filed as an original proceeding and should not be consolidated, especially  considering no motion to transfer has been filed. \n5. Ms. Carter's pleadings should be stricken due to her failure to respond to a Rule 12 challenge  \n6. The children's best interests require immediate relief without further procedural delays  \nI. FACTUAL BACKGROUND \nA. Procedural History  \n1. December 1 8, 2023: Divorce case filed in 322nd District Court with 60- day waiver.  \n2. February 6, 2024: Respondent filed emergency motion challenging basis for agreement. \n3. March 14, 2024: Respondent’s motion was denied, basis for agreement became temporary orders.  \n4. April 8, 2024: Respondent sought relief in the Second Court of Appeals via Mandamus. \n5. April 10, 2025: Respondent was denied mandamus, he moved for rehearing. M.1977 M.1977\nM.1977 M.1977 M.1977 M.1977",
      "char_length": 1240
    },
    {
      "page_number": 4,
      "text": "6. April 24, 2024: Cooper L. Carter filed Motion for Pre- Trial Conference. \n7. May 13, 2024: Second Court of Appeals denied rehearing, Respondent appealed to the \nTexas Supreme Court. \n8. June 2024: Texas Attorney General attempted to intervene. \n9. September 2024: Supreme Court of Texas denied relief. \n10. September 17, 2024: Respondent served a request for discovery and admissions on Petitioner .  \n11. September 20, 2024: Respondent filed Rule 12 motion challenging Carter's authority. \n12. October 7, 2024: Respondent moved to recuse judge s after the case continued to stall and \nun-opposed emergency relief remained unadjudicated. \n13. November 7, 2024: Recusal denied. \n14. December 4, 2024: Respondent removed case to Northern District of Texas. \n15. December 6, 2024: Case remanded to state court , placing the obligation of Rule 237a of \nthe Texas Rules of Civil Procedure on COOPER L. CARTER, which remains unsatisfied. \n16. March 2025: Respondent filed new SAPCR in 233rd District Court seeking emergency relief for the children.  \n17. March 28, 2025: Respondent appeared for TRO hearing that was not heard due Cooper Carter’s improper interference.  \n18. April 2, 2025: Respondent pre-objected to consolidation. M.1978 M.1978\nM.1978 M.1978 M.1978 M.1978",
      "char_length": 1270
    },
    {
      "page_number": 5,
      "text": "19. April 4, 2025: Cooper L. Carter attempting to present consolidation motion without any \nreference to the objection, EX-PARTE, and without conferring with Respondent . \nB. Harm to Children \n1. Children subjected to psychological manipulation and medical neglect by Petitioner \n2. Children left home alone at night without supervision \n3. Children removed from Respondent's care and placed with elderly great-grandparents \n4. Children being gaslighted by Petitioner into false belief that divorce is finalized \n5. Eldest child's academic performance has plummeted  \n6. Children emotionally estranged from both parents \n7. Respondent unlawfully locked out of family home on March 6, 2024 \n8. Respondent prevented from accessing home and caring for children \n9. Respondent’s business has been significantly damaged due to Petitioner’s deception and the children’s financial future has been crippled \nC. Attorney Misconduct  \n1. Cooper L. Carter has failed to prosecute the case since April 24, 2024. \n2. No substantive action has been taken  for approximately 11 months. \n3. Failed to respond to discovery requests, resulting in deemed admissions. \n4. Failed to comply with Rule 237a after federal remand . \n5. Failed to respond to Rule 12 challenge to authority. M.1979 M.1979\nM.1979 M.1979 M.1979 M.1979",
      "char_length": 1305
    },
    {
      "page_number": 6,
      "text": "6. Several exhibits have been provided, conclusively establishing the claims herein without \nresponse. \n7. Has not communicated or responded in any manner throughout the litigation. \n8. E-filing account registered under prior employer's email address. \n9. Not properly registered for e- filing notifications . \n10. Has an individual not named in the suit file pleadings on her behalf. \n11. Claims to have been retained in her individual capacity yet there are multiple people claiming to represent Petitioner in this matter.  \n12. Lacks current working phone number or email on file with State Bar. \n13. Reappeared only to block emergency relief in new proceedings in violation of Due Process.  \n14. Never filed substantive response to any of Respondent's claims and continues to ask favors from the bench. \nII. LEGAL ANALYSIS  \nA. Dismissal for Want of Prosecution \nLegal Framework \n1. Texas courts have authority to dismiss cases for want of prosecution under both Texas \nRule of Civil Procedure 165a and the court's inherent power to manage its docket. The Texas \nSupreme Court recognized both bases for dismissal in Villarreal v. San Antonio Truck & Equipment , 994 S.W.2d 628 (Tex. 1999). M.1980 M.1980\nM.1980 M.1980 M.1980 M.1980",
      "char_length": 1235
    },
    {
      "page_number": 7,
      "text": "2. A party seeking affirmative relief has a duty to prosecute the case with due diligence. \nAs stated in  In re Conner , 458 S.W.3d 532 (Tex. 2015) , “[t]he issue here is whether a trial court \nabuses its discretion by refusing to grant a motion to dismiss for want of prosecution in the face \nof unmitigated and unexplained delay. We hold that it does.” Id.  \n3. In family law specifically, In re Marriage of Buster , 115 S.W.3d 141 (Tex. App.—\nTexarkana 2003) emphasized the importance of moving family law cases toward resolution and upheld dismissal after extended inactivity.  \nApplication to Current Case \n4. The facts strongly support dismissal for want of prosecution: \ni. The divorce case has been pending for over 16 months \nii. Petitioner's attorney has failed to prosecute the case since April 24, 2024 \niii. No substantive action taken for approximately 11 months \niv. No responses to discovery, no substantive pleadings, no trial settings \nv. The only recent action was filing a Motion to Consolidate to block emergency relief  \n5. This extended inactivity is precisely the type of conduct that Texas courts have \nconsistently held, which justifies dismissal for want of prosecution. The court should dismiss the dormant divorce case and allow the new SAPCR to proceed independently to address the children's urgent needs. \n M.1981 M.1981\nM.1981 M.1981 M.1981 M.1981",
      "char_length": 1380
    },
    {
      "page_number": 8,
      "text": "B. Void Orders Due to Lack of Consent  \nLegal Framework \n6. The Texas Supreme Court established in Burnaman v. Heaton, 240 S.W.2d 288, 291 \n(Tex. 1951) that: \"A valid consent judgment cannot be rendered by a court when consent of one \nof the parties is wanting. It is not sufficient to support the judgment that a party's consent thereto may at one time have been given; consent must exist at the very moment the court undertakes to make the agreement the judgment of the court.\" \n7. The Court further held: \"When a trial court has knowledge that one of the parties to a \nsuit does not consent to a judgment, it is error to render a judgment purportedly by agreement; such a judgment is a nullity.\" \n8. This principle was reaffirmed in Padilla v. LaFrance , 907 S.W.2d 454 (Tex. 1995), \nwhich confirmed that a trial court cannot render an agreed judgment after a party has withdrawn consent to a settlement.  \nApplication to Current Case \n9. The orders in this case are void under Burnaman and its progeny because: \ni. The orders claim consent of all parties but only bear signatures of the Petitioner and counsel \nii. Respondent contends he never gave consent to the orders \niii. Respondent actively opposed the terms that locked him out of his home and separated him from the children M.1982 M.1982\nM.1982 M.1982 M.1982 M.1982",
      "char_length": 1328
    },
    {
      "page_number": 9,
      "text": "iv. The court was aware of the dispute regarding consent (Respondent filed an \nemergency motion challenging the basis for agreement) \n10. Under Texas law, if Respondent did not consent to the orders at the time they were \nrendered, they are void ab initio. The court should declare these orders void and vacate them. \nC. Associate Judge's Orders Never Properly Adopted  \nLegal Framework \n11. Texas Family Code § 201.013(b) explicitly states: \"Except as provided by Section \n201.007 (Powers of Associate Judge), if a request for a de novo hearing before the referring court \nis not timely filed, the proposed order or judgment of the associate judge b ecomes the order or \njudgment of the referring court only on the referring court's signing the proposed order or judgment .\" \n12. This requirement is mandatory, not discretionary. Without the District Judge's \nsignature, the Associate Judge's order remains merely a \"proposed\" order. \nApplication to Current Case \n13. The orders in this case were issued by an Associate Judge but allegedly never \nproperly adopted or signed by the referring District Court. Under Texas Family Code § \n201.013(b), these orders never achieved the status of a final judgment of the court and have no legal effect as final orders.  \n14. This defect alone would be sufficient to challenge their validity, even without the \nconsent issues. The court should declare these orders void or vacate them due to the lack of proper adoption by the referring court. M.1983 M.1983\nM.1983 M.1983 M.1983 M.1983",
      "char_length": 1526
    },
    {
      "page_number": 10,
      "text": "D. No Continuing Exclusive Jurisdiction (CEJ) \nLegal Framework \n15. Texas Family Code § 155.001(a) provides: \"A court acquires continuing, exclusive \njurisdiction over the matters provided for by this title in connection with a child on the rendition \nof a final order.\" \n16. Critically, § 155.001(d) states: \"Unless a final order has been rendered by a court of \ncontinuing, exclusive jurisdiction, a subsequent suit shall be commenced as an original proceeding.\" \n17. In In re Burk , 252 S.W.3d 736 (Tex. App.—Houston [14th Dist.] 2008), the court held \nthat CEJ is established only upon rendition of a final order, and temporary orders do not establish CEJ.  \nApplication to Current Case \n18. No final order was ever rendered in the divorce case because:  \ni. The Associate Judge's orders were never properly signed by the referring District Court Judge (per § 201.013(b)) \nii. The orders were void due to lack of consent (per Burnaman v. Heaton) \n19. Without a final order, the 322nd District Court never acquired CEJ over the children. \nTherefore, under § 155.001(d), the Respondent's new SAPCR was properly \"commenced as an original proceeding\" in the 233rd District Court. \n20. The motion to consolidate should be denied because the 322nd District Court does \nnot have dominant jurisdiction over the children. M.1984 M.1984\nM.1984 M.1984 M.1984 M.1984",
      "char_length": 1358
    },
    {
      "page_number": 11,
      "text": "E. Exceptions to Dominant Jurisdiction \nLegal Framework \n           21. Generally, when two suits involving the same subject matter are pending in different \ncourts of equal jurisdiction, the court in which the suit was first filed has dominant jurisdiction. However, the Texas Supreme Court in Wyatt v. Shaw Plumbing Co., 760 S.W.2d 245, 247 (Tex. 1988) recognized three exceptions to this rule: \ni. Conduct by a party that estops them from asserting prior active jurisdiction \nii. Lack of persons to be joined if feasible \niii. Lack of intent to prosecute the first lawsuit \nApplication to Current Case \n         22. Even if the 322nd District Court had dominant jurisdiction (which it does not due to \nlack of CEJ), at least two exceptions to the first-filed rule apply: \nEstoppel by Conduct:  \ni. Petitioner allowed the case to become completely dormant  \nii. Failed to comply with Rule 237a's notice requirements after federal remand \niii. Effectively concealed the revival of the state case  \niv. Represented through inaction that she had abandoned the case \n     Lack of Intent to Prosecute:  \ni. For nearly a year, Petitioner took no action to advance the divorce M.1985 M.1985\nM.1985 M.1985 M.1985 M.1985",
      "char_length": 1213
    },
    {
      "page_number": 12,
      "text": "ii. No discovery, no responses, no settings \niii. Only \"revived\" the divorce case as a strategic ploy to derail Respondent's \nemergency action  \n23. The 233rd District Court is the appropriate forum to hear the current disputes because \nthat case was initiated specifically to address the children's urgent needs, free from the entanglements of the stalled divorce. \nF. Attorney Misconduct - Rule 12 Challenge \nLegal Framework \n24. Texas Rule of Civil Procedure 12 provides that a party may file a sworn motion \nstating that they believe a suit is being prosecuted or defended without authority. The challenged \nattorney bears the burden of proving authority to act. If the attorney fails to show authority, the court \"shall refuse to permit the attorney to appear in the cause and  shall strike the pleadings if \nno person who is authorized to prosecute or defend appears.\" \n25. These consequences are mandatory, not discretionary. The court has no choice but to \nbar the attorney and strike the pleadings upon failure to show authority. \nApplication to Current Case \n26. Respondent filed a verified Rule 12 motion on September 20, 2024, challenging \nCooper L. Carter's authority. Ms. Carter has not responded to this challenge for over 6 months. \nAdditional facts supporting the Rule 12 challenge include: \ni. Ms. Carter's e -filing account is registered under her prior employer's email \naddress  M.1986 M.1986\nM.1986 M.1986 M.1986 M.1986",
      "char_length": 1441
    },
    {
      "page_number": 13,
      "text": "ii. Ms. Carter has not meaningfully corresponded with Respondent during the \nlitigation  \niii. Ms. Carter is unreachable by phone or email \niv. Ms. Carter lacks a current working phone number or email on file with the State Bar \nv. Ms. Carter has not produced any client authority or engagement agreement in 14 months \n27. Under Rule 12, Ms. Carter's failure to respond to the challenge requires the court to \nrefuse to permit her to appear in the case and strike all pleadings filed by her, including the \nMotion to Consolidate. \nG. Additional Attorney Misconduct  \n \nDiscovery Violations \n28. Ms. Carter failed to respond to Requests for Admissions served on September 17, \n2024, resulting in deemed admissions under Texas Rule of Civil Procedure 198. She made no \neffort to withdraw or amend these deemed admissions, effectively conceding critical fa cts against \nher client.  \n29. This constitutes a violation of her duties under Rules 193.2 and 193.5 to timely \nrespond or amend discovery responses. \n M.1987 M.1987\nM.1987 M.1987 M.1987 M.1987",
      "char_length": 1048
    },
    {
      "page_number": 14,
      "text": "Rule 237a Violations \n30. After federal remand on December 6, 2024, Ms. Carter failed to:  \ni. File the required certified copy of the remand order with the clerk \nii. Provide Respondent with mandatory written notice of the remand \n31. This procedural violation prevents the case from moving forward properly and further \ndemonstrates Ms. Carter's neglect of basic procedural duties.  \nAbuse of Process  \n31. Ms. Carter's sudden reappearance after nearly a year of inactivity solely to block \nemergency relief suggests improper purpose. Filing a Motion to Consolidate without addressing \nsubstantive issues appears designed to delay resolution rather than advance the case.  \nThis conduct violates: \ni. Rule 13 of Texas Rules of Civil Procedure (forbidding groundless filings brought in bad faith) \nii. Texas Disciplinary Rule 3.02 (prohibiting positions that unreasonably delay resolution) \nH. Children's Best Interests  \nLegal Framework \n32. Texas Family Code § 153.002 establishes: \"The best interest of the child shall be the \nprimary consideration of the court in determining the issues of conservatorship and possession of and access to the child.\" M.1988 M.1988\nM.1988 M.1988 M.1988 M.1988",
      "char_length": 1196
    },
    {
      "page_number": 15,
      "text": "This paramount standard must guide all decisions in cases involving children. \nApplication to Current Case \n33. The children in this case are suffering ongoing harm: \ni. Subjected to psychological manipulation and medical neglect \nii. Left home alone at night without supervision \niii. Removed from Respondent's care and placed with elderly great-grandparents \niv. Eldest child's academic performance has plummeted  \nv. Emotionally estranged from both parents \n34. Every day that passes without corrective action leaves the children in an unstable, \nharmful environment. Consolidation would reward procedural stonewalling and cause further \ndelay. The children's best interests require prompt resolution, which can only be achieved by denying consolidation, dismissing the dormant divorce case, and allowing the new SAPCR to proceed expeditiously. \nIII. CONCLUSION AND RELIEF REQUESTED \nBased on the comprehensive legal analysis above, there are multiple independent grounds \nsupporting the Respondent's entitlement to relief: \n1. The divorce case should be dismissed for want of prosecution under Rule 165a and the court's inherent power. \n2. The current orders are void due to lack of consent under Burnaman v. Heaton. M.1989 M.1989\nM.1989 M.1989 M.1989 M.1989",
      "char_length": 1262
    },
    {
      "page_number": 16,
      "text": "3. The Associate Judge's orders were never properly adopted under Texas Family Code § \n201.013(b). \n4. The 322nd District Court never acquired CEJ under Texas Family Code § 155.001. \n5. Exceptions to dominant jurisdiction apply under Wyatt v. Shaw Plumbing Co. \n6. Ms. Carter's pleadings should be stricken due to her failure to respond to a Rule 12 challenge. \n7. Ms. Carter has engaged in multiple instances of misconduct warranting sanctions and referral to the State Bar . \n8. The children's best interests require immediate relief without further procedural delays  \nTherefore, the Respondent is entitled to the following relief:  \ni. Denial of Petitioner's Motion to Consolidate. \nii. Declaration that the current orders are void and of no legal effect. \niii. Dismissal of the divorce action (Cause No. 322-744263-23) for want of prosecution. \niv. Striking of all pleadings filed by Cooper L. Carter due to her failure to show authority. \nv. Permission for the new SAPCR to proceed in the 233rd District Court to address the children's urgent needs. \nThese remedies are supported by well -established Texas law and are necessary to protect the \nchildren's best interests, ensure procedural fairness, and maintain the integrity of the legal process.  Without any opposition, the court has every ability to act. M.1990 M.1990\nM.1990 M.1990 M.1990 M.1990",
      "char_length": 1357
    },
    {
      "page_number": 17,
      "text": "IV . SUPPORTING CASE LAW AND STATUTES  \nA. Dismissal for Want of Prosecution \n• Villarreal v. San Antonio Truck & Equipment , 994 S.W.2d 628 (Tex. 1999) \n• In re Conner, 458 S.W.3d 532 (Tex. 2015)  \n• In re Marriage of Buster , 115 S.W.3d 141 (Tex. App.—Texarkana 2003) \n• Fox v. Wardy , 234 S.W.3d 30 (Tex. App.—El Paso 2007) \n• Dueitt v. Artripe , 217 S.W.3d 911 (Tex. App.—Dallas 2007) \n• Texas Rule of Civil Procedure 165a \nB. Void Orders Due to Lack of Consent \n• Burnaman v. Heaton, 240 S.W.2d 288 (Tex. 1951) \n• Padilla v. LaFrance , 907 S.W.2d 454 (Tex. 1995) \n• In the Interest of J.G., a Child (Texas Fourth Court of Appeals, 2018) \n• St. Raphael Medical Clinic, Inc. v. Mint Medical Physician Staffing, LP  (2007) \nC. Associate Judge's Orders  \n• Texas Family Code § 201.013 \n• In re B.B.S. (Texas Court of Appeals) \nD. Continuing Exclusive Jurisdiction \n• Texas Family Code § 155.001 M.1991 M.1991\nM.1991 M.1991 M.1991 M.1991",
      "char_length": 937
    },
    {
      "page_number": 18,
      "text": "• In re Burk , 252 S.W.3d 736 (Tex. App.—Houston [14th Dist.] 2008) \n• In re G.R.M. , 45 S.W.3d 764 (Tex. App.—Fort Worth 2001)  \n• In re C.G., 495 S.W.3d 40 (Tex. App.—Corpus Christi 2016) \nE. Exceptions to Dominant Jurisdiction \n• Wyatt v. Shaw Plumbing Co., 760 S.W.2d 245 (Tex. 1988) \n• V .D. Anderson Co. v. Young, 101 S.W.2d 798 (Tex. 1937) \n• Curtis v. Gibbs , 511 S.W.2d 263 (Tex. 1974) \nF . Attorney Misconduct  \n• Texas Rule of Civil Procedure 12 \n• Texas Rule of Civil Procedure 198 (Deemed Admissions) \n• Texas Rule of Civil Procedure 237a (Remand Procedure) \n• Texas Rule of Civil Procedure 13 (Groundless Pleadings) \n• Texas Disciplinary Rule 3.02 (Delay of Litigation) \n• TransAmerica Corp. v. Braes Woods Condo Ass'n  \nG. Children's Best Interests \n• Texas Family Code § 153.002 \n \nRespectfully submitted,  M.1992 M.1992\nM.1992 M.1992 M.1992 M.1992",
      "char_length": 864
    },
    {
      "page_number": 19,
      "text": "/s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS  \n 817-546-3693 \n CHUCKDUSTIN12@GMAIL.COM  \n PRO -SE \n      \nCERTIFICATE OF SERVICE  \nPursuant to Rule 21a of the Texas Rules of Civil Procedure, this request has been served on all \nparties of record on 04/03/2025 through their electronic filing manager registered email address. \n \nThis request has also been served on COOPER L. CARTER via her email \nCOOPERCARTER@MAJADMIN.COM  which is not registered with the EFM. \nRespectfully submitted,  \n /s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS  \n 817-546-3693  CHUCKDUSTIN12@GMAIL.COM  \n PRO -SE \n M.1993 M.1993\nM.1993 M.1993 M.1993 M.1993",
      "char_length": 637
    },
    {
      "page_number": 20,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99277864\nFiling Code Description: No Fee Documents\nFiling Description: COMPREHENSIVE CASE ANALYSIS IN SUPPORT\nOF DISMISSAL\nStatus as of 4/4/2025 2:40 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/4/2025 9:12:06 AM\n4/4/2025 9:12:06 AM\n4/4/2025 9:12:06 AM\n4/4/2025 9:12:06 AMStatus\nSENT\nSENT\nSENT\nSENTM.1994 M.1994\nM.1994 M.1994 M.1994 M.1994",
      "char_length": 920
    }
  ]
}