{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.21.25 - 233rd Rule 12 Motion-1.pdf",
  "base_name": "03_21_25_233rd_rule_12_motion_1",
  "page_count": 10,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 233- 765358- 25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \n \nTO THE HONORABLE JUDGE OF THE 233RD DISTRICT COURT:  \nCOMES NOW, CHARLES DUSTIN MYERS, Petitioner pro se, and files this Rule 12 \nMotion to Show Authority pursuant to Texas Rule of Civil Procedure 12, and respectfully shows the Court as follows:  \n1. There is a general presumption that an attorney is acting with authority; however, that \npresumption is rebuttable. Breceda v. Whi , 187 S.W.3d 148, 152 (Tex. App.--El Paso 2006, no \npet.). If evidence or circumstances cast doubt on the attorney’s authority, the presumption gives \nway and the attorney must prove actual authority. For example, an attorney who conducted a trial is presumed authorized to pursue an appeal, but that presumption can be rebutted with contrary evidence. Here, the  unusual facts surrounding Ms. Carter’s involvement thoroughly rebut any \npresumption of her authority to represent the Respondent named in this matter, Morgan Michelle Myers, as detailed below .  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n PETITIONER’S RULE 12 MOTION TO \nSHOW AUTHORITY  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-21",
      "char_length": 1217
    },
    {
      "page_number": 2,
      "text": "2 \n I. Texas Rule of Civil Procedure 12 – Attorney Must Show Authority  \nA. Carter’s Lack of Authority Indicia  \n 2. A party in a suit or proceeding pending in a court of this state may, by sworn written \nmotion stating that he believes the suit or proceeding is being prosecuted or defended without \nauthority, cause the attorney to be cited to appear before the court and show his authority to act. \nThe notice of the motion shall be served upon the challenged attorney at least ten days before the hearing on the motion. At the hearing on the motion, the burden of proof shall be upon the challenged attorney to show sufficie nt authority to prosecute or defend the suit on behalf of the \nother party. Tex. R. Civ. P. \n3. Multiple red flags call into question whether Carter is authorized – or even genuinely \nacting – as Ms. Myers’s counsel, justifying relief under Rule 12. Petitioner respectfully requests \nthat the court requires  RODERICK D. MARX and COOPER L. CARTER to appear and show \ntheir authority to represent MORGAN MICHELLE MYERS in this matter to clear up the \nambiguity surrounding their representation.  \nB. Pleadings Filed by Proxy \n4. Every filing attributed to Carter in this case was filed through another attorney, Roderick \nMarx, rather than by Carter herself . Mr. Marx is the founding partner of the MAJ firm Carter \nformerly worked for, and he submitted documents “on her behalf ” through the electronic filing \nmanager.  In effect, Carter has not personally prosecuted or defended anything – someone else is \nhandling the filings. This raises serious doubts about whether Carter is acting  as counsel or whether \nMrs. Myers’s case is being carried (or neglected) by others without a clear designation. An attorney \nof record should be the one signing filings or at least directly supervising and endorsing them; if",
      "char_length": 1844
    },
    {
      "page_number": 3,
      "text": "3 \n not, the court and opposing party cannot even be sure the attorney whose name is on the pleadings \nis truly involved. Such proxy filings strongly indicate that Carter may lack authority or engagement – if she had authority, one would expect her direct parti cipation. Rule 12 is meant to prevent exactly \nthis sort of scenario where a suit might be conducted by someone without clear authorization. \nC. Employment/Firm Misrepresentation  \n5. Carter’s own public statements conflict with the representations made to the court about \nher role. While her pleadings continued to identify her as “Cooper Carter, Marx Altman & \nJohnson” (with a MAJ email address), her initial response in the instant cas e was filed by Roderick \nD Marx, signed by Cooper Carter with the Marx, Altman & Johnson letterhead, and then claimed that Cooper L. Carter was retained in her individual capacity. Further:  \ni. Carter’s public Facebook profile claims that she is no longer employed with Marx, Altman , & Johnson.  \nii. Carter’s public LinkedIn profile claims that she is no longer employed with Marx, Altman, & Johnson, and that she currently is employed at Cantey and Hanger, LLP. \niii. Carter’s Electronic Filing Manager is registered under ccarter@canteyhangar.com . \nThis level of ambiguity is unnecessary and could be deliberate. In fact, Texas law requires attorneys \nto keep their State Bar profile updated with current employment information (Tex. Gov’t Code § 81.115), which currently reflects her employment with Marx, Altman & Johnson.  So the \nquestion remains : why would Carter u pdate her Texas State Bar profile to reflect her current \nemployer  but leave her social media and LinkedIn outdated?  \nD. Failure to Participate or Respond (Abandonment)",
      "char_length": 1751
    },
    {
      "page_number": 4,
      "text": "4 \n 6. Carter’s complete failure to prosecute the divorce case for an extended period also \nundercuts any claim of active authority. An attorney who is truly acting with a client’s authorization \nis expected to pursue the client’s interests diligently – e.g. respond to motions, appear at hearings, move the case forward. Carter, however, has been conspicuously silent. She has not plead any \ndefense for her client, has not participated in any discovery .  \n7. Carter’s abrupt appearance in this suit —after months of silence in the divorce case —\nmirrors the same confusion and procedural uncertainty that plagued the divorce action. This re -\nemergence appears tactical, not substantive, and should not obstruct the SAPCR’s merits -based \nprogression. She has not mentioned anything about the children, their status, or how the current  \nsituation is what ’s best for them .  \n8. Carter’s only notable action in the last six months related to her client has been to seek \nconsolidation of the SAPCR with the dormant divorce –  essentially tethering the active custody \nmatter to a paralyzed divorce case which would further prejudice the children and delay the relief \nsought. \nII. Conflicts of Interest and Duty of Candor  \n9. Misrepresenting one’s role or affiliation can also create conflicts of interest  and \nbreaches of the duty of candor. If an attorney signs pleadings stating it was “necessary to retain their legal services” while filing under a firm’s name, it muddles who was retained  – the individual \nlawyer or the firm. This ambiguity can prejudice the client’s interests and the opposing party’s understanding of the representation. \n10. For example, in the case at hand the answer explicitly stated,  “It was necessary for \nMorgan [Michelle] Myers to secure the services of COOPER L. CARTER, a licensed attorney, to",
      "char_length": 1836
    },
    {
      "page_number": 5,
      "text": "5 \n prepare and defend this suit.” .  Yet, the filing was styled as coming from “Marx Altman & \nJohnson”  with Carter as the attorney. If Mr s. Carter was operating  as a solo practitioner at that \npoint, the pleading arguably misled the court about who had been hired. This kind of \nmisrepresentation may violate the lawyer’s candor toward the tribunal  (e.g. Tex. Disc. R. 3.03 \nor its equivalents) since it obscures a material fact – the lawyer’s true status. Courts have held that \nlawyers must not omit facts necessary to keep statements from being misle ading. Failing to clarify \nthat the attorney is no longer with the named firm, it  could be seen as an omission that makes the \nfiling as a whole misleading.  \nIII. Unauthorized Filings and “Ghost” Representation  \n12. Having documents filed by another attorney who has not formally appeared is another \nproblematic practice. In proper procedure, every pleading or motion must be signed by an attorney of record – i.e. a lawyer who has made an appearance in the case.  Texas is clear: “Every \npleading of a party represented by an attorney shall be signed by at least one attorney of record in his individual name.”  If Attorney A is counsel of record, it is improper for Attorney B (who \nhas not appeared in the case) to file documents on A’s behalf without disclosure or court permission.  \n13. In the example above, the e -filing system’s certificate shows “Roderick Marx on \nbehalf of Cooper Carter” as the filer , neither of which have formally appeared. This kind of \n“ghost filing” blurs who is responsible for the document. Courts frown upon undisclosed involvement of attorneys  because it can circumvent accountability and confuse the record. At \nbest, it is an irregular practice; at worst, it could be seen as misrepresentation to the court. Here, given the same circumstances exist in the divorce case which has been abandoned, Pet itioner \nbelieves the situation leans more towards misrepresentation.",
      "char_length": 1974
    },
    {
      "page_number": 6,
      "text": "6 \n 14. Procedurally, if an attorney who is not counsel of record submits a filing, the court \nmay treat that filing as nullity  or require it to be redone. No appearance means no authority to \nact. From an ethical standpoint, using another lawyer to file pleadings without notice may \nimplicate rules against aiding in rule violations. Lawyers are forbidden from assisting or \ninducing others to violate the rules  (see Tex. Disc. R. 8.04(a)(1) . If Attorney A  knows they \nshould appear officially but instead has Attorney B  file a document to evade a procedural \nrequirement, both attorneys tread on thin ice. They could be seen as trying to circumvent the rules of the tribunal. At a minimum, this lack of transparency undermines trust. The proper course would have been for the second attorney to file a notice of appearance (if joining the case) or for the original attorney to personally sign and file the pleading. Having someone “cover” a filing without formal acknowledgment is not a recognized practice. In short, any attorney involved in a case needs to either be of record or stay behind the scenes entirely . But if an \nattorney actually files or signs on behalf of the attorney of record, that person effectively steps \ninto the role of counsel without the court’s knowledge , which is improper. It is better to err on \nthe side of disclosure – either by formal association of that attorney or by avoiding involvement in filing . \n15. A s pointed out, the Petitioner believes that this is occurring because Carte r’s EFM \naccount is setup under her prior employer ’s email address. So why not change it to reflect the \ncorrect address and file your  own pleadings? Last ly, these same issues have been present in the \ndivorce matter, and although Carter was served with a Rule 12 motion in that case on September 20, 2024, she has yet to clear up t his issue.  \nIV . CONCLUSION AND PRAYER  \nFor the above stated reasons, Petitioner requests  the following relief from the court:",
      "char_length": 1994
    },
    {
      "page_number": 7,
      "text": "7 \n 1. That before any requested relief is granted and before any motion can be set for \nhearing  by COOPER L. CARTER, that she be required to appear alongside \nRODERICK D. MARX and show their authority to represent MORGAN \nMICHELLE MYERS in this matter ; \n2. If the authority to represent MORGAN MICHELLE MYERS cannot be shown, Petitioner requests that the court s trike all pleadings and motions filed by either \nattorney in this SAPCR pursuant to Rule 12 of the Texas Rules of Civil Procedure and; \n3. Grant any further relief that the court deems just and equitable given the \ncircumstances.  \nRespondent affirms that the above titled motion was filed in good faith, and the relief sought ultimately serves the bests interests of the children named in this suit.  \nRespectfully submitted,  \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693  \n6641 ANNE COURT  \nWATAUGA, TEXAS 76148  \nPRO -SE",
      "char_length": 933
    },
    {
      "page_number": 8,
      "text": "8 \n AFFIDA VIT OF CHARLES DUSTIN MYERS  \nSTATE OF TEXAS § § COUNTY OF TARRANT §  \nBEFORE ME, the undersigned authority, personally appeared CHARLES DUSTIN MYERS, \nwho, being duly sworn, deposed and stated:  \n1. \"My name is CHARLES DUSTIN MYERS. I am over 18 years of age, of sound mind, and fully competent to make this affidavit. I have personal knowledge of the facts herein stated, and they are true and correct.  \n2. I am the Petitioner in Cause No. 233- 765358- 25, currently pending in the 233rd District \nCourt of Tarrant County, Texas.  \n3. I filed this Rule 12 Motion to Show Authority due to reasonable and substantial doubt regarding the authority of attorneys COOPER L. CARTER and RODERICK D. MARX to represent Respondent, MORGAN MICHELLE MYERS. \n4. I have personally observed and documented procedural irregularities, including but not limited to: a. Failure of attorney COOPER L. CARTER to formally appear or file a notice of appearance in the case, creating ambiguity regarding her representation. b. Pl eadings \nattributed to COOPER L. CARTER being filed solely through attorney RODERICK D. MARX, raising questions regarding actual representation authority and participation. c. Inconsistencies in public statements and professional profiles by COOPER L. CARTE R \nconcerning her current employment and representation status. d. The complete absence of meaningful participation or prosecution of related divorce proceedings for a prolonged period, contrasted by her sudden appearance and procedural interference in this  Suit \nAffecting Parent -Child Relationship (SAPCR).",
      "char_length": 1587
    },
    {
      "page_number": 9,
      "text": "9 \n 5. These facts collectively cast substantial and justifiable doubt upon the claimed \nrepresentation of MORGAN MICHELLE MYERS by COOPER L. CARTER and RODERICK D. MARX, necessitating judicial inquiry. \n6. My primary motivation in filing this Rule 12 Motion is to ensure clarity of legal representation, procedural integrity, and, most importantly, to safeguard the best interests and welfare of the children involved in this case.  \n7. I believe wholeh eartedly that Cooper L. Carter is litigating in bad faith, has no genuine \ninterest in the best interests o f the Children, and only exists as a barrier to the relief the \nPetitioner has diligently sought for over a year for his children. \nFURTHER AFFIANT SAYETH NOT.\"  \n \n________________________ \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693  \n6641 ANNE COURT  \nWATAUGA, TEXAS 76148  \nPRO -SE \n \n \n \n \n \n \n \n \n \n03/21/2025",
      "char_length": 896
    },
    {
      "page_number": 10,
      "text": "10 \n CERTIFICATE OF SERVICE \n \nPursuant to Rule 21 of the Texas Rules of Civil Procedure, Respondent, CHARLES \nDUSTIN MYERS, certifies that the above motion, Petitioner’s Rule 12 Motion to Show \nAuthority, has been filed with the electronic filing manager and served on the parties of record \non this 21st day of March 2025, including:  \nMORGAN MICHELLE MYERS, RESPONDENT  \nVia her email registered under the EFM: MORGANMW02@GMAIL.COM  \nCOOPER L. CARTER  \nVia her email not registered under the EFM: COOPERCARTER@MAJADMIN.COM  \n \n \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693  \n6641 ANNE COURT, WATAUGA, TEXAS 76148  \nPRO -SE \n \n03/21/2025\nCommonwealth of Virginia\nCounty of Newport News Virigina\nThe foregoing instrument was subscribed and sworn\nbefore me on 03/21/2025 by Charles Dustin Myers.\n8070793\nMy commission expires: 08/31/2027\nNotarized remotely online using communication technology via Proof.",
      "char_length": 949
    }
  ]
}