{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\11.06.24 - REQUEST FOR CONFIRMATION OF PROCEDURAL COMPLIANCE (1)-1.pdf",
  "base_name": "11_06_24_request_for_confirmation_of_procedural_compliance_1_1",
  "page_count": 5,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263 -23 & NO. 322 -744538 -23 \n \nIn the matter of the marriage of  \n Morgan Michelle Myers & Charles Dustin Myers  \nand in the interest of M .E.M. and C.R.M.,  two minor children \nREQUEST FOR CONFIRMATION   \n OF PROCEDURAL REQUIREMENTS  \n \nProceeding from the 322nd District Court \n \n-&- \n \nTarrant County, Texas  \n \n-&- \n \nREQUESTED  BY: \n \n \nCHARLES DUSTIN MYERS, \n \nRESPONDENT  \n \n 322-744263-23FILED\nTARRANT COUNTY\n11/6/2024 2:48 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 480
    },
    {
      "page_number": 2,
      "text": "TO THE HONORABLE COURT:  \nNOW COMES Charles Dustin Myers, Respondent in the above -referenced case, \nwho respectfully submits this Request for Confirmation of Procedural Requirements . \nThis request is filed as a procedural safeguard to ensure compliance with statutory \nrequirements and to uphold transparency within these proceedings.  \nI. Background and Purpose  \n1. The Respondent respectfully seeks confirmation that Justice Lee Gabriel, presiding \nover matters in this case, has fulfilled all constitutionally and statutorily mandated \nrequirements, specifically including the Oath of Office  and Anti -Bribery Oath  as \nprescribed by Article XVI, Section 1 of the Texas Constitution  and Texas Government \nCode §§ 25.0017 and 25.0018 . \n2. Texas Government Code § 25.0017(a)  states, “A person who is a retired or former \njudge shall, before accepting an assignment as a visiting judge of a statutory county court, take the oath of office required by the constitution and file the oath with the regional presiding judge.” Additional ly, § 25.0018(a)  mandates that when a retired or former \njudge is appointed as a visiting judge, the court clerk should enter in the administrative file a record showing that the required oath was administered and filed with the regional \npresiding judge.  \n3. This request is submitted solely for procedural safety and transparency and is not \nintended as a challenge to the authority of the Court. Verification of these oaths is",
      "char_length": 1471
    },
    {
      "page_number": 3,
      "text": "requested to ensure a complete and accurate record, should this case proceed to future \nappellate review  and is in no manner aimed at disrespecting  the court or Justice Lee \nGabriel . \nII. Request for Specific Documentation  \n4. Accordingly, Respondent respectfully requests that the Clerk of the Court provide, as \npart of the official case record:  \ni. A certified copy of Justice Lee Gabriel’s Oath of Office  and Anti -Bribery Oath , \nfiled in compliance with Texas Government Code § 25.0017. \nii. Confirmation that the record entry in the administrative file complies with Texas Government Code § 25.0018, confirming the administration and filing of the oath \nwith the regional presiding judge.  \nIII. Conclusion  \nThis request is submitted in the interest of due process and procedural compliance. \nRespondent respectfully requests that this confirmation  be provided for review and  be \nadded to the official case record to ensure transparency and uphold the principles of impartiality fundamental to the judicial process.  \nRespectfully submitted, \n   /s/ Charles Dustin Myers  \n   CHARLES DUSTIN MYERS \n   PRO SE \n   817-507-6562 \n   Chuckdustin12@gmail.com",
      "char_length": 1168
    },
    {
      "page_number": 4,
      "text": "CERTIFICATE OF SERVICE  \n \nRespondent  certifies  that a true copy of this REQUEST   FOR CONFIRMATION  \nOF PROCEDURAL   REQUIREMENTS was served in accordance with Rule 21a of \nthe Texas Rules of Civil Procedure on the following on 11/0 6/2024 : \n \nCooper L. Carter (Counsel for petitioner) \nby EFM/ESERVE  at COOPERCARTER@MAJADMIN@COM  \n \nMorgan Michelle Myers (real party in interest)  \n by EFM/ESERVE at MORGANMW02@GMAIL.COM  \n     Holly L. Hayes, Texas Office of the Attorney General \n    By EFM/ESERVE at 914 -filer@texas.oag.gov\n \n \n \n/s/ Charles Dustin Myers  \nCharles Dustin Myers  \nChuckdustin12@gmail.com  \n6641 Anne Court  \nWatauga, TX 76148  \nTel: 1-817-507-6562 \nPro-se",
      "char_length": 681
    },
    {
      "page_number": 5,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 94002696\nFiling Code Description: Request\nFiling Description: Request for oath of office records pursuant to Tex.\nGov't Code ???? 25.0017 and 25.0018\nStatus as of 11/6/2024 2:55 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n11/6/2024 2:48:54 PM\n11/6/2024 2:48:54 PMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n11/6/2024 2:48:54 PMStatus\nSENT\nAssociated Case Party: ATTORNEY GENERAL OF TEXAS\nName\nHOLLY HAYESBarNumber Email\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n11/6/2024 2:48:54 PMStatus\nSENT",
      "char_length": 1119
    }
  ]
}