{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - NOTICE-1.pdf",
  "base_name": "09_11_25_notice_1",
  "page_count": 13,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n 322-744263 -23 \nIN THE 322ND DISTRICT COURT  \nOF TARRANT COUNTY, TEXAS  \n \nMorgan Michelle Myers,  \n \n                                   Petitioner,  \n               v.  \n \nCharles Dustin Myers,  \n   \n                     Respondent.  \n \nAnd In the interest of M.E.M. and \nC.R.M., two children.  § \n§ \n§ \n§ \n§ NOTICE   \n§                  \n§      \n§ \n§ \n§ \n \n \nTO THE HONORABLE JUDGE OF THIS COURT:  \n COMES NOW  Respondent, CHARLES DUSTIN MYERS , and provides this notice to \nplace on the record that significant issues which have persisted throughout this case are now \nbeing addressed by opposing counsel, Cooper L. Carter . These actions appear calculated to \nquietly remedy the problems without directly confronting or acknowledging the issues as pled.  \n 1. Specifically, the following issues which Ms. Carter has not addressed after over a year \nof non-responsiveness include:  \ni. On September 20, 2024, Cooper L. Carter was served with a Rule 12 Motion to Show Authority on the grounds of ambiguity surrounding her employment. REC. 1169. \nFurther grounds included her lack of participation throughout this case, and an individual named Roderick D. Marx filing pleadings on her behalf.  \nii. On February 20, 2025, Respondent filed a Motion to Sign, and served it on opposing counsel, showing in an exhibit that her EFM (Electronic Filing Manager) was still",
      "char_length": 1368
    },
    {
      "page_number": 2,
      "text": "2 registered to her prior employer (Cantey Hangar) with the date showing March 13, \n2025 in the screenshot. REC. 1654. \niii.In several pleadings, Respondent also notified the Court and Ms. Carter that herpublic LinkedIn profile also showed that she was no longer employed at Marx Altmanand Johnson. REC. 1172, REC. 1434, REC. 2293, REC. 2563, REC. 3040, REC.\n3051, REC. 3121,  REC. 3307, REC. 3318, REC. 3751.\niv. Ms. Carter has provided no explanation for these discrepancies, no explanation for\nher lack of participation, and has shown an inability to conduct herself ethically andto the standards set forth in the Texas Lawyer’s Creed.\n2. Now, as of September 11, 2025, Ms. Carter is going back through and fixing these errorswithout addressing the issues. Exhibit 1. 3. These changes come directly following an email exchange sent to the Court Coordinator.Exhibit 2. 4. Furthermore, on September 8, 2025, a letter was mailed to the Respondent’s residence at 6641Anne Court, Watauga, Texas, 76148, sent from “Marx Altman and Johnson” with the name “Victoria Weaver” on the envelope. Exhibit 3. \n5. Victoria weaver is not a party to this suit, holds a managerial role at Marx, Altman, andJohnson, and Cooper L. Carter claimed to have been retained in her individual capacity, and stated the same two times on the record. REC. 217, REC. 2280. \n6. These actions are being documented on the record to highlight how the opposing sidecontinues to operate outside the bounds of ethical standards, and Cooper L. Carter is put on notice not to destroy, conceal, alter, or dispose of the letter mailed on Sep tember 8, 2025, as no \nattorney -client relationship exists between Morgan Michelle Myers and Victoria Weaver.",
      "char_length": 1712
    },
    {
      "page_number": 3,
      "text": "3 \n  Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693 \n \n  \nCERTIFICATE OF SERVICE  \n \n Respondent certifies that on September 11, 2025, a true and accurate copy of this notice \nwas served on all parties of record pursuant to Rule 21a of the Texas Rules of Civil Procedure.  \n    \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS",
      "char_length": 406
    },
    {
      "page_number": 4,
      "text": "EXHIBIT 1",
      "char_length": 9
    },
    {
      "page_number": 5,
      "text": "",
      "char_length": 0
    },
    {
      "page_number": 6,
      "text": "EXHIBIT 2",
      "char_length": 9
    },
    {
      "page_number": 7,
      "text": "FUDSTOP <chuckdustin12@gmail.com>\nFW: Myers 322-744263-23\n2 messages\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Tue, Sep 9, 2025 at 4:22 PM\nTo: FUDSTOP <chuckdustin12@gmail.com>, Cooper Carter <coopercarter@majadmin.com>, CSD-Legal-914 <csd-legal-\n914@oag.texas.gov>, \"CSD-LEGAL-914@TEXASATTORNEYGENERAL.GOV\" <csd-legal-914@texasattorneygeneral.gov>\nDear Ms. Kemp:\n \nAttached is correspondence from Judge Munford to Judge Evans and an Order of Referral.\n \nFurther, attached is correspondence from Judge Kaitcer to Judge Evans and an Order of Referral.\n \nThank you.\n \nLindsey Baker\n322nd Court Coordinator\nTarrant County Family Law Center\n200 E. Weatherford, 4th floor\nFort Worth, Texas 76196\nPhone: (817) 884-1597\n \n \nF r o m : Lindsey K. Baker\nS e n t : Tuesday, September 9, 2025 4:16 PM\nT o : Tracy Kemp <THKemp@tarrantcountytx.gov>\nS u b j e c t : Myers 322-744263-23\n \nDear Ms. Kemp:\n \nAttached is correspondence from Judge Munford and an Order of Referral.\n \n9/11/25, 11:06 AM Gmail - FW: Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1842822989587015946&simpl=msg-f:1842822989587015… 1/5",
      "char_length": 1157
    },
    {
      "page_number": 8,
      "text": "Further, attached is correspondence from Judge Kaitcer and an Order of Referral.\nThank you.\nLindsey Baker\n322nd Court Coordinator\nTarrant County Family Law Center\n200 E. Weatherford , 4th floor\nFort Worth, Texas 76196\nPhone: (817) 884-1597\n4 attachments\nCorrespondence-District.pdf\n41K\nOrder of Referral-District.pdf\n523K\nCorrespondence-Associate.pdf\n36K\nOrder of Referral-Associate.pdf\n508K\nFUDSTOP <chuckdustin12@gmail.com> Tue, Sep 9, 2025 at 10:48 PM\nT o: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>, CSD-Legal-914 <csd-legal-914@oag.texas.gov>, \"CSD-LEGAL-\n914@TEXASATTORNEYGENERAL.GOV\" <csd-legal-914@texasattorneygeneral.gov>\nMs. Baker,\nJust so I understand, I need the following to be explained, and anyone CC'ed in this email is free to provide input.\nRegarding the recusal procedures (this marks the third):\nThe first recusal, you send me a modified version of my pleading as if I'm not going to notice it's missing the exhibits and\naffidavit critical to the motion. You confirm it was electronically filed when I bring this discrepancy up, and then suddenly\nchange your answer when I bring up the file size discrepancy, and modify it again in conjunction with an amended order of\nreferral but that time split the file into three parts because of the \"size of the motion\" which directly contradicts how the\nfiling procedure works, as per the T arrant County District Clerk's FAQ.The parties agreed to continue the case because I had a dental emergency the day of the first hearing on November  7th,\nwhich everyone agreed to in writing, and which I appreciated. That was denied for a failure to appear.\nBecause I read the Regional Judge's order, I waited for the next four months while the other side did absolutely nothing\nand reached out to you about an unopposed summary judgement that's been on the docket since February 22, 2024. You9/11/25, 11:06 AM Gmail - FW: Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view =pt&search=all&permthid=thread-f:1842822989587015946&simpl=msg-f:1842822989587015… 2/5",
      "char_length": 2087
    },
    {
      "page_number": 9,
      "text": "told me to file a notice of hearing, which I already had when I filed the original motion, and reminded you that the judges\nhadn't been reinstated back into the case.\nThen, the next two recusals, you didn't attach any motion at all to the orders of referral, and erroneously included an order\nof referral for Judge Jeffrey Kaitcer not once, but now twice, when he wasn't implicated in either of the second or third\nmotions.\nAll three times I have no indication that the correct pleading was even sent to the Regional Presiding Judge, as the orders\ndon't comport with what was filed, and we have judges electing not to recuse who were never asked to, and then orders\ndenying motions which were never filed follow.\nThe inconsistency surrounding a straightforward process set forth in the rules of procedure is being\nunnecessarily  obfuscated, and there doesn't exist a logical explanation that warrants confusing a process designed to\npromote judicial fairness, transparency, and impartiality.\nAs a final reminder, and in good faith to prevent any further disruption to the rule of law, these issues must be addressed\nor explained:\n1. The most recent recusal brings up serious issues that undermine the judiciary, as I'm concurrently litigating in the\nWestern District of Oklahoma trying to seek damages from this situation pursuant to RICO, and I warned the court that\nbecause I have no alternative options, and the Court insists on moving to final trial in the midst of all of these issues, I\nmust enjoin additional defendants as the court found I was lacking continuity and relatedness.\n2. The actions taken here provide the missing elements of the RICO claim according to the 10th Circuit, however, I will be\nappealing to the 10th circuit given there is a circuit split of authority regarding this aspect of RICO law.\n3. I've given this Court many chances to provide corrective action, I've tried to warn the court that there's an ongoing\ncriminal enterprise that was formed in December of 2023, yet it continues to ignore these unrebutted facts, and has now\nclearly chosen to become part of the enterprise I have repeatedly brought to the court's attention through several different\nvehicles, including mandamus petitions.\n4. We can't even follow recusal procedures correctly, and for some reason you continue to be involved when nowhere in\nthe T exas Rules of Civil Procedure does it give you any designated role in this process.6. You feel the need to email me these exchanges, when they should just be filed with the EFM. Nobody in this case\nrequires emailed service, because the attorney on the other side is registered under the EFM, albeit  to her prior employer,\nwhich is another issue the Court continues to ignore. Electronic filing is REQUIRED, it's not optional for licensed\nattorneys.\n7. I've filed six mandamus and have received zero responses from any implicated judge, and all the Court has to base its\nreasoning on is an order that claims consent with only one side of the case's signature on it.\nThe only argument I've been given is that your position is to \"help effectuate and expedite justice\", yet here - no logical\nperson knowing these facts would think for a second that the Court is being impartial, or that your involvement has done\nanything other than create ambiguities in a process designed to show the Court is, in fact, unbiased and fair.\nAgain, I understand the bias is there - but you have to put yourself in my shoes, even if just for a moment, and realize that\nthis entire time all I've done is try to WARN the court with facts that - to this day - remain unopposed within a record that\nexceeds 3,900 pages and exists in the public domain.  \nhttps://search.txcourts.gov/ SearchMedia.aspx? MediaVersionID=8e2d45b4-fb4f- 40a0-93bc-ed9ed5f3cebd&coa=\ncossup&DT=RECORD&MediaID= 804ac8d3-9b5f-40b0-bc41- bbc08c814365\nI don't want to litigate. I don't want to continue to try and explain what's already obvious. I want to get justice for my\nchildren, which is why instead of performing self-help remedies, I've tried to follow the law and give the court every\nopportunity that I possibly could to make them aware that it is actively assisting a criminal RICO enterprise in furthering\ntheir scheme, providing the continuity and relatedness elements that the Western District of Oklahoma found was\nlacking, and that will be appealed to the 10th circuit.\nI didn't ask to be in this position, I was put here, and I have no other options but to initiate a federal action and use the\n3,900 page record and the unexplained misconduct as self-authenticating evidence that what I've been saying is the truth.9/11/25, 11:06 AM Gmail - FW: Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view =pt&search=all&permthid=thread-f:1842822989587015946&simpl=msg-f:1842822989587015… 3/5",
      "char_length": 4818
    },
    {
      "page_number": 10,
      "text": "This is nothing against you personally, Ms. Baker, I understand politics are at play here with next year's elections coming\nup - but this is my life - it has been destroyed, and I have to do everything that the law allows to ensure that this situation\nis remedied.In fact, I take nothing that has occurred personally, because I'm not doing any of this for any other reasons\nthan it's what's best for my Children.\nI just can't fathom how the desire to silence a litigant could outweigh the risk of becoming involved with the criminal\nenterprise that has made absolutely no defense to the claims made against them, and they're being given a vehicle to just\nwalk into court on December 10th and obtain a final decree of divorce despite all of these issues, thus effectively\nconcluding the enterprise's affairs.\nThis message is not meant to intimidate the Court, harass or threaten, but is to merely communicate what I have been\nforced into doing, and to reiterate the major issues that continue to compound.\nIf anyone else were in my position, it's hard to fathom that they'd feel like they were being treated fairly.\nI hope that this Court, at the very least, understands why I have to do this. I've tried everything else to no avail, and every\npleading has been in good faith.\nThe opposing counsel, Petitioner, and CSD legal have been duly CC'ed in this email.\nA few more key notes:\n1. T ake special note how CSD legal is silent on the issue of their certificate of service sent in the intervention pleading\ncontaining mismatched names. Holly Hayes is allegedly the attorney of record, yet she signs with a signature that\ndoesn't match any of the other 85 documents I've pulled containing Holly Hayes signature, and the signature line says\n\"Choya Burkley\". It's comically fraudulent.\n2. T ake special note how CSD legal has no basis to even be on the case considering they don't reply to objections served\nto them, similar to opposing counsel here, and they're unable to enforce a facially void order, especially when the attorney\non the other side can't file anything in her own name despite being allegedly retained in her individual capacity.\n3. T ake special note of how Holly Hayes, alleged attorney for the OAG, publicly left in 2018, claims to work at the SBA on\nher public LinkedIn profile, yet somehow is the attorney of record for the OAG in this case.\n4. T ake special note of how Cooper Carter, alleged attorney for Petitioner, publicly left Marx Altman and Joined Cantey\nHanger in 2022, yet here she claims to be employed by Marx Altman with an EFM registered to Cantey Hanger, and has\nevery filing submitted \"on her behalf by Roderick Marx\" who is not a party named in this suit.\n5. T ake special note how Cooper Carter will have zero explanation as to why her EFM account is registered to her prior\nemployer despite this being brought to her attention time and time again, and won't have any explanation as to why she\nhasn't responded to anything served on her.\n6. T ake special note of the case docket, and notice that the Petitioner has only made one appearance in this matter on\nJanuary 16, 2024, despite there being three alleged hearings.\nWhen you add in the document tampering, one-sided temporary orders, six ignored mandamus petitions, the sua sponte\nfinal trial setting, and the illegal and deceptive nature upon which this case was founded in conjunction with everything\nelse mentioned above...it paints a very clear picture that defies all reasonable logic and warrants an immediate stay until\nthese issues can be resolved. It makes no sense.\nAgain, everything herein is not speculative, it's not accusatory - it's in the public domain, and remains unopposed. What's\nstated here is already before the court, the only thing that doesn't exist is any substantive participation whatsoever by the\nother side or a reasonable explanation by the Court.\nThis is not how this process is supposed to work, and everyone in this email chain knows it.\nI hope the Court starts to make the right decisions, because the real party responsible for this entire mess remains the\nPetitioner as the record facially establishes, and no further judicial resources should have to be expended in what should\nhave already been a remedied situation by operation of law.9/11/25, 11:06 AM Gmail - FW: Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view =pt&search=all&permthid=thread-f:1842822989587015946&simpl=msg-f:1842822989587015… 4/5",
      "char_length": 4456
    },
    {
      "page_number": 11,
      "text": "Charles Dustin Myers\n[Quoted text hidden]9/11/25, 11:06 AM Gmail - FW: Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view =pt&search=all&permthid=thread-f:1842822989587015946&simpl=msg-f:1842822989587015… 5/5",
      "char_length": 230
    },
    {
      "page_number": 12,
      "text": "EXHIBIT 3",
      "char_length": 9
    },
    {
      "page_number": 13,
      "text": "",
      "char_length": 0
    }
  ]
}