{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\DISTRICT JUDGE\\10.09.24 - AMENDED ORD. REFERRAL-1.pdf",
  "base_name": "10_09_24_amended_ord_referral_1",
  "page_count": 152,
  "pages": [
    {
      "page_number": 1,
      "text": "CAUSE NUMBER: 322-744263-23 \nIN THE MATTER OF THE \nMARRIAGE OF \nMORGAN MICHELLE MYERS \nAND \nCHARLES DUSTIN MYERS \nAND IN THE INTEREST OF \nMARA MYERS AND \nCAROLINE MYERS \nMINOR CHILDREN ) \n) \n) \n) \n) \n) \n) \n) \n) \n) \n) IN THE DISTRICT COURT \nTARRANT COUNTY, TEXAS \n322ND JUDICIAL DISTRICT \nAMENDED ORDER OF REFERRAL \nOn the 7th day of October, 2024 a Joint Motion to Recuse was filed by Charles Dustin \nMyers in the above styled and numbered cause. A copy of the Motion is attached to this Order. \nThe Presiding Judge against whom the motion was filed declines to recuse himself and hereby \nrefers this matter to the Presiding Judge of the Eight Administrative Judicial District, Honorable \nDavid L. Evans, to decide the Motion. \nSIGNEDthis 'J~ayof c:'t {J{e, ,2024. ---------322-744263-23\nFILED\nTARRANT COUNTY\n10/10/2024 1:56 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 859
    },
    {
      "page_number": 2,
      "text": "322-7 44263-23 \nNO. 24-0395 \nNO._ SW3d_, 04-10-24 FILED \nTARRANT COUNTY \n10n/2024 7:30 AM \nTHOMAS A. WILDER \nDISTRICT CLERK \nNO. 322-744263-23 & NO. 322-744538-23 \nMorgan Michelle Myers v Charles Dustin Myers \nJOINT MOTION \nTO RECUSE \nProceedings arising from the 322nd District Court \n-&-\nOn Petition for Writ of Mandamus from the Second Court of \nAppeals, \nTarrant County, Texas \n-&-\nIn the Supreme Court of Texas, \nAustin.",
      "char_length": 425
    },
    {
      "page_number": 3,
      "text": "TABLE OF CONTENTS \nI. BASIS FOR RECUSAL \nA. Challenging impartiality via motion to recuse ...................................... 2 \nB. Form, content, timing, and grounds for recusal.. ................................ 2,3 \nII. QUESTIONING THE IMPARTIALITY OF JAMES MUNFORD \nA. The discovery of the TCDC Facebook post on Jan 15, 2024 ................. 3 \nB. James Munford presided in place of Jeffrey Kaitcer who arrived late ... 3 \nC. Continuance, consolidation, and rulings within the same order ........... .4 \nD. Custody decisions were made prior to notice and hearing ................... .4 \nE. Rule 6.405(b) of the Texas Family Code was overlooked ..................... 5 \nF. Injunctions are meant preserve the status quo, not destroy it .............. 5,6 \nI \nG. James Munford deprived respondent of a fair trial ............................... 6 \nH. The threshold for recusal is satisfied .................................................... 6 \nI. James Munford's only explanation was extrajudicial .......................... 6,7 \nIII. QUESTIONING THE IMPARTIALITY OF JEFFREY KAITCER \nA. Petitioner is awarded a second continuance and further delays ............. 7 \nB. Respondent's counsel encourages settlement without a valid reason. 7,8 \nC. The details of the settlement displace the children from home .............. 8 \nD. Respondent terminates his counsel and challenges the agreement. ....... 8 \nE. The procedural timeline of the agreement expires ................................. 8 \nii",
      "char_length": 1500
    },
    {
      "page_number": 4,
      "text": "F. Petitioner locks the Respondent outside of the residency ...................... 9 \nG. Parties appeared before Jeffrey Kaitcer on March 14, where Respondent was \npresented with formal agreed temporary just before the hearing began ......... 9 \nH. Jeffrey Kaitcer refused to hear facts prior to Feb 1, 2024 ..................... 9 \nI. Jeffrey Kaitcer directed extrajudicial statements at the Respondent..9,10 \nJ. Jeffrey Kaitcer ordered the Respondent to sign the agreement.. ........... 10 \nK. Jeffrey Kaitcer has shown an inability to remain impartial ............ 10, 11 \nIV. THE AFTERMATH \nA. The case becomes a one-sided pursuit for relief .................................. 11 \nB. The orders erode the status quo as better alternatives are sought ... 11,12 \nC. The petitioner reduces her employment, introduces chaos .................. 12 \nD. The petitioner's grandmother contacts Respondent with concems ...... 12 \nV. QUESTIONS THAT REMAIN UNANSWERED ............................. 12,13 \nVI. CONCLUSION .................................................................................... 14 \nVII. PRAYER ........................................................................................ 15,16 \nVIII. CERTIFICATE OF CONFERENCE .................................................. 17 \nIX. CERTIFICATE OF SERVICE ............................................................... 17 \nX. AFFIDAVIT OF CHARLES MYERS .................................................... 18 \niii",
      "char_length": 1480
    },
    {
      "page_number": 5,
      "text": "NO. 322-744263-23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS \nIN THE MATTER \nOF THE MARRIAGE OF \nMORGAN MICHELLE MYERS \nAND CHARLES DUSTIN MYERS \nAND IN THE INTEREST OF MARA \nMYERS AND CAROLINE MYERS, \nCHILDREN MOTION FOR RECUSAL \nTO THE HONORABLE DAVID EVANS \nOF THE 8TH ADMINISTRATIVE JUDICIAL REGION OF TEXAS: \nIn February of 2018, response to a question posed by the Republican Club Political \nAction Committee, the now elected District Judge James Munford stated: \n\"I'm running for this office because I've worked many, many years in the family law field. I want \nto help and work with the citizens of Tarrant County and the families of Tarrant County to \nprovide a good and accurate judiciary that follows the rules oflaw.\" \nHowever, in this case, Respondent, CHARLES DUSTIN MYERS, has encountered a \nseries of judicial determinations that fundamentally contradict this objective. The \nassurance to uphold a judiciary that follows the rule of law has been replaced with \ndecisions that have deprived the Respondent of due process, equitable hearings, and his \nfundamental paternal rights. Respondent respectfully moves to recuse District Judge \nJames Munford and Associate Judge Jeffrey Kaitcer pursuant to TAC §155.152 & TEX. \nR. CIV. P § l 8b(b )(1) and in support thereof, states the following un-opposed facts: \n1",
      "char_length": 1334
    },
    {
      "page_number": 6,
      "text": "I. BASIS FOR RECUSAL \nA. The impartiality of a judge may be challenged in the trial court by a motion to \nrecuse. TEX. R. CIV. P. 18a, 18b. The Respondent respectfully moves to recuse Honorable \nJudge James Munford and Honorable Associate Judge Jeffrey Kaitcer from presiding over \ncause number 322-744263-231 for their collective inability to remain impartial in this \nmatter by depriving the Respondent of a fair trial on four separate appearances. \"Texas \nrequires the recusal of a judge in any case where his or her impartiality might reasonably \nbe questioned, regardless of any actual bias which may be held in a case.\" Aguilar v. \nAnderson., 855 S.W.2d 799, 815. \nB. This motion has been filed at the earliest practicable opportunity, as the \nRespondent has exhausted all other available legal avenues without receiving any response, \nexplanation, or opposition. Respondent has given the trial court every opportunity to \ncorrect the errors made in this case and has recently discovered pertinent information \nrelated to the initial proceeding that took place on January 16th, 2024, as outlined below. \nThere are no current settings or upcoming hearings, and the case has not yet been scheduled \nfor a final trial. The Respondent's motion is verified and asserts grounds for recusal \npursuant to TEX. CIV. R. P. 18(b )b I. These grounds are not predicated solely on the judges' \nprior rulings. Instead, this motion presents detailed, particularized facts based on the \nRespondent's direct knowledge that are admissible as evidence and are self-authenticating \n1 This case was consolidated on January 16th, 2024, by District Judge James Munford with cause number \n322-744538-23, a protective order suit initiated by the Petitioner, Morgan Michelle Myers. \n2",
      "char_length": 1763
    },
    {
      "page_number": 7,
      "text": "under Rule 902( 4) of the Texas Rules of Evidence and are sufficient to warrant recusal. \nMoreover, where facts are presented based on information and belief, the foundation for \nsuch beliefs is explicitly stated. See TEX. R. CIV. P. 18a(a)(l )-( 4); 18a(b )(1) \nII. QUESTIONING THE IMPARTIALITY OF JAMES MUNFORD \nA. On September 29th, 2024, the Respondent discovered a Facebook post made by \nthe Tarrant County District Courts which stated the following: \n\"The following Tarrant County District Courts will be closed tomorrow, Tuesday, January 16, \n2024. \nThis list is evolving as individual Judges are making informed decisions based on their dockets, \ninclement weather, and the safety and welfare of litigants, Court staff, counsel, and the general \npublic.\" -Tarrant County District Courts on January 15, 2024. \nThe Fort Worth Independent School District also announced that they would remain \nclosed due to inclement weather in the area. https://www.(ox4news.com/news/dallas-fort-\nworth-school-closings-ian-16. On December 14th, 2024, the petitioner requested a \nprotective order from Jaines Munford, which was denied. Exhibit A. However, one month \nand two days later, Judge James Munford made an initial decision that has been \nunexplained for the last ten months. \nB. The initial decision at issue arose during a show cause hearing concerning an \norder of protection initiated by the petitioner, Morgan Michelle Myers, on December 22, \n2023. This hearing was originally scheduled to be presided over by Associate Judge \nJeffrey Kaitcer in the 322nd District Court of Tarrant County at 9:00 A.M. on January 16th, \n2024. However, due to delays caused by inclement weather as mentioned above, the \n3",
      "char_length": 1705
    },
    {
      "page_number": 8,
      "text": "proceedings were instead conducted by District Judge James Munford, as Associate \nJudge Jeffrey Kaitcer arrived late. \nC. Both parties were present and appeared without legal representation. During the \nproceedings, Judge Munford presented the parties with an agreed continuance, which \nboth parties accepted, and which was subsequently granted by Judge Munford as \nreflected in his order. However, despite granting the continuance, Judge Munford went \nfurther, issuing a series of rulings where he sua sponte consolidated the protective order \ncase with the divorce case previously filed by the petitioner on December 18, 2023. \nExhibit B. He ordered the Respondent to vacate the residency that same day by 2:00 p.m., \ndivested him of the custody of his children, and the hearing was then rescheduled for \nJanuary 22, 2024, to be presided over by Associate Judge Jeffrey Kaitcer. Exhibit C. \nD. This decision by Judge Munford undeniably raises serious questions regarding \nhis impartiality in this matter. Due process of law requires that an individual receive \nnotice and hearing before being deprived of a property right. In re the Guardianship of \nBays, 355 S.W.3d 715, 720 (Tex. App. 2011); See Grannis v. Ordean, 234 U.S. 385, 394, \n34 S. Ct. 779, 783, 58 L. Ed. 1363 (1914) (\"a fundamental requisite of due process oflaw \nis the opportunity to be heard\"). Furthermore, the Texas Family Code prohibits such an \norder before notice and hearing. TEX. FAM. CODE 105.001 (\" ... an order may not be \nrendered under Subsection (a)(l ) ... except after notice and a hearing ... \") (referencing \nchild custody). \n4",
      "char_length": 1612
    },
    {
      "page_number": 9,
      "text": "E. Moreover, 6.405(b) of the Texas Family Code was not satisfied, which is a \nmandatory requirement before any hearing can take place given the original petition for \ndivorce claimed an active order of protection was currently in effect against the \nRespondent. Exhibit B, p. 7. (\"The petitioner shall attach to the petition a copy of each \norder described by Subsection (a)(l) in which a party to the suit or the child of a party to \nthe suit was the applicant or victim of the conduct alleged in the application ... if a copy \nof the order is not available at the time of filing, the petition must state that a copy of the \norder will be filed with the court before any hearing.) All of the procedural safeguards \nabove were disregarded by James Munford. \nF. The purpose of temporary orders with injunctive relief is not to destroy the \nstatus quo, but rather to preserve it. See Iranian Muslim Organization v. City of San \nAntonio, 615 S.W.2d 202, 208 (Tex. 1981); Davis v. Huey, 571 S.W.2d 859, 862 (Tex. \n1978); Citizens a/Texas Sav. v. Fox Jacobs, 718 S.W.2d 2, 3 (Tex. App. 1985). Similarly \nto how the temporary injunction in Coyote Lake Ranch, LLC v. City of Lubbock, 498 \nS.W.3d 53 (Tex. 2016) improperly denied the City its undisputed right to access \ngroundwater-an essential resource-Judge Munford's rulings have deprived the \nRespondent of his residency, which has served not only as the family home since 2015 \nbut also as the headquarters for his business which provided for the children -an \nessential resource to their wellbeing. Furthermore, the Respondent was divested of \ncustodial rights to his children without justification. Like the injunction in Coyote, rather \nthan preserving the status quo, these initial rulings have done the opposite by depriving \n5",
      "char_length": 1780
    },
    {
      "page_number": 10,
      "text": "the Respondent of his constitutional rights to property prior to due process oflaw. US \nCONST. AMEND XIV,§ 1; TEX CONST. ART. I,§ 19. Furthermore, James Munford \nprejudged critical matters that require full evidentiary hearings. TEX. FAM. CODE \n105.00l(b) ( ... an order may not be rendered under Subsection (a)(l), (2), or (5) except \nafter notice and a hearing.) (in regard to the temporary conservatorship for a child, for the \ntemporary support of the child, or for payment of attorney's fees.) \nG. The Respondent's burden of showing of bias or impartiality to such an extent \nthat the movant was deprived of a fair trial is satisfied from Judge Munford's initial \nruling. See Rodriguez v. JPMorgan Chase Bank, N.A., No. 04-14-00342-CV, 22 (Tex. \nApp. Jun. 17, 2015). \nH. The threshold for recusal is \"whether a reasonable member of the public at \nlarge, knowing all the facts in the public domain concerning the judge's conduct, would \nhave a reasonable doubt that the judge is actually impartial.\" Hansen v. JPMorgan Chase \nBank, N.A., 346 S.W.3d 769, 776 (Tex. App.-Dallas 2011, no pet.); Rodriguez v. \nJPMorgan Chase Bank, N.A., No. 04-14-00342-CV, 22 (Tex. App. Jun. 17, 2015). The \nRespondent asserts that a reasonable member of the public would indeed reasonably \ndoubt James Munford was actually impartial given that he deprived the Respondent of a \nfair trial. Thus, the Respondent's burden and threshold for recusal has been met, and \nJudge James Munford should be recused from this matter. \nI. The only reasoning provided was an oral statement regarding his personal \nopinion regarding the Respondent living next door to his ex-partner's grandparents, \n6",
      "char_length": 1669
    },
    {
      "page_number": 11,
      "text": "which is extrajudicial and comes from a biased perspective which discounted the facts of \nthe case relevant to the children's well-being. In the context of this case, recusal is \nwarranted if the trial judge's impartiality might reasonably be questioned, or he has a \npersonal bias. TEX. R. CIV. P. 18b(2). This opinion or bias was irrelevant to the well \nbeing of the children, as the grandmother, much like the children, relied on the \nRespondent's income in order to provide financial stability, and further justifies his \nrecusal. \nIII. QUESTIONING THE IMPARTIALITY OF JEFFREY KAITCER \nA. The initial ruling reset the case to January 22nd, 2024. The Respondent retained \nthe services of Dan Bacalis, while the Petitioner arrived without any legal representation \nand retained the services of Cooper Carter in the lobby of the courtroom. Much like the \nfirst setting, Associate Judge Jeffrey Kaitcer granted a continuance which only benefitted \nthe petitioner by allowing her legal representation more time to become familiar with the \ncase while simultaneously extending the initial orders of Judge James Munford to \nFebruary 1st, 2024, which significantly impacted the Respondent and his children. Exhibit \nD. Neither party appeared before the Jeffrey Kaitcer, and this decision was made without \nany input from the Respondent and without any opportunity to contest it. \nB. At the third trial setting on February 1, 2024, the parties arrived only to be \npresented with a settlement agreement from the Respondent's own counsel. Given that \nthe case had been delayed twice already and the ongoing damage from being unable to \nwork at full capacity was compounding by the day, the Respondent contested this \n7",
      "char_length": 1711
    },
    {
      "page_number": 12,
      "text": "strategy. He was informed by his attorney that the orders could be modified later and was \nurged to sign it. Left with no better alternative, the Respondent signed the agreement \nunder duress after already being deprived of his residency, children, and business since \nJanuary 16th, 2024. Exhibit E \nC. The agreement removed the children from their own home that they had resided \nin their entire life and allowed the Respondent back into the home until March 1, 2024. It \nalso established child support, and allocated financial responsibilities to the parties, to \nwhere the Respondent was left with both car payments, an unreasonable amount of time \nto transition from the home and with the addition of child support obligations. Exhibit E \nD. Due to the Respondent's counsel drafting a settlement agreement rather than \nrepresenting the interests of his client, he was terminated shortly after the third setting on \nFebruary 5, 2024, where the Respondent began to represent himself prose. Exhibit F. He \nfiled a motion to reconsider the associate judge's report for temporary orders on February \n9, 2024, which wasn't set for hearing until March 14 due to unnecessary delay by the \nopposing counsel, Cooper Carter, who has not filed any pleadings in this case on behalf \nof the petitioner. Exhibit G \nE. Given that Dan Bacalis had been terminated, and that the associate judge's \nreport signed on February 1, 2024, had clear stipulations regarding its' reduction to \nwriting Exhibit G, p.5, the Respondent filed notice with the court on March 4th, 2024, \nstating that he would not be leaving the marital residence as it was not in the best \ninterests of his children. Exhibit H \n8",
      "char_length": 1683
    },
    {
      "page_number": 13,
      "text": "F. This decision prompted the petitioner to run inside the family residence on \nMarch 6th, 2024, while the Respondent was walking his daughters to school on her \nvisitation time and lock the petitioner out of the home. Since this day, the Respondent has \npursued relief to no avail, without argument, and without any response or findings of \nfacts from either judge or Cooper Carter, petitioner's counsel. \nG. On March 14, 2024, the parties appeared before Associate Judge Jeffrey Kaitcer \nto address the Respondent's motion to reconsider. Just minutes prior to the hearing, the \nRespondent was served formally reduced temporary orders by Cooper L. Carter, which \ncontained significant clerical discrepancies and deviated from the original orders signed \non February 1, 2024. These orders are currently in effect today as 'agreed orders'. Exhibit \nI. The orders also reference a hearing that was never conducted in this case. \nH. During the hearing, the Respondent was precluded from addressing the events \nleading up to February I, 2024, due to sustained objections based on relevance. Despite \nsigning off on the Associate Judge's Report which non-suited the protective order, the \nopposing counsel was nonetheless permitted to elicit testimony from their client \nregarding her purported fear for safety should Respondent be allowed near the residency, \nwhich has not been supported by any evidence to date. \nI. Judge Kaitcer refused to admit the Respondent's exhibits, which included \naffidavits from business clients prepared to attest to his need for residency and his close \nrelationship with his daughters. Exhibit J. Judge Kaitcer further stated in open court, \nwhile drafting his ruling on the Respondent's motion, \"You don't care about your kids. \n9",
      "char_length": 1759
    },
    {
      "page_number": 14,
      "text": "You just care about your business.\" This remark, devoid of any evidentiary basis, exposed \na deep-seated bias that rendered impartial adjudication impossible. A neutral and \nimpartial evaluator would have acknowledged the interconnected nature of the \nRespondent's business, residency, and familial relationships as well as the impact of the \ninitial proceedings leading up to that point. Further, an impartial judge would have \nrealized that there is no logical explanation to remove a parent who relies on the \nresidency to provide for the children while simultaneously denying the evidence that \nwould have corroborated this need. \nJ. The Respondent's motion for reconsideration concluded with an illegible order, \nrequiring him to sign the temporary orders served just moments earlier by 1 :30 p.m. that \nsame day. Exhibit K. Again, the order was designated as \"agreed\" despite lacking the \nRespondent's signature, was reduced outside of its' own procedural requirements ordered \nby the same judge, was reduced without any underlying motion for temporary orders ever \nserved to the Respondent and differed from the associate judge's report signed on \nFebruary 1, 2024. Rather than holding the opposing counsel and the petitioner in \ncontempt for violating Rule 13 of the Texas Rules of Civil Procedure for signing a \nfictitious pleading which contained false statements, Jeffrey Kaitcer deprived the \nRespondent of a fair trial, thus warranting his recusal from this matter. \nK. It is evident, based on common sense and objective evaluation of the public \nfacts regarding Jeffrey Kaitcer's conduct that no reasonable person would believe that he \nwas actually impartial knowing all of the facts of the case. After eight months of seeking \n10",
      "char_length": 1745
    },
    {
      "page_number": 15,
      "text": "relief throughout the Texas judiciary, the collective actions of Judge James Munford and \nAssociate Judge Jeffrey Kaitcer remain unexplained, and the damage is ongoing. Their \njoint recusal is necessary to ensure a fair resolution of this matter and to ensure the \npersistent favoritism directed towards the petitioner is abolished. \nIV. THE AFTERMATH \nA. Since the March 14th hearing, the case has stalled. There has been no \nparticipation from the opposing party, and all attempted communications have failed. \nThere hasn't been any explanation for the denials in the Second Court of Appeals, leaving \nthe Respondent to continue seeking every remedy available to him to correct the \ndecisions presented above or receive a valid legal basis that justifies them. \nB. The joint managing conservatorship that the current orders outline has put the \nRespondent in massive amounts of debt. He had to stay in hotels on Thursday nights in \norder to take his Children to school on Friday mornings for his visitation period, and for \nthe extended summer visitation, rented an AIR BNB in order to provide the Children with \na stable living space. The Respondent was able to have the owner of the AIRBNB located \nat 6608 Dewsbury St. that was only 1.3 miles from the Respondent's home allow him to \nport forward the router, allowing him to work to some degree, where he stayed until \nSeptember 14th, 2024. Given the requirements to operate his business, an alternative \nresidency would take a fair amount of time to transition to, and likewise the petitioner \nwould need equal amount of time to obtain full employment in order to maintain the \n11",
      "char_length": 1636
    },
    {
      "page_number": 16,
      "text": "current household. All of this was explained in the Respondent's pleadings that were \nbefore the court on January 16th, 2024, but were not considered. Exhibit L, Exhibit M \nC. Since the March 14th hearing, the petitioner has moved additional family \nmembers into the home, has not paid rent, and has reduced her employment while \nsignificantly reducing the Respondents. On top of both James Munford and Jeffrey \nKaitcer's disregard for the law and the best interests of the children, the inadvertent \nfavoritism towards the petitioner has allowed her to further her own interests at the \nexpense of the status quo of the children. An impartial judge is required in this matter to \nensure that this one-sided favoritism does not continue at the expense of the children. \nD. On June 2 of 2024, the petitioner's grandmother contacted the Respondent \nreiterating the above. She stated that the children were not being taken care of, that the \npetitioner was not acting like herself, and that she was not paying rent. This information \nwas relayed to the Supreme Court of Texas, where the Respondent's motion for rehearing \non petition for writ of mandamus is still pending before the court, asking them to compel \nJames Munford to vacate the current orders which were entered by Associate Judge \nJeffrey Kaitcer as agreed without consent and referenced a hearing that has never taken \nplace. \nV. QUESTIONS THAT REMAIN UNANSWERED \nThroughout this case, several concerning questions have arisen regarding the conduct \nof both judges: \n12",
      "char_length": 1531
    },
    {
      "page_number": 17,
      "text": "1. What dire circumstance compelled Judge James Munford to take up a case on \nshort notice and grant injunctions and make child custody decisions without \nknowing the facts or considering the pleadings, particularly on a day the court was \nclosed due to inclement weather when he had denied a similar request a month \nearlier? \n2. Why did Judge Munford grant an agreed continuance at a protective order hearing \nand simultaneously rule against one of the parties on divorce issues without taking \ninto consideration the preponderance of the evidence before him? \n3. What factual basis on the record compelled Jeffrey Kaitcer to openly make \nnegative statements about the Respondent regarding his children? \n4. Why has Cooper Carter failed to respond to any of the Respondent's pleadings and \nneglected to file any documents on behalf of her client? \n5. What factual basis exists on the record to supports the petitioner being granted full \ncustody of the children and sole use of the residence? \n6. How can an order be issued as an \"agreed order\" after consent was explicitly \nwithdrawn, referencing a hearing that never occurred, and served to the \nRespondent before a scheduled hearing meant to challenge the very order? \n13",
      "char_length": 1226
    },
    {
      "page_number": 18,
      "text": "VI. CONCLUSION \nThis case, as detailed in the pending motion for rehearing before the Supreme \nCourt of Texas, revolves around the core issue of accountability. What began with \nMorgan Michelle Myers attempting to avoid responsibility has now evolved into a \ntroubling scenario where both judges have repeatedly failed to recognize and correct their \nserious missteps. Attorney Cooper Carter's authority to represent the petitioner, currently \nbeing challenged through a Rule 12 motion, further deepens concerns about the integrity \nand fairness of these proceedings. \nRecusing both judges is not just a procedural necessity, but a crucial step toward \nensuring that this case is reviewed impartially and that the facts are properly considered. \nThis will allow the court to focus on the petitioner's pattern of deception and, more \nimportantly, what truly serves the best interests of the children. The petitioner's actions \nhave caused unnecessary delays, destabilized her family, and inflicted significant \nemotional and financial harm on all involved. The ongoing litigation, exacerbated by a \nlack of judicial transparency and accountability, has only added to the hardship. \nDespite these issues, the Respondent holds no ill will toward any party involved. \nHis primary concern has always been, and continues to be, doing what is right for his \nchildren. The Respondent believes that with impartial judges and a renewed focus on \nfairness, this case can still be resolved justly, allowing all parties to move forward with \ndignity and integrity. The Respondent remains diligent in his commitment to securing a \nfair outcome that reflects the best interests of his children as the Family Code mandates. \n14",
      "char_length": 1711
    },
    {
      "page_number": 19,
      "text": "VII. PRAYER FOR RELIEF \nThe Respondent respectfully requests the following relief: \n1. That the clerk of the court deliver a copy of the motion for recusal to both the \nrespondent judges and the regional presiding judge, and deliver any signed orders \nof recusal or referral to the regional presiding judge immediately upon filing. \n2. That the respondent judges either recuse themselves or refer the motion to the \nregional presiding judge within three business days after the motion is filed, and \nrefrain from taking any further action in the case until the motion is decided, \nunless good cause is shown in writing or on the record. \n3. That the regional presiding judge issue interim orders to reset the status quo by \nallowing the Respondent's immediate return to his home and business, thereby \ninitiating a peaceful transitionary period for the family's well-being and stability. \n4. That the motion for recusal be conducted by telephone, as permitted by Rule \n18(g)(6)(C), to expedite the process and ensure all documents submitted by \nfacsimile or email, if otherwise admissible under the rules of evidence, are \nconsidered. \n5. That, if the motion is granted, the regional presiding judge reassign the case to \nanother court or assign another judge to ensure fairness and impartiality moving \nforward. \n15",
      "char_length": 1316
    },
    {
      "page_number": 20,
      "text": "The Respondent seeks this relief to ensure that the case proceeds in a just manner, \nrestoring stability and allowing a fair resolution to the matter at hand during the pendency \nof the case. \nRespectfully submitted, \nIsl Charles Dustin Myers \nCHARLES DUSTIN MYERS \n6641 Anne Court \nWatauga, TX 76148 \nChuckdustin 12@gmail.com \n817-507-6562 \nPro-se \n16",
      "char_length": 352
    },
    {
      "page_number": 21,
      "text": "VIII. CERTIFICATE OF SERVICE \nRespondent certifies that a true copy of this Joint Motion for Recusal was served in \naccordance with Rule 21a of the Texas Rules of Civil Procedure on the following \non 10/07/2024: \nCooper L. Carter (Counsel for real party in interest) \nby EMAIL/ESERVE at COOPERCARTER@MAJADMlN@COM \nMorgan Michelle Myers (real party in interest) \nby EMAIL/ESERVE at MORGANMW02@GMAIL.COM \nHOLLY HAYES (OAG) \nBy EMAIL/ESERVE at CSD-Legal-914@oag.texas.gov \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS \n6641 Anne Court \nWatauga, TX 76148 \nChuckdustin 12@gmail.com \n817-507-6562 \nPro-se \nIX. CERTIFICATE OF CONFERENCE \nA conference was not held with Cooper Carter on the merits of this Motion \nbecause the Respondent failed to reach via her provided telephone number on the \ncase docket after two attempts. Respondent has communicated the merits to the petitioner \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS \n6641 Anne Court \nWatauga, TX 7 6148 \nChuckdustin 12@gmail.com \n817-507-6562 \nPro-se \n17",
      "char_length": 1014
    },
    {
      "page_number": 22,
      "text": "X. AFFIDAVIT OF CHARLES MYERS \nSTATE OF TEXAS \nCOUNTY OF TARRANT \nBEFORE ME, the undersigned authority, on this day personally appeared Charles Dustin \nMyers, who, being by me duly sworn, deposed as follows: \n1. My name is Charles Dustin Myers, and I am over the age of 18, of sound mind, \nand competent to make this affidavit. I am the Respondent in the case styled \nMorgan Michelle Myers v. Charles Dustin Myers, Cause No. 322-744263-23, \npending in the 322nd District Court of Tarrant County, Texas. \n2. I have personal knowledge of the facts stated herein, and they are true and correct \nto the best of my knowledge and belief. \n3. I am submitting this affidavit in support of my Joint Motion for Recusal of District \nJudge James Munford and Associate Judge Jeffrey Kaitcer in the above-referenced \ncase due to their demonstrated inability to remain impartial and provide me a fair \ntrial. \n4. As outlined in the Joint Motion for Recusal, I have encountered judicial \ndeterminations in this case that have deprived me of due process, equitable \nhearings, and my fundamental parental rights. The decisions rendered by both \nJudge Munford and Judge Kaitcer have caused significant harm to my ability to \nmaintain stability for my children and have compounded my financial hardship. \n18",
      "char_length": 1287
    },
    {
      "page_number": 23,
      "text": "5. I have attempted to address these concerns through all available legal avenues, yet \nI have received no adequate response or resolution. The continued judicial \nfavoritism towards the petitioner, Morgan Michelle Myers, has resulted in undue \nhardship on me and my children, destabilizing our lives both emotionally and \nfinancially. \n6. I attest that all facts presented in the Joint Motion for Recusal are true and accurate \nbased on my personal experience and knowledge. I have made every effort to act \nin the best interests of my children throughout these proceedings, and I believe \nthat the recusal of both judges is necessary for an impartial review of this case. \n7. I further attest that the petitioner, Morgan Michelle Myers, has knowingly made \nfalse statements and misrepresented facts in order to benefit herself in these \nproceedings, which has inadvertently caused harm to our children. These false \nstatements have contributed to the current instability and emotional distress they \nare experiencing. I affirm that all statements made herein regarding the welfare of \nthe children are true, accurate, and made under penalty of perjury. \n8. I also affirm that my return to the family residence will be conducted with \namicable honor and respect for all involved. I will take every step necessary to \nensure a peaceful and respectful environment, with no conflict or disruptions. \nWhile residing in the home t~mporarily, I will pursue alternative living \narrangements, allowing for a smooth transition, all while preserving the status quo \nfor the sake of the children and their well-being. \n19",
      "char_length": 1611
    },
    {
      "page_number": 24,
      "text": "Further, Affiant sayeth not. ~ 0->l>+lv-.-A'f= \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 7 6148 \nChuckdustin 12@gmail.com \n817-507-6562 \nPro-se \nST ATE OF FLORIDA, COUNTY OF PALM BEACH \nSWORN TO AND SUBSCRIBED before me on this~ day of October , 2024, \nby Charles Dustin Myers, known to me or proven by identification to be the person \nwhose name is subscribed to this document. \nHe/She/They is/are_ Personally Known OR _X_ Produced _DRIVER'S LICENSE, as identification. \n11\\11111//// \n~ ~ :s §: \"\" -\n1/1111 EGLARINE HARRISON \nNotary Public• State of Florida \nCommission # HH146993 \nExpires on October 11. 2025 \nNotarized remotely online using communication technology via Proof. \n20",
      "char_length": 719
    },
    {
      "page_number": 25,
      "text": "EXHIBIT A \nDENIED EX-PARTE ORDER 12/14/23",
      "char_length": 41
    },
    {
      "page_number": 26,
      "text": "26 \nCause No.: 322 7 4· 4 5 3 8 23 \n322-744538-23 \nApplica~t: • M t>r..GPs:cl rJ\\ \\ c.tii LI ~ fY\\iEf2.-S § In the --\"-P'-'/_,.S\"-'-T ..... JZ-\"'\"\"\"\"l....a:C ..... T' ____ Court \n§ \nV. of \nRespondent: C:~LfS l)l)S\"f\"I N MY \nle . tefp.rJT FILED \nTARRANT COUNTY \n12/27/20239:04 AM \nTHOMAS A. WILDER \nDISTRICT CLERK \nCounty, Texas \nGo to the cour h • \n•• ~-0 -~ ~IV'.'. \nCourt Address: _..J___:_ _ _;.-4-D.J,_ll1_~~~~~2;:ZJ.~~...L-1S,~~lA-~=-...:._~0f~l..,..i-:~C7::::'.'....~ U~LJ~C=::_ __ _ \nFindings: The Co r 1~ swor Affidavit or eclatat1on a'dheWo£C--1~ficat~ for frotective Order \nfiled in this case that there is a clear and present danger that the Respondent named below will commit acts of family· \nviolence that will cause the-Applicant. Children, and/or Other Adults named below immediate and irreparable injury, · \nloss, and damage, for i.vhich there is no adequate remedy at law. The Court. therefore, enters this Temporary· Ex Parte \nProtective Order without further notice to the Respondent or hearing. No bond is required. • \n1 • Respondent: The person riamed below is ordered to follow all Orders marked with a check. \nName: Cr\\Ae..L£S Dos::r::1cl MYEJ25 CountyofResidence: 1:fC(?~p..rJ-r\" \n2 Protected People: The following people are protected by the terms of this PROTECTIVE ORDER: \nName: County of Residence: \nD Applicant:· tv\\DC,(,A N N\\\\C:\\:\\I1U; M~~S \nD Children: N\\f\\<?-A ~ 1./ o·f\\1 N 1: • tJ\\'-{t; (? <; \n-□ Other \nAdults:. CMD LI N f @.OS E IY\\'/E £. <; 1 Af?.:'1-f\\ l'11 \n3 Temporary Orders -.To prevent family violence, the Court orders the Respondent to obey all orders marked \nwith a check. V \nThe Respond t (person ·named in 1) must: \na. ( Not commit n act agai st any person named in 2 above that is intended to result in physical harm. bodily· \n. ~jury, assault. r sex I assault or that is a threat that reasonably places those people in fear of imminent \n\"C,(•~{~!tfical harm, b ilYJ injury, assault, or sexual assault. . . • \n• • b. & ~ot communicate • a reatening or harassing manner with any person named in 2 above. \nc. ~ Not communic ough any person to any person named in 2 above. \nTem;:;or .. 1ry Ex Pmte =>rcte,;t;ve Qrder \nForm Approved by the SupremP _Court of.TPxas ••m•;_;;~;:R~.. A CERTIFIED COPY \nl'.:+, ~-~-.. ATTEST: 04/15/2024 [8 • ~i THOMAS A. WILDER \n\\t, .\"</ ..{)ISTRICT f.1,.ERK \n··~.. +>:;lTAR1t1G-fl- e<%1'JTv, TEXJ \n•••:?. ...... r■ :••• BY: /s/ Catherine Saenz",
      "char_length": 2418
    },
    {
      "page_number": 27,
      "text": "27 \n·-\nd. jQ Not ommunicate or attempt to communicate in any manner with: (Check all that apply) . \n~~ A licant □ Children □ Other Adults named in 2 above. The Respondent may communicate through: \n__ __,, ____________________ or other person the Court appoints. \nGood ca se exists for prohibiting the Respondent's direct communications. \ne. ~ Not go wit in 200 yards of the (Check all that apply}: \n1bl. Applican □ Children □ Other Adults named in 2 above. (except to go to court hearings) \nf. &., Not go within 00 yards of the Residence, workplace, or school of the: (Check all that apply) \n. . fia.Applicant D her Adults named in 2 above. . \nThe addresses o the prohibited locations are: ( Check all that apply) • \n□ Deemed confide tial. The Clerk is ordered to strike the information fro all public court records and maintain \na confidential rec d of the information for Court use only. \n□ Disclosed as folio \nApplican(s Residen e: _____________________________ _ \nApplican~·s Workplac School: ------------1----------------\nOther: --------'',-----'-----------1-----------------\ng. t/'Not possess a firearm or am unition, !,Jnless the Respondent is peace officer actively engaged in \nemployment as a sworn. full-ti e paid employee of a state ag ncy or political subdivision. \nh. ~ Not go within 200 yards of the C ildren's Residence, child-c re facility, or school .. •. \n• The addresses of the prohibited lo ations are: (Check all t t apply) \nD Deemed confidential. The Clerk ·s ordered to strike th information from all public court records and \nmaintain a confidential record oft e information for • ourt use only. \nD Disclosed as follows: \nChildren's Residence: __ ,_;.., __ ..:.------1---------------­\nChildren's Child-care/School: --------t----------------­\nother: \ni. t Not stalk, follow, or engage in conduct dir 1cally towa or Other Adults \nnamed in 2 above that is reasonably likely , annoy, ala , , ~....,.,,arrass them, \nincluding tracking or monitoring a car or ot erty. \nj. ~ Not remove the Children from their sch 1ld)are facility, or the Applicant's possession. \nk. W-Not remove the Children from the juri n of th~ourt. • . \nI. □ Not take, harm, or interfere with the c custody, or~ontrol of the following pet, companion ani~al, \n.or assistance animal: \\ (describe the animal). \nm.'fr • • • the Residence loc~ted at: l£~4\\ ANN( CI \n__._\"\"-+'._...,_,,_.,.~....._.,_....~--'-..,_.,-v-----------· including, but not limited to, disconnecting \nsuch services to be disconnected. \nn. 00- • e follo~v\\9 property: \no. ¢-Not damag~. transfer encumber, or otherwise dispose of any property ~n.tly owned ~r • \n· leased by the Appli nt and Respondent, except _in the ordinary course of bb~ness or for reasonable and \nnecessary living . penses, including, but not limited to, removing or disabling any vehicle owned \nor possessed b the Applicant or jointly by the parties (whether so titled or not). \nTempcrnry E.~ Parle Prolective Qrder \nForm Aporcved by the Supreme Court of Tex::is",
      "char_length": 2989
    },
    {
      "page_number": 28,
      "text": "28 \n4 ~ Order: cate Residence Immediately \nThe Collrt I s that the Residence located at: (ele4\\ AN Nf c:r Wro:rol~~ ;rx 1lP m(Check one): \n& is jointly o d or leased by the Applicant and Respondent; \nO is solely owne or leased by the Applicant; or \n□ is soley owned b ·e Respondent; ahd the Respondent is obligated to support the Applicant or a child in \nin the Applicant's po ession. \nThe Court further finds that t Applicant currently resides at the Residen , or has resided there within 30 \ndays prior to the filing of the Ap ication for Protective-Order in this case, nd that the Respondent has \ncommitted family violence· agains member of the household within 3 days prior to the filing of the \nApplication for Protective Order in t • case. There is a clear and pre ent danger that the Respondent is \nlikely to commit family violence agains a member of the househ61 . \nThe Respondent is therefore ORDERED t vacate the Reside eon or.before: ____ o a.m. c p.m. on: \n_________ {date) and to remai at least 200 yar s away from the Residence until further order \nof the Court. The Applicant shall have exclusi use and p session of the Residence until further order of \nthe Court. \n(i!; /iT IS FURTHER ORDERED that the sheriff, consta e. or chief of police shall provide a law enforcement I ~fficer to accompany the Applicant to the Reside e, o inform the Respondent that the Court has ordered \nthe Respondent to vacate the Residence, and t provi e protection while the Applicant takes possession of \nthe Residence, and if the Respondent refuse to vacate he Residence, provide protection while the \nApplicant takes possession of the Applican ·s necessary rsonal property. \nConfidentiality of Information \nThe Court Clerk is ordered to strike· ntact information for Pr tected People, including: addresses, m\"ailing \naddresses, county of residence, le phone numbers, places of mployment, businesses, child-care facilities, and \nschools from the public records the Co_urt, and maintain a con ·dential record of this information. The Clerk of \nthe Court is prohibited from r easing contact information of Prate ed People except to the Court or to law \nenforcement for the purpos of entering the information into the De rtment of Public Safety law enforcement \ninformation system. It is rdered that all contact information fort e Protected People is confidential. \nm.._ It is ordered that t e following person is designated as a person to r • ceive any notice or documents filed with \nthe Court relate o the application on behalf of the Applicant: \nName: \\1\\1\\\\,SDrJ \nAd \n~It is ordered that the following person is designated as a person to receive a y notice or documents filed with the \nCourt. \n6 ~ Go to the Court Hearing \nIT IS FURTHER ORDERED that notice issue to the Respondent to appear, and the Respondent is ORDERED \nto appear in person before this Court at the time and place indicated on page 1 of this form. \nThe purpose of this hearing is to determine whether the Court should issue the Protective Orders and \nother relief requested in the Application for Protective Order filed in this case. \n7 Duration of Order: This Order is effective immediately and shall continue in full force and effect until twenty \n(20) days from the date it is signed, or further order of the.Court. \n• Tempor::iry Ex Parte fer Protective Order \nForm Approved by the Sc:preme C,:urt ci Texos .••-•o\";~A~'.;;.-... A CERTIFIED COPY :~ ~ 'o•. ATTEST: 04/15/2024 •o ~• :U . ~: THOMAS A. WILDER . \n~t, :</ DISTRICT CLERK \n••:a..., ~fTARRANTCOUNTY. TEXJ \n•••~?. ..•••• t••• e'~M ~!>lei\\ne Saenz",
      "char_length": 3574
    },
    {
      "page_number": 29,
      "text": "29 \n8 D War • g: A person who violates this order may be punished for contempt of court by a fine of as much as \n$500 or confinement in jail for as long as six mon~hs, 1 both. \nNo person, in uding a person who is protected by th order, may give permission.to anyone to ignore or \nviolate any pro -~ion of this Or~er. During the time • which this Order is valid, every provision of this \nOrder is in full for e and effect unless a court cha ges the Order. • \nIt is unlawful for any rson, other than a pea e officer, as defined by Section 1.07, Penal Code, actively \nengaged In employmen s a sworn, full-tim paid employee of a state agency ,or political subdivision, who \nis subject to a Protective rder to posses a firearm or ammunition. \nIf a person subject to a prote ive ord is released from confinement or imprisonment following the date \nthe order would have expired, dr✓f t e order would have expired not later than the first anniversary of the \ndate the person is released from c nfinement or imprisonment, the order is automatically extended to \nexpire on: (1) the first anniversary' o the date the person is released,_if the person y.,as sentenced to \nconfinement or imprisonment orate of more than five years; or (2) the second anniversary of the date \nthe person is released if the sentenced to confinement or imprisonment for a term of fi°ve years \nor.less. • • \nA violation of this OEd by commission of an ct prohibited by the Order may be punishable by a fine of as \nmuch as $4,000 or b confinement in jail for as lo~as one year, or both. An act that results in family \nviolence may be PJ secuted as a separate misdem anor or felony offense. If the act is prosecuted as a \nseparate felon(ffense, it is punishable by confine nt in priso_n for at l~ast two years. . _ . \nThis is a Court Order. No one -except the Court -can change this Order. \nTemporary Ex Parte Prctective Order \nForm Approved by the Supreme Court of Texas •-~~;~'..:;~;_,., A CERTIFIED COPY /~\"' ~ c-.i'~ ATTEST: 04/15/2024 :8 . ~: THOMAS A. WILDER \n\\t, :<: DISTRICT CLERK \n·-:-...,, ~;lTA~4:o{JIITY, TEXI \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 2131
    },
    {
      "page_number": 30,
      "text": "EXHIBIT B \nORIGINAL PETITION \nFOR DIVORCE 12/18/23",
      "char_length": 50
    },
    {
      "page_number": 31,
      "text": ".. \nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA \nCause Number. 322 7 4 ,, 2 6 3 23 \nIn the Matter of the Marriage of \nIn the _____ _ \nPetitioner: Morgan Michelle Myers (Court Number) \nPrint first, middle and last name of the spouse who filed for divorce. \n19-District Court And D County Court at Law \nRespondent: Charles Dustin Myers TarrantCounty.Texas \nPrint first, middle and last name of other spouse. \nAnd in the Interest of: \n(Print the Initials of each child you and your spouse have together who Is under 18 or still In high school.) \n1. Mara Evonne Myers 2. Caroline Rose Myers 3. \n4. ----------- 5. ------------ 6. -----------\nOriginal Petition for Divorce \nPrint your answers. \nMy name is: Morgan Michelle Myers \nFirst \nI am the Petitioner, the person asking for a divorce. Middle Last \nThe last three numbers of my driver's license number are 579 ..................... My driver's license was \n-issued in (State): ..a.1'.=exa=s'---------­\nor □ I do not have a driver's license number. \nThe last three numbers of my social security number are: 893. \nor □ I do not have a social security number. \nMy spouse's name is:-'C'-h...:.a.;..;.rle.c..s;;...D;;;..;;..us;;,.;ti;.;..;.n...:.M'\"\"yc.;;e_rs ______________________ __,.--,---\nFirst Middle Last \nMy spouse is the Respondent \n1. Discovery Level \nThe discovery level in this case, if needed, is Level 2. \n2. Legal Notice (Check one box.) \n0 I think my spouse will sign a Waiver of Service (or Answer). Do not send a sheriff, constable, or \nprocess server to serve my spouse with a copy of this Petition for Divorce at this time. \n(9' I will have a sheriff, constable, process server or clerk serve my spouse with this Petition for Divorce \nhere: \n6641 Anne Court, Watauga, Texas 76148 \nStreet Address City State Zip \nIf this is a work address, name of business:. ____________________ _ \nI ask tlie clerk to issue a Citation of Service (the form necessary to provide legal notice to my spouse by \n\"Official Service of Process·). I understand that I will need to pay the fee (or file a Statement of Inability \nto Afford Payment of Court Costs if I am unable to pay the fee) and arrange for service. \nD I cannot find my spouse. I ask that my spouse be served by publication. I understand I must file an )> \n-rt .,, -0 \n~ ---i \n0 .,, -z \n► \nOJ \nAffidavit for Citation by Publication and hire a lawyer to serve as attorney ad !item form .~~;~;:;~;.-.. A CERTIFIED copy \n/'.,\"' ,:.<[;~ ATTEST: 04/15/2024 :8 ~:'frHOMASA.WILDER \n\\t, ~ ... Ll'!n :-</ DISTRICT CLERK \n••~., ~lrARRANT COUNTY, TEXI \n•.:o s .•• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 2596
    },
    {
      "page_number": 32,
      "text": "• \n3. Jurisdiction \n3A. County Residence Requirement \n(Check all boxes that apply.) \nf9' I have lived in this county for the last 90 days. \ng' My spouse has lived in this county for the last 90 days. \nD I am serving in the armed forces or other government \nservice outside of Texas, but this county has been the \nhome county of either my spouse or me for at least 90 \ndays. \nD I have accompanied my spouse who is serving in \nthe armed forces or other government service outside of \nTexas, but this county has been the home county of either \nmy spouse or me for at least 90 days. \n38. Texas Residence Requirement \n(Check all boxes that apply.) \n~ I have lived in Texas for the last six months. \nG:YMy spouse has lived in Texas for the last six months. \nD I am serving in the armed forces or another government service outside of Texas, but Texas is the \nhome state of either my spouse or me and has been for at least 6 months. \nD I have accompanied my spouse who is serving in the armed forces or another government service outside \nof Texas, but Texas is the home state of either my spouse or me and has been for at least 6 months. \n3C. Personal Jurisdiction over Spouse \n(Check one box.) \n• g' My.spouse lives in Texas. \nD My spouse does not live in Texas. (Check any boxes that apply below.) \nD My spouse agrees that a Texas court can make orders in this divorce, including orders regarding \nconservatorship (custody), visitation, and financial support of our children and orders regarding our \nproperty and debts. My spouse will file a Waiver of Service (or Answer). \nD Texas is the last state where we lived together as a married couple. This Petition for Divorce is filed \nless than two years after we separated. \nD The children live in Texas because of my spouse's actions. \nD My spouse has lived in Texas with the children. \nD My spouse has lived in Texas and provided prenatal expenses or support for the children. \nD My spouse had sexual intercourse in Texas, and the children may have been conceived by that act \nof intercourse. \nD · Our child was born in Texas and my spouse registered with the paternity registry maintained by the \nbureau of vital statistics or signed an acknowledgment of paternity. \nD My spouse will be personally served with citation (official service of process) in Texas.",
      "char_length": 2305
    },
    {
      "page_number": 33,
      "text": "_4. Dates of Marriage and Separation \nMy spouse and I got married on or about: .::.;Ju:.:IY....::.20:::..th \n...... -=2\"\"'0..:.;15=------------------\nMonth Day Year \nWe stopped living together as spouses on or about :._D..;e=ce=m ........ be __ r_1 __ st .... , =20=2=3 _____________ _ \nMonth Day Year \n5. Grounds for Divorce \nI ask the Court to grant me a divorce. The marriage has become insupportable due to discord or conflict of \npersonalities that destroys the legitimate ends of the marital relationship and prevents any reasonable \nexpectation of reconciliation. \n6. Children \n6A. Children Husband and Wife Have Together \nMy spouse and I are the parents of the following children who are under 18 years old Qr over 18 years old \nand still in high school. \n(You MUST list all children you and your spouse have together (adopted or biological) who are under 18 or over \n18 and still In high school.} \nChild's name \n1. Mara Myers \n2. Caroline Myers \n3. \n4. \n5. State where child \nDate of Birth Place of Birth lives now \n_e_12_0_11_e_F_t._w_o_rth _________ T--e=x=a __ s ___ _ \n_4_11_21_1_8 F_t._W_ort_h _________ T-=e=x=a __ s ___ _ \n6. ______________________________ -------\n68. Jurisdiction over Children \n(Check one box.} \ng' The children live in Texas now and have lived in Texas for at least the past 6 months or since birth. \nD The children do not live in Texas now, but they have been gone from Texas for less than 6 months. \nThe children lived in Texas the 6 months before they moved. A parent or person acting as a parent \ncontinues to live In Texas. \nD None of the above apply. \n(Check box below only If true.} \nD There are no court orders about any of the children listed above. No other court has continuing \njurisdiction over this case or the children. \n··•••••••••·· ••-•0~1\"-'Rll-1-\\-)-°•, A CERTIFIED COPY \n/:;;\"' ~; ~\\1 ATTEST: 04/15/2024 :8 • i: THOMASA.WILDER \n~t, . ·•<J DISTRICT CLERK \n••~.., ~;o'TARRANT COUNTY, TEXJ \n••,:Q 1:o ,.•• BY: Is/ Catherine Saenz \n••••···•••",
      "char_length": 1995
    },
    {
      "page_number": 34,
      "text": "• 6C. Children's Property \n(Check one box.) \ng-' The children do not own any property of significant value in their own name. \nD The children own the following property of significant value in their own name: \n6D. Conservators~ip (Custody) of the Child{ren) \nI ask the court to make conservatorship {custody) orders as follows: (Check a, b, or c.) \na. D Mother and Father should be Joint Managing Conservators of the child(ren) and: \n(If you checked a, check a-1, a-2, or a-3.) \na-1.0 Father should have the exclusive right to designate the primary residence of the child(ren) \nwithin the following geographic area: (Check one box below.) \nD anywhere. . D this county. D this county or county adjacent to this county. \nD Texas. • D other:. ______________ _ \na-2.Q\" Mother should have the exclusive right to designate the primary residence of the child(ren) \nwithin the following geographic area: (Check one box below.) \nD anywhere. D this county. GJ,1his county or county adjacenttothis county. \nD Texas. D other:. _____________ _ \na-3. D Neither parent should have the exclusive right to designate the primary residence of the \nchild(ren) but both parents should be ordered not to move the child(ren) out of the following \ngeographic area: (Check one box below.) \nD this school district:._________ D this county. \n0 this county or county adjacent to this county. 0 other:. _________ _ \nb. 0 Mother should be the Sole Managing Conservator of the child(ren) with the exclusive rights \nlisted in Texas Family Code 153.132 including the exclusive right to designate the primary \nresidence of the child(ren) anywhere. \nc. 0 Father should be the Sole Managing Conservator of the child(ren) with the exclusive rights listed \nin Texas Family Code 153.132 including the exclusive right to designate the primary residence of \nthe child(ren) anywhere. \n6E. Child{ren)'s Passports (Check only if applicable.) \n5Y1 ask the Court to order that I have the exclusive right to apply for and renew passports for the child(ren) . \n. ••11•:;;~;Rii;:;;•••• A CERTIFIED COPY \n/::,\" ~\"' ~\\ ATTEST: 04/15/2024 : 8 . % : hHOMAS A. WILDER \n\\t, .-</ DISTRICT CLERK \n\"•:.,_,, ~;:TARRANT COUNTY, TEX/ \n•••:?.•••••••••••• BY: /s/ Catherine Saenz",
      "char_length": 2216
    },
    {
      "page_number": 35,
      "text": "6F. Possession of and Access to the Child(ren) (Visitation) \nI ask the court to make possession and access (visitation) orders as follows: (Check a, b, c, or d.) \na. ~ Father should have •standard visitation.• (See Texas Family Code Chapter 153, Subchapter F.) \nb. 0 Mother should have •standard visitation.• (See Texas Family Code Chapter 153, Subchapter F.) \nc. 0 •standard visitation• would be unworkable or inappropriate. Possession and access to the \nchild{ren)should be as follows: \nd. 0 I am concerned about the safety of the children with the other parent: I ask that \n(If you checked d, check all that apply below.) \nd-1. 0 exchanges of the child{ren) be supervised, or in the alternative, be in a public place. \nd-2. D the other parent's possession of the child{ren)' be limited to day visits. \nd-3. 0 the other parent's possession of the child{ren) be supervised. \nd-4. 0 the other parent have no right to possession or access to the child{ren). \nd-5. 0 the other parent be ordered not to use alcohol or illegal drugs 24 hours prior to or during \npossession of the child{ren). \nd-6. 0 the other parent's possession and access to the children be restricted as follows: \n(Check only if you are asking that a different possession order be in place while a child is under 3 years old.) \n0 One or more of the children is under 3. Until the child turns 3, possession should be as follows: \nAfter the child turns 3, possession should be as checked above. \n(Check only if applicable.) \n0 1 am concerned that the other parent may take the child(ren) to another country and refuse to return \nthem. I ask the Court to determine if there is a risk of international kidnapping by the other parent and \nto take such measures as are necessary to protect the child{ren). \n6G. Child Support, Medical Support, and Dental Support for the Child(ren) \nI ask the court to make appropriate orders for the financial support of the child{ren), including regular child \nsupport, medical support, dental support and, if supported by the evidence, retroactive child support. \n•■••;;;~;:;~;•.. A CERTIFIED COPY \n:°::,~ ~· 'i,\\ ATTEST: 04/15/2024 \n{8 . %\\ 1THOMAS A. WILDER tt :<: DISTRICTCLERK \n• \"•:.,_. :1/..e>;lTARRANT COUNTY, TEXJ \n••.to ~~•• BY: /s/ Catherine Saenz \n••······•• •",
      "char_length": 2266
    },
    {
      "page_number": 36,
      "text": "' • \n7. Is the wife pregnant? \n(Check one box.) \ng\" The wife in this marriage is not pregnant \nD The wife in this marriage is pregnant. I understand that I cannot finish the divorce until after the child is \nborn. • \n(If the wife is pregnant, also check one box below.) \nD The husband Is the father of this child. I ask the court to include orders for custody, visitation, child \nsupport, and medical and dental support for the child in the Final Decree of Divorce. \nD The husband Is not the father of this child. I understand that paternity of the child must be \nestablished before I can finish the divorce. \n8. Did the wife have a child with another man while married to the husband? \n(Check one box. Fill in the requested information, if applicable.) \n19' The wife did not have a child with another man while married to the husband. \nD The wife did have a child with another man while married to the husband. All of the children born \nduring the marriage that are not the Husband's adopted or biological children are named below: \n1. \n2. \n3. \n4. \n5. \n6. Child's name Age Date of Birth Sex \n(If the wife had a child or children with another man during the marriage, check one box below,) \nD Paternity of the child(ren) named above has not been established. I understand that paternity of the \nchild(ren) must be established before I can finish my divorce. \nD Paternity of the child(ren) named above has been established: \n(Check one box.) \nD A court order has established that another man is the biological father and/or the Husband is not \nthe biological father of the child(ren) listed above. I understand I must attach a file-stamped copy \nof the court order to my Final Decree of Divorce. \nD An Acknowledgement of Paternity was signed by the biological father and a Denial of Paternity \nwas signed by the Husband for the child(ren) listed above. I understand I must attach a copy of \nthese documents to my Final Decree of Divorce. \n. .. \n11.~;;:.:R~'.;;.-.. _ A CERTIFIED COPY \n/:::,\"' ~- ~~ ATTEST: 04/15/2024 :8 i11rHOMAS A. WILDER \n~t :<: DISTRICT CLERK \n••~. ~~/TARRANT COUNTY. TEXJ \n... ✓, ~~-· •••?.••••••••••• BY: Isl Catherine Saenz",
      "char_length": 2146
    },
    {
      "page_number": 37,
      "text": ". . \n9. Protective Order Statement (Check the appropriate boxes. Fill in the requested information.) \n~A. No Protective Order \nD I do not have a protectiv~ order against my spouse and I have not asked for one. \nD My spouse does not have a protective order against me and has not asked for one. \n138. Pending Protective Order \n@\" I have filed paperwork at the courthouse asking for a protective order against my spouse, but a \njudge has not decided if I should get il I asked for a protective order on ..:.12:::l..:.1..:.a4/2c=.:.0=23~~--­\noate Filed \nIn Tarrant County, Texas . The cause number is. ___________ _ \nCounty State Cause Number \nIf I get a protective order, I will file a copy of it before any hearings in this divorce. \nD My spouse has filed paperwork asking for a protective order against me, but a judge has not \ndecided if my spouse will get it. My spouse asked for a protective order on -~--,,,,.,...~--­\nDate Filed \nin. _______ county, _____ . The cause number is. __________ _ \nCounty State Cause Number \nIf my spouse gets a protective order, I will file a copy of it before any hearings in this divorce. \n9C. Protective Order in Place \nD I do have a protective order against my spouse. I got the protective order in _____________ county,, __________ on. _______ _ \nCounty State Date Ordered \nThe cause number for the protective order is·----,,--~---,,-----------­\ncause Number \nEither I have attached a copy of the protective order to this petition or I will file a copy of it with the \ncourt before any hearings in this divorce. \nD My spouse does have a protective order against me. The protective order was made in _____________ county,, __________ on. ________ _ \nCounty State Date Ordered \nThe cause number for the protective order is. __________________ _ \nCause Number \nEither I have attached a copy of the protective order to this petition or I will file a copy of it with the \ncourt before any hearings in this divorce. \n10. Waiver of Waiting Period Based on Family Violence (Check only if applicable.) \nfS2r I ask the Court to waive the 60-day waiting period for divorce because: (Check one box.) \n0 My spouse has been convicted of or received deferred adjudication for a crime involving family \n. violence against me or a member of my household. \n~ I have an active protective order or an active magistrate's order for emergency protection against \nmy spouse because of family violence during our marriage. The order includes a finding that my \n• spouse committed family violence.",
      "char_length": 2510
    },
    {
      "page_number": 38,
      "text": ".• . . \n11. Property and Debt \n11A. Community Property and Debt \nIf my spouse and I can agree about how to divide the property and debts we got during our marriage, I ask \nthe Court to approve our agreement. If we cannot agree, I ask the Court to divide our community property \nand debts according to Texas law. • \n11 B. Separate Property \nI own the following separate property. I owned this property before I was married, or I received this property \nas a gift or inheritance during my marriage or I received this property as recovery for personal injuries that \noccurred during the marriage (not including any recovery for lost wages or medical expenses). I ask the \nCourt to confirm this property as my separate property. \n(Fill in all lines. If you have no property to list in a particular category, write \"none.\") \nHouse located None ______________________________ _ \nStreet Address City State Zip \nLand located at: None. ___________________________ _ \nStreet Address City State Zip \nCars, trucks, motorcycles, or other vehicles \nYear Make \n2023 Mazda \n2021 Mazda Model \nCX-5 \nCX-3 Vehicle Identification No. [VIN]­\nJM3KFBCM1 P0135569 \nOther money or personal property I owned before I was married, received as a gift or inheritance during my \nmarriage or property I purchased during my marriage with separate property funds: None \nMoney I received as recovery for personal injuries that occurred during the marriage that was not for Jost \nwages or medical expenses: _N ___ o ___ n=e _________________________ _ \n······;······ •-~of-r\" R:¼,-\"•. ACERTIFIEDCDPY \nf°:o\"' ~; <'i\"\\1 ATTEST: 04/15/2024 :8. :z: THOMASA.WILDER \n\\t, .~ j DISTRICT CLERK \n••:.,.,, ::,,p:hARRANT COUNTY, TEXJ \n•••:? ~;~• BY: /s/ Catherine Saenz \n•••···•••",
      "char_length": 1733
    },
    {
      "page_number": 39,
      "text": ", \n' . \n12. Name Change \n(Check one box.) \nD I am NOT asking the Court to change my name. \ng\" I ask the Court to change my name back to a name I used before my marriage. I am not asking the \ncourt to change my name to avoid criminal prosecution or creditors. I ask that my name be changed to: \nMorgan Michelle Wilson \nFirst \nThe children: (Check all that apply.) \nD have private health Insurance. Middle Last \nName of insurance company: ________________________ _ \nPolicy number: ________________ Cost of premium:$ ______ _ \nName of person who pays for insurance: ____________________ _ \nThe insurance policy [il; (runot available through the parent's work. \nD have health insurance through Medicaid. \nD have health insurance through C.H.1.P. Cost of premium (if any):$ ___________ _ \n19\" do not have health insurance. \nIf the children do not have private health insurance also complete the following: \nPrivate dental insurance D is ~is not available to Father at a reasonable cost. \nPrivate dental insurance D is 19\"is not available to Mother at a reasonable cost. \n13. Dental Insurance Availability for Children \nThe child(ren): (Check all that apply.) \nD have private dental Insurance. \nName of insurance company: ________________________ _ \nPolicy number: ________________ Cost of premium: $ ______ _ \nName of person who pays for insurance: ____________________ _ \nThe insurance policy D is D is not available through the parent's work. \nD have dental insurance through Medicaid. \ng' do not have dental insurance. \nPrivate dental insurance Dis~ not available to Father at a reasonable cost. Private \ndental insurance D is gis not available to Mother at a reasonable cost \n··•••••••••·· ••m•o~\"t\"~-\\->-°'•• A CERTIFIED COPY \n:°::,<: ~\"\" \"o\\ ATTEST: 04/15/2024 \n{8 · • iihHOMASA.WILDER \n\\t, .-<J DISTRICTCLERK \n·-~.. ~;hARRANT COUNTY, TEX/ \n•••:?. .. , ..... •••• BY: /s/ Catherine Saenz",
      "char_length": 1889
    },
    {
      "page_number": 40,
      "text": "14. Public Benefits \n(Check any boxes that apply.) \nts?' The child(ren) have Medicaid now or had it in the past \ng' The child(ren), or someone on behalf of the child(ren), get TANF (Temporary Assistance for Needy \nFamilies) now or got it in the past. \n~5. Family Information \n(Check only if applicable.) \ng' I believe my children or I will be harassed, abused, seriously harmed or injured or otherwise subjected \nto family violence if I must give my spouse the information checked below for myself and the \nchild(ren): \nD home address, D mailing address, D employer, D work address, \ng,'home phone, (;Jwork phone, 0 social security no., 0 driver's license#. \nI ask the Court to Order that I not have to give this information or notice of changes in this information to \nmy spouse. I also ask the Court to keep this information confidential. • \n16. Request for Judgment \nI ask the Court to grant my divorce. I also ask the Court to make the other orders I have asked for in this \nPetition and any other orders to which I am entitled. \n➔ \nDate \n\\ \nPetitioner's Name (Print) Phone \n. (el,4{ ANtJf C1 v.Jk'f /nJGA \n. Mailing Address \nEmail Address: VVlO( Wi {3-f@tnall. uni? City \nFax (if available) \ndivorce proceedings. If I don't, any notices about this case Including the dates and times of \nhearings-will be-sent to me at the malling address· or email address above. \n17. Certificate of Service to the Office of the Attorney General (OAG) \nI certify that a true copy of this Petition was served on the Office of the Attorney General Child Support \nDivision* in person, by certified and first-class mail, by commercial delivery service, by fax, by email, or \nthrough the electronic file manager on this date. \n➔ \nPetitioner's Signature Date \n··•••••••••·· ••-•o~'TAAA-t-1,;.. A CERTIFIED COPY \nl::,\"' ~-<o••, ATTEST: 04/15/2024 \ni 8 i \\1fHOMAS A. WILDER \n~\\j . :<J DISTRICT CLERK \n••~_, '.(?::lTARRANTCOUNTY, TEXJ \n•••:? f.••• BY: /s/ Catherine Saenz \n••••••••",
      "char_length": 1960
    },
    {
      "page_number": 41,
      "text": "EXHIBIT C \nINITIAL RULING 01/16/2024",
      "char_length": 36
    },
    {
      "page_number": 42,
      "text": "322-744263-23 \n322ND FAMILY DISTRICT COURT R.,;,,,,1,/.,'cA,-.. FILED \nAs 8 a A'l'E O xoaE;s 8 ~ '\"hi' - r TARRANT couNTY .n :art • , ~ 1117/2024 2:28 PM \n. 7//// e:2. i ..._ ~ THOMASA. WILDER CA USE NUMBER: 322 -Y-T v \" -°' :> ! DISTRICT CLERK \n~Z2 • 7 'It/ '-.(1)3-\"3 , ITMOTMO/INRE \nfYJ&r50..11 (IIJ. my~r6 § \n~6 ~ IN THE DISTRICT COURT \n, TARRANT COUNTY, TEXAS \nDlarlrs IJ... 111,rr:s ~ \nRESET DATE AND TIME: __ Jt.;;...:;.~~J,t=Ul)=-r_,,7_:J._;{-1-/ _z:..~,&_.b_;::;o<~c/_,____,IA=-f-;..__._=...9_: ~-~~a~-1.\"-.;.__-'-' __ 322ND JUDICIAL DISTRICT \n1. Appearances: \nif Petitioner/Niovant appeared in person and +,3 a:tto111e~_..;/;;;___~ __ $_:._,,.. ________ _ \nC!t'Respondent appeared in person and by atturney __ ~_.,,._~ __ 6_e_. ________ _ \n□-------------------------------\nAGREED AS TO FORM AND SUBSTANCE: \nAttorney for Petitioner Attorney for Respondent \nRespondent \nDate ••■•;;;~:.:;~~••• A CERTIFIED COPY --------- ·~ o• /:,\"' ~ ci,\\-i,A,n,IIE....,.51-t'!,, 04~, 1~12024 i 8 · ~i THOMAS A. WILDER ~t · :<: DISTRICT CLERK \n••:.-,. ~;hARRANT COUNTY, TEXJ \n•••:?. ........ •••• BY: /s/ Catherine Saenz",
      "char_length": 1111
    },
    {
      "page_number": 43,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 83494135 \nFiling Code Description: No Fee Documents \nFiling Description: Rendition \nStatus as of 1/17/2024 4:23 PM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email TimestampSubmitted Status \nMORGAN MICHELLEMYERS morganmw02@gmail.com 1/17/2024 2:28:44 PM SENT \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email TimestampSubmitted Status \nCHARLES MYERS chuckdustin 12@gmail.com 1/17/2024 2:28:44 PM SENT \n•••m•~;~i'.~R~'.;;.-... A CERTIFIED COPY \nl;:,... ~-~\\ ATTEST: 04/15/2024 \n:8 . 1: THOMAS A. WILDER \n\\t, :<! DISTRICT CLERK \n••:.,, ~,.e,:hARRANTCOUNTY, TEXJ \n•••~? t;•• BY: /s/ Catherine Saenz \n••••·•••",
      "char_length": 1039
    },
    {
      "page_number": 44,
      "text": "EXHIBIT D \nASSOCIATE JUDGE'S REPORT \n01/22/24",
      "char_length": 45
    },
    {
      "page_number": 45,
      "text": "322ND FAMILY DISTRICT COURT \nASSOCIATE JUDGE'S REPORT \nCAUSE NUMBER: 322-7 l/ 'j.S-3.8,..:;). 2 FILED \nTARRANT COUNTY \n1/23/2024 8:14 AM \nTHOMAS A. WILDER \nDISTRICT CLERK \nITMOTMO/INRE N{ 322-744538-23 \n___,/vl'---'--'o\"'-L/!_,__, o\"--'-tt-!...-<V __ _,_~-1_E.._lf_S ~ IN THE DISTRICT COURT \n// vQ § TARRANT COUNTY, TEXAS \n__ t:,,_h_1_r_1?_7 __ M~v_r_oL_s ~ 322ND JUDICIAL DISTRICT \n<J JI I('\\ A<::) 'i Af~.· OCJ /}. AA, RESET DATE AND TIME: __ {J'--J-_,.__c::1-_v_v____;_______;;~...L...L--..--'-~_._,___,_ v1 ___ _ \n1. Appearances: \n'12KPetitionerfl\\1:ovant appeared in person and by attorney ~o Pe-1 L 1 <f TM \n~ Respondent appeared in person and by attorney ;}:24d/ 25((' e ~ J (..S \n□-------------------------------\n2. Issue(s): D Custody D Visitation D Child Support D Health Insurance D CPS \nK-.J)/<15fl« u,cff. a IIP/\"1(-9 J. Af!I-r::s, /,o. \n3. Order(s) or Agreement(s): /210'11/t1\"' {;;/ Cc11v7? A/ V ~a,c;, (;> 'f vF,,/2-R \n%oihf:;~;;p;· 7;4? ';5o;:c9J~'f~ ca;);;;;:Y \nd> P Ii~ ~:-flr/4,.,v . ~~ rr D ¾ JI!-NZ Cf Z:1 ~ Y,, c:c.c l,r-5e,,WJtyl I~ \nIZ Es ffr/P ~ r ,v 7 ~ 421< Ii-; ¢ 4 (v rJ /J r CJ p--o -f+' dr, ?tR r,, /{/ ; ~~ \n&t h6 ti/ Jpvµ~ \"Cf1 W1-74rzM1 IT ,,, \n' \n~£~ ~spondent \n(ii--ifl-_;· \nRespondenV' \nSO ORDERED: \n~=-:::::::::: \n322nd Associate Judge \n1(22-hJ \nDate",
      "char_length": 1289
    },
    {
      "page_number": 46,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 83674346 \nFiling Code Description: No Fee Documents \nFiling Description: \nStatus as of 1/24/2024 8:13 AM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email TimestampSubmitted \nMORGAN MICHELLEMYERS MORGANMW02@GMAIL.COM 1/23/2024 8:14:14 AM \nCooper Carter COOPERCARTER@MAJADMIN.COM 1/23/2024 8:14:14 AM \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email TimestampSubmitted Status \nCHARLES MYERS chuckdustin12@gmail.com 1/23/2024 8:14:14 AM SENT \nDaniel Bacalis DBACALIS@DBACALIS.COM 1/23/2024 8:14:14 AM SENT Status \nSENT \nSENT \n-~~;;.;:;~;•.. A CERTIFIED COPY \n/\"_,+ 'ti\\ ATTEST: 04/15/2024 \n; 8 ~: THOMAS A. WILDER :t :<: DISTRICT CLERK \n••:.,.,, ~lrARRANTCOUNTY, TEXJ \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1145
    },
    {
      "page_number": 47,
      "text": "EXHIBIT E \nASSOCIATE JUDGE'S REPORT \n02/01/24",
      "char_length": 45
    },
    {
      "page_number": 48,
      "text": ".• \n322-7 44263-23 \nlj>{gVJ{f) FILED \nTARRANT COUNTY \n2/8/2024 2:29 PM \nTHOMAS A. WILDER \nDISTRICT CLERK \nASSOCIATE JUDGE'S REPORT FOR TEMPORARY ORDERS \n(Suit Affecting the Parent-Child Relationship, Property and Debts) \nDIVORCE WITH CHILDREN \nCAUSE NUMBER: 322-7 lf r 2 a 3 -;;)._ 2 \n' \nIyer? \nMy~C? I § \n§ \n§ IN THE DISTRICT COURT \nTARRANT COUNTY, TEXAS \n322ND JUDICIAL DISTRICT \nRESET DATE: ______________________________ _ \n1. Appearances: \n~itioner/Movant appeared in person and by attomey_~c:::;..·,><;f)..,,6\"-,/Zi,F--l,-[_,('-----:::-Y=~-R..;:_:cffi......._~~~---\nc.x,kespondent appeared in person and by attomey ___ _,:l)=--.;'1:....,....;.AJ=-----~~___,;;..,cf:;,--=C;;........./f- ..... f ..... r_S=-----\n( ) ____________________________ _ \n2. Temporary Conscrvatorship: \nA. ~oint Managing Conservators: Primary Possession to v\\1'Mother ( )Father ( )Other: _____ _ \n~other and Father have the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, 153.074 \n( )Other has the rights and duties under TEX. FAM. CODE ANN. §§ 153.073, 153.074 \n( )Mother ( )Father ( )Other have the rights, duties and privileges as set forth in TEX. FAM. CODE \nANN.§ 153.132 except as follows: \nThe {)efMother ( )Father ( )Other shall have the exclusive right to establish the residence of the \nchild(ren) and residence of the child(ren) will be Tarrant County or counties contiguous to \nTarrant County, TX and/or ______________________ _ \nThe ~other-':iJFather ( )Other are enjoined from removing the child(ren) from Tarrant County \nor counties contiguous to Tarrant County, TX for the purpose of establishing the residence of the \nchild(ren) and/or _________________________ _ \nThe right to make educational decisions shall be by the ~Mother ( )Father ( )Other. \n•••■•:;;;:.:;;;~~;_-... A CERTIFIED COPY \n:::,+ ~\"\" <'.'o~ ATTEST; 04/15/2024 \n1 )t-----------::/3 · ~i THOMASA. WILDER \\; ' :<J DISTRICT CLERK \n••~ ~:TARRANT COUNTY, TEXJ \n••~?. ...... ~••• BY: /s/ Catherine Saenz",
      "char_length": 1968
    },
    {
      "page_number": 49,
      "text": "The right to make invasive surgical decisions shall be by mutual consent of the partied and failing \nto agree by the (,{)Mother ( )Father ( )Other. The term \"invasive\" means elective surgical \ndecisions. \nThe right to receiv~ child support shall be by the~)Mother ( )Father ( )Other ______ _ \nB. ( )Sole Managing Conservator: ( )Mother ( )Father ( )Other: ______________ _ \n( )Possessory Conservator: ( )Mother ( )Father ( )Other: ________________ _ \n( )Mother ( )Fa~her ( )Other have the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, \n153.074 \n( )Mother ( )Father and/or ( • )Other have the rights, duties and privileges as set forth in TEX. FAM. \nCODE ANN.§ 153.132. \n( )Residency Restriction to ( )Tarrant County ( )Tarrant & contiguous counties. \n3. Temporary Possession Schedule: \n( )Texas Standard Family Code TEX. FAM. CODE ANN.§§ 153.311 THROUGH 153.316. All \npossession times begin and end at 6:00 p.m. except for Thursdays which ends at 8:00 p.m. \nWexas \"Extended\" Standard Family Code TEX. FAM. CODE ANN.§§ 153.311 THROUGH 153.316. \nAll possession times begin and end at the time school recesses or begins. Thursdays overnight, during the \nregular school year. • \n( )Other:. ______________________________ _ \n0:}Mother ( )Father ( )Other shall surrender the child to the other person at the residence of ~other \n( )Father ( )Other at the beginning of each period of possession. \n• ( )Mother (~ather ( )Other shall surrender the child to the other person at the residence of ( )Mother \n~ather ( )Other at the end of each period of possession. \n4. Temporary Child Support: \n( )Mother AfFather shall pay through the Texas State Disbursement Unit, P.O. Box 659791, San \nAntonio, TX 78265-9791 of$ q ,23, / CJ per h1 CJ)( JCfz beginning 1!./.-I -~\"J.. Y \n•••■•;_;;;'..:~~'.;;:... A CERTIFIED COPY \n] :.,., w ~•. ATTEST: 04/15/2024 2 11-------------:!8 . ~\\ THOMAS A. WILDER !t .-</ DISTRICTCLERK \n••:., ~M,hARRANT COUNTY, TEXI \n••~o ~• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 1986
    },
    {
      "page_number": 50,
      "text": "Medical Insurance on Child Provided by: \nInsurance Cost Paid by: \nUncovered Medical, Dental & Vision Costs: \n5. Additional Orders: ( )Mother ( J~ther \n( )Mother~ather \n¥qually ( ), ____________ _ \n-------------------------\n6. Temporary Spousal Support: A./ /r. \n( )Wife ( )Husband shall pay direct to Spouse $. ______ per ______ beginning \n7. Temporary Possession of Property: / \nHusband: (217 :i I d~& I> 1: 3:.; IJ.t 5 /f A5 o -w./ ~tf'-\n9--cJ C) r v (:Ary a2 02 :z Mt a--P 1 Ck -o l! r IJ?e .1) • \n,kc~IJ'd'v/Jb'f ~ V/H:2f(P ho~t +f W& YI /jAJ!i.? ~l'-J-\nUllt:t?f(I c 4 by fi1 ,1 ~ cfi .:L 7 ;;)e) ;;? Y , \n••■•~;~'..:~~'.;;••• A CERTIFIED COPY \nl::,°' w,; '°'o\\ ATTEST: 04/15/2024 \n) . :o c:.• 3 ._ ________ _.:t.i · ~i THOMASA. WILDER \n~l:j • ;</ DISTRICT CLERK \n••~.s,. _.'.¢;,lTARRANTCOUNTY, TEXJ \n•••?. •••••• ;:.•• BY: /s/ Catherine Saenz",
      "char_length": 847
    },
    {
      "page_number": 51,
      "text": "8. Temporary Payment of Debts and Bills: \nHusband: His living expenses: C, ,f-(f' f 1/1/7 V 0 \nh;$ N: &p(I'(// Jf1;/d&vrc \nhr-:r \nba «cs# 11, \n9. Temporary Injunctions: \n~utual Temporary Injunctions as to Persons pursuant to the Texas Family Practice Manual. \n~utual Temporary Injunctions as to Property pursuant to the Texas Family Practice Manual. \n-rft L. f -'H' ft// h, Co l'Z1 ~ ,</A// 2:-t-~ \n10. MISCELLANEOUS: \n.wine pa~i7s are to attend \"Children in the Middle\" part 1 and/or 2 by __.5/\"\"\"'---1--tL-L-Ll_~____,1/- __ and to file a \ncertificate with the Court. Each to pay for their own costs. \n~either party shall consu~~. use· or have in their poss~ssion any.illegal drug or drugs at any_ time nor shall \nthey have, at any time, a legal drug or drugs in their possession for which that party does not have a \nprescription. \nNeither party shall consume alcohol at least 12 hours prior to their time for possession of the child(ren). \nNeither party shall consume alcohol during their period of possession with the child(ren). \nNeither party shall attend one of the child(ren)'s activities if they have consumed alcohol or they are \nunder the influence of alcohol. \nNeither party shall leave the child(ren) with a person who is consuming alcohol at least 12 hours prior to \ntaking possession of the child(ren) or has in their possession an illegal drug(s), including prescription drugs, \nas a childcare provider. No disparaging remarks in the presence of the child(ren) and no discussion of \nlitigation or issues of the case with the child(ren). \n•••■•:;;;;:;;;~:;;_- .. , A CERTIFIED COPY \n) I::,._. ~- C'o'• ATTEST: 04/15/2024 4 .. ___________ ....;:{3 . \\1.THOMAS A. WILDER \n\\t, .-</ DISTRICT CLERK \n••~ ~lTARRANTCOUNTY, TEX.I \n••~? ~-••• BY: Isl Catherine Saenz \n••••·•••",
      "char_length": 1782
    },
    {
      "page_number": 52,
      "text": "y(1ne parties are not to discuss the litigation or issues with the child(ren) about the other party. The \naforementioned sentence means that neither party shall belittle, talk bad, refer to the other party using a \nprofane name or names, profanity or curse words. \nThe parties are not to discuss the litigation or issues with the child(ren). This paragraph presumes the \nchild(ren) is old enough to communicate with a party. The aforementioned sentence means that neither party \nshall discuss what occurred in Court including the testimony of any witness or witnesses with the child(ren). \nA party is allowed to reasonably offer an age-appropriate statement to discuss the effect of an Order with \nthe child(ren)_ with a brief statement or sentence. For ~~ample, a party is not allowed to show a document to \nthe child(reh}°\"and attempt to comprehensively discuss the ca·se in detail with the child(ren). \nA typed written Order conforming to this Report will follow within 20 days from the date this \nReport is signed. The Temporary Order shall be prepared by P./f 11./ j3 tf-cd: f✓.,5 . \nEach attorney should approve the Order. The parties do not need to approve the Order. The \nattorney reviewing the proposed Order shall have five (5) days to do so. There arc no ten (10) day \nletters. If an agreement is not reached, a Motion to Sign shall be filed and set within thirty (30) days \nfrom the signing of this Report. \ncy for.Petitioner \nPctd.£4/2. \nSO, ORDERED: \n---322ND Associate Judge AGREED AS TQ. FORM AND SUBSTANCE \n5 o!.Z£ol~ \nRespondent ~ \n•••■•~;~;:;~~'.;;_-... -A CERTIFIED COPY \nI:::,+ ~-'t,•. ATTEST: 04/15/2024 \n) :o . c:.• :u . ~; THOMAS A. WILDER r--------------.\\~ .'<j DISTRICTCLERK \n•.~_,, ;::::.•TARRANT COUNTY, TEXJ \n•••?. ••.••• t•• BY: /s/ Catherine Saenz",
      "char_length": 1779
    },
    {
      "page_number": 53,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 84305097 \nFiling Code Description: No Fee Documents \nFiling Description: AGO AJ REP \nStatus as of 2/8/2024 3: 12 PM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email \nCooper L.Carter coopercarter@majadmin.com \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email \nDaniel Bacalis service@dbacalis.com \nTammy L.Johnson tjohnson@dbacalis.com \nDaniel R.Bacalis dbacalis@dbacalis.com \nCHARLES MYERS chuckdustin 12@gmail.com TimestampSubmitted Status \n2/8/2024 2:29:20 PM SENT \nTimestampSubmitted Status \n2/8/2024 2:29:20 PM SENT \n2/8/2024 2:29:20 PM SENT \n2/8/2024 2:29:20 PM SENT \n2/8/2024 2:29:20 PM SENT \n··•••••••••·· ••m•o~'fAR~>•• A CERTIFIED COPY \n:'.:,+ ~--~\\ ATTEST: 04/15/2024 \n{8 · i1 THOMASA.WILDER \\t :<J DISTRICTCLERK \n•.;-_,.,, ~;hARRANT COUNTY, TEXI \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1235
    },
    {
      "page_number": 54,
      "text": "EXHIBIT F \nNOTICE OF TERMINATION OF \nLEGAL COUNSEL \n02/05/2024",
      "char_length": 62
    },
    {
      "page_number": 55,
      "text": "322-7 44263-23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY \nMORGAN MICHELLE MYERS, \nPlaintiff, \nv. \nCHARLES DUSTIN MYERS, \nRespondent. \nCause Number: 322-744538-23 \nNOTICE OF TERMINATION OF LEGAL COUNSEL \nTO THE CLERK OF THE COURT AND ALL PARTIES OF INTEREST: FILED \nTARRANT COUNTY \n2/5/2024 8:36 PM \nTHOMAS A. WILDER \nDISTRICT CLERK \nPlease take notice that I, Charles Dustin Myers, the Respondent in the above-captioned matter, have \nterminated the legal services of Mr. Daniel R. Bacalis as my counsel of record, as communicated with Mr. \nBacalis on 02/05/2024 at 3:09 P.M. CST via e-mail communications. \nThis notice is filed pursuant to the applicable rules and regulations governing legal representation and is \nintended to ensure no delay in the proceedings due to this change. \nI will represent myself prose until further notice. If I retain new legal counsel, a notice of appearance will \nbe filed accordingly. \nKindly update the court records to reflect this change and direct all future correspondence related to this \ncase to my attention via the contact method of preference listed below. \nThis notification is provided directly to the court due to the time-sensitive nature of the ongoing matters \nin this case. \nI will ensure all future correspondence and legal documents are filed in accordance with local court rules \nand within the set deadlines. \nShould there be any required actions or additional information needed from my end, please do not \nhesitate to contact me directly. \nRespectfully submitted, \nIsl CHARLES DUSTIN MYERS \nCHARLES DUSTIN MYERS \n6641 Anne Court \nWatauga, Tx 76148 \n817-507-6562 \nchuckdustinl2@gmail.com \n••■•~;~~R~;•.. A CERTIFIED COPY \nl.:,°' ~-· ~---ATTEST: 04/15/2024 •o - c.• :O . !j: THOMAS A. WILDER \n\\ t, :<: DISTRICT CLERK \n••:.-,. ~~hARRANT COUNTY, TEXJ \n••.:o s\"'!;~• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1858
    },
    {
      "page_number": 56,
      "text": "CERTIFICATE OF SERVICE \nI hereby certify that a true and correct copy of the foregoing Notice of Termination of Legal Counsel has \nbeen furnished to all counsel of record on this 5th day of February, 2024 via e-mail. \nIsl CHARLES DUSTIN MYERS \nCHARLES DUSTIN MYERS \n6641 Anne Court \nWatauga, Tx 76148 \n817-507-6562 \nchuckdustin12@gmail.com \n..• ~~;~:.:R~i;.-... A CERTIFIED COPY \n:J-~-~•• ATTEST: 04/15/2024 • c• :8 . ~: THOMAS A. WILDER \n~t, :<: DISTRICT CLERK \n••:.,_,, ~;hARRANTCOUNTY, TEXJ \n•••:?.•••••••••••• BY: Isl Catherine Saenz",
      "char_length": 537
    },
    {
      "page_number": 57,
      "text": "EXHIBIT G \nRESPONDENT'S EMERGENCY \nMOTION TO VACATE 02/09/24",
      "char_length": 60
    },
    {
      "page_number": 58,
      "text": "**THIS 15 NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY** FILED \nTARRANT COUNTY \n2/9/2024 3:17 PM \nTHOMAS A. WILDER \nDISTRICT CLERK NOTICE: THIS DOCUMENT \nCONTAINS SENSITIVE DATA \nCause No. ___ .=C..::::.a.:::;us::..::e\"'\"'Nc..:.o:=..:·:...:3=2=2c....:-7-'4'-'4=2=63=--=2=3------\nMORGAN MICHELLE MYERS \nV \nCHARLES DUSTIN MYERS § \n§ \n§ \n§ In the (check one): \n[x] 322nd District Court \nD County Court at Law No. __ \n_ ___,_,TA:..,.R~RA,_,_,_,_N_,_T __ County, Texas \nMotion for Reconsideration and to Vacate Temporary Orders \nPrint your answers \nMy name is: \nCHARLES \nFirst \nI am the □ Petitioner DUSTIN MYERS \nMiddle Last \nocl Respondent in this case and request the Court grant \nth is motion for _ __;_;R..:;_ec::..:o:..:..n.:..:::s..:..:id.:..:::e.:....:ra::..:t.:..:::io\"'\"\"n...::a:.;.:n.=.d..:.;to::........:..V-=-ac::..::a:..:.te::........:..T..:;_em:...:.=p..::..;or.:..:::a\"\"'ry,.._O.=..:..:rd=-=e.:....:rs=------· In support, the \n(title of motion) \nfollowing is shown: \nSEE ATTACHED MOTION \n··m•c:;~:.:R~'.;;.-.. A CERTIFIED COPY \nl::,4c ~_; ~\\ ATTEST: 04/15/2024 \n{8 'i\\ THOMAS A. WILDER it _:j!f ~ISTRICT CLERK \n••~. ~~/rARRANTCOUNTY, TEXJ \n• ~✓, • \n•••Q ••• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1206
    },
    {
      "page_number": 59,
      "text": "Respectfully submitted, \n► Isl Charles Dustin Myers \nYour Signature \nCharles Dustin Myers \nYour Printed Name \n6641 ANNE cm JRT \nMailing Address \nCHUCKDUSTIN12@GMAIL.COM \nEmail Address 2024-02-09 \nDate \n817 -507 -6562 \nPhone \nWAIAIIGA \nCity \nFax # (if any) \nNotice of Hearing IX \nState 76148 \nZip \nThe above motion is set for hearing on ________ at _____ .M. in \n___________________________ (designation and location of court). \nSIGNED on ---------------\nJudge or Clerk ••m•~;~'.a:Rii~;.-.. A CERTIFIED COPY \n/::,\" ~--'o\\ ATTEST: 04/15/2024 :8 . ~: THOMAS A. WILDER !t . :<:f 3JISTRICT CLERK \n••:.,, ::;,-..e,;lTARRANTCOUNTY, TEXJ \n•••~? t~•• BY: /s/ Catherine Saenz \n••••·•••",
      "char_length": 675
    },
    {
      "page_number": 60,
      "text": "Certificate of Service \nI certify that I delivered a copy of this document to each party in this case, or if a party \nis represented by a lawyer to the party's lawyer, by: (Check one or more) \nD Hand delivery to the other party _________________ _ \nD Hand delivery to the other party's lawyer _______________ _ \n[xi Email to this email address COOPERCARTER@MAJADMIN.COM \n□Regular mail to this address: ____________________ _ \nD Certified mail to this address: -----------------------\nD Commercial delivery service (for example FedEx) to this address: \nD Fax to fax #: -----------------------------\n/s/ Charles Dustin Myers 2024-02-09 \nSignature Date \n••m•c:;;'.-:i~;.-.. A CERTIFIED COPY \n/_,\"' ~,: c{\\ ATTEST: 04/15/2024 \n:8. ,~J ~: THOMASA.WILDER :~ :<Jf 3:JISTRICT CLERK \n\\~1. :V...e>;ITARRANTCOUNTY, TEXJ \n••.:o C::~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 858
    },
    {
      "page_number": 61,
      "text": "**THIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY** \nNOTICE: THIS DOCUMENT \nCONTAINS SENSITIVE DATA \nCause No. ------------------\n§ In the (check one): \n§ D ___ District Court \n§ D County Court at Law No. __ \n§ _______ County, Texas \nOrder on Motion for --------------------\nOn the Court heard the Motion for ------------------(date) \nof ----------------- ----------------(title of motion) (name of person who filed the motion) \n□ IT IS ORDERED that the motion is GRANTED \nSIGNED on -----------------\nJUDGE PRESIDING \n•••-•o\";~i'.~'.;;_-... A CERTIFIED COPY \n/~ ••• 01~ ATTEST: 04/15/2024 \n: 8 . ~ ?i: THOMAS A. WILDER \\t .1~J :<::f 1DISTRICT CLERK \n••~_,, ~,e,;hARRANTCOUNTY, TEX/ \n••.:Q ~;.• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 736
    },
    {
      "page_number": 62,
      "text": "IN THE 322nd DISTRICT COURT OF TARRANT COUNTY \nSTATE OF TEXAS \nMorgan Michelle Myers, \nPetitioner, \nV. \nCharles Dustin Myers, \nRespondent Cause No. 322-744263-23 \nEmergency Motion to Reconsider \nEvidence and to Vacate Temporary \nOrders \nThis motion urgently calls for the Court's intervention to address critical procedural \nmissteps in the matter of cause# 322-744263-23, aiming to reinstate the safety and stability \nthat our children rightfully deserve until due process and all facts of the case can be considered \nby the Court. I am seeking immediate court intervention to correct procedural errors and \naddress the misuse of the legal system by the Petitioner. This motion highlights the significant \nimpact of the Petitioner's actions on our children's welfare and my unjust removal from our \nhome based on frivolous claims. \nIn pursuit of justice and the well-being of the children at heart, I respectfully request that \nthe Court reconsider all details, weighing the comprehensive scenario presented herein along \nwith the supporting evidence. I am committed to the highest interests of my children and \nfamily, striving to resolve these matters efficiently and avoid unnecessary judicial expenditure. \nThis document seeks to unveil the Petitioner's deliberate misrepresentation and misuse of the \nlegal system, which has gravely disrupted our children's stability and emotional well-being by \nweaponizing the court system. \n1 On December 1st, 2023, the Petitioner announced her desire for a divorce with no plan in place to preserve our \nfamilial stability, with no desire for counseling or communication, and with no consideration of the timing around \nthe holiday season, nor any sign of marital discord warranting such a decision leading up to this announcement. \n2 Between December 14th, 2023, and December 22nd, 2023, the Petitioner filed for an Emergency Protective \nOrder, a Divorce Petition, a Protective Order, and instigated an Eviction suit. \n.••m•~;~'.,'.i,~'.;;•... A CERTIFIED COPY \n:_,., ~· i•. ATTEST: 04/15/2024 • c.• : 8 . ~: THOMAS A. WILDER :t . :<! DISTRICT CLERK \n••~1 ~~hARRANTCOUNTY, TEXJ \n•••~? t~•• BY: /s/ Catherine Saenz \n••••••••",
      "char_length": 2168
    },
    {
      "page_number": 63,
      "text": "NATURE OF SUITS AND THIRD-PARTY INFLUENCE \n1. On December l5t, 2023, Petitioner announced the divorce with no plan in place for the \nchildren, no sign of marital discord leading up to this point to warrant such a decision, \nand no desire for counseling, communication, and no consideration for the time of year. \n2. Between December 1st, 2023, and December 12th, 2023, all efforts are exhausted in an \nattempt to communicate with the Petitioner which lead to the subsequent discovery of an \nalarming volume of text messages that were directed towards two individuals -Debbie \nPrice and Darnen Kazlauskas, showing a significant level of influence.3 \n3. On December 12th, 2023, After the discovery of the communications between these two \nindividuals combined with the irrational behavior from the Petitioner during such a \ncritical time of year, I reached out to the Petitioner's grandfather via text message. 4 \n4. On December 13th, 2023, Petitioner states she will be going to talk to her Grandparents \nalone. This conversation lasts between 9:55 and 1:30 A.M. \n5. On December 14th, 2023, Petitioner filed for an Emergency Protective Order. This order \nwas denied by the court. \n6. On December 15th, 2023, Petitioner involves her family into the situation. \nParticularly, Dan Branthoover became involved. He is the boyfriend of the Petitioner's \nMother. Shortly thereafter, I received a notice from our joint bank account stating that \n$1,576 had just been withdrawn. As our bank statement for December 2023 will \ndemonstrate -the transaction record shows the funds being transferred directly to Mr. \nBranthoover's PayPal account. 5 \n3 See attached EXHIBIT A.1 - A true and accurate copy of the AT&T text logs filtered by relevant parties. Parties \ninclude Merne, Papaw, Darnen, Debbie, and Dan. Dates and times surrounding the case will corroborate with other \nevidence presented herein. See page 456 -458. \n4 See attached EXHIBIT A.2 - A true and accurate copy of the referenced text message in paragraph 3. \n5 See attached EXHIBIT A.3 -The true and accurate bank statement reflecting the transaction referenced in \nparagraph 6. \n-2-\n.. ~c:;~AR~;•... A CERTIFIED COPY \nl~ ('>~~ ATTEST: 0411512024 \n:8 ~: THOMAS A. WILDER !t :<! DISTRICT CLERK \n••i.i; ~~hARRANTCOUNTY, TEX/ \n••• Q '>!;•• BY: Isl Catherine Saenz \n••••···•••",
      "char_length": 2325
    },
    {
      "page_number": 64,
      "text": "7. On December 16th, 2023, Petitioner's transaction under the advice of Mr. Branthoover \nlead to our joint bank account becoming $-800 overdrawn. I requested from Mr. \nBranthoover via text message that he needs to return the funds immediately, where he \nsubsequently admits to this transaction having occurred. 6 \n8. On December 17th, 2023, Petitioner's grandmother, Margie Wilson, initiates an Eviction \nSuit by serving me an eviction notice around 11:00 AM CST. \n9. On December 18th, 2023 -Petitioner writes \"VOID\" on the Eviction Notice, and \nphysically tears it in half. 7 \n10. On December 19th, 2023, Mr. Branthoover uses intimidation tactics by impersonating an \nattorney despite having no license to practice law in the State of Texas.8 \n11. On December 27th, 2023, I am served the Divorce Papers by the Constable. \n12. On December 28th, 2023, I am served the Protective Order, followed by the Eviction \nshortly thereafter by the Constable. \nThe Protective Order (Show Cause) hearing was set for January 16th, 2024, and the Eviction \nhearing for January 17th, 2024. \nThe documented timeline of events, particularly during the holiday season, underscores a \nnotable disregard for our children's welfare. This has enabled the Petitioner to inappropriately \nutilize the judicial system to disrupt the stable environment our children have known, \ninfluenced significantly by third-party actions as previously detailed. The forthcoming section of \nthis motion will highlight the specific frivolous claims and false statements found within each \nfiling initiated by the Petitioner. \n6 See attached EXHIBIT A.4 -Overdrawn account notice from PNC bank on December 161\\ 2023. \n7 See attached EXHIBIT A.5 -The physically torn and voided Eviction notice served on December 171h, 2023. \n8 See attached EXHIBIT A.6 -Mr. Branthoover refers to Petitioner as \"his client\" while having no license in law. \n-3-\n··•••••••••·· ••-•o~,-t-R~,_••• A CERTIFIED COPY \n/_,4.-~--i\\ ATTEST: 04/1512024 \n: /3 ~: THOMAS A. WILDER \n: t, :< ! DISTRICT CLERK \n••~.. ~~hARRANTCOUNTY, TEXJ \n• ~✓• • •••? ,••• BY: Isl Catherine Saenz \n••••·•••",
      "char_length": 2114
    },
    {
      "page_number": 65,
      "text": "FRIVOLOUS CLAIMS AND FALSE STATEMENTS \nA. EMERGENCY PROTECTIVE ORDER \n1. As mentioned above, Petitioner filed for an Emergency Protective Order on \nDecember 14th, 2023. This protective order was denied by the courts. \n2. Due to the fact this order was not granted by the court, one could conclude that \nthere was not a clear and present danger of family violence.1 \nB. THE DIVORCE PETITION \n1. Petition was filed on 2024-12-18 under an Affidavit of Inability to pay.2 \n2. The Petitioner's action of filing for divorce under an Affidavit of Inability to pay \nthree days after transferring $1,576 to herself starkly contravenes the mandates \nset forth in Chapter 10, Section 10.001 of the Civil Practice and Remedies Code. This \nsection asserts that each claim or legal contention must be warranted by existing \nlaw or a nonfrivolous argument for the modification of existing law or the \nestablishment of new law, and that each factual contention has or is likely to have \nevidentiary support after further investigation or discovery3• \n3. The Petitioner violated Chapter 10, Section 10.001 a second time within the \nsame document when she intentionally elected to waive the 60-day waiting \nperiod claiming to have an active protective order against me that found family \nviolence had occurred during our marriage4 despite being denied such an order \njust five days prior on December 1'4th, 2023. \n5. The final page of the Divorce Petition for service to the Office of the Attorney \nGeneral was left unsigned by the Petitioner. \n1 TEXAS FAMILY CODE, TITLE 4, SUBTITLE B, CHAPTER 83, Sec. 83.001 \n2 See attached EXHIBIT B.l -A True and Accurate copy of the Divorce Petition for all references made in regard to \nthis document. \n3 CIVIL PRACTICE AND REMEDIES CODE, TITLE 2, SUBTITLE A, CHAPTER 10, Sec. 10.001. \n4 TEXAS FAMILY CODE, Sec. 6.405 -The petitioner shall attach to the petition a copy of each order described by \nSubsection (a)(l). No such order, as required, was attached to the divorce petition, because no such order exists. \n-4-\n·•·;:.:R~··· ,-;_of Iv/•, A CERTIFIED COPY \n/_,\"' ~\\ ATTEST: 04/15/2024 \n: 8 ~: THOMAS A. WILDER \n\\\\j :<! DISTRICT CLERK \n••:.--s, ~/TARRANT COUNTY, TEXJ \n•••:?. ....... ••••• BY: /s/ Catherine Saenz",
      "char_length": 2239
    },
    {
      "page_number": 66,
      "text": "C. EVICTION SUIT \n1. The suit was unlawful by nature5, as the grounds for eviction were based on \nfamily status, referencing the divorce as well as a protective order that had been \ndenied on December 14th, 2023. The suit was dismissed for lack of jurisdiction on \nJanuary 17th, 2024. 6 \nD. PROTECTIVE ORDER \n1. This suit was the second attempt by the Petitioner to have me removed from \nthe home, which ultimately succeeded. \n2. The claims within this suit mentioned sexually aggressive comments and \nthreatening behavior. These allegations are materially false, as the Petitioner \npossesses no evidence, and has presented no evidence in relation to these claims \nsince the initiation of the suit. Despite this, as video and image evidence will show \nonce a fair trial date is set, the Petitioner and I continued to maintain stability at \nour family home and preserved the sense of normalcy that our daughters have \nbeen accustomed to their entire lives up until January 16th, 2024. \nThe Court's decision to remove me from my home and my children's lives on January \n16th, 2024, albeit preliminary and unjustified, bypassed the safeguarding of the children's \nemotional, psychological, and physical well-being. This oversight is compounded by the \nPetitioner's actions. The juxtaposition of the Court's decision against the backdrop of the \nPetitioner's inattention to the children's needs illuminates a disconcerting disregard for the \nparamount principle that custody determinations should primarily serve the children's best \ninterests. The final section of this motion will highlight the procedural aspects of the events \nunfolding between the dates of January 16th, 2024, and February l5t, 2024, and pray the court \nwill rectify this situation by restoring the stability to our family by vacating the current \ntemporary orders that are in place until a proper investigation can be completed by the courts. \n5 TEXAS RULES OF CML PROCEDURE -RULE 6 -Suits initiated on a Sunday are invalid. \n6 See attached EXHIBIT B.2 - A true and accurate copy of the Eviction Dismissal. \n-5-\n··•••••••••·· •-~o~1\"-'~,.••• A CERTIFIED COPY \n/:;;4< ~-'o\\ ATTEST: 04/15/2024 :8 . ~: THOMAS A. WILDER !t :<: DISTRICT CLERK \n•,:.,_,, ~..L\"°';hARRANTCOUNTY. TEXJ \n••.:Q s\"!;•• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 2295
    },
    {
      "page_number": 67,
      "text": "THE PROTECTIVE ORDER HEARINGS \n1. In preparation for the Protective Order hearing on January 16th, 2024, I filed with the \nCourt an answer to the Protective Order on January 2nct, 2024 as well as two motions - a \nmotion to consolidate the divorce with the protective order, filed on January 4th, 2024, as \nwell as a motion of continuance, filed on January 8th, 2024 for the purpose to acquire \ncounsel due to the complex nature of the case.1 All three filings were accepted by the \ncourt. \n2. On January 16th, 2024, both parties sought additional time to secure legal \nrepresentation. Despite not reviewing any evidence, witness testimonies, or documents \nrelated to the motions, and acknowledging the denial of a previous Emergency Protective \nOrder, the court mandated my departure from our home within four hours. This \ndecision, unexpectedly made, awarded custody to the Petitioner, overlooking my \nconcerns about the adverse effects on our children and my work from home. This ruling, \nwhich both parties did not sign, set the case to resume on January 22nd, 2024, to allow \ntime for obtaining counsel. 2 \n3. Following the court's directive, I relocated to my father's residence in Flower Mound until \nthe subsequent hearing. During this interval, the Petitioner did not take the initiative to \nhave the children call once and did not provide any information as to how they were \ndoing, showcasing her lack of empathy and concern for our children's well-being and \nstability. After incurring substantial expenses to secure representation, I detailed my case \nand concerns to my attorney, preparing for the next court appearance. \n4. On January 22nd, 2024, the Petitioner chose to seek legal representation just minutes \nbefore the hearing was due to start, indicating a disregard for the process. My lawyer \nrecommended agreeing to a continuance, thereby extending the period I couldn't work \nand impacting our established family dynamics. This resulted in a third hearing being set \nfor February 1st, coinciding with my birthday, and a second rendition being ordered. 3 \n1 See attached EXHIBIT C.1 -A true and accurate copies of all referenced filings in paragraph 1. \n2 See attached EXHIBIT C.2 -A true and accurate copy of the unsigned rendition ordered on January 16th, 2024. \n3 See attached EXHIBIT C.3 - A true and accurate copy of the second rendition ordered on January 22nd, 2024. \n-6-\n··•••••••••·· ••-•o~'T\"~>-°•• ACERTIFIEDCOPY \nf::,+ ~\"\" ~\\ ATTEST: 04/15/2024 :8 . ~: THOMAS A. WILDER !t :</ DISTRICT CLERK \n0•!.,J· ~f.?TARRANT COUNTY, TEXJ \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 2604
    },
    {
      "page_number": 68,
      "text": "5. On February 1st, 2024, during the third hearing, the substantive issues I had raised were \nnot addressed, nor was there any exchange of evidence between our legal representatives. \nDespite the focus of the hearing supposed to be on the protective order, the discussions \nveered into custody and child support matters. My lawyer presented the sole option of a \ntemporary return to the family home for 30 days with expanded visitation rights, coupled \nwith a child support obligation starting in April. This outcome, which diverged significantly \nfrom the case's core issues, compelled me to reconsider my legal representation. \nConsequently, I decided to terminate my attorney's services and embarked on drafting this \nmotion myself, aiming to bring the court's attention back to the pivotal elements of the case \nthat had thus far been neglected while able to legally reside in my home. \nCONCLUSION AND PRAYER \nIn conclusion, this motion has laid bare the stark realities and procedural aberrations that have \nmarred the essence of justice and due process in the matter of Cause No. 322-744263-23. \nThrough the course of these proceedings, it has become abundantly clear that the actions taken \nby the Petitioner, Morgan Michelle Myers, have not only disregarded the welfare and best \ninterests of our children but have also illuminated her unfitness as a parent. Her actions speak \nto a pattern of deceit, manipulation, and ari unsettling willingness to leverage the judicial \nsystem for personal vendettas, all at the expense of the emotional and psychological well-being \nof our children. \nThe court, in its decisions, inadvertently facilitated this troubling trajectory by removing me, \nCharles Dustin Myers, from the lives of our children based on unsubstantiated claims and \nwithout due consideration of my role as a devoted and stable parent. This oversight has not \nonly disrupted the lives of our children but has also significantly impaired my ability to provide \nfor them, casting a long shadow over their future stability and welfare. \nMoreover, the conduct of my Counsel involved has further compounded these issues, \ndemonstrating a distressing disregard for the intricate dynamics and facts of this case. This has \nculminated in a situation where the paramount importance of the children's best interests and \nthe fundamental principles of fairness and justice have been overshadowed by procedural \nmissteps and a lack of thorough investigation into the Petitioner's fitness as a parent. \n-7-\n•••;:.:R~·•· .-:_of ,\\,,.\"•. A CERTIFIED COPY \n/_,4-- to\\ ATTEST: 04/15/2024 \n: 8 ~: THOMAS A. WILDER \n~t, :<! DISTRICT CLERK \n••:-,,, ~_ff.fTARRANTCOUNTY, TEXJ \n••.:o ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2719
    },
    {
      "page_number": 69,
      "text": "Therefore, it is with a heavy hearted yet unwavering resolve that I implore the Court to take \nimmediate and decisive action to rectify these wrongs. Specifically, I respectfully request the \nCourt to: \n1. Vacate the existing temporary orders that unjustly removed me from my home and \nseparated me from my children, restoring the status quo ante until a thorough and \nunbiased evaluation of the facts can be conducted, as the Texas Constitution requires. If \nleft as it stands, these orders will further compound the issues at hand, and will \nexacerbate the chaos introduced into the children's lives. \n2. Set a fair hearing date to delve into the substantive issues at hand, ensuring that all \nparties are given an equitable opportunity to present their case and that the best \ninterests of our children are placed at the forefront of all considerations. \n3. Scrutinize any response or new claims from the Petitioner or her counsel with the utmost \ndiligence, given the established pattern of deceitful and manipulative behavior exhibited \nby the Petitioner throughout these proceedings. \n4. Consider awarding me full custody of our children, ensuring their continued access to a \nstable, nurturing environment, and the consistent provision of their needs, which I am \nfully committed to upholding. Furthermore, in alignment with my enduring belief in the \nimportance of both parents in the lives of our children, I pledge to facilitate and \nencourage a healthy, constructive relationship between the children and their mother, \nprovided she demonstrates a genuine commitment to their well-being and stability. \n5. In seeking these remedies, I do so not out of vindictiveness but from a place of deep \nconcern for the welfare of our children and a steadfast belief in the principles of justice \nand fairness. Despite the pain and turmoil of these proceedings, my ultimate desire is for \npeace and the best possible outcome for all parties involved, most importantly, our \nchildren. It is my sincere hope that the Court will recognize the gravity of the situation \nand act in a manner that prioritizes the well-being of our children, ensuring their return \nto a life marked by stability and love. \nI affirm under penalty of perjury that all claims herein are true and accurate to the best of my \nknowledge. \nRespectfully submitted on this 9th day of February 2024, \nIsl Charles Dustin Myers \nCharles Dustin Myers \nChuckdustin12@gmail.com \n-8-\n••-•o\";;AR~'.;;_-.. A CERTIFIED COPY \n/:;;;\"' ~• 0i\\ ATTEST: 04115/2024 : 8 -~: THOMAS A. WILDER \n~t, :<: DISTRICTCLERK \n-.i.,.,. ~~/TARRANT COUNTY, TEXJ \n•,.o 'i'!;•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2647
    },
    {
      "page_number": 70,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 84359156 \nFiling Code Description: Motion (No Fee) \nFiling Description: EMERGENCY MOTION TO RECONSIDER EVIDENCE \nAND VACATE TEMPORARY ORDERS \nStatus as of 2/9/2024 4:27 PM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email TimestampSubmitted \nMORGAN MICHELLEMYERS morganmw02@gmail.com 2/9/2024 3:17:19 PM \nCooper L.Carter coopercarter@majadmin.com 2/9/2024 3:17:19 PM \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email TimestampSubmitted Status \nDaniel Bacalis service@dbacalis.com 2/9/2024 3:17:19 PM SENT \nTammy L.Johnson tjohnson@dbacalis.com 2/9/2024 3:17:19 PM SENT \nDaniel R.Bacalis dbacalis@dbacalis.com 2/9/2024 3:17:19 PM SENT \nCHARLES MYERS chuckdustin 12@gmail.com 2/9/2024 3:17:19 PM SENT Status \nSENT \nSENT \n.··m·~;~:.:R;;~:;;.-.. _ A CERTIFIED COPY \n:::,\"' ~-- <'o•• ATTEST: 04/15/2024 \n{8 -- ~\\ THOMAS A. WILDER tt :<: DISTRICTCLERK \n••J..Jl ~..l:\"'°:lrARRANT COUNTY, TEX/ \n•••:? t;•• BY: /s/ Catherine Saenz \n••••·•••",
      "char_length": 1364
    },
    {
      "page_number": 71,
      "text": "EXHIBITH \nNOTICE AND UNSWORN \nDECLARATION 03/04/24",
      "char_length": 50
    },
    {
      "page_number": 72,
      "text": "322-7 44263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY \nSTATE OF TEXAS FILED \nTARRANT COUNTY \n3/4/2024 12:00 AM \nTHOMAS A. WILDER \nDISTRICT CLERK \nMorgan Michelle Myers, Cause No. 322-744263-23 \nPetitioner, \nV. \nNOTICE AND UNSWORN DECLARATION \nCharles Dustin Myers, \nRespondent \nMarch 3, 2024 \nDear Clerk of the Court, \nThis letter is submitted on behalf of the Respondent in the above-referenced case to \nprovide the court with an update on the Respondent's efforts to uphold the well-being of \nthe children under the current agreed arrangements pending review and to navigate the \ncomplexities of this case. The following reasons why it is impossible for the Respondent \nto vacate the family home under the current agreement pending review are as follows: \n1. Since the inception of the case, the Respondent's primary focus has been to reset \nthe status quo ante for the benefit of the children, ensuring their lives remain as \nnormal and uninterrupted as possible during this transitory period after it was \nsignificantly disrupted beginning on January 161h, 2024. Despite the challenges \nposed by the non-suited protective order and the dropped allegations of family \nviolence which were the foundations of all decisions made within this case, the \nRespondent has respected the orders pending review, and has strived to provide a \nstable and supportive environment for his children during his designated time, all \nwhile planning a transition that best suits his children. \n2. During the short amount of time the Respondent has been re-instated to his home, \nthe Petitioner has, on multiple occasions, entered the residence unannounced and \nwithout prior consent, actions which stand in stark contrast to her prior requests \nfor protection which have governed this case. \n··•i:m:·.•· ,,;._co~ -.........-vv/•, A CERTIFIED COPY \nf°::i\"' 'b\\ ATTEST: 04/15/2024 \n:8 %: THOMASA. WILDER !t :<! DISTRICT CLERK \n',J..\"\" ~;lTARRANTCOUNTY, TEX/ \n•••:?. ........ •••• BY: /s/ Catherine Saenz",
      "char_length": 1992
    },
    {
      "page_number": 73,
      "text": "3. The Petitioner has changed employers since the signing of the agreement. \n4. Petitioner has relinquished custody of the children to the Respondent on multiple \ndays during her scheduled time, showcasing the Respondent's ability to care for \nhis children at any time given his at-home work schedule specifically crafted to \nensure participation in every aspect of his children's lives remains possible. \n5. The Respondent must dedicate substantial time to researching and understanding \nlegal procedures to ensure compliance with court rules and to advocate effectively \nfor the best interests of his children. He is prepared to present all relevant facts \nand evidence at the upcoming hearing on March 14th, should his partial summary \njudgment not be accepted. \n6. The Respondent has made efforts over the past 30 days to maintain normalcy for \nhis children, showcasing his dedication to their well-being. The Respondent has \nmaintained an amicable relationship with the Grandparents residing next-door, \nallowing frequent access during his time with the children to visit and attend \nchurch, maintaining normalcy and peace. \n7. The choice to remain outside the home is a deliberate decision by the Petitioner \nduring the transition period. Self-hosting and advertising is an essential . \nrequirement for my at-home operations, which is essential to maintain the quality \nof life our children are accustomed to. Multiple alternative housing options are \navailable to the Petitioner, including the house next door. \nThe Respondent remains committed to following the court's directives and ensuring the \nbest possible outcomes for his children. He appreciates the court's attention to these \nmatters and is ready to provide further information or clarification as needed. \nMy name is Charles Dustin Myers my date of birth is 02-01-1991, and my address is 6641 \nAnne Court, Watauga TX, 76148, United States. I declare under penalty of perjury that the \nforegoing is true and correct. \nExecuted in Tarrant County, TX on this 3rd day of March 2024. \n/s/ Charles Dustin Myers \nCharles Dustin Myers, Declarant \n••m•c:;;.~i,~~••, A CERTIFIED COPY \nf'.:,+ ~ 0i\\ ATTEST: 04/15/2024 \n:8 '~\" ~: THOMAS A. WILDER t~ :<j DISTRICT CLERK \n\\~_, :V~.\"TARRANTCOUNTY, TEXJ \n••.:Q ~~•• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 2304
    },
    {
      "page_number": 74,
      "text": "Certificate of Service \nI certify that a true copy of the Notice and Unsworn Declaration was served in \naccordance with Rule 21a of the Texas Rules of Civil Procedure on 2024-03-03 to: \nMorgan Michelle Myers, Petitioner \nBy electronic filing manager/email at MORGANMW02@GMAIL.COM \nCooper Carter, Attorney \nBy electronic filing manager/email at COOPERCARTER@MAJADMIN.COM \n/s/ Charles Dustin Myers \nCharles Dustin Myers \nRespondent \n6641 Anne Court \nWatauga, Tx 76148 \n817-507-6562 \n••■•~;;.'..:it~;_-., A CERTIFIED COPY \nl_,., ~·· <o\\ ATTEST: 04/15/2024 •o ~• it; · !j: THOMAS A. WILDER \n~t :<: DISTRICT CLERK \n'•:.,. ~,.e.,;hARRANT COUNTY, TEXI \n• ~✓- s\"\"~--···?. ...... ••••• BY: /s/ Catherine Saenz",
      "char_length": 700
    },
    {
      "page_number": 75,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 85135431 \nFiling Code Description: Notice \nFiling Description: Notice/ Unsworn Declaration \nStatus as of 3/4/2024 9:02 AM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email \nMORGAN MICHELLEMYERS morganmw02@gmail.com \nCooper L.Carter coopercarter@majadmin.com \nAssociated Case Party: CHARLESDUSTINMYERS TimestampSubmitted Status \n3/3/2024 11 :56:06 PM SENT \n3/3/2024 11 :56:06 PM SENT \nName BarNumber Email TimestampSubmitted Status \nCHARLES MYERS chuckdustin 12@gmail.com 3/3/2024 11 :56:06 PM SENT \n••m•~;~:.:i~;.-.. A CERTIFIED COPY \nl.::,\" ~-C6\\ ATTEST: 04/15/2024 .,..., c.• \n: /j . ~: THOMAS A. WILDER !t :<! DISTRICT CLERK \n\"•:.,,, ~,£,;/TARRANT COUNTY, TEXJ .... .,. ~~-· •••?.••••••••••• BY: /s/ Catherine Saenz",
      "char_length": 1136
    },
    {
      "page_number": 76,
      "text": "EXHIBIT I \nCURRENT TEMPORARY ORDERS \n(ASSOCIATE JUDGE JEFFREY \nKAITCER) 03/14/24",
      "char_length": 80
    },
    {
      "page_number": 77,
      "text": "IN THE MATTER OF \nTHE MARRIAGE OF \nMORGAN MYERS \nAND \nCHARLES MYERS \nAND IN THE INTEREST OF 322-744263-23 \nCAUSE NO. 322-744263-23 \nIN THE DISTRICT COURT FILED \nTARRANT COUNTY \n3/26/2024 3:19 PM \nTHOMAS A WILDER \nDISTRICT CLERK \n322ND JUDICIAL DISTRICT \nMARA MYERS AND CAROLINE \nMYERS, CHILDREN § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ TARRANT COUNTY, TEXAS \n1JC TEMPORARY ORDERS \nOn February JI, 2024, the Court heard Petitioner's motion for temporary orders. \nAppearances \nPetitioner, MORGAN MYERS, appeared in person and through attorney of record, \nCooper L. Carter, and announced ready and signed an Associate Judge's Report regarding \nAgreed Temporary Orders. \nRespondent, CHARLES MYERS, appeared in person and through attorney of record, \nDaniel Bacalis, and announced ready and signed an Associate Judge's Report regarding Agreed \nTemporary Orders. \nThe parties have agreed to the terms of this order as evidenced by the signatures below. \nJurisdiction \nThe Court, after examining the record and the agreement of the parties and hearing the \nevidence and argument of counsel, finds that all necessary prerequisites of the law have been \nlegally satisfied and that the Court has jurisdiction of this case and of all the parties. \nChildren \nThe following orders are for the safety and welfare and m the best interest of the \n•••m•c:;;'..:~'.;~•••, A CERTIFIED COPY \n/;:;;'t-~-i\\ ATTEST: 04/1612024 :8 . ~: THOMAS A. WILDER \n~t, :</ DISTRICT CLERK \n••:.,_,, ~..e,;:°TARRANTCOUNTY, TEXJ \n••.:<:t S\"'!~~• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1528
    },
    {
      "page_number": 78,
      "text": "following children: \nName: \nSex: \nBirth date: \nHome state: \nName: \nSex: \nBirth date: \nHome state: \nConservatorship MARAMYERS \nFemale \n7 years \nTexas \nCAROLINE MYERS \nFemale \n5 years \nTexas \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS are appointed \nTemporary Joint Managing Conservators of the following children: MARA MYERS and \nCAROLINE MYERS \nIT IS ORDERED that, at all times, MORGAN MYERS, as a parent temporary joint \nmanaging conservator, shall have the following rights: \n1. the right to receive information from any other conservator of the children \nconcerning the health, education, and welfare of the children; \n2. the right to confer with the other parent to the extent possible before making a \ndecision concerning the health, education, and welfare of the children; \n3. the right of access to medical, dental, psychological, and educational records of \nthe children; \n4. the right to consult with a physician, dentist, or psychologist of the children; \n5. the right to consult with school officials concerning the children's welfare and \neducational status, including school activities; \n6. \nfield trips; the right to attend school activities, including school lunches, performances, and \n7. the right to be designated on the children's records as a person to be notified in \ncase of an emergency; \n8. the right to consent to medical, dental, and surgical treatment during an \n······rt· ..... \n••-•c,~'tl>. 11.,-\\>»••• ACERTIFIEDCOPY \n:\"_,4' ,~\"\" 'f,\\ ATTEST: 04/16/2024 \n{8 . • ~i THOMAS A. WILDER \n~t, -'<! DISTRICTCLERK \n••~, +\";;hARRANTCOUNTY, TEXJ \n• ~✓• ~ • . •••?. •••••• ::••• BY: /s/ Catherine Saenz",
      "char_length": 1628
    },
    {
      "page_number": 79,
      "text": "emergency involving an immediate danger to the health and safety of the children; and \n9. the right to manage the estates of the children to the extent the estates have been \ncreated by the parent's family or by the parent, other than by the community or joint property of \nthe parent. \nIT IS ORDERED that, at all times, CHARLES MYERS, as a parent temporary joint \nmanaging conservator, shall have the following rights: \n1. the right to receive information from any other conservator of the children \nconcerning the health, education, and welfare of the children; \n2. the right to confer with the other parent to the-extent possible before making a \ndecision concerning the health, education, and welfare of the children; \n3. the right of access to medical, dental, psychological, and educational records of \nthe children; \n4. the right to consult with a physician, dentist, or psychologist of the children; \n5. the right to consult with school officials concerning the children's welfare and \neducational status, including school activities; \n6. \nfield trips; the right to attend school activities, including school lunches, performances, and \n7. the right to be designated on the children's records as a person to be notified in \ncase of an emergency; \n8. the right to consent to medical, dental, and surgical treatment during an \nemergency involving an immediate danger to the health and safety of the children; and \nI \n9. the right to manage the estates of the children to the extent the estates have been \ncreated by the parent's family or by the parent, other than by the community or joint property of \nthe parent. \nIT IS ORDERED that, at all times, MORGAN MYERS and CHARLES MYERS, as \nparent temporary joint managing conservators, shall each have the following duties: \n1. the duty to inform the other conservator of the children in a timely manner of \nsignificant information concerning the health, education, and welfare of the children; \n2. the duty to inform the other conservator of the children if the conservator resides \nwith for at least thirty days, marries, or intends to marry a person who the conservator knows is \n-~~;;:-R~;_-.. A CERTIFIED COPY \n/_,\" f'i\"~ ATTEST: 04/16/2024 \n:8 ~:THOMASA.WILDER !t ,--:,m~.~1 :<:: DISTRICT CLERK \n••~.i, ~..l.\"'.hARRANT COUNTY, TEXJ \n••.to ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2338
    },
    {
      "page_number": 80,
      "text": "registered as a sex offender under chapter 62 of the Texas Code of Criminal Procedure or is \ncurrently charged with an offense for which on conviction the person would be required to \nregister under that chapter. IT IS ORDERED that notice of this information shall be provided to \nthe other conservator of the children as soon as practicable, but not later than the fortieth day \nafter the date the conservator of the children begins to reside with the person or on the tenth day \nafter the date the marriage occurs, as appropriate. IT IS ORDERED that the notice must include \na description of the offense that is the basis of the person's requirement to register as a sex \noffender or of the offense with which the person is charged. WARNING: A CONSERVATOR \nCOMMITS AN OFFENSE PUNISHABLE AS A CLASS C MISDEMEANOR IF TI-IE \nCONSERVATOR FAILS TO PROVIDE TIIIS NOTICE; \n3. the duty to inform the other conservator of the children if the conservator \nestablishes a residence with a person who the conservator knows is the subject of a final \nprotective order sought by an individual other than the conservator that is in effect on the date \nthe residence with the person is established. IT IS ORDERED that notice of this information \nshall be provided to the other conservator of the children as soon as practicable, but not later than \nthe thirtieth day after the date the conservator establishes residence with the person who is the \nsubject of the final protective order. WARNING: A CONSERVATOR COMMITS AN \nOFFENSE PUNISHABLE AS A CLASS C MISDEMEANOR IF TI-IE CONSERVATOR \nFAILS TO PROVIDE TIIIS NOTICE; \n4. the duty to inform the other conservator of the children if the conservator resides \nwith, or allows unsupervised access to a child by, a person who is the subject of a final protective \norder sought by the conservator after the expiration of sixty-day period following the date the \nfinal protective order is issued. IT IS ORDERED that notice of this information shall be \nprovided to the other conservator of the children as soon as practicable, but not later than the \nninetieth day after the date the final protective order was issued. WARNING: A \nCONSERVATOR COMMITS AN OFFENSE PUNISHABLE AS A CLASS C \nMISDEMEANOR IF TI-IE CONSERVATOR FAILS TO PROVIDE THIS NOTICE; and \n5. the duty to inform the other conservator of the children if the conservator is the \nsubject of a final protective order issued after the date of the order establishing conservatorship. \nIT IS ORDERED that notice of this information shall be provided to the other conservator of the \nchildren as soon as practicable, but not later than the thirtieth day after the date the final \nprotective order was issued. WARNING: A CONSERVATOR COMMITS AN OFFENSE \nPUNISHABLE AS A CLASS C MISDEMEANOR IF THE CONSERVATOR FAILS TO \nPROVIDE THIS NOTICE. \nIT IS ORDERED that, during her periods of possession, MORGAN MYERS, as parent \ntemporary joint managing conservator, shall have the following rights-and duties: \n1. the duty of care, control, protection, and reasonable discipline of the children; \n2. the duty to support the children, including providing the children with clothing, \nfood, shelter, and medical and dental care not involving an invasive procedure; \n··•••••••••·· .~of,:-'Rl!-1-\\-,-\"•. A CERTIFIED COPY /':tm··· <'i\\ ATTEST: 04/16/2024 ;8. ?j: THOMASA.WILDER \nt'u . •\"': DISTRICTCLERK \n••Jt., ~;hARRANT COUNTY, TEXJ \n•••!?. ........ •••• BY: /s/ Catherine Saenz",
      "char_length": 3451
    },
    {
      "page_number": 81,
      "text": "3. the right to consent for the children to medical and dental care not involving an \ninvasive procedure; and \n4. the right to direct the moral and religious training of the children. \nIT IS ORDERED that, during his periods of possession, CHARLES MYERS, as parent \ntemporary joint managing conservator, shall have the following rights and duties: \n1. the duty of care, control, protection, and reasonable discipline of the children; \n2. the duty to support the children, including providing the children with clothing, \nfood, shelter, and medical and dental care not involving an invasive procedure; \n3. the right to consent for the children to medical and dental care not involving an \ninvasive procedure; and \n4. the right to direct the moral and religious training of the children. \nIT IS ORDERED that MORGAN MYERS, as a parent temporary joint managing \nconservator, shall have the following rights and duty: \n1. the independent right to consent to medical, dental, and surgical treatment \ninvolving invasive procedures; \n2. the independent right to consent to psychiatric and psychological treatment of the \nchildren; \n3. the independent right to receive and give receipt for periodic payments for the \nsupport of the children and to hold or disburse these funds for the benefit of the children; \n4. the independent right to represent the children in legal action and to make other \ndecisions of substantial legal significance concerning the children; \n5. the independent right to consent to marriage and to enlistment in the armed forces \nof the United States; \n6. the independent right to make decisions concerning the children's education; \n7. except as provided by section 264.0111 of the Texas Family Code, the \nindependent right to the services and earnings of the children; \n8. except when a guardian of the children's estates or a guardian or attorney ad litem \nhas been appointed for the children, the independent right to act as an agent of the children in \n.~c:;;::;;~:;;... A CERTIFIED COPY \n:°:,\"'-~ fo\"•• ATTEST: 04/16/2024 {8 ii THOMASA.WILDER \n~t, , :<! DISTRICT CLERK \n•,iJ~ ~lTARRANT COUNTY, TEXJ \n••• Q ':io ••• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 2170
    },
    {
      "page_number": 82,
      "text": "relation to the children's estates if the children's action is required by a state, the United States, or \na foreign government; \n9. the right, subject to the agreement of the other conservator, to apply for passports \nfor the children, to renew the children's passports, and to maintain possession of the children's \npassports; and \n10. the independent duty to manage the estates of the children to the extent the estates \nhave been created by the community or joint property of the parent. \nIT IS ORDERED that CHARLES MYERS, as a parent temporaty joint managmg \nconservator, shall have the following rights and duty: \n1. the independent right to consent to medical, dental, and surgical treatment \ninvolving invasive procedures; \n2. the independent right to consent to psychiatric and psychological treatment of the \nchildren; \n3. the independent right to receive and give receipt for periodic payments for the \nsupport of the children and to hold or disburse these funds for the benefit of the children; \n4. the independent right to represent the children in legal action and to make other \ndecisions of substantial legal significance concerning the children; \n5. the independent right to consent to marriage and to enlistment in the armed forces \nof the United States; \n6. the independent right to make decisions concerning the children's education; \n7. except as provided by section 264.0111 of the Texas Family Code, the \nindependent right to the services and earnings of the children; \n8. except when a guardian of the children's estates or a guardian or attorney ad litem \nhas been appointed for the children, the independent right to act as an agent of the children in \nrelation to the children's estates if the children's action is required by a state, the United States, or \na foreign government; \n9. the right, subject to the agreement of the other conservator, to apply for passports \nfor the children, to renew the children's passports, and to maintain possession of the children's \npassports; and \n10. the independent duty to manage the estates of the children to the extent the estates \nhave been created by the community or joint property of the parent. \n··■·;_;;;:.:R~~-.. A CERTIFIED COPY \n/:;\"\" ~, ~\\ ATTEST: 04/16/2024 :8 , ~: THOMAS A. WILDER \nit, :<J DISTRICT CLERK \n••:.-, ::,,..e,;hARRANT COUNTY. TEX/ \n•~;,. ~~.-···?. ......... •· BY: Isl Catherine Saenz",
      "char_length": 2380
    },
    {
      "page_number": 83,
      "text": "Notwithstanding any provision in this order to the contrary, IT IS ORDERED that \nMORGAN MYERS shall have the exclusive right to enroll the children in school. Each \nconservator, during that conservator's period of possession, is ORDERED to ensure the \nchildren's attendance in the schools in which MORGAN MYERS has enrolled the children. \nThe Court finds that, in accordance with section 153.001 of the Texas Family Code, it is \nthe public policy of Texas to assure that children will have frequent and continuing contact with \nparents who have shown the ability to act in the best interest of the child; to provide a safe, \nstable, and nonviolent environment for the child; and to encourage parents to share in the rights \nand duties of raising their child after the parents have separated or dissolved their marriage. IT \nIS ORDERED that the primary residence of the children shall be within Tarrant County, Texas, \n' and counties contiguous to Tarrant County, Texas, and the parties shall not remove the children \nfrom Tarrant County, Texas, and counties contiguous to Tarrant County, Texas for the purpose \nof changing the primary residence of the children until this geographic restriction is modified by \nfurther order of the court of continuing jurisdiction or by a written agreement that is signed by \nthe parties and filed with that court. \nExcept as expressly provided otherwise in this temporary order, IT IS ORDERED that all \ninformation of which a conservator is required to notify the other conservator and all documents \nand information that a conservator is required to provide to the other conservator shall be sent in \nthe following manner: \na. delivery to the recipient at the recipient's electronic mail address as \nfollows or to such other electronic mail address subsequently designated \nby the recipient: \nMORGAN MYERS morganm202@gmail.com \n··•••••••••·· ••-•oy'f,\\R~,_••• A CERTIFIED COPY \n:'\"::,._. '~..; <o\\ ATTEST: 04/16/2024 •o . (!.• i '-' · :\\: THOMAS A. WILDER \n~\\j , ,~; DISTRICT CLERK \n••~. ~.-6'.lrARRANT COUNTY, TEXJ \n• ~✓• ~~~-···?. ......... •· BY: /s/ Catherine Saenz",
      "char_length": 2105
    },
    {
      "page_number": 84,
      "text": "CHARLES MYERS chuckdusti c 12@gmai I .com \nand in the event of any change in a recipient's electronic mail address, that \nrecipient is ORDERED to notify the other recipient of such change in \nwriting within twenty-four hours after the change. \nIf a party applies for a passport for the children, that party, is ORDERED to notify the \nother party of that fact no later than 10 days after the application. \nIT IS ORDERED that if a parent's consent is required for the issuance or renewal of a \npassport, that parent shall provide that consent in writing no later than ten days after receipt of \nthe consent documents, unless the parent has good cause for withholding that consent. \nPossession and Access \nIT IS ORDERED that nothing in this order shall supercede any term of any \nprotective order or condition of bond, probation, or parole. \nI. Standard Possession Order \nIT IS ORDERED that each conservator shall comply with all terms and \nconditions of this Standard Possession Order. IT IS ORDERED that this Standard \nPossession Order is effective immediately and applies to all periods of possession \noccurring on and after the date the Court signs this Standard Possession Order. IT IS, \nTHEREFORE, ORDERED: \n(a) Definitions \n1. In this Standard Possession Order \"school\" means the elementary \nor secondary school in which the child is enrolled or, if the child is not enrolled in \nan elementary or secondary school, the public school district in which the child \nprimarily resides. \n2. In this Standard Possession Order \"child\" includes each child, \nwhether one or more, who is a subject of this suit while that child is under the age \nof eighteen years and not otherwise emancipated. \n(b) Mutual Agreement or Specified Terms for Possession \nIT IS ORDERED that the conservators shall have possession of the child \nat times mutually agreed to in advance by the parties, and, in the absence of \n••-•o\";~~R~/•. A CERTIFIED COPY \n/'.:,\"' ~-\"i\\ ATTEST: 04/16/2024 : 8 . > ?i: THOMAS A. WILDER \\t :<: DISTRICTCLERK ••i,, ::;,~/TARRANT COUNTY, TEXJ \n•.:o ~;~• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2091
    },
    {
      "page_number": 85,
      "text": "mutual agreement, it is ORDERED that the conservators shall have possession of \nthe child under the specified terms set out in this Standard Possession Order. \n(c) When Parents Reside 50 Miles or Less Apart \nExcept as otherwise expressly provided in this Standard Possession Order,. \nwhen CHARLES MYERS resides 50 miles or less from the primary residence of \nthe child, CHARLES MYERS shall have the right to possession of the child as \nfollows: \n1. Weekends-\nOn weekends that occur during the regular school term, beginning at the \ntime the child's school is regularly dismissed, on the first, third, and fifth Friday of \neach month and ending at the time the child's school resumes after the weekend. \nOn weekends that do not occur during the regular school term, beginning \nat 6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \n2. Weekend Possession Extended by a Holiday -\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \nterm, as determined by the school in which the child is enrolled, or a federal, \nstate, or local holiday that falls on a Friday during the summer months when \nschool is not in session, that weekend period of possession shall begin at the time \nthe child's school is regularly dismissed on the Thursday immediately preceding \nthe student holiday or teacher in-service day and 6:00 p.m. on the Thursday \nimmediately preceding the federal, state, or local holiday during the summer \nmonths. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on \na Monday during the regular school term, as determined by the school in which \nthe child is enrolled, or a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 8:00 a.m. on Tuesday. \n3. Thursdays -On Thursday of each week during the regular school \nterm, beginning at the time the child's school is regularly dismissed and ending at \nthe time the child's school resumes on Friday. \n4. Spring Vacation in Even-Numbered Years -In even-numbered \n••-•o-;;.;:R~;•.. A CERTIFIED COPY \nl:o\"' ~ 'o\\ ATTEST: 04/16/2024 \n: 8 . \n1 ~j ~: THOMAS A. WILDER \n~~ :<f DISTRICT CLERK \n••.t, ~;-'TARRANT COUNTY, TEXJ \n••~:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 2638
    },
    {
      "page_number": 86,
      "text": "years, beginning at the time the child's school is dismissed and ending at 6:00 \nP.M. on the day before school resumes after that vacation. \n5. Extended Summer Possession by CHARLES MYERS-\nWith Written Notice by April 1 -If CHARLES MYERS gives MORGAN \nMYERS written notice by April 1 of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for thirty days beginning no earlier than the day after the \nchild's school is dismissed for the summer vacation and ending no later than seven \ndays before school resumes at the end of the summer vacation in that year, to be \nexercised in no more than two separate periods of at least seven consecutive days \neach, as specified in the written notice. These periods of possession shall begin \nand end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April 1 -If CHARLES MYERS does not give \nMORGAN MYERS written notice by April I of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for thirty consecutive days in that year beginning at \n6:00 P.M. on July 1 and ending at 6:00 P.M. on July 31. \nNotwithstanding the Thursday periods of possession during the regular \nschool term and the weekend periods of possession ORDERED for CHARLES \nMYERS, it is expressly ORDERED that MORGAN MYERS shall have a \nsuperior right of possession of the child as follows: \n1. Spring Vacation in Odd-Numbered Years -In odd-numbered \nyears, beginning at the time the child's school is dismissed and ending at 6:00 \nP .M. on the day before school resumes after that vacation. \n2. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P.M. on Friday and ending at 6:00 P.M. on the following \nSunday during any one period of the extended summer possession by CHARLES \nMYERS in that year, provided that MORGAN MYERS picks up the child from \nCHARLES MYERS and returns the child to that same place and that the weekend \nso designated does not interfere with Father's Day possession. Not later than the \nfifteenth day before the Friday that begins the designated weekend, CHARLES \nMYERS must give MORGAN MYERS written notice of the location at which \nMORGAN MYERS is to pick up and return the child. \n3. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear or gives CHARLES MYERS fourteen days' written notice on or after April \n16 of a year, MORGAN MYERS may designate one weekend beginning no \n··•••••••••·· ••-•o~'f.-.RR,1.\\-,.'•. ACERTIFIEOCOPY \n:\"_,q,-w~ ~---ATTEST: 04/16/2024 {8 . 'i: THOMAS A. WILDER \n~t, ·· -~! DISTRICTCLERK \n••~,, :i:::hARRANT COUNTY, TEXJ \n•••:?. ...... r.••• BY: /s/ Catherine Saenz",
      "char_length": 2924
    },
    {
      "page_number": 87,
      "text": "earlier than the day after the child's school is dismissed for the summer vacation \nand ending no later than seven days before school resumes at the end of the \nsummer vacation, during which an otherwise scheduled weekend period of \npossession by CHARLES MYERS shall not take place in that year, provided that \nthe weekend so designated does not interfere with CHARLES MYERS's period or \nperiods of extended summer possession or with Father's Day possession. \nNotwithstanding the weekend and Thursday periods of possession of \nCHARLES MYERS, MORGAN MYERS and CHARLES MYERS shall have the \nright to possession of the child as follows: \n1. Christmas Holidays in Even-Numbered Years -In even-numbered \nyears, CHARLES MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and MORGAN MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n2. Christmas Holidays in Odd-Numbered Years -In odd-numbered \nyears, MORGAN MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and CHARLES MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n3. Thanksgiving in Odd-Numbered Years -In odd-numbered years, \nCHARLES MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n4. Thanksgiving in Even-Numbered Years -In even-numbered years, \nMORGAN MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP .M. on the Sunday following Thanksgiving. \n5. Child's Birthday -If a parent is not otherwise entitled under this \nStandard Possession Order to present possession of a child on the child's birthday, \nthat parent shall have possession of the child and the child's minor siblings \nbeginning at 6:00 P.M. and ending at 8:00 P.M. on that day, provided that that \nparent picks up the child from the other parent's residence and returns the child to \nthat same place. \n6. Father's Day -CHARLES MYERS shall have the right to \npossession of the child each year, beginning at 6:00 P.M. on the Friday preceding \n.••■••.<?c'..:i.i;~'.;;_-... A CERTIFIED COPY \n:.::,4' ~·· <o•. ATTEST: 04/16/2024 le . • ~l THOMAS A. w1LDER \n~t, . .-</ DISTRICTCLERK \n••:... ;,,,,,;/TARRANT COUNTY, TEXJ • ~1. :.ti:• •••?. .... ,, ~-•• BY: /s/ Catherine Saenz",
      "char_length": 2859
    },
    {
      "page_number": 88,
      "text": "Father's Day and ending at 8:00 a.m. on the Monday after Father's Day, provided \nthat if CHARLES MYERS is not otherwise entitled under this Standard \nPossession Order to present possession of the child, he shall pick up the child \nfrom MORGAN MYERS's residence and return the child to that same place. \n7. Mother's Day -MORGAN MYERS shall have the right to \npossession of the child each year, beginning at the time the child's school is \nregularly dismissed on the Friday preceding Mother's Day and ending at the time \nthe child's school resumes after Mother's Day, provided that if MORGAN \nMYERS is not otherwise entitled under this Standard Possession Order to present \npossession of the child, she shall pick up the child from CHARLES MYERS's \nresidence and return the child to that same place. \n( d) When Parents Reside More than 50 Miles but 100 Miles or Less Apart \nExcept as otherwise expressly provided in this Standard Possession Order, \nwhen CHARLES MYERS resides more than 50 Miles but 100 miles or less from \nthe primary residence of the child, CHARLES MYERS shall have the right to \npossession of the child as follows: \n1. Weekends -\nOn weekends that occur during the regular school tenn, beginning at the \ntime the child's school is regularly dismissed, on the first, third, and fifth Friday of \neach month and ending at the time the child's school resumes after the weekend. \nOn weekends that do not occur during the regular school tenn, beginning \nat 6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \n2. Weekend Possession Extended by a Holiday -\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \ntenn, as detennined by the school in which the child is enrolled, or a federal, \nstate, or local holiday that falls on a Friday during the summer months when \nschool is not in session, that weekend period of possession shall begin at the time \nthe child's school is regularly dismissed on the Thursday immediately preceding \nthe student holiday or teacher in-service day and 6:00 p.m. on the Thursday \nimmediately preceding the federal, state, or local holiday during the summer \nmonths. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on",
      "char_length": 2573
    },
    {
      "page_number": 89,
      "text": "a Monday during the regular school term, as determined by the school in which \nthe child is enrolled, that weekend period of possession shall end at 8:00 a.m. on \nTuesday. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 6:00 P.M. on that Monday. \n3. Thursdays -On Thursday of each week during the regular school \nterm, beginning at the time the child's school is regularly dismissed and ending at \nthe time the child's school resumes on Friday. \n4. Spring Vacation in Even-Numbered Years -In even-numbered \nyears, beginning at the time the child's school is dismissed for the school's spring \nvacation and ending at 6:00 P.M. on the day before school resumes after that \nvacation. \n5. Extended Summer Possession by CHARLES MYERS -\nWith Written Notice by April 1 -If CHARLES MYERS gives MORGAN \nMYERS written notice by April 1 of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for thirty days beginning no earlier than the day after the \nchild's school is dismissed for the summer vacation and ending no later than seven \ndays before school resumes at the end of the summer vacation in that year, to be \nexercised in no more than two separate periods of at least seven consecutive days \neach, as specified in the written notice. These periods of possession shall begin \nand end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April 1 -If CHARLES MYERS does not give \nMORGAN MYERS written notice by April 1 of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for thirty consecutive days in that year beginning at \n6:00 P.M. on July 1 and ending at 6:00 P.M. on July 31. \nNotwithstanding the Thursday periods of possession during the regular \nschool term and the weekend periods of possession ORDERED for CHARLES \nMYERS, it is expressly ORDERED that MORGAN MYERS shall have a \nsuperior right of possession of the child as follows: \n1. Spring Vacation in Odd-Numbered Years -In odd-numbered \nyears, beginning at the time the child's school is dismissed for the school's spring \nvacation and ending at 6:00 P.M. on the day before school resumes after that \nvacation. \n••■•;;;~:.:;~~•• A CERTIFIED COPY \n/:,\"' ~ ~~ ATTEST: 04/16/2024 :8. ~: THOMASA.WILDER \n~t, :</ DISTRICT CLERK \n••:.,r ~.e,\"?TARRANTCOUNTY. TEX/ \n••:!o s4'!;•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2729
    },
    {
      "page_number": 90,
      "text": "2. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \n, year, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P.M. on Friday and ending at 6:00 P.M. on the following \nSunday during any one period of the extended summer possession by CHARLES \nMYERS in that year, provided that MORGAN MYERS picks up the child from \nCHARLES MYERS and returns the child to that same place and that the weekend \nso designated does not interfere with Father's Day possession. Not later than the \nfifteenth day before the Friday that begins the designated weekend, CHARLES \nMYERS must give MORGAN MYERS written notice of the location at which \nMORGAN MYERS is to pick up and return the child. \n3. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear or gives CHARLES MYERS fourteen days' written notice on or after April \n16 of a year, MORGAN MYERS may designate one weekend beginning no \nearlier than the day after the child's school is dismissed for the summer vacation \nand ending no later than seven days before school resumes at the end of the \nsummer vacation, during which an otherwise scheduled weekend period of \npossession by CHARLES MYERS shall not take place in that year, provided that \nthe weekend so designated does not interfere with CHARLES MYERS's period or \nperiods of extended summer possession or with Father's Day possession. \n( e) Parents Who Reside More Than 100 Miles Apart \nExcept as otherwise expressly provided in this Standard Possession Order, \nwhen CHARLES MYERS resides more than 100 miles from the residence of the \nchild, CHARLES MYERS shall have the right to possession of the child as \nfollows: \n1. Weekends -Unless CHARLES MYERS elects the alternative \nperiod of weekend possession described in the next paragraph, CHARLES \nMYERS shall have the right to possession of the child on weekends beginning at \n6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \nAlternate Weekend Possession -In lieu of the weekend possession \ndescribed in the foregoing paragraph, CHARLES MYERS shall have the right to \npossession of the child not more than one weekend per month of CHARLES \nMYERS's choice beginning at 6:00 P.M. on the day school recesses for the \nweekend and ending at 6:00 P.M. on the day before school resumes after the \nweekend. CHARLES MYERS may elect an option for this alternative period of \nweekend possession by giving written notice to MORGAN MYERS within ninety \ndays after the parties begin to reside more than 100 miles apart. If CHARLES \nMYERS makes this election, CHARLES MYERS shall give MORGAN MYERS \n.••m•;;;;'..:R~'.;;.-... A CERTIFIED COPY \n:::,+ ~' <e-. ATTEST: 04/16/2024 {8 . • 'ii THOMAS A. WILDER \n~\\j , -~! DISTRICTCLERK \n••:... ~~/TARRANT COUNTY, TEXJ \n• ~✓• • • •••Q .•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2972
    },
    {
      "page_number": 91,
      "text": "fourteen days' written or telephonic notice preceding a designated weekend. The \nweekends chosen shall not conflict with the provisions regarding Christmas, \nThanksgiving, the child's birthday, and Mother's Day possession below. \n2. Weekend Possession Extended by a Holiday -\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \nterm, as determined by the school in which the child is enrolled, or a federal, \nstate, or local holiday during the summer months when school is not in session, \nthat weekend period of possession shall begin at the time the child's school is \nregularly dismissed on the Thursday immediately preceding the student holiday or \nteacher in-service day and 6:00 p.m. on the Thursday immediately preceding the \nfederal, state, or local holiday during the summer months \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on \na Monday during the regular school term, as determined by the school in which \nthe child is enrolled, that weekend period of possession shall end at 8:00 a.m. on \nTuesday. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 6:00 P.M. on that Monday. \n3. Spring Vacation in All Years -Every year, beginning at 6:00 P.M. \non the day the child is dismissed from school for the school's spring vacation and \nending at 6:00 P.M. on the day before school resumes after that vacation. \n4. Extended Summer Possession by CHARLES MYERS -\nWith Written Notice by April I -If CHARLES MYERS gives MORGAN \nMYERS written notice by April I of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for forty-two days beginning no earlier than the day after \nthe child's school is dismissed for the summer vacation and ending no later than \nseven days before school resumes at the end of the summer vacation in that year, \nto be exercised in no more than two separate periods of at least seven consecutive \ndays each, as specified in the written notice. These periods of possession shall \nbegin and end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April I -If CHARLES MYERS does not give \n•••m•~;_~;R~'.,;;.-... A CERTIFIED COPY \n:::,°' W,. ~•. ATTEST: 04/16/2024 \n{8 \\\\ THOMAS A. WILDER \n~lj . :</ DISTRICTCLERK ••i,., ~4hARRANTCOUNTY, TEXJ \n• •• o ;;:~•• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 2949
    },
    {
      "page_number": 92,
      "text": "MORGAN MYERS written notice by April 1 of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for forty-two consecutive days beginning at 6:00 \nP.M. on June 15 and ending at 6:00 P.M. on July 27 of that year. \nNotwithstanding the weekend periods of possession ORDERED for \nCHARLES MYERS, it is expressly ORDERED that MORGAN MYERS shall \nhave a superior right of possession of the child as follows: \n1. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P.M. on Friday and ending at 6:00 P.M. on the following \nSunday during any one period of possession by CHARLES MYERS during \nCHARLES MYERS's extended summer possession in that year, provided that if a \nperiod of possession by CHARLES MYERS in that year exceeds thirty days, \nMORGAN MYERS may have possession of the child under the terms of this \nprovision on any two nonconsecutive weekends during that period and provided \nthat MORGAN MYERS picks up the child from CHARLES MYERS and returns \nthe child to that same place and that the weekend so designated does not interfere \nwith Father's Day possession. \n2. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS may designate twenty-one days beginning no earlier \nthan the day after the child's school is dismissed for the summer vacation and \nending no later than seven days before school resumes at the end of the summer \nvacation in that year, to be exercised in no more than two separate periods of at \nleast seven consecutive days each, during which CHARLES MYERS shall not \nhave possession of the child, provided that the period or periods so designated do \nnot interfere with CHARLES MYERS's period or periods of extended summer \npossession or with Father's Day possession. These periods of possession shall \nbegin and end at 6:00 P.M. on each applicable day. \n(f) Holidays \nNotwithstanding the weekend and Thursday periods of possession of \nCHARLES MYERS, except when CHARLES MYERS resides fifty miles or less \nfrom the primary residence of the child, MORGAN MYERS and CHARLES \nMYERS shall have the right to possession of the child as follows: \n1. Christmas Holidays in Even-Numbered Years -In even-numbered \nyears, CHARLES MYERS shall_ have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and MORGAN MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \n.··m·o-;~:.:RR~;.- .. _ A CERTIFIED COPY \n:& ~\"\" 'b\\ ATTEST: 04/1612024 \n{8 • 'i\\ THOMAS A. WILDER \n~t ·· .⇒/ DISTRICT CLERK \n••:.,_,, ~;hARRANT COUNTY, TEXJ \n•••:? ~-••• BY: /s/ Catherine Saenz \n••••••••",
      "char_length": 2949
    },
    {
      "page_number": 93,
      "text": "at 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n2. Christmas Holidays in Odd-Numbered Years -In odd-numbered \nyears, MORGAN MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and CHARLES MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n3. Thanksgiving in Odd-Numbered Years -In odd-numbered years, \nCHARLES MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP .M. on the Sunday following Thanksgiving. \n4. Thanksgiving in Even-Numbered Years -In even-numbered years, \nMORGAN MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n5. Child's Birthday -If a parent is not otherwise entitled under this \nStandard Possession Order to present possession of a child on the child's birthday, \nthat parent shall have possession of the child and the child's minor siblings \nbeginning at 6:00 P.M. and ending at 8:00 P.M. on that day, provided that that \nparent picks up the child from the other parent's residence and returns the child to \nthat same place. \n6. Father's Day -CHARLES MYERS shall have the right to \npossession of the child each year, beginning at 6:00 P.M. on the Friday preceding \nFather's Day and ending at 8:00 a.m. on the Monday after Father's Day, provided \nthat if CHARLES MYERS is not otherwise entitled under this Standard \nPossession Order to present possession of the child, he shall pick up the child \nfrom MORGAN MYERS's residence and return the child to that same place. \n7. Mother's Day -MORGAN MYERS shall have the right to \npossession of the child each year, beginning at the time the child's school is \nregularly dismissed on the Friday preceding Mother's Day and ending at the time \nthe child's school resumes after Mother's Day, provided that if MORGAN \nMYERS is not otherwise entitled under this Standard Possession Order to present \npossession of the child, she shall pick up the child from CHARLES MYERS's \nresidence and return the child to that same place. \n(g) Undesignated Periods of Possession \nMORGAN MYERS shall have the right of possession of the child at all \n•••m•~;~~R~'.;~... A CERTIFIED COPY \n:~ ~\"\" ?,•. ATTEST: 0411612024 ...... c:.• £8 . ~i THOMAS A. WILDER •t · .'<• DISTRICTCLERK \n\\..,,. ~..e,;lTARRANT COUNTY, TEX/ \n••.:Q ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2747
    },
    {
      "page_number": 94,
      "text": "other times not specifically designated in this Standard Possession Order for \nCHARLES MYERS. \n(h) General Terms and Conditions \nExcept as otherwise expressly provided in this Standard Possession Order, \nthe terms and conditions of possession of the child that apply regardless of the \ndistance between the residence of a parent and the child are as follows: \n1. Surrender of Child by MORGAN MYERS -MORGAN MYERS \nis ORDERED to surrender the child to CHARLES MYERS at the beginning of \neach period of CHARLES MYERS's possession at the residence of MORGAN \nMYERS. \nIf a period of possession by CHARLES MYERS begins at the time the \nchild's school is regularly dismissed, MORGAN MYERS is ORDERED to \nsurrender the child to CHARLES MYERS at the beginning of each such period of \npossession at the school in which the child is enrolled. If the child is not \nphysically attending school, CHARLES MYERS shall pick up the child at the \nresidence of MORGAN MYERS at 6:00 P.M., and MORGAN MYERS is \nORDERED to surrender the child to CHARLES MYERS at the residence of \nMORGAN MYERS at 6:00 P.M. under these circumstances. \n2. Surrender of Child by CHARLES MYERS -CHARLES MYERS \nis ORDERED to surrender the child to MORGAN MYERS at the residence of \nCHARLES MYERS at the end of each period of possession. \nIf a period of possession by CHARLES MYERS ends at the time the \nchild's school resumes, CHARLES MYERS is ORDERED to surrender the child \nto MORGAN MYERS at the end of each such period of possession at the school \nin which the child is enrolled or, if the child is not physically attending school, at \nthe residence of MORGAN MYERS at 6:00 P.M. \n3. Surrender of Child by CHARLES MYERS -CHARLES MYERS \nis ORDERED to surrender the child to MORGAN MYERS, if the child is in \nCHARLES MYERS's possession or subject to CHARLES MYERS's control, at \nthe beginning of each period of MORGAN MYERS's exclusive periods of \npossession, at the place designated in this Standard Possession Order. \n4. Return of Child by MORGAN MYERS -MORGAN MYERS is \nORDERED to return the child to CHARLES MYERS, if CHARLES MYERS is \nentitled to possession of the child, at the end of each of MORGAN MYERS's \nexclusive periods of possession, at the place designated in this Standard \nPossession Order. \n5. Personal Effects -Each conservator is ORDERED to return with \n••m•~;~i:~;_-.. A CERTIFIED COPY \nl~\"' ~ ('i\\ ATTEST: 04/16/2024 \n: 8 . \n1 't'l; ~: THOMAS A. WILDER !~ :<j DISTRICT CLERK \n\\\".,., ~,.e,;.•TARRANTCOUNTY, TEXJ \n••.to ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2537
    },
    {
      "page_number": 95,
      "text": "the child the personal effects that the child brought at the beginning of the period \nof possession. \n6. Designation of Competent Adult -Each conservator may designate \nany competent adult to pick up and return the child, as applicable. IT IS \nORDERED that a conservator or a designated competent adult be present when \nthe child is picked up or returned. \n7. Inability to Exercise Possession -Each conservator is ORDERED \nto give notice to the person in possession of the child on each occasion that the \nconservator will be unable to exercise that conservator's right of possession for \nany specified period. \n8. Written Notice -Written notice, including notice provided by \nelectronic mail or facsimile or as otherwise authorized in this order, shall be \ndeemed to have been timely made if received or, if applicable, postmarked before \nor at the time that notice is due. Each conservator is ORDERED to notify the \nother conservator of any change in the conservator's electronic mail address or \nfacsimile number within twenty-four hours after the change. \n9. Notice to School and MORGAN MYERS -If CHARLES \nMYERS's time of possession of the child ends at the time school resumes and for \nany reason the child is not or will not be returned to school, CHARLES MYERS \nshall immediately notify the school and MORGAN MYERS that the child will not \nbe or has not been returned to school. \nThis concludes the Standard Possession Order. \n2. Duration \nThe periods of possession ordered above apply to each child the subject of this \nsuit while that child is under the age of eighteen years and not otherwise emancipated. \nChild Support \nIT IS ORDERED that CHARLES MYERS pay to MORGAN MYERS for the support of \nMARA MYERS and CAROLINE MYERS nine hundred seventy-three dollars and nineteen \ncents ($973.19) per month, with the first payment being due and payable on April 1, 2024 and a \nlike payment being due and payable on the first day of each month thereafter until further order \nof this Court. \n••m•;_;;~:.:R~;•.. A CERTIFIED COPY /J ~--0f~ ATTEST: 04/16/2024 : 8 . ~: THOMAS A. WILDER \\t --<: DISTRICTCLERK \n\"•:.,. ::;,',£>;/TARRANT COUNTY, TEXJ .... .,. ;;t~.-···?. ........ •·· BY: /s/ Catherine Saenz",
      "char_length": 2203
    },
    {
      "page_number": 96,
      "text": "Withholding from Earnings \nIT IS ORDERED that any employer of CHARLES MYERS shall be ordered to withhold \nthe child support payments ordered in this order from the disposable earnings of CHARLES \nMYERS for the support of MARA MYERS and CAROLINE MYERS. \nIT IS FURTHER ORDERED that all amounts withheld from the disposable earnings of \nCHARLES MYERS by the employer and paid in accordance with the order to that employer \nshall constitute a credit against the child support obligation. Payment of the full amount of child \nsupport ordered paid by this order through the means of withholding from earnings shall \ndischarge the child support obligation. If the amount withheld from earnings and credited \nagainst the child support obligation is less than I 00 percent of the amount ordered to be paid by \nthis order, the balance due remains an obligation of CHARLES MYERS, and it is hereby \nORDERED that CHARLES MYERS pay the balance due directly as specified below. \nOn this date the Court signed an Income Withholding for Support. \nPayment \nIT IS ORDERED that all payments shall be made through the state disbursement unit at \nTexas Child Support Disbursement Unit, P.O. Box 659791, San Antonio, Texas 78265-9791, and \nthereafter promptly remitted to MORGAN MYERS for the support of the children. IT IS \nORDERED that all payments shall be made payable to the Office of the Attorney General and \ninclude the ten-digit Office of the Attorney General case number (if available), the cause number \nof this suit, CHARLES MYERS's name as the name of the noncustodial parent (NCP), and \nMORGAN MYERS's name as the name of the custodial parent (CP). Payment options are found \non the Office of the Attorney General's website at www.texasattorneygeneral.gov/cs/payment­\noptions-and-types.",
      "char_length": 1777
    },
    {
      "page_number": 97,
      "text": "IT IS ORDERED that each party shall pay, when due, all fees charged to that party by the \nstate disbursement unit and any other agency statutorily authorized to charge a fee. \nChange of Employment \nIT IS FURTHER ORDERED that CHARLES MYERS shall notify this Court and \nMORGAN MYERS by U.S. certified mail, return receipt requested, of any change of address \nand of any termination of employment. This notice shall be given no later than seven days after \nthe change of address or the termination of employment. This notice or a subsequent notice shall \nalso provide the current address of CHARLES MYERS and the name and address of his current \nemployer, whenever that information becomes available. \nClerk's Duties \nIT IS ORDERED that, on the request of a prosecuting attorney, the title IV-D agency, the \nfriend of the Court, a domestic relations office, MORGAN MYERS, CHARLES MYERS, or an \nattorney representing MORGAN MYERS or CHARLES MYERS, the clerk of this Court shall \ncause a certified copy of the Income Withholding for Support to be delivered to any employer. \nMedical and Dental Support \n1. IT IS ORDERED that MORGAN MYERS and CHARLES MYERS shall each \nprovide additional child support for each child as set out in this order for as long as the Court \nmay order MORGAN MYERS and CHARLES MYERS to provide support for the child under \nsections 154.001 and 154.002 of the Texas Family Code. Beginning on the day MORGAN \nMYERS and CHARLES MYERS's actual or potential obligation to support a child under \nsections 154.001 and 154.002 of the Family Code terminates, IT IS ORDERED that MORGAN \nMYERS and CHARLES MYERS are discharged from these obligations with respect to that \nchild, except for any failure by a parent to fully comply with these obligations before that date. \n··•••••••••·· ••-•of-C-'Rl!'l,1,)-°•. A CERTIFIED COPY /J· ~\"' ('o\\ ATTEST: 04/16/2024 :8 . ~: THOMAS A. WILDER :t, , ,.,,: DISTRICT CLERK \n\\~-t. ~;iTARRANT COUNTY, TEXJ \n••.:Q S-:••• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 2000
    },
    {
      "page_number": 98,
      "text": "IT IS FURTHER ORDERED that the additional child support payments for costs of health and \ndental insurance ordered below are payable through the state disbursement unit or as directed \nbelow and subject to the provisions for withholding from earnings provided above for other child \nsupport payments. \n2. Definitions -\n\"Health Insurance\" means insurance coverage that provides basic health-care services, \nincluding usual physician services, office visits, hospitalization, and laboratory, X-ray, and \nemergency services, that may be provided through a health maintenance organization or other \nprivate or public organization, other than medical assistance under chapter 32 of the Texas \nHuman Resources Code. \n\"Reasonable cost\" means the total cost of health insurance coverage for all children for \nwhich MORGAN MYERS is responsible under a medical support order that does not exceed 9 \npercent of MORGAN MYERS's annual resources, as described by section 154.062(b) of the \nTexas Family Code. \n\"Health-care expenses\" include, without limitation, medical, surgical, prescription drug, \nmental health-care services, dental, eye care, ophthalmological, and orthodontic charges but do \nnot include expenses for travel to and from the provider or for nonprescription medication. \n\"Health-care expenses that are not reimbursed by insurance\" (\"unreimbursed expenses\") \ninclude related copayments and deductibles. \n3. Findings on Availability of Health Insurance -Having considered the cost, \naccessibility, and quality of health insurance coverage available to the parties, the Court finds: \nIT IS FURTHER FOUND that the following orders regarding health-care coverage are in \nthe best interest of the children. \n..\n11.:;;~AR~;,-.. A CERTIFIED COPY \n:°'.:,\"' '~-i\\ ATTEST: 04/16/2024 \n·~ :,i, ~· : ~ - ~: THOMAS A. WILDER \n~\\j :</ DISTRICTCLERK ••i,. ~..e,;lrARRANTCDUNTY, TEXJ \n•.:o ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1919
    },
    {
      "page_number": 99,
      "text": "4. Provision of Health-Care Coverage -\nAs Petitioner's child support, MORGAN MYERS is ORDERED to obtain Medicaid for \nthe children the subject of this suit, and then maintain health insurance for the children as long as \nchild support is payable for that child. MORGAN MYERS is ORDERED -\na. to provide to each conservator of the children the following infonnation no later \nthan the thirtieth day after she received Medicaid for the children: \na. MORGA MYERS' Social Security number; \nb. Proof that health insurance has been provided for the children; \nc. The following information and documents: \n1. The name of the health insurance carrier; \n11. The number of the policy; \niii. A copy of the policy; \n1v. A schedule of benefits; \nv. A health insurance membership card; \nv1. Claim fonns; and \nv11. Any other infonnation necessary to submit a claim; and \nd. To provide each conservator of the children with a copy of any \nrenewals or changes to the health insurance coverage of the children \nand any additional information regarding health insurance coverage \nof the children no later than the fifteenth day after MORGAN \nMYERS receives or is provided with the renewal, change, or \nadditional information; \ne. To notify each conservator of the children of any termination or \n•••m•~;~AR~'.;;.,... A CERTIFIED COPY \n::::,4-~ \"o•• ATTEST: 04/1612024 • c• : 8 . ~: THOMAS A. WILDER \\t :< i DISTRICT CLERK \n••:.,.,, ~lrARRANTCOUNTY, TEXJ \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1479
    },
    {
      "page_number": 100,
      "text": "lapse of health insurance coverage of the children no later than the \nfifteenth day after the date of the tennination or lapse; \nf. After termination or lapse of health insurance coverage, to notify \neach conservator of the children of the availability to MORGAN \nMYERS of additional health insurance for the children no later than \nthe fifteenth day after the date the insurance becomes available; \ng. After termination or lapse of health insurance coverage, to enroll the \nchildren in a health insurance plan that is available to MORGAN \nMYERS at a reasonable cost at the next available enrollment period. \nPursuant to section 1504.051 of the Texas Insurance Code, IT IS ORDERED that if \nMORGAN MYERS is eligible for dependent health coverage but fails to apply to obtain \ncoverage for the children, the insurer shall enroll the children on application of CHARLES \nMYERS or others authorized by law. \n5. Allocation ofUnreimbursed Expenses -\nThe conservator who incurs a health-care expense on behalf of a child is ORDERED to \nprovide to the other conservator receipts, bills, statements, or explanations of benefits showing \nthe uninsured portion of the health-care expenses within thirty days after the incurring \nconservator receives them. The nonincurring conservator is ORDERED to pay the non-incurring \nconservator's percentage of the unreimbursed portion of the health-care expenses either by \npaying the health-care provider directly or by reimbursing the incurring conservator for any \nadvance payment exceeding the incurring conservator's percentage of the unreimbursed portion \nof the health-care expenses within thirty days after the nonincurring conservator receives \nreceipts, bills, statements, or explanations of benefits showing the unreimbursed portion of the \n•• ~~;,;.:.:~;.-... A CERTIFIED COPY \n::::,\"' ~ •• A TT EST: 04/16/2024 \n{8 ~i THOMAS A. WILDER \n~t, :<: DISTRICT CLERK \n•.~\"\" ~~/TARRANT COUNTY, TEXJ \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1976
    },
    {
      "page_number": 101,
      "text": "health-care expense. \nFor the Court to hold the nonincurring conservator in civil or criminal contempt for \nfailing to pay the nonincurring conservator's percentage of the unreimbursed portion of a health­\ncare expense, the incurring conservator must prove beyond a reasonable doubt that the \nnonincurring conservator personally received receipts, bills, statements, or explanations of \nbenefits reflecting the unreimbursed portion of the health-care expense no later than thirty days \nafter the incurring conservator received them. Even if the incurring conservator fails to meet that \nburden of proof, the Court may award the incurring conservator a judgment in the nature of child \nsupport against the nonincurring conservator in the amount of the unreimbursed portion of the \nheath-care expense the nonincurring conservator was ordered but fail to pay. \n6. WARNING -A PARENT ORDERED TO PROVIDE HEAL TII INSURANCE \nOR DENT AL INSURANCE OR TO PAY THE OTHER PARENT ADDITIONAL CHILD \nSUPPORT FOR THE COST OF HEALTII INSURANCE OR DENTAL INSURANCE WHO \nFAILS TO DO SO IS LIABLE FOR NECESSARY MEDICAL EXPENSES OF THE \nCHILDREN, WITHOUT REGARD TO WHETHER THE EXPENSES WOULD HA VE BEEN \nPAID IF HEALTH INSURANCE OR DENTAL INSURANCE HAD BEEN PROVIDED, AND \nFOR THE COST OF HEALTH INSURANCE PREMIUMS, DENTAL INSURANCE \nPREMIUMS, OR CONTRIBUTIONS, IF ANY, PAID ON BEHALF OF THE CHILDREN. \n7. Notice to Employer -On this date a Medical Support Notice was signed by the \nCourt. For the purpose of section 1169 of title 29 of the United States Code, the conservator not \ncarrying the health or dental insurance policy is designated the custodial parent and alternate \nrecipient's representative. \n••m•~tri:;~;_-., A CERTIFIED COPY :) ~:.. '/i\\ ATTEST: 04/16/2024 f 8 . • % 1 THOMAS A. WILDER \n~t, .-</ DISTRICT CLERK \n••~J; ~/rARRANTCO~NTY, TEXJ \n•••?. ........ ••• BY: /s/ Catherine Saenz",
      "char_length": 1878
    },
    {
      "page_number": 102,
      "text": "No Termination of Orders on Death of Obligee \nAn obligation to pay child support under this order does not terminate on the death of \nMORGAN MYERS but continues as an obligation to MARA MYERS and CAROLINE \nMYERS. \nOther Child Related Provisions \nRequired Notices \nNOTICE TO ANY PEACE OFFICER OF TI-IE STATE OF TEXAS: YOU MAY USE \nREASONABLE EFFORTS TO ENFORCE THE TERMS OF CHILD CUSTODY SPECIFIED \nIN TIIIS ORDER. A PEACE OFFICER WHO RELIES ON THE TERMS OF A COURT \nORDER AND THE OFFICER'S AGENCY ARE ENTITLED TO THE APPLICABLE \nIMMUNITY AGAINST ANY CLAIM, CIVIL OR OTIIER WISE, REGARDING TI-IE \nOFFICER'S GOOD FAITH ACTS PERFORMED IN THE SCOPE OF THE OFFICER'S \nDUTIES IN ENFORCING THE TERMS OF TI-IE ORDER THAT RELATE TO CHILD \nCUSTODY. ANY PERSON WHO KNOWINGLY PRESENTS FOR ENFORCEMENT AN \nORDER THAT IS INVALID OR NO LONGER IN EFFECT COMMITS AN OFFENSE THAT \nMAY BE PUNISHABLE BY CONFINEMENT IN JAIL FOR AS LONG AS TWO YEARS \nAND A FINE OF AS MUCH AS $10,000. \nTI-IE COURT MAY MODIFY THIS ORDER THAT PROVIDES FOR THE SUPPORT \nOF A CHILD, IF: \n(1) THE CIRCUMSTANCES OF THE CHILD OR A PERSON AFFECTED BY \nTHE ORDER HA VE MATERIALLY AND SUB ST ANTIALL Y CHANGED; OR \n(2) IT HAS BEEN THREE YEARS SINCE THE ORDER WAS RENDERED OR \nLAST MODIFIED AND THE MONTHLY AMOUNT OF THE CHILD SUPPORT AWARD \n····AR······ ••-•c,~'T l<,1-\\>),°•. ACERTIFIEDCOPY \n:':,~ w-\"o\\ ATTEST: 04/16/2024 •o · e• \n:c., . !j: THOMASA.WILDER \n~t, . • :<: DISTRICT CLERK \n\\\\. ~;hARRANT COUNTY, TEXJ \n••.:Q ;;:.•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1517
    },
    {
      "page_number": 103,
      "text": "UNDER THE ORDER DIFFERS BY EITHER 20 PERCENT OR $100 FROM THE AMOUNT \nTI-IAT WOULD BE AWARDED IN ACCORDANCE WITH THE CHILD SUPPORT \nGUIDELINES. \nWarnings to Parties \nWARNINGS TO PARTIES: FAILURE TO OBEY A COURT ORDER FOR CHILD \nSUPPORT OR FOR POSSESSION OF OR ACCESS TO A CHILD MAY RESULT IN \nFURTHER LITIGATION TO ENFORCE THE ORDER, INCLUDING CONTEMPT OF \nCOURT. A FINDING OF CONTEMPT MAY BE PUNISHED BY CONFINEMENT IN JAIL \nFOR UP TO SIX MONTHS, A FINE OF UP TO $500 FOR EACH VIOLATION, AND A \nMONEY JUDGMENT FOR PAYMENT OF ATTORNEY'S FEES AND COURT COSTS. \nFAILURE OF A PARTY TO MAKE A CHILD SUPPORT PAYMENT TO THE \nPLACE AND IN THE MANNER REQUIRED BY A COURT ORDER MAY RESULT IN THE \nPARTY'S NOT RECEIVING CREDIT FOR MAKING THE PAYMENT. \nFAILURE OF A PARTY TO PAY CHILD SUPPORT DOES NOT JUSTIFY \nDENYING THAT PARTY COURT-ORDERED POSSESSION OF OR ACCESS TO A \nCHILD. REFUSAL BY A PARTY TO ALLOW POSSESSION OF OR ACCESS TO A \nCHILD DOES NOT JUSTIFY FAILURE TO PAY COURT-ORDERED CHILD SUPPORT TO \nTI-IAT PARTY. \nProperty and Parties \nThe Court finds that the following orders respecting the property and parties are \nnecessacy and equitable. \nIT IS ORDERED that MORGAN MYERS shall be responsible for the timely payment of \nthe following:",
      "char_length": 1238
    },
    {
      "page_number": 104,
      "text": "I. The auto insurance for the vehicle in her possession; \n2. the monthly payment for her cell phone; \n3. the rent payment for the residence located at 6641 Anns Court, Watauga, \nTexas beginning after March 30, 2024. \nIT IS ORDERED that CHARLES MYERS shall be responsible for the timely payment of \nthe following: \n1. The auto insurance for the 2021 Mazda, the 2023 Mazda, and any other \nvehicle currently in his possession; \n2. the car payments for the 2021 Mazda, the 2023 Mazda, and any other \nvehicle currently in his possession; \n3. the monthly payment for his cell phone; \n4. the rent payment for the residence located at 6641 Anns Court, Watauga, \nTexas for February and March 2024. \nIT IS ORDERED that Petitioner have the exclusive and private use and possession of the \nfollowing property while this case is pending: the personal property and clothing in her \npossession, the 2007 Mazda motor vehicle currently in her possession, and the residence located \nat 6641 Anns Court, Watauga, Texas beginning March 30, 2024. \nIT IS ORDERED that Respondent have the exclusive and private use and possession of \nthe following property while this case is pending: the personal property and clothing in his \npossession, the 2021 Mazda motor vehicle, the 2023 Mazda motor vehicle, and the residence \nlocated at 6641 Anns Court, Watauga, Texas ONLY until March 20, 2024. \nCo-Parenting Website \nIT IS ORDERED that the parties are to attend \"Children in the Middle\" part 1 and/or 2 \n•-•~;~;:R~;_-.. A CERTIFIED COPY f'l' ~J: 'o\\ ATTEST: 04/16/2024 \n: 8 . ~: THOMAS A. WILDER \n~ t, :<: DISTRICT CLERK \n••~,- ~~lTARRANT COUNTY, TEXI \n•.:Q ~~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1670
    },
    {
      "page_number": 105,
      "text": "by May 1, 2024, and file a certificate of completion with the Court for their attendance to this co­\nparenting class. \nIT IS FURTHER ORDERED that each party shall be solely liable for their own costs for \nthe attendance of this co-parenting class. \nApp Close \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS each shall, within \nten days after the entry of the Associate Judge's Report is signed by the Court, obtain at his/her \nsole expense a subscription to the AppClose program. IT IS FURTHER ORDERED that \nMORGAN MYERS and CHARLES MYERS each shall maintain that subscription in full force \nand effect for as long as the child is under the age of eighteen years and not otherwise \nemancipated. \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS shall each \ncommunicate through the AppClose program with regard to all communication regarding the \nchildren, except in the case of emergency or other urgent matter. \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS each shall timely \npost all significant information concerning the health, education, and welfare of the children, \nincluding but not limited to the children's medical appointments, the children's schedules and \nactivities, and request for reimbursement of uninsured health-care expenses, on the AppClose \nwebsite. However, IT IS ORDERED that neither party shall have any obligation to post on that \nwebsite any information to which the other party already has access through other means, such as \ninformation available on the website of the children's schools. \nIT IS FURTHER ORDERED that MORGAN MYERS and CHARLES MYERS shall \neach timely post on the AppClose website a copy of any email received by the party from the \n••m•;_;;;;:;~;,-.. A CERTIFIED COPY \n(,~ ~-'6\\ ATTEST: 04/16/2024 \n{8 . • i1 THOMAS A. WILDER \ntt, • -'<: DISTRICT CLERK \n••i.~ +°!;/TARRANT CO~NTY, TEXJ \n•••? ~•• BY: /s/ Catherine Saenz \n••••••••",
      "char_length": 1885
    },
    {
      "page_number": 106,
      "text": "children's school or any health-care provider of the children, in the event that email was not also \nforwarded by the school or health-care provider to the other party. \nFor purposes of this section of this order, \"timely\" means on learning of the event or \nactivity, or if not immediately feasible under the circumstances, not later than twenty-four hours \nafter learning of the event or activity. \nBy agreement, the parties may communicate in any manner other than usmg the \nAppClose program, but other methods of communication used by the parties shall be in addition \nto, and not in lieu of, using the AppClose program. \nTemporary Injunction \nThe temporary injunction granted below shall be effective immediately and shall be \nbinding on the parties; on their agents, servants, employees, and attorneys; and on those persons \nin active concert or participation with them who receive actual notice of this order by personal \nservice or otherwise. The requirement of a bond is waived. \nIT IS ORDERED that Petitioner and Respondent are enjoined from: \nI. Intentionally communicating with the other party in person or m any other \nmanner, including by telephone or another electronic voice transmission, video chat, in writing, \nor electronic messaging, by use of vulgar, profane, obscene, or indecent language or in a coarse \nor offensive manner, with intent to annoy or alarm the other party. \n2. Threatening the other party in person or in any other manner, including by \ntelephone or another electronic voice transmission, video chat, in writing, or electronic \nmessaging, to take unlawful action against any person, intending by this action to annoy or alarm \nthe other party. \n3. Placing a telephone call, anonymously, at any unreasonable hour, in an offensive \n.••m•~;~:..:~:;;.,... A CERTIFIED COPY \n::,~ ~··· ~--ATTEST: 04/16/2024 {8 . • 'i: THOMAS A. WILDER \n~t , -~i DISTRICT CLERK \n••~,; :1/~lrARRANTCOUNTY, TEXJ \n••• o ~;~• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 1972
    },
    {
      "page_number": 107,
      "text": "and repetitious manner, or without a legitimate purpose of communication with the intent to \nannoy or alarm the other party. \n4. Intentionally, knowingly, or recklessly causing bodily injury to the other party or \nto a child of either party. \n5. Threatening the other party or a child of either party with imminent bodily injury. \n6. Intentionally, knowingly, or recklessly destroying, removing, concealing, \nencumbering, transferring, or otherwise harming or reducing the value of the property of one or \nboth of the parties with intent to obstruct the authority of the Court to order a division of the \nestate of the parties in a manner that the Court deems just and right, having due regard for the \nrights of each party and the children of the marriage. \n7. Intentionally falsifying any writing or record, including an electronic record, \nrelating to the property of either party. \n8. Intentionally misrepresenting or refusing to disclose to the other party or to the \nCourt, on proper request, the existence, amount, or location of any tangible or intellectual \nproperty of one or both of the parties, including electronically stored or recorded information. \n9. Intentionally or knowingly damaging or destroying the tangible or intellectual \nproperty of one or both of the parties, including electronically stored or recorded information, \nand causing pecuniary loss or substantial inconvenience to the other party. \n10. Intentionally or knowingly tampering with the tangible or intellectual property of \none or both of the parties, including electronically stored or recorded information, and causing \npecuniary loss or substantial inconvenience to the other party. \n11. Selling, transferring, assigning, mortgaging, encumbering, or in any other manner \nalienating any of the property of one or both of the parties, whether personal property, real \n••■•~;~'.,'.~~'.;~••• A CERTIFIED COPY \n:'\"_,4: ~_; i••• ATTEST: 04/16/2024 f 8 • 'i: THOMAS A. WILDER \n;t, , -~: DISTRICTCLERK \n\\~_,, ~iTARRANT COUNTY, TEXJ \n•••:? f.••• BY: /s/ Catherine Saenz \n••••••••",
      "char_length": 2060
    },
    {
      "page_number": 108,
      "text": "property, or intellectual property, and whether separate or community property, except as \nspecifically authorized by this order. \n12. Incurring any debt, other than legal expenses in connection with this suit, except \nas specifically authorized by this order. \n13. Withdrawing money from any checking or savmgs account in any financial \ninstitution for any purpose, except as specifically authorized by this order. \n14. Spending any money in either party's possession or subject to either party's \ncontrol for any purpose, except as specifically authorized by this order. \n15. Withdrawing or borrowing money in any manner for any purpose from any \nretirement, profit-sharing, pension, death, or other employee benefit plan, employee savings \nplan, individual retirement account, or Keogh account of either party, except as specifically \nauthorized by this order. \n16. Withdrawing, transferring, ass1gnmg, encumbering, selling, or in any other \nmanner alienating any funds or assets held in any brokerage account, mutual fund account, or \ninvestment account by one or both parties, regardless of whether the funds or assets are \ncommunity or separate property and whether the accounts are self-managed or managed by a \nthird party, except as specifically authorized by this order. \n17. Withdrawing or borrowing in any manner all or any part of the cash surrender \nvalue of any life insurance policy on the life of either party or a child of the parties, except as \nspecifically authorized by this order. \n18. Entering any safe-deposit box in the name of or subject to the control of one or \nboth of the parties, whether individually or jointly with others. \n19. Changing or in any manner altering the beneficiary designation on any life",
      "char_length": 1736
    },
    {
      "page_number": 109,
      "text": "insurance policy on the life of either party or a child of the parties. \n20. Canceling, altering, failing to renew or pay premiums on, or m any manner \naffecting the level of coverage that existed at the time this suit was filed of, any life, casualty, \nautomobile, or health insurance policy insuring the parties' property or persons including a child \nof the parties. \n21. Opening or diverting mail or email or any other electronic communication \naddressed to the other party. \n22. Signing or endorsing the other party's name on any negotiable instrument, check, \nor draft, including a tax refund, insurance payment, and dividend, or attempting to negotiate any \nnegotiable instrument payable to the parties or the other party withou~ the personal signature of \nthe other party. \n23. Taking any action to terminate or limit credit or charge cards in the name of the \nparties or the other party, except as specifically authorized in this order. \n24. Discontinuing or reducing the withholding for federal income taxes from either \nparty's wages or salary. \n25. Destroying, disposing of, or altering any financial records of the parties, including \nbut not limited to a canceled check, deposit slip, and other records from a financial institution, a \nrecord of credit purchases or cash advances, a tax return, and a financial statement. \n26. Destroying, disposing of, or altering any email, text message, video message, or \nchat message or other electronic data or electronically stored information relevant to the subject \nmatter of this case, whether stored on a hard drive, in a removable storage device, in cloud \nstorage, or in another electronic storage medium. \n27. Modifying, changing, or altering the native format or metadata of any electronic \n•••11•:;;;~;R~'.v;•••• A CERTIFIED COPY \n:::,., ~' 'c,•. ATTEST: 04/16/2024 {8. 'i: THOMASA. WILDER \n:,t, , -~i DISTRICTCLERK \n0•:I;,., ~~Ir ARRANT COUNTY, TEXJ \n••~:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1960
    },
    {
      "page_number": 110,
      "text": "data or electronically stored infonnation relevant to the subject matter of this case, whether \nstored on a hard drive, in a removable storage device, in cloud storage, or in another electronic \nstorage medium. \n28. Deleting any data or content from any social network profile used or created by \neither party or a child of the parties. \n29. Using any password or personal identification number to gain access to the other \nparty's email account, bank account, social media account, or any other electronic account. \n30. Consuming, use or have in their possession any illegal drug or drugs at any time \nnor shall they have, at any time, a legal drug or drugs in their possession for which that party \ndoes not have a prescription. \n31. Neither party shall consume alcohol at least 12 hours prior to their time for \npossession of the children. \n32. Neither party shall consume alcohol during their period of possession with the \nchildren. \n33. Neither party shall attend one of the children's activities if they have consumed \nalcohol or they are under the influence of alcohol. \n34. Neither party shall leave the children with a person who is consuming alcohol at \nleast 12 hours prior to taking possession of the children or has in their possession an illegal \ndrug(s), including prescription drugs, as a childcare provider. \n35. No disparaging remarks in the presence of the children and no discussion of \nlitigation or issues of the case with children. \n36. The parties are not to discuss the litigation or issues with the children about the \nother party. The aforementioned sentence means that neither party shall belittle, talk bad, refer to \n••m•~;~'.:R';;~'.;;_-.. A CERTIFIED COPY \n/~~ ~·- <'cf~ ATTEST: 04/16/2024 \n:8 , ~: THOMAS A. WILDER it :<: DISTRICTCLERK \n••~_, ~~lrARRANT COUNTY, TEX/ \n•.:Q ~~-• BY: /s/ Catherine Saenz \n•••••·••••",
      "char_length": 1847
    },
    {
      "page_number": 111,
      "text": "the other party using a profane name or names, profanity or curse words. \n37. The parties are not to discuss the litigation or issues with the children. \n38. Neither party shall discuss what occurred in Court including testimony of any \nwitness or witnesses with the children. \nIT IS ORDERED that Petitioner is further enjoined from: \n1. Entering, operating, or exercising control over the 2021 Mazda motor vehicle and \nthe 2023 Mazda motor vehicle in the possession of Respondent. \nIT IS ORDERED that Respondent is further enjoined from: \n1. Excluding Petitioner from the use and enjoyment of the residence located at 6641 \nAnns Court, Watagua, Texas on or after March 30, 2024;. \n2. Entering, operating, or exercising control over the 2007 Mazda motor vehicle in \nthe possession of Petitioner. \nIT IS ORDERED that Petitioner is specifically authorized: \nTo make expenditures and incur indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medical care. \nTo make expenditures and incur indebtedness for reasonable attorney's fees and expenses \nin connection with this suit. \nTo make withdrawals from accounts m financial institutions only for the purposes \nauthorized by this order. \nIT IS ORDERED that Respondent is specifically authorized: \nTo make expenditures and incur indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medical care. \nTo make expenditures and incur indebtedness for reasonable attorney's fees and expenses \n.••m•~f,~'..:RR~'.;;_-... A CERTIFIED COPY /~ ~· '6\\ ATTEST: 04/16/2024 :8. i: THOMASA.WILDER !t --<! DISTRICT CLERK \n••:.,_, ~,6'.:TARRANTCOUNTY, TEXJ \n••.:o ~;~• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1740
    },
    {
      "page_number": 112,
      "text": "in connection with this suit. \nFor purposes of this order, \"personal property\" includes, but 1s not limited to, the \nfollowing: \na. cash, checks, traveler's checks, and money orders; \nb. funds on deposit in financial accounts with commercial banks, savings banks, and \ncredit unions; \nc. funds and assets held in brokerage, mutual fund, and other investment accounts; \nd. publicly traded stocks, bonds, and other securities; \ne. stock options and restricted stock units; \nf. bonuses; \ng. closely held business interests; \nh. retirement benefits and accounts; \n1. deferred compensation benefits; \nJ. insurance policies, annuities, and health savings accounts; \nk. motor vehicles, boats, airplanes, cycles, mobile homes, trailers, and recreational \nvehicles; \n1. money owed to one or both parties, including notes and expected income tax \nrefunds; \nm. household furniture, furnishings, and fixtures; \nn. electronics and computers; \no. antiques, artwork, and collections; \np. sporting goods and firearms; \nq. jewelry and other personal items;",
      "char_length": 1039
    },
    {
      "page_number": 113,
      "text": "r. pets and livestock; \ns. club memberships; \nt. travel award benefits and other award accounts; \nu. crops, farm equipment, construction equipment, tools, leases, cemetery lots, gold \nor silver coins not part of a collection, tax overpayments, loss carry-forward deductions, lottery \ntickets/winnings, stadium bonds, stadium seat licenses, seat options, season tickets, ranch brands, \nand business names; \nv. digital assets such as email addresses, social network accounts, Web sites, domain \nnames, digital media such as pictures, music, e-books, movies, and videos, biogs, reward points, \ndigital storefronts, artwork, and data storage accounts; \nw. virtual assets such as virtual pets, avatars, accessones for virtual characters, \nvirtual prizes, virtual real estate, and virtual currency; \nx. safe-deposit boxes and their contents; \ny. storage facilities and their contents; and \nz. contingent assets. \nDuration \nThese Temporary Orders shall continue in force until the signing of the Final Decree of \nDivorce or until further order of this Court. \nA>Jt1t1tl \nAPPROVED AS TO FORM ONLY: \nMARX ALTMAN & JOHNSON .TT.JDGE PRESIDING \n······R_······ ••-•c,f'tA '4.\\-;•. ACERTIFIEDCOPY \n1~~ w~ <'i\\ ATTEST: 04/16/2024 :8 . z: THOMAS A. WILDER \n~t, ., .:::; DISTRICT CLERK \n•~_,, ~..e,;hARRANTCOUNTY, TEXJ \n••.:Q ~~~• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1349
    },
    {
      "page_number": 114,
      "text": "2905 Lackland Rd. \nFT. WORTH, Texas 76116 \nTel: (817) 926-6211 \nFax: (817) 926-6188 \nBy:--.i.....,,c_+µ--fi-2~----------­\nCooper \nAttorne for Petitioner \nState Bar No. 24121530 \ncoopercarter@majadmin.com \nDaniel R. Bacalis PC \n669 Airport Freeway \nSuite 307 \nHurst, TX 76053 \nOffice Phone: (817)498-4105 \nFax: (817)282-0634 \nBy: ________________ _ \nDaniel Bucalis \nAttorney for Respondent \nState Bar No. 01487550 \nEmail: dbacalis@dbacalis.com \nAPPROVED AND CONSENTED TO AS TO BOTH FORM AND SUBSTANCE: \nMORGAN MYERS \nPETITIONER \nCHARLES MYERS \nRESPONDENT \n.~c:;~ARR~'.;;•.. A CERTIFIED COPY \nf~4'-- '6\\ ATTEST: 04/1612024 :8 . i: THOMAS A. WILDER !t :<J DISTRICTCLERK \n••:.,.., ~lrARRANTCOUNTY, TEXJ \n•••:?. ....... ••••• BY: /s/ Catherine Saenz",
      "char_length": 744
    },
    {
      "page_number": 115,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 85983756 \nFiling Code Description: No Fee Documents \nFiling Description: \nStatus as of 3/27/2024 7:40 AM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email TimestampSubmitted \nMORGAN MICHELLEMYERS morganmw02@gmail.com 3/26/2024 3: 19:25 PM \nCooper L.Carter coopercarter@majadmin.com 3/26/2024 3:19:25 PM \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email TimestampSubmitted Status \nDaniel Bacalis service@dbacalis.com 3/26/2024 3: 19:25 PM SENT \nTammy L.Johnson tjohnson@dbacalis.com 3/26/2024 3:19:25 PM SENT \nDaniel R.Bacalis dbacalis@dbacalis.com 3/26/2024 3:19:25 PM SENT \nCHARLES MYERS chuckdustin 12@gmail.com 3/26/2024 3:19:25 PM SENT Status \nSENT \nSENT \n······•• ..... \n••-•o~'\\\"AR~>,\"•. ACERTIFIEDCOPY \n/'.,\"\" ~--r>i'~ ATTEST: 04/16/2024 : 8 . ~: THOMAS A. WILDER \nt'G --<: DISTRICTCLERK \n',:.,\"' &,:lrARRANT COUNTY, TEXJ \n•••:?. ...... •••••• BY: /s/ Catherine Saenz",
      "char_length": 1307
    },
    {
      "page_number": 116,
      "text": ". EXHIBIT J \nAFFIDAVITS IN SUPPORT OF \nCHARLES MYERS",
      "char_length": 52
    },
    {
      "page_number": 117,
      "text": "\"THIS IS NOT A SUBSTITUTE F9ftJ;:ttMY-¥!CE OF AN ATTORNEY\" \nCause Number 322-7 44263-23 \n(Complete the heading so that it lookS eractly like the Peti!ion) \nMORGAN MICHELLE MYERS 1 \nPETITIONER \nV. \nCHARLES DUSTIN MYERS. § \n§ \n§ \n§ \n§ \n§ \n§ \nRESPONDENT § \nAffidavit \nTHE STATE OF __ TE_XA_S __ IN THE 322ND Dl5IBIGI COURT \nOF TARRANT COUNTY \nSTATE OF TEXAS \nCOUNTY OF ___ L~B_K--:--:---:-:-~~':':\"::\"~-\n<county where statement iS bemg notanzcdJ \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nMy name is ___ ~A~a...;.ro~n ____ -:-:-J::-=-____ W---:-at:-::s_on ____ _ \nFirst Mlddle Last \nI am of sound mind and capable of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct. \nI, Aaron Watson, affirm my association with the data service managed \nby Mr. Charles Myers over the past two years. During this time, Mr. Myers has \ndemonstrated a strong commitment to delivering high-quality service and has \nfrequently shared personal stories that highlight his devotion to his daughters. \nHis efforts to maintain a balance between his professional responsibilities and his \ncommitment to family, such as surprising his daughters with lunch dates \nand celebrating significant family events, have endeared him to his customer \nbase and fostered a close-knit community. \nAffidavit",
      "char_length": 1498
    },
    {
      "page_number": 118,
      "text": "However, since December 2023, there has been a notable decline in the \nreliability and efficiency of the service provided. This shift coincides with Mr. \nMyers facing significant personal and legal challenges, including a divorce \nproceeding that has drastically impacted his ability to operate his business \neffectively. A particularly distressing development for Mr. Myers has been his \ninability to access the physical location where his business equipment and \ndata connections are housed. This situation has not only disrupted the service \nbut has also imposed significant financial difficulties on Mr. Myers, threatening \nthe sustainability of the business and the quality of service that customers \nhave come to expect. \nThe repercussions of these challenges have been felt deeply by both Mr. \nMyers and his clientele. While the community understands and sympathizes \nwith Mr. Myers' personal struggles, the increasing service disruptions have \nraised concerns among users about the future reliability and viability of the \nservice. We are hopeful for a resolution that will allow Mr. Myers to regain \naccess to his business infrastructure, thereby restoring the service quality and \nreliability that we have valued highly. It is in the interest of both Mr. Myers and \nhis customers to find a solution that addresses these operational challenges \nwhile supporting him through his personal difficulties, ensuring the long-term \nsuccess and sustainability of the service. • \nSigned this _._l ..... l __ day of Mt>-'C\"\"C.. k \n~W-1:.rs,;.· \n(signature of affiant) \nState of ___ 1i...:..;e ..... x~!4,q......,Sc...-____ _ \nCounty of ___ w_~ __ b&.-'O .... C .... ¾:~-----\nSworn to and subscribed to before me on ___ _!..M.-!..::~::..rth~~l ~I~--' ..... '2=0 ___ (l_i.J_ \n(date) \nby ___ eor~c~O-=-:--i\\l\\\\!-:LO,~tsc~t+-n~---· \n(insert printed name of affiant) \nMy commission expires: /J'l • 24 • 207J/) \nAffidavit Page2of2 \n····~:.::~···· ••11:._of \"\"\"',-••• A CERTIFIED COPY \n:°'>,._ ~'\" i\\ ATTEST: 04/15/2024 \n:8 -ii THOMAS A. WILDER \n~~ :<! DISTRICTCLERK \n\\~,.,. ~/TARRANT COUNTY, TEXJ \n••'! •••• BY: /s/ Catherine Saenz \n••••·•••",
      "char_length": 2134
    },
    {
      "page_number": 119,
      "text": "322-7 44263-23 \nHTHIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY~ \nCause Number 322-7 44263-23 \n(Complete the heading so that it looks exactly like the Petition) \nMORGAN MICHELLE MYERS 1 IN THE 322ND DISTRICT COURT \nPETITIONER § \n§ \n§ \nV. \nCHARLES DUSTIN MYERS, § \n§ \n§ \n§ \nRESPONDENT § \nAffidavit \nTHE STATE OF New York \nCOUNTY OF Suffolk \n(county where statement is being notarized) OF TARRANT COUNTY \nSTATE OF TEXAS \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nMy name is _ ___;B:=..:..::ri=a~n~n=a;__ __ ____;N~ic::-::o~le-=-____ G--:-a-:lb:-o _____ _ \nFirst Middle Last \nI am of sound mind and capable of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct. \nThis statement serves as a formal declaration of my support for Mr. Charles Myers in light \nof recent challenges that have resulted in him being unjustly denied access to his home, where \nhis business equipment and operations are based. As a paying client for two years prior to this \nincident, Mr. Myers maintained a flawless record of uninterrupted service, reflecting his \nhardworking nature and commitment to excellence. Mr. Myers's dedication to improving both his \npersonal capabilities and the quality of his products has been the cornerstone of his reputation. \nThe denial of Mr. Myers's access to his home has not only caused significant service \ndisruptons but has also resulted in considerable financial losses for Mr. Myers, myself, and other \npaying clients that rely on the services that he offers. As someone directly affected by this \nsituation, I have witnessed firsthand the stress and financial strain placed on Mr. Myers, compounded \nAffidavit ····~······ ••-~o•\"' ~;.-.. A CERTIFIED COPY \n:°::,~ ~• ~\\ ATTEST: 04/16/2024 •0 • c.• : u . Z: THOMAS A. WILDER \ni.; -~i DISTRICTCLERK \n\\~.,, ~_.e,~/rARRANTCOUNTY, TEXJ \n••?? ~:•• BY: /s/ Catherine Saenz \n•••··••••",
      "char_length": 2082
    },
    {
      "page_number": 120,
      "text": "by the loss of income and client dissatisfaction resulting from these unprecendented service \ninterruptions. \nI solemnly affirm that the statements herein are true to the best of my knowledge and belief, \nprovided In support of Mr. Charles Myers to highlight the unjust circumstances leading to the \nfinancial and operational setbacks experienced. I submit this affidavit to express the urgent need \nfor a resolution that addresses the losses incurred and to support the reinstatement of \naccess to Mr. Myers's home for the restoration of business operations. It is my sincere hope that \nthe court will recognize the undue hardship placed on Mr. Myers and facilitiate a swift resolution \nto restore his access to his home and thereby his ability to conduct business without further \ndisruptions. \nSigned this 1 0th day of _______________ _, March 2024 \n~fafflanl) \nstate of Texas \nCounty of Denton \nSworn to and subscribed to before me on 03/10/2024 --------,-,---,--___;,;;__ ___ _ \n(date) \nby ___ B7R7.\"\"l-:--:A\"\"7\"\"N::'-'.N~A;..;..N.;.;..IC~O~LE=-=G~A=LB=-O=-· \n(insert prinlod namo of affiant) \n(sign:iture of no::wal officer) \n[NOTARY SEAL] My commission expires: 06/03/2025 \nAffidavit ·•·;········ ••-~\"~ ~;_,., A CERTIFIED COPY ll -~ ~\\ ATTEST; 04/16/2024 \n:1.1 • ,1\\TJ ~: THOMAS A. WILDER \n~.\\; · ;f DISTRICT CLERK \n••~J>. './.°'./TARRANT COUNTY, TEXJ \n•••?. •••••• r-••• BY: /s/ Catherine Saenz",
      "char_length": 1403
    },
    {
      "page_number": 121,
      "text": "I Signed by: Latoya Lynn Reese \nTime: 2024-03-10 15:26:41 UTC \nURL: https://notarylive.com \n••• :;;;~~~;••• A CERTIFIED COPY l;--0.., ATTEST: 04/16/2024 {8. ~ 'i\\ THOMAS A. WILDER \n:t, ,l'JirJ .~: DISTRICTCLERK \n•••t \"iTARRANT COUNTY, TEXJ \n••.f~o m• BY: /s/ Catherine Saenz .. .. ••••••••",
      "char_length": 289
    },
    {
      "page_number": 122,
      "text": "322-7 44263-23 \n\"THIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY** \nCause Number _ ___:3::.::2==2=--7=-4.::...4=-=2:.:::6;.:.3-=-2=3~---\n•• • #. • -~• .•:: . .,' I \nMORGAN MICHELLE MYERS, IN THE 322ND QJSTRJCT COURT \n§ \nPETITIONER § \n§ \nV. § OF TARRANT COUNTY \n§ \nCHARLES DUSTIN MYERS. § \n§ ______ ____,,R..w,e ..... s.._p,_O.u.NCw.1E--.N~J § STATE OF TEXAS \nAffidavit \nTHE STATE OF Texas \nCOUNTY OF Dallas -----------., ,:; •~~ ':!.':._.,-,_ ::,~.i~~ll~f':;',: ~,t\";,,,:, :,,:::,:•:~i;f. \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nChristian Michael Vroom My name ls ___________________ _ \n; ' ·; ;, ... \nI am of sound mind and capable of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct. \nI'm signing this affidavit to attest to the work ethic and \ndedication of Charles Myers. I've come to rely on the \nservices he provides in order to gather the required data to \nmake educated decisions on what and when to enter/exit \noptions positions. Recently due to him not being at his \nnormal location of operations the services have had multiple \ndown times in which Charles was not in a position to be able \nto remedy. Some of these down times have led to significant \nlosses due to making decisions without the necessary data \nafter already being entered in a position. \nF ··11·~;;:.:;;;~;.-.. A CERTIFIED COPY \nf~\"' ,~ e>i\\ ATTEST; 04/16/2024 \n: 8 ~: THOMAS A. WILDER \n:~ :<: DISTRICT CLERK \n\\~~ :V4lTARRANTCOUNTY, TEXI \n••? C::~•• BY: Isl Catherine Saenz \n•••···•••",
      "char_length": 1708
    },
    {
      "page_number": 123,
      "text": "Charles' work ethic is unlike anything I've seen in anyone \nI've ever met and he does everything for the future of his \nfamily. I'm constantly amazed at the feats he is able to pull \noff as a one man show. Some things he is able to create \nI didn't think were possible but he figures it out through \nhis endless research and personal development efforts. \nAgain, everything I've seen him do. he does to give his \ngirls the best life he can and wants the world for them. \nI've seen videos of him with his children out at many \ndifferent parks/recreational areas and I can tell that they \nlove their father to death and that he would die for them. \nI hope his situation is resolved for not only my benefit but \nfor the sakes of his children and the life he is trying to \nprovide them with. Charles Myers is both a good person and \namazing father and I would hate to see him and his daughters \nrobbed of the life he is building that they need and deserve. \nSigned this 1 0th day of March 2024 \n' . \n~~ \n(s1grmtwc of aff,ant/ \nState of Texas \nCounty of Dallas \nSworn to and subscribed to before me on 03/10/2024 \nChristian Michael Vroom ((fJ/eJ \nby . \nu11:.t·rt /Jt,li!(:<111:,111,• ot ,,!!,.inti \n._,,•'\\\\;~11,;~1,,~, • • ~ ,,' ~\":-······· . .t< ~ Jenrufer Frazier \n{ {~\\~\\ Notary Public, State of Texas : ! : ~ (s1gnatur,• of 11otC1flJI officer) \\•).. /~! Comm. Expires 03-16-2026 \\,tf,·o,~-f Notary ID 131492357 \n,,,.11111 \nd•··· .. ,, \"' Notarized nline with NotaryLh'e.com My commission expires: 03/16/2026 \n~---'\"' _ ...... \n' ,••m•~;;:.:;~+;_,•,. A CERTIFIED COPY \n/,& ~-\"i~ ATTEST: 04/16/2024 :8 ~: THOMASA.WILDER \n~t, --<! DISTRICT CLERK \n•.;a._ ~lrARRANT COUNTY, TEXJ \n••~?. ....... ••••• BY: /s/ Catherine Saenz",
      "char_length": 1718
    },
    {
      "page_number": 124,
      "text": "322-7 44263-23 \n.. THIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY .. \nCause Number 322-744263-23 -----'-=::;;__'--'__;..;;=-=-~~~----( C<> m; >ff'/ { • //w hrMf,ng $0 11,.,1 ,1 Joo~s ,.,,,r.rly hkn 1/•o l'd,Mn} \nMORGAN MICHELLE MYERS \n1 \n§ \nPETITIONER § \n§ \nV. § \nCHARLES DUSTIN MYERS i \n§ \n8E$PONDft:,tT § \nAffidavit \nrHesTAreoF Ca ltc fo/'¥1..1 ... {L \nCOUNTY OF ,4-l--a oi s}q tl.5 \nrcounty where st.JIE>mont ,s bci\"g not:mLollJ IN THE 322ND DISTRICT COURT \nOF TARRANT cm JNIY \nSTAIE Of TEXAS \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nMy name is )\\9 (II\\\\( ,S\\cJe ~ t lr::i;-= . \nFirst { Midd.'o :isl \nI am of sound mind and capable of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncrimi • h' ement is true and co \nAfftd:JVit Page 1 of 2 \n••11•~;~'..'.~;,-.. A CERTIFIED COPY \n/;~ ~ ~\\ ATTEST: 04/15/2024 :8 • 'i: THOMAS A. WILDER \\~ ::q DISTRICTCLERK \n••~~ ~~;.\"TARRANT COUNTY, TEXJ \n•• Q ~;.• BY: /s/ Catherine Saenz \n•••····•••",
      "char_length": 1123
    },
    {
      "page_number": 125,
      "text": "CALIFORNIA JURAT WITH AFFIANT STATEMENT GOVERNMENT CODE§ 8202 \n~~~~~~~~:.oQ(~~~~~oeo~~~~lOCO~oae.occ~,co~~ \nA notary public or other officer completing this certificate verifies only the identity of the Individual who signed the \ndocument to which this certificate Is attached, and not the truthfulness, accuracy, or validity of that document. \nState of California \nCounty of .... S ... ta ___ n....,is...,ta .... u .... s ____ _ \nSeal \nPlace Notary Seal Above Subscribed and swom to (or affirmed) before me \non this \nby 11 day of __ M=ar:.:ce.:.h __ • 20~ \nDate Month Year \n(1) DANNY SLADE BURT \n(and (2)1-==========~ ), \nName(,J,of Signet(,JJ \nproved to me on the basis of satisfactory evidence \nto be the person~ who appeared before me. \n/ J -~ -Signatura__,:.,,J-2~-----'-,r-:--~-t­\nSignature of Notaryjjbiic \n--------------oPTIONAL \nThough this section is optionaf, completing this information can deter alteration of the document or \nfraudulent reattachment of this form to an unintended document. \nDescription of Attached Document \nTrtle or Type of Document AFEIDAYII Document Date: MARCH 11, 2024 \nNumber of Pages: _2_ Slgner(s) Other Than Named Above: .... N .... IA......_ ___________ _ \n02014 National Notary Msoelatlon • www.NationalNotary.org • 1-800-US NOTARY (1·800-876-6827) Item 15910 \n•••m•;;;~:.::.;;~~_;.,... A CERTIFIED COPY \nl::,\"' ~- ~~ ATTEST: 04/15/2024 :8 %\\ THOMAS A, WILDER \n~Y, - :</ DISTRICT CLERK \n\\~,.,. ::,,_.e:~1TARRANT COUNTY, TEXJ \n••? f.~•• BY: Isl Catherine Saenz \n••••·•••",
      "char_length": 1511
    },
    {
      "page_number": 126,
      "text": "-\n322-7 44263-23 \n-rHIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY\" \nCause Number 322-744263-23 --------------- 1 C. o ~ 1 pie I e the heaamg so 1/Jat 1/ /0011s ,u:,ctty /;ko tne i-'otrt,onJ \nMORGAN MICHELLE MYERS, • IN THE 322ND Dl$IBICT COURT \n§ \nPETITIONER § \n·§ v. § \n§ \nCHARLES DUSTIN MYERS, § \n§ \nRESPONDENT § \nAffidavit \nTHE STATE OF /h.l C '1,· q~,J \n. (/ \nCOUNTY OF (j \". lL l s.,N 'J \n(county where statement is being notarized) CE TARRANT CQIINIY \nSTATE Of TEXAS \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \n·. . J clArJ • J l .. V °'rel My name 1s . U \\ A rJ • ~ \nFirsl Midd/11 Last \nI am of sound mind and capable of making this statement. I have personal knowfedge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct.. \n~ CA.Vy'\\. C,\\ C.U. et-=>'\\. '1 ·n~vQ S\\or :fL'-0...1 ~A.S &<r-> \n4 / 0,~ys: need tA.>or le :-~,'J d ~ l l: r<,,Jf{':f +o /Lee e \n/Ii< S:ec Ji c: es ~c-...~ l \"'-L-te ±-P LMe, $ ~e 0fi:'-£, \n' u s :\\:: u ~ «-s Ovv~ I rv0 es f-<) r ~ :f:,tj C IA.-=< I., .s \ncbu t~s {At-...s-b~-t,-J -~ck:e~ ou @P· ~ f e:rce a \n~\\JS'< .... e .s s e,;_\"\" c! \\) i,..l .!. .t (' ~ cl·, r h'.t' l ,-j o( \n/..lf,::J~vil",
      "char_length": 1320
    },
    {
      "page_number": 127,
      "text": "I \n~;;,:;, c\\C ; c:? , ~\\ 5 ½,\"-S D, ~ 1H•rs~ I__'-t ef Pe c.J,..e,;J \nv\"\\'2 c-.r-Jl vC!>)uf\" 0~t~cc C\\.;..e,...,-\\-r ¼ j,-jJRs-hrs 1 !;;!~'~.=;- (kc \\es c,-~,)-1- a:c\"-d; \nState of \\/Vl. I. CA\"', rj Ced \nCounty of ()0-.lc..\\c.,r-1 ~ \n'Sworn to and subscribed to before me on ___,,1,0;...,.c]~/L....lo\"\"'---'--9 ;r.--:~~o---a ...:..y __ \nby .Io h Q r IA l i a fl V q rt{(( ~ (da!eJ \n(111:crt printed n:Jmc of :Jlfiilnt) \n•. f:JOI\\Jlure cf ~'!JI o.1roe,1 \n~ M~ com~ission expires: QJ1t ,1 u, oa. J \nPage2d2 \n··•••••••· •~\"~ \"\"~~;.,.. A CERT ED COPY /~\"11·\"' ('~\\ ATTEST 4/16/2024 \n:0 • ,t\\'r.J !i:.-UIQl~.WILDER \n~~ :,\"/ DISTRICT CLERK \n••~•~ ~/TARRANT COUNTY, TEX., \n••?. •••• BY: /s/ Catherine Saenz \n•••••••",
      "char_length": 709
    },
    {
      "page_number": 128,
      "text": "\"THIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY.,. \n322-744263-23 \nCause Number 322-7 44263-23 \n/Complete the heading so I/Jal ii looks exactly like the Petition) \nMORGAN MICHELLE MYERS, \nPETITIONER IN THE 322ND DISTRICT COURT \nV. \nCHARLES DUSTIN MYERS. \nRESPONDENT § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \nTHE STATE OF California \nCOUNTY OF San Diego Affidavit \n(county where statement is being notarized) OF TARRANT CQlJNJY \n$TATE OF TEXAS \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nMy name is· Luz Maria Obie \nFirst Middle Last \nI am of sound mind and capable.of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct. \nI subscribed for an extensive education program under Charles Myers to gain expertise in \nreading and researching market data. Charles Myers, a dedicated father, teacher. and \nmentor, has been instrumental in inspiring myself and numerous others to independently \npursue knowledge in the field of financial data. The instability in Charles Myers' living \nsituation has adversely affected his ability to fulfill his work commitments to the best of \nhis capacity. This instability has had a significant impact on my ability to efficiently learn \nand absorb the subject matter, as Charles Myers is unable to work full time from his \nhome office. Charles Myers requires a meticulously crafted computer setup to efficiently \nmanage and process extensive data sets anc1 resource-mtensivc programs essential for his \nwork in market research and education. The consequence of Charles Myers' restricted \nAffidavit Page 1 of2 l i \nl",
      "char_length": 1767
    },
    {
      "page_number": 129,
      "text": "work environment has directly impacted my financial education. limiting my access to \nthe full breadth of knowledge and guidance originally anticipated, and finances. I affinn \nthe truth and accuracy of the foregoing statements to the best of my knowledge, belief. \n. and understanding, under penalty of perjury. \nSigned this 13th day of__,;, ____ M_a_rc_h ________ __, ___ 2_0_24 __ \nState of Texas -------'---'----------\nCounty of _P_a_r_ke_r ___________ _ \nSworn to and subscribed to before me on _____ 0_3_/1_3_/2_0_2_4 _____ _ \n(date) \nPaluru Shepard \nlursa Shepard \nic. State o Texas \nElectr•nn~--.-.,..,....,1wm!!f!d-rm!rmn,!'ffl'l<rthlri\"r,:,i,I Platform. \n[NOTARY SEAL] My commission expires: 12/01/2026 \nAffidavit Page 2of2 \n····-:.······· ••-•o~'t \"\"~;.. ACERTIFIEDCOPY \nl:~ w i\\ ATTEST: 04/15/2024 :8 ~: THOMAS A. WILDER :t -~f DISTRICT CLERK \n••~h ~:lrARRANTCOUNTY, TEXJ ..... ,. . ••? ••• BY: Isl Catherine Saenz \n•••···•••",
      "char_length": 937
    },
    {
      "page_number": 130,
      "text": "'\"THIS IS NOT A SUBSTITU!Y--R!bW-~f'DVICE OF AN ATTORNEY** \nCause Number _ __,;;3-=2=-2-....;..7....;..44...;.;;2=-6c...;;3---\"-2\"'---'3;......_ __ _ \nMORGAN MICHELLE MYERS 1 IN THE 322ND DISTRICT COLJRT \n§ \nPETITIONER § \n§ \nV. § \n§ \nCHARLES DUSTIN MYERS, § \n§ \nRESPONDENT § \nAffidavit \nTHE STATE OF California \nCOUNTY OF ______ ora=-ng=e ________ _ \n(coun;y iinere sta:err,t:t1t JS Ct.~tnc; 11(,•(arrzed; OF TARRANT COUNTY \nSTATE OF TEXAS \nThe person who signed this affidavit, appeared in person, before me, the \nundersigned notary, and stated under oath: \nMy name is ____ N .... • .... rch....,o ..... la .... s....._ _____ G_le_n ______ M_o_rv_a_n _____ _ \nFirs! Lnsr \nI am of sound mind and capable of making this statement. I have personal knowledge of \nthe facts written in this statement. I understand that if I lie in this statement, I may be held \ncriminally responsible. This statement is true and correct. \nI am a paying customer of Charles Myers for the past two years and four months. In this time, he has been \nworking exclusively out of his home office to run his business. and provide for his family. \nCharles has worked very hard for the past two years to provide a quality experience that benefits \nall of his customers. His ability to provide these services have been directly impacted by his inability to \naccess his home office. As a result, my experience as a customer has suffered, and I am not receiving \nthe level of service that I have been paying for. I understand that there are unfortunate circumstances \nand I am patient while Charles resolves his situation. He has been incredibly apologetic that he cannot \nprovide the same level of quality, and uninterrupted service due to his inability to work out of his home \noffice. I do not question his integrity with regards to this situation, he has always been honest and upfront \nwith myself and others. My hope is that he may return to his home office in order to avoid shutting down \nAf!1d2vi1 Page 1 of2 \nACERTIFI \nATTEST: 0",
      "char_length": 2005
    },
    {
      "page_number": 131,
      "text": "the buisness that he has worked on day and njght for the past two years, \nSigned this 13tb day of March 2024 \nState of California \nCounty of Orange \nSworn to and subscribed to before me on ---------------by ______________ _ \n(in;e,t p!1ntc-tf n:nr-e r::f fi/l1J,1!l \n:t SEE:: A-TTA-C.\\{E. D copy \n[NOTl',RY SE1\\Lj My commission expires: oz/2-2.. /202.=,. \nI I \nPage 2 of2 \nACERTIFI \nATTEST:",
      "char_length": 390
    },
    {
      "page_number": 132,
      "text": "A notary public or other officer completing this \ncertificate verifies only the identity of the individual \nwho signed the document to which this certificate \nis attached, and not the truthfulness, accuracy, or \nvalidity of that document. \nState of California \nCounty of oR.AWG.6 \nSubscribed and sworn to ( or affirmed) before me on this I\"!)\"\"\" \nday of HA'2..C.\\.t 202.'f, by NI C.HO LA~ 0.L~~ \ntiO V..\\/Af.J ' proved to me on the basis of satisfactory evidence to be the \nperson(~ who appeared before me. \n1·a· ... :. 0 \n• 6\nT~MAS CUROOV • • l . \no . . ~ COMM. #2460276 : \nC. ~ IIOTARY PU81.IC· CALIFORIIIA ,' \nZ . ORAIIGE COUNTY . I •· !tr eo.. Expires Alli 22, 2027 ( r,~. (:a~ •••••••••• §ignature",
      "char_length": 702
    },
    {
      "page_number": 133,
      "text": "EXHIBIT K \nDENIAL ON RESPONDENT'S \nEMERGENCY MOTION TO \nVACATE 03/14/24",
      "char_length": 71
    },
    {
      "page_number": 134,
      "text": "322ND FAMILY DISTRICT COURT \nASSOCIA~jtl1'tm'S REPORT \nFOR TEMPORARY ORDERS \nCAUSE NUMBER: 322 ~ -'-7...:J.4..:.J-q..P.;;:.ulew3!.--_!,c~:;.::'3;___ ___ _ \nITMOTMO/INRE/ITIO \n§ \n§ \n§ \n§ \n§ IN THE DISTRICT COURT \nTARRANT COUNTY; TEXAS \n322ND JUDICIAL DISTRICT \nI, n ·w O'{~ ~ M()JCW\\t '~ MGri<n ~ ::h> \\JaCAttv ,1 \nciwu.e'd . \n. y,'\\~~I \n? ,,_-4\\.!;Z±:~·u.u-1m.ui0-Q~'.Al\\J~ w~MMt~M-----lM.t>J~U}!OMt~-${)ULIJll~,ulll---y:-fY..x..l>l!,CJ..J,·, fil=-__._M~~'---\"\"-=--'' 0~9-\"'--\"fxf~• _· -\nMhYYill:_1 '>-0M-°' \\1~ Cfb ® '-M c1tvl 61 ocptf Vu. V\\U di $-~ \n\\.\\,\\Ag Y\\AOI. ,\\d)-pJ) V\\OO'Lg, I r/o / t,. f J /4, G& J ,~ \"-0 _, J_ \nDate \n200 East Weatherford Street \nFort Worth, Texas 76196 -·",
      "char_length": 686
    },
    {
      "page_number": 135,
      "text": "EXHIBIT L \nPROPOSED PARENTING PLAN \n01/07/23",
      "char_length": 44
    },
    {
      "page_number": 136,
      "text": "IN THE DISTRICT COURT OF TARRANT COUNTY, TEXAS \n322ND DISTRICT FAMILY COURT \nMORGAN MICHELLE MYERS, § \nPlaintiff, § \n§ \nvs. § case No. 322-744538-23 \n§ \nCHARLES DUSTIN MYERS, § \nDefendant. § \nEXHIBIT A: TEMPORARY VISITATION ADJUSTMENT PROPOSAL \nRespondent: Charles Dustin Myers \nUnderstanding the intricate nature of our family's current situation and the legal complexities involved, I, \nCharles Dustin Myers, propose a thoughtful adjustment to the visitation schedule that aligns with our \ncohabiting status and the abrupt changes brought about by the divorce announcement \n1. Co-habitation Acknowledgement: \nIt is acknowledged that both parents currently cohabit, which complicates traditional custody \narrangements. Therefore, the immediate priority is to facilitate a transition where both parties can \nestablish their respective independent living and working arrangements without disrupting the children's \nlives. \n2. Transition Period: \nMorgan's Employment: Provide Morgan with the necessary support and time to secure stable \nemployment, which is vital for her to contribute to the children's needs and establish her own residence. \nStable Housing for Charles: As I seek stable housing to maintain my significant role in our daughters' \nlives, flexibility in visitation is essential to ensure I continue to fulfill my parental duties. \n••■•~;~'.:AA~;_,., A CERTIFIED COPY \nl~ ' \"o•, ATTEST: 04/15/2024 \n{8 ~ 'i\\ THOMAS A. WILDER \n;t, ,ll-!J -~: DISTRICT CLERK \\a..,. }1TARRANTCOUNTY, TEXJ \n•••:'! ~ BY: /s/ Catherine Saenz \n•••·••••",
      "char_length": 1541
    },
    {
      "page_number": 137,
      "text": "3. Work and Research Commitments: \nThe concurrent legal proceedings, particularly those based on unverified claims, demand a substantial \namount of my time for research and preparation to protect the children's well-being. \nMy ability to work has been affected by the proceedings, necessitating an adjustment in my day-to-day \nroutine to accommodate these new responsibilities. \n4. Interim Custody Logic: \nContinuity for Children: While we navigate these proceedings, it is critical to maintain stability and \ncontinuity for our children. Any temporary custody arrangements should reflect the least disruptive path \nforthem. \nCounseling and Mediation: I strongly advocate for counseling or mediation to reconcile and navigate the \ndivorce process, emphasizing the children's best interests rather than abrupt and contentious changes. \n5. Court's Facilitation: \nThe court's facilitation in endorsing a temporary and flexible visitation framework is crucial. This \nframework must account for the current living situation and the significant emotional and logistical \nupheaval thatthe divorce proceedings have caused. \nThis proposal is made in the spirit of cooperation, with a focus on minimizing the impact of our marital \ndissolution on our children. It is with a sincere hope that we can transition into a stable co-parenting \narrangement that keeps our children's welfare as the priority. \nRespectfully submitted, \nX ~~ c:;,\\-01-Jod.~ \nCharles D ·n Myers \n6641 Anne Court \nWatauga, Texas 76148 \n817-507-6562 \nChuckdustin12@gmail.com \n••~;;:.:~•• A CERTIFIED COPY \n.. --J,0 r~·-. ATTEST: 0411512024 \n{8 'i\\ THOMASA. WILDER \n~~ -~f DISTRICT CLERK \n\\~ ~,e,;:TARRANTCOUNTY, TEXI \n••!>o ~ ~•• BY: /s/ Catherine Saenz \n•••·····••••",
      "char_length": 1727
    },
    {
      "page_number": 138,
      "text": "Certificate of Service \nI hereby certify that a true and correct copy of the foregoing document, EXHIBIT A: TEMPORARY \nVISITATION ADJUSTMENT PROPOSAL, has been furnished to the following on 2024-01-07: \nTo Plaintiff: \nMorgan Michelle Myers \nEmail: morganmw02@gmail.com \nMethod of Service: \nVia electronic mail to morganmw02@gmail.com as per the agreement between parties for electronic \ncommunication. \nExecuted on this sixth day of January, 2024. \nx{~ \nCharles Dustin Myers \n6641 Anne Court \nWatauga, Texas 76148 \n817-507-6562 \nChuckdustin12@gmail.com \n.•·■•;;;}:.:AA~;.-•. _ A CERTIFIED COPY I~ ~· ('~\\ ATTEST: 04/15/2024 :8. ~: THOMASA.WILDER \n~\\:, :</ DISTRICT CLERK ••i,. ~~hARRANTCOUNTY, TEXI \n•.:o s\"!~•• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 747
    },
    {
      "page_number": 139,
      "text": "EXHIBIT M \nBACKGROUND REPORT FOR CASE \nCONSOLIDATION 01/03/24",
      "char_length": 61
    },
    {
      "page_number": 140,
      "text": "322-7 44263-23 \nBackground Report for Case Consolidation \nCase Details: \nDivorce Case (Cause No. 322-744263-23) in the 322nd District Court ofTarrant County, filed on \nDecember 18, 2023. \nProtective Order Case (Cause No. 322-744538-23) in the 322nd District Court ofTarrant County. \nReasons for Consolidation: \nInterconnected Issues: \nThe divorce case and the protective order case involve overlapping issues concerning family violence \nallegations, which are central to the divorce proceedings and directly affect custody and visitation rights. \nThe protective order case includes allegations of family violence, which are also a pivotal point in the \ndivorce case in determining the waiver of the standard waiting period for the divorce. \nConsistency In Rulings: \nConsolidating the divorce and protective order cases would ensure consistency in the court's findings, \nparticularly regarding any allegations of family violence and their impact on the dissolution of marriage, \ncustody, and visitation rights. \nJudicial Economy: \nHearing both cases together would promote judicial economy by avoiding duplication of legal \nproceedings, as both cases are likely to involve similar witnesses, evidence, and legal arguments. \nClaims of False Statements: \nThere have been claims of false statements and perjury related to the protective order, which could have \nsignificant implications for the divorce case. For instance, the claim that the plaintiff intentionally lied \nabout being unable to pay court fees and made false allegations of family violence to gain an advantage \nin the divorce proceedings suggests that a single judge should hear both matters for a clear \nunderstanding of the facts. \n•m•~;;'..:~+;••• A CERTIFIED COPY /.l _. r>o\\ ATTEST: 04/15/2024 \n:8. ~ %: THOMASA.WILDER :t ,tlrJ :~/ DISTRICT CLERK \n•••i,, ;JTARRANTCOUNTY, TEXJ \n•.to 'io~ BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1890
    },
    {
      "page_number": 141,
      "text": "Evidence of Misrepresentation and False Statements: \nEvidence provided suggests that there have been misrepresentations to the court, including the transfer \nof funds from the joint account and the plaintiff's interaction with third parties, which could affect both \nthe protective order and the divorce outcome. The protective order-which was based on claims of \nfamily violence -are entirely baseless as I have no record of family violence, and no evidence from the \nPlaintiff has been provided to substantiate these claims. \nLandlord-Tenant Relationship: \nThe eviction case, although not directly related to family law matters, stems from claims and actions that \nare deeply intertwined with the divorce and protective order cases, suggesting that the alleged family \nviolence and the actions of the plaintiff have been used to justify an eviction that coincides with the \ntiming of the divorce and protective order filings. \nConclusion: \nGiven the overlapping factual and legal issues in the divorce and protective order cases, consolidation \nwould serve the interests of justice and efficiency. It would ensure that the court has a comprehensive \nunderstanding of the intertwined nature of the family's circumstances, which is vital for fair and \nequitable resolution of these matters. While the eviction case may not be directly consolidated due to \njurisdictional differences, it should be considered in context with the other cases to provide a complete \npicture of the ongoing disputes and to keep the best interests of our children intact. \nRespectfully submitted, \nCharles Myers \nChuckdustin12@gmail.com \n817-507-6562 \nOn this day of O l-o 1-cl o~ '1 \n····•• ... \n•••■•;;~ 'TARR-1_;;:... A CERTIFIED COPY \n1§\" \"\" ('o', ATTEST: 04/15/2024 \n{8 . ~ ii THOMAS A. WILDER \n:'u ,~J -~! OISTRICTCLERK \n••~ :,,_.#./TARRANT COUNTY, TEXJ \n••~o ~;-• BY: /s/ Catherine Saenz \n••••···•••",
      "char_length": 1884
    },
    {
      "page_number": 142,
      "text": "EXHIBITN \nRULE 12 MOTION TO SHOW \nAUTHORITY 09/20/24",
      "char_length": 52
    },
    {
      "page_number": 143,
      "text": "322-7 44263-23 FILED \nTARRANT COUNTY \n9/20/2024 3:31 PM \nTHOMAS A. WILDER \nDISTRICT CLERK \nNO. 322-744263-23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS \nMorgan Michelle Myers, \nPetitioner, \nv. Respondent's Rule 12 Motion to Show \nAuthority \nCharles Dustin Myers, \nRespondent \n2024-09-20 \nTo the Honorable Judge of the 322nd District Court of Tarrant County: \nREBUTTABLE PRESUMPTION \nThere is a general presumption that an attorney is acting with authority; \nhowever, that presumption is rebuttable. Breceda v. Whi, 187 S.W.3d 148, 152 \n(Tex. App.--El Paso 2006, no pet.); Kelly v. Murphy, 630 S.W.2d 759, 761 \n(Tex. App.--Houston [1st Dist.] 1982, writ refd n.r.e.); see also City of San \nAntonio v. Aguilar, 670 S. W.2d 681, 684 (Tex. App.--San Antonio 1984, writ \ndism'd) (\"[A]n attorney who has conducted a case in the trial court is \npresumed to have authority to pursue an appeal, although this presumption can \nbe rebutted.\"). Here, however, this presumption is to be rebutted for the \nforegoing reasons: \n1",
      "char_length": 1024
    },
    {
      "page_number": 144,
      "text": "I. Legal Basis for Rule 12 Motion \n2. Pursuant to Tex. R. Civ. P. § 12, a party may challenge an attorney's \nauthority to act on behalf of a party in a proceeding. When such a challenge is \nraised, the burden of proof shifts to the challenged attorney to demonstrate \ntheir authority to represent the party. Id. The attorney must appear before the \ntrial court and show sufficient authority to prosecute or defend the suit on \nbehalfoftheirclient. (Brecedav. Whi(2006) 187 S.W.3d 148, 152;Kellyv. \nMurphy (1982) 630 S.W.2d 759, 761). \n3. Rule 12 of the Texas Rules of Civil Procedure permits any party to \nchallenge an attorney's authority to prosecute or defend a lawsuit. (See Nolana \nOpen MRI Ctr., Inc. v. Pechero (2015) No. 13-13-00552-CV, at *15). The \npurpose of a Rule 12 motion is to protect parties from groundless suits and to \npermit dismissal of suits instituted without authority. (See Nicholas v. Envtl. \nSys. (Int'!) Ltd. (2016) 499 S.W.3d 888, 895;Angelina Cty. v. McFarland \n(1964) 374 S.W.2d 417, 422-23). \n4. Here, the procedural inconsistencies, lack of formal notice, and \nsubmission of documents by other parties on behalf of Ms. Carter raise \nsubstantial doubts about whether she possesses the necessary authority to \nrepresent the Petitioner. Despite being allegedly retained on January 22, 2024, \nMs. Carter has not filed a formal notice of appearance, leaving her role \nambiguous. Further complicating matters, filings under her name have been \nsubmitted by others, including the founder of Marx Altman & Johnson, her \npurported former employer. Coupled with her suspiciously timed State Bar \nprofile update and lack of meaningful engagement, these facts compel the \nRespondent to seek clarification and challenge her authority under Rule 12. \n2",
      "char_length": 1772
    },
    {
      "page_number": 145,
      "text": "II. Procedural Basis \n5. No Formal Notice of Appearance Filed. Although Cooper Carter \nwas allegedly retained on January 22, 2024, she has not filed a formal Notice \nof Appearance in this case. The absence of a Notice of Appearance creates \nsubstantial ambiguity regarding her authority to represent the Petitioner, \nespecially given the procedural irregularities discussed below. \n6. Lack of engagement. Throughout the proceedings, Ms. Carter \nhas consistently failed to engage in any meaningful way and has failed \nto respond to any pleadings in the suit. \n7. Filings Submitted on Behalf of Cooper Carter. All court \ndocuments and pleadings attributed to Ms. Carter have been submitted \"on her \nbehalf' by Roderick Marx, the founder of Marx Altman & Johnson. There \nis no indication that Ms. Carter is directly involved in this matter, raising \nsignificant questions about whether she is properly authorized to act as \ncounsel for Morgan Michelle Myers. \n8. Discrepancies in employment. On Ms. Carter's public social \nmedia, she claims to be a former attorney for Marx Altman & Johnson and \nclaims to be employed currently with Cantey Hanger LLP. 1 The timeliness of \nher profile aligns with the public article released by Cantey Hanger LLP \n1 ~rter's public Linkedln profile \n3",
      "char_length": 1280
    },
    {
      "page_number": 146,
      "text": "themselves. 2 Further, Every attorney in Texas is required by law to maintain a \ncurrent and up-to-date profile. Tex. Gov't Code§ 81.115. Notably, Ms. \nCarter's profile was updated on March 13th, 2024, one day prior to the only \nhearing that has occurred in this matter3 to her former employer. The \nRespondent has actively been seeking relief from the result of the \naforementioned hearing for nearly seven months without any engagement or \nany authoritative activity from Ms. Carter, thus warranting this motion. \nIII. Prayer and Relief \n9. Given the ongoing procedural irregularities and the apparent lack of \nclarity surrounding Cooper Carter's authority to represent Petitioner Morgan \nMyers, the Respondent respectfully requests the following: \n1. The Court should schedule a hearing requiring Cooper Carter to \npersonally appear and definitively prove her authority to represent \nMorgan Myers, and to provide clarification as to who is involved in \nthe case, and in what capacity Morgan Michelle Myers is being \nrepresented in this matter. \n11. \"Upon [her] failure to show such authority, the court shall refuse \nto permit the attorney to appear in the cause, and shall strike the \npleadings if no person who is authorized to prosecute or defend \nappears.\" (Tex. R. Civ. P. 12; see Kindle v. Wood Cnty. Elec. Co-op, Inc. \n(2004) 151 S.W.3d 206,210) \n2 News article corroborating employment timeline \n3 Ms. Carter's Texas State Bar profile. \n4",
      "char_length": 1449
    },
    {
      "page_number": 147,
      "text": "m. Grant of Summary Judgment Motion: Given that the \nRespondent's pending summary judgment motion filed on February \n261\\ 2024, remains unchallenged due to the lack of any meaningful \nengagement from Cooper Carter, and in light of the procedural \ndeficiencies highlighted above, the Court should grant the pending \nsummary judgment via the attached order as unopposed for judicial \nefficiency and to reset the status quo ante. \n1v. Stay all other formal settings and proceedings until resolution of \nthis motion. \nv. Respondent seeks no further sanctions against Ms. Carter \ngiven she fails to show her authority over the Petitioner in this \nmatter. \nRespectfully submitted, \nRespectfully Submitted, \nIsl Charles Dustin Mvers \nCharles Dustin Myers \nChuckdustin12@gmail.com \n1-817-507-6562 \n5",
      "char_length": 791
    },
    {
      "page_number": 148,
      "text": "CERTIFICATE OF SERVICE \nRespondent hereby certifies that on 09/20/2024, a true and correct copy \nof the Respondent's Rule 12 Motion to Show Authority was served on the \nfollowing parties via electronic service through the Electronic Filing \nManager (EFM) and via email to the email address on record, pursuant to \nTexas Rules of Civil Procedure 21a and 191.4. \nServed to: \n• Morgan Michelle Myers, Petitioner via electronic filing system. \n• Cooper Carter, Counsel for Petitioner via electronic filing system. \n• Email Addresses for Service: \ncoopercarter@majadmin.com & morganmw02@gmail.com \n6 /s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148 \nchuckdustin l 2@gmail.com \n817-507-6562",
      "char_length": 718
    },
    {
      "page_number": 149,
      "text": "11111// Certificate of Conference \nPursuant to the Tarrant County Local Rule 4.0l(l0)(b), a conference \nwas not held with Cooper L. Carter on the merits of this motion because \nCooper Carter failed to respond to email correspondence sent on 0911712024. \nEfralm Menashe Salvador ~ °'3-=-4lu... Ai= \nIsl Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 7 6148 \nchuckdustin 12@gmail.com \n817-507-6562 \n-a ~ State of Texas \nCounty of Johnson \n~ ~ \n11/1/111\\I\\II ID NUMBER \n134501582 \nCOMMISSION EXPIRES \nAugust 10, 2027 Sworn to and subscribed before me \non 09/20/2024 by Charles Dustin Myers. \nElectronically signed and notarized online using the Proof platform. \n7",
      "char_length": 686
    },
    {
      "page_number": 150,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 92285306 \nFiling Code Description: Motion (No Fee) \nFiling Description: RULE 12 MOTION TO SHOW AUTHORITY \nStatus as of 9/20/2024 4:33 PM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email TimestampSubmitted \nMORGAN MICHELLEMYERS morganmw02@gmail.com 9/20/2024 3:31:19 PM \nCooper L.Carter coopercarter@majadmin.com 9/20/2024 3:31:19 PM \nAssociated Case Party: CHARLESDUSTINMYERS \nName BarNumber Email TimestampSubmitted Status \nCHARLES MYERS chuckdustin 12@gmail.com 9/20/2024 3:31:19 PM SENT Status \nSENT \nSENT",
      "char_length": 927
    },
    {
      "page_number": 151,
      "text": "Automated Certificate of eService \nThis automated certificate of service was created by the efiling system. \nThe filer served this document via email generated by the efiling system \non the date and to the persons listed below. The rules governing \ncertificates of service have not changed. Filers must still provide a \ncertificate of service that complies with all applicable rules. \nEnvelope ID: 92846417 \nFiling Code Description: Motion (No Fee) \nFiling Description: Joint Motion to Recuse \nStatus as of 10/7/2024 10:44 AM CST \nAssociated Case Party: MORGANMICHELLEMYERS \nName BarNumber Email \nMORGAN MICHELLEMYERS morganmw02@gmail.com \nCooper L.Carter coopercarter@majadmin.com \nAssociated Case Party: CHARLESDUSTINMYERS TimestampSubmitted \n10/7/2024 7:30:03 AM \n10/7/2024 7:30:03 AM \nName BarNumber Email TimestampSubmitted Status \nCHARLES MYERS chuckdustin 12@gmail.com 10/7/2024 7:30:03 AM SENT \nAssociated Case Party: ATTORNEY GENERAL OF TEXAS Status \nSENT \nSENT \nName BarNumber Email TimestampSubmitted Status \nHOLLY HAYES csd-filer-914@texasattorneygeneral.gov 10/7/2024 7:30:03 AM SENT",
      "char_length": 1096
    },
    {
      "page_number": 152,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 93028733\nFiling Code Description: No Fee Documents\nFiling Description:\nStatus as of 10/10/2024 3:17 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n10/10/2024 1:56:50 PM\n10/10/2024 1:56:50 PMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n10/10/2024 1:56:50 PMStatus\nSENT\nAssociated Case Party: ATTORNEY GENERAL OF TEXAS\nName\nHOLLY HAYESBarNumber Email\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n10/10/2024 1:56:50 PMStatus\nSENT",
      "char_length": 1045
    }
  ]
}