{"id": "11dee39a94076c5c2760f21edcb3cf4a7cdc29dd", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "233-765358-25\nEMERGENCY TRO AND \nORDER SETTING HEARING \nDated: 03/24/2025M.2301 M.2301\nM.2301 M.2301 M.2301 M.2301\n\nNO. 233-765358-25 \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY, TEXAS  \nTO THE HONORABLE COURT:  \nPetitioner, CHARLES DUSTIN MYERS (\"Father\"), urgently brings before this \ncourt an EMERGENCY MOTION FOR TEMPORARY RESTRAINING ORDER to be \nissued immediately and without prior notice to the Respondent, MORGAN MICHELLE MYERS (\"Mother\"), for the safety and welfare of their two minor children M.E.M. and C.R.M., the parties' biological children. The Respondent has been informed of thisrequest for a TRO as well as her attorney, COOPER L. CARTER. Petitioner has received IN RE: M.E.M., ET AL.   \n**CHARLES DUSTIN MYERS, **  \nPetitioner,  \nEMERGENCY MOTION FOR TRO  \nMORGAN MICHELLE MYERS,  \nRespondent.  \n2025 -03-24 233-765358-25FILED\nTARRANT COUNTY\n3/24/2025 4:42 PM\nTHOMAS A. WILDER\nDISTRICT CLERKM.2302 M.2302\nM.2302 M.2302 M.2302 M.2302\n\nno response from either individual. Swift injunctive relief is needed to safeguard the well-\nbeing of the children – including immediate medical needs, schooling needs, financial needs, and emotional needs that the Petitioner has the ability, desire, and duty to satisfy. \nThe Respondent has disrupted the stable living environment enjoyed by the \nchildren up until the Petitioner's unlawful exclusion on March 6, 2024. They have been left without a Father for over thirteen months without any legal justification and are now being raised by their elderly great-grandparents in place of their Father. \nThe forthcoming and undisputed facts uncover the true intent behind the \nRespondent's actions and clearly demonstrate the need for the Petitioner's immediate re-\nentry into their lives.  \nI. STATEMENT OF JURISDICTION\nThis Court has jurisdiction, and the authority grants the requested relief because \nno valid existing orders bar such action. The only prior orders affecting the parties were \nissued in the 322nd District Court of Tarrant Co"}
{"id": "aab28769bf422e31fee39832904c6f9aa7d08fc8", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ion, and the authority grants the requested relief because \nno valid existing orders bar such action. The only prior orders affecting the parties were \nissued in the 322nd District Court of Tarrant County, but those orders are void and of no legal effect. Under Texas Family Code § 201.013(b), an associate judge's order does not become final unless and until the referring district court judge signs the order. \nMoreover, the orders claim that all parties agree to the terms of the order despite \nthe Petitioner's signature being absent. In the prior proceedings (Cause Nos. 322-744263-23 in the 322nd District Court), an associate judge signed a \"temporary\" order on March 14, 2024 that purported to be an agreement between the parties. Critically, no district judge of the 322nd District Court ever signed or adopted that order, as required by law. TEX. FAM. CODE Sec. 201.013. Given this fact, the orders have no legal eff ect and M.2303 M.2303\nM.2303 M.2303 M.2303 M.2303\n\nshould be declared void by this court, or in the alternative, voidable, and vacated without \ndelay. There is effectively no valid court order currently governing the parties' residence or conservatorship rights. This Court may therefore proceed to protect the children's welfare and the parties' rights as justice requires, unimpeded by the defective 322nd District Court order.  \nFurthermore, this court has jurisdiction because the Respondent cannot argue that \nthe related cause number retains dominated jurisdiction. Texas law does allow a court to lose dominant jurisdiction if the party with the first suit proceeded in bad faith or the suit is not actively pursued. Both apply here, as demonstrated below. The first suit was unquestionably brought in bad faith, and the case hasn't been actively pursued for over six months by the opposition, leaving the children in procedural limbo and their needs unaddressed. \nII. STATEMENT OF FACTS\n1. On December 12, 2023, Petitioner discovered over 6,500 text messages\nexchan"}
{"id": "40c92273cf92f03b8f9f2658549e3ed36e5479d7", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "x months by the opposition, leaving the children in procedural limbo and their needs unaddressed. \nII. STATEMENT OF FACTS\n1. On December 12, 2023, Petitioner discovered over 6,500 text messages\nexchanged between the Respondent and an individual named DAMEN GAULT KAZLAUSKAS by checking the usage history on the joint AT&T account owned by the Respondent's grandmother and paid for by the Petitioner, who had access to the account. (these records are voluminous and will be provided at hearing) \n2. On December 14, 2023, in response to this discovery, the Respondent made\nplans to visit the residence of an individual named DANIEL KENNETH BRANTHOOVER, her stepfather.  M.2304 M.2304\nM.2304 M.2304 M.2304 M.2304\n\n3. During this trip, the Respondent withdrew the entirety of funds within the joint\nmarital bank account, totaling $1,576, and transferred the funds to Mr. Branthoover's \nPayPal account, which is reflected in the Petitioner's bank statements as \"dmb575\".  \n4. The Respondent and Mr. Branthoover both admitted this transaction occurred\nvia text message evidence. \n5. The Petitioner requested the funds be returned on December 16, 2023, and\ninformed Mr. Branthoover of the fund's intent being for the Children's Christmas gifts and household bills related to Petitioner's business operations.  \n6. The intentions of the trip to Mr. Branthoover's residence located in Yukon,\nOklahoma were then made clear in his response when Mr. Branthoover informed the Respondent via text message that \"he would be getting divorced\" and that he \"hope[s] [he] can help with the paperwork.\"  \n7. On December 17, 2023, the Petitioner was served an eviction notice by the\nRespondent's grandmother, which cited a protective order and a divorce as the grounds for eviction. Exhibit 5 \n8. On December 18, 2023, the Petitioner filed for divorce in the 322nd District\nCourt of Tarrant County claiming financial indigency and waived the 60-day waiting period due to claiming an active protective order was in effect "}
{"id": "96d1cd1a3da91e8c54d4dcd5de651c4e11a989fa", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "e Petitioner filed for divorce in the 322nd District\nCourt of Tarrant County claiming financial indigency and waived the 60-day waiting period due to claiming an active protective order was in effect against Petitioner, as well as made the claim that she believed herself or the children would be abused or harassed if any contact info were given to Petitioner.  M.2305 M.2305\nM.2305 M.2305 M.2305 M.2305\n\n9. On December 19, 2023, Mr. Branthoover reached out via text message and\ninformed the Petitioner not to contact \"his client\" any further. \n10. On December 22, 2023, the Respondent filed for another protective order claiming\nthat family violence had occurred on December 18, 2023, in the presence of the children. Exhibit 8 \n11. On the same evening that she filed for protection, the Respondent can be seen\nat home with the Petitioner in no emergency. Exhibit 9 \n12. Between December 23 and January 16, the Petitioner and Respondent\npeacefully cohabitated with the children continuing their normal routine where the Petitioner stayed home and worked during the day and would pick the children up from school and care for them in the evenings and on weekends. \n13. The Petitioner was responsible for the children's daily meals, bathing, helped\nin getting them ready for school, taking them to school, and picking them up from school throughout their lives alongside the Respondent. \n14. On January 16, 2023, the 322nd District Court of Tarrant County ordered the\nPetitioner to vacate the matrimonial home at 6641 Anne Court Watauga Texas and the case was reset for January 22, 2024. \n15. On January 19, 2024, Petitioner retained Dan Bacalis, a licensed attorney.\n16. On January 22, 2024, after the reset hearing was already supposed to have\nstarted, RESPONDENT retained COOPER L. CARTER in the lobby of the 322nd M.2306 M.2306\nM.2306 M.2306 M.2306 M.2306\n\nDistrict Court on the fly and then requested a continuance, which was granted, and the \ncase reset to February 1st, 2024. \n17. On February "}
{"id": "563c8da29a3c0c848b85a9e82a94fc3254381ac9", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "obby of the 322nd M.2306 M.2306\nM.2306 M.2306 M.2306 M.2306\n\nDistrict Court on the fly and then requested a continuance, which was granted, and the \ncase reset to February 1st, 2024. \n17. On February 1, 2024, the parties appeared by counsel and entered into a\nsettlement agreement via an Associate Judge's Report that had the following provisions ordered by the Associate Judge: \ni. A typed written Order conforming to this Report will follow within 20 daysfrom the date this report is signed. \nii. The order shall be prepared by DAN BACALIS.iii. Each attorney should approve the Order.iiii. The parties do not need to approve the Order.\niiiii. The attorney reviewing the Order will have (5) days to do so. \niiiiii. There are no 10 day letters.  \niiiiiii. If an agreement is not reached, a Motion to Sign shall be filed and set \nwithin thirty (30) days from the signing of this Report. \n18. On February 5, 2024, Petitioner terminated the services of Dan Bacalis.\n19. On February 8, 2024, Petitioner put the court on notice that he rescinded the\nagreement and filed an EMERGENCY MOTION TO RECONSIDER EVIDENCE AND \nVACATE TEMPORARY ORDERS containing the following exhibits: M.2307 M.2307\nM.2307 M.2307 M.2307 M.2307\n\nDKT.53 - A.1 ‐ TEXT RECORDS AND VISUALIZATIONS  \nDKT.54 - EXHIBIT A.2 ‐ TEXT TO PAPAW  \nDKT.55 - EXHIBIT A.3 ‐ FINANCIAL TRANSACTION  \nDKT.56 - EXHIBIT A.4 ‐ OVERDRAWN ACCOUNT  \nDKT.57 - EXHIBIT A.5 ‐ EVICTION NOTICE TORN \nDKT.58 - EXHIBIT B.1 ‐ DIVORCE PETITION  \nDKT.59 - EXHIBIT B.2 ‐ DISMISSED EVICTION  \nDKT.60 - EXHIBIT C.1 ‐ FILINGS REGARDING PROTECTIVE ORD  \nDKT.61 - EXHIBIT C.2 ‐ 01.16.2024 RENDITION UNSIGNED  \nDKT.62 - EXHIBIT C.3 ‐ RENDITION FOR JANUARY 22ND, 2024  \n21. On February 12, 2024, an order was rendered effectuating the termination of\nDan Bacalis by the court.  \n22. On February 22, 2024, Petitioner filed a MOTION FOR PARTIAL\nSUMMARY JUDGEMENT with an attached parenting plan. \n23. On February 27, 2024, a notice of hearing was filed with the clerk and\nschedu"}
{"id": "c7799cf49494270539641913f76b3248b679f3c4", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "  \n22. On February 22, 2024, Petitioner filed a MOTION FOR PARTIAL\nSUMMARY JUDGEMENT with an attached parenting plan. \n23. On February 27, 2024, a notice of hearing was filed with the clerk and\nscheduled the Petitioner's EMERGENCY MOTION TO RECONSIDER EVIDENCE AND VACATE TEMPORARY ORDERS for March 14, 2024.  \n24. On March 6, 2024, while walking his two children to school, the\nRESPONDENT ran inside the marital home and locked the Petitioner out of the home. \n25. On March 14, 2024, RESPONDENT and her counsel, COOPER L. CARTER,\nwere seen in the conference room preparing Temporary Orders moment before the hearing was to begin. M.2308 M.2308\nM.2308 M.2308 M.2308 M.2308\n\n26. On March 14, 2024, Petitioner was handed a document titled \"Temporary\nOrders\" which had already been signed by the opposing party. \n27. On page 1 of the orders, the orders claimed \"All parties consent to the terms\nof these orders as evidenced by the signatures below.\" \n28. On March 14, 2024, the Associate Judge denied the Petitioner's emergency\nmotion. \n29. On March 14, 2024, the Associate Judge adopted the Associate Judge's Report\nsigned by the parties on February 1st and ordered the Petitioner to sign them by 1:30 \nP.M. that same day.\n30. On March 26, 2024, the Temporary Orders signed on March 14, 2024, were\nfiled with the clerk.  \n31. On March 26, 2024, the Petitioner filed a request for findings of fact and\nconclusions of law. \n32. On April 8, 2024, the Petitioner filed a Petition for Writ of Mandamus in the\nSecond Court of Appeals. \n33. On April 10, 2024, the Petitioner's Petition for Writ of Mandamus was denied.\n34. On April 22, 2024, the Petitioner filed a Motion for Rehearing in the SecondM.2309 M.2309\nM.2309 M.2309 M.2309 M.2309\n\n36. On April 24, 2024, Petitioner filed an OBJECTION to the MOTION FOR\nPRETRIAL CONFERENCE.  \n37. On April 25, 2024, Petitioner's motion for rehearing was denied.\n38. On April 27, 2024, Petitioner filed a Motion for Reconsideration En Banc\nwith the Second Court of Ap"}
{"id": "36527da29567ea38211ea439aff00c294b231241", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "FOR\nPRETRIAL CONFERENCE.  \n37. On April 25, 2024, Petitioner's motion for rehearing was denied.\n38. On April 27, 2024, Petitioner filed a Motion for Reconsideration En Banc\nwith the Second Court of Appeals. \n39. On April 30, 2024, Petitioner filed a notice of completion regarding the\n'children in the middle' course. \n40. On May 2, 2024, Petitioner's motion for reconsideration en banc was denied.41. On May 13, Petitioner filed a PETITION FOR WRIT OF MANDAMUS in\nthe Texas Supreme Court. \n42. On June 2, 2024, the RESPONDENT's grandmother called the Petitioner,\nraising several concerns regarding the children's well-being. \n43. On June 28, 2024, the Texas Attorney General's Office filed an\nINTERVENTION.  \n44. On July 1, 2024, the Petitioner filed an OBJECTION TO INTERVENTION\npleading. \n45. On August 30, 2024, the Petitioner's mandamus was denied in the Texas\nSupreme Court. \n46. On September 10, 2024, the Petitioner filed a MOTION FOR REHEARING\nin the Texas Supreme Court. M.2310 M.2310\nM.2310 M.2310 M.2310 M.2310\n\n47. On September 17, 2024, the Petitioner served a REQUEST FOR\nDISCOVERY, PRODUCTION, AND ADMISSIONS on the opposing party.  \n48. On September 20, 2024, the Petitioner filed a RULE 12 MOTION TO SHOW\nAUTHORITY against COOPER L. CARTER.  \n49. On September 26, 2024, the Petitioner filed a MOTION FOR TEMPORARY\nORDERS, later amended on September 27, 2024. \n50. On October 7, 2024, the Petitioner filed a JOINT MOTION TO RECUSE the\ndistrict and associate judges from the case.  \n51. Petitioner's motion for rehearing was denied by the Texas Supreme Court on\nOctober 18, 2024. \n52. On November 1, 2024, Justice E. Lee Gabriel was assigned to hear the recusal\nmotion. \n53. On November 4, 2024, Petitioner filed a PRE- TRIAL MOTION IN LIMINE.\n54. On November 6, 2024, the Petitioner requested confirmation from the clerk\nthat Justice E. Lee Gabriel took her required Oath of Office.  \n55. On November 15, 2024, Petitioner filed a MOTION TO COMPEL\nDISCOVERY regarding the discovery re"}
{"id": "34fce91cb17d115cb2c09b63855a4326e7a99bd9", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "requested confirmation from the clerk\nthat Justice E. Lee Gabriel took her required Oath of Office.  \n55. On November 15, 2024, Petitioner filed a MOTION TO COMPEL\nDISCOVERY regarding the discovery requests sent on September 17, 2024. \n56. On November 19, 2024, an order DENYING the recusal of the associate and\ndistrict judges was filed with the clerk.  M.2311 M.2311\nM.2311 M.2311 M.2311 M.2311\n\n57. On December 12, 2024, the Petitioner filed a NOTICE OF REMOVAL with\nthe 322nd District Court, and removed the case to the Northern District of Texas. \n58. On December 14, 2024, the case was REMANDED by the Northern District\nof Texas for lack of subject matter jurisdiction.  \n59. On January 12, 2025, Petitioner filed a MOTION TO DISMISS FOR WANT\nOF PROSECUTION.  \n60. On March 18, 2025, Petitioner filed an original SAPCR and motion for\ninjunctive relief with this court.  \n61. On March 22, 2025, the Petitioner learned through a family member that\nRespondent's public Facebook profile states \"In a Relationship since February, 2024\". \n62. On March 22, 2025, the Petitioner informed the opposing party of this motion.\n63. On March 23, 2025, the Petitioner filed this suit with this court seeking\nimmediate and emergency relief given the extraordinary circumstances leading up to this \npoint. \nIII. IMMEDIATE NEED FOR RELIEF\n64. Every day that Petitioner remains barred from his home and children inflicts\nirreparable injury on both Petitioner and the children. Irreparable harm means an injury that cannot be adequately compensated for money damages or corrected later. That is exactly the case here.  M.2312 M.2312\nM.2312 M.2312 M.2312 M.2312\n\n65. Petitioner is being deprived of the irreplaceable experience of parenting his\nchildren during their formative years. No amount of monetary compensation or later \nvisitation can make up for the lost time, missed milestones, and emotional bonding that has been denied for over a year. Courts have recognized that interference with custodial or visita"}
{"id": "f9e57479f6a4088fa5103624bed21fa78af8ba1e", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "ion or later \nvisitation can make up for the lost time, missed milestones, and emotional bonding that has been denied for over a year. Courts have recognized that interference with custodial or visitation rights constitutes irreparable harm, as time lost with one's child is gone forever. The children are likewise losing the benefit of a father's love, guidance, and daily care – a harm that is unquestionably irreparable. If this wrongful separation continues, the risk increases that the parent -child bond could be permanently damaged. Reunification \nbecomes harder as more time passes; thus the urgency is extreme.  \n66. The children have been suffering confusion, instability, and emotional distress\ndue to the sudden absence of Petitioner and the drastic changes imposed by Respondent. They went from having both parents in their daily life to seeing only one parent, with no satisfactory explanation. Respondents' insertion of a new father- figure (Mr. Kazlauskas) \nhas exacerbated their confusion and anxiety. This kind of emotional turmoil in young children can lead to long-term psychological issues – a classic irreparable injury, as the court cannot later repair the trauma inflicted on a child's sense of security. Restoring Petitioner's presence is needed now to begin healing the damage and to reassure the children that their father has not abandoned them. The more time that passes, the deeper the potential harm to the children's mental health.  \n67. Petitioner's fundamental right to maintain his familial relationship with his\nchildren (protected by the U.S. and Texas Constitutions) is being violated. Such a violation is inherently irreparable. Deprivation of one's home – being ousted without cause – is also a profound personal harm for which there is no adequate remedy at law. M.2313 M.2313\nM.2313 M.2313 M.2313 M.2313\n\nPetitioner has effectively been made a stranger to his own family and property based on \nfalse pretenses. If the Court does not act, the Petitioner  will"}
{"id": "18f35052a35e97e56e9b772d27e383f145354fad", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "aw. M.2313 M.2313\nM.2313 M.2313 M.2313 M.2313\n\nPetitioner has effectively been made a stranger to his own family and property based on \nfalse pretenses. If the Court does not act, the Petitioner  will continue to suffer intangible \nharms such as loss of income, anguish, and the erosion of his role as a father, none of which can be quantified or compensated later.  \nIV. THE RESPONDENT'S MISCONDUCT\nPerjury and Aggravated Perjury (Tex. Penal Code §§ 37.02–.03) \n68. Texas law makes it a crime to make false statements under oath. Perjury\noccurs when a person, with intent to deceive, makes a false statement under oath in a proceeding where an oath is required. \n69. If the false statement is made in connection with an \"official proceeding\" and\nis material, it becomes Aggravated Perjury, a third -degree felony. In civil cases, \nknowingly submitting false affidavits or testimony can also constitute perjury and be treated as a fraud upon the court. Courts have recognized that false sworn statements in family law matters are serious misconduct, undermining the judicial process and potentially warranting sanctions or even criminal referral (e.g., Skepnek v. Mynatt, 8 S.W.3d 377, 381 (Tex. App. – El Paso 1999) (attorney sanctioned $30,000 for filing false affidavit).  \n70. Here, Respondent swore to multiple false statements under oath, meeting all\nelements of perjury and aggravated perjury. For example: \nFalse Affidavit of Indigency M.2314 M.2314\nM.2314 M.2314 M.2314 M.2314\n\n71. On December 18, 2023, Respondent filed a sworn \"Affidavit of Inability to\nPay\" court costs, claiming she had only $20 in her bank account. This statement was \nknowingly false. Just two days prior, Respondent had transferred $1,576.00 in marital funds to herself, as confirmed by text messages with her relative (Dan Branthoover) on December 16. She then appeared in court swearing she was penniless and could not afford the $400 filing fee. In that same affidavit, Respondent also lied that she alone paid cer"}
{"id": "2cce3ae45cbcf17186ea72183f335243a7e3c462", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "e (Dan Branthoover) on December 16. She then appeared in court swearing she was penniless and could not afford the $400 filing fee. In that same affidavit, Respondent also lied that she alone paid certain expenses (two car loans and $800 rent plus utilities), when in fact Petitioner had been paying those bills; he continued to pay for the vehicles Respondent claimed to finance on her own. Bank statements and financial records will clearly establish this fact on the merits. Respondent's counsel has never refuted these facts. Thus, Respondent made multiple false statements under oath, meeting Penal Code § 37.02. Because these affidavits were filed in court proceedings and were material to the case (securing a fee waiver and influencing the court's actions), they also qualify as aggravated perjury under § 37.03. Each false statement was material to issues before the court (Respondent'sfinancial status and credibility), satisfying the materiality requirement.  \nFalse Statements in Protective Order Filings  \n72. Respondent submitted false sworn statements in her applications for\nprotective orders. Texas Family Code § 82.009 requires that an application for a temporary ex parte protective order \"contain a detailed description of the facts\" of alleged family violence and be sworn as true by the applicant. Respondent sought an ex parte protective order on or about Dec. 14, 2023, claiming abuse, yet on Dec. 22, 2023, she was photographed laughing and playing with the children alongside Petitioner – conduct wholly inconsistent with someone in fear of imminent harm. In fact, that same day, she M.2315 M.2315\nM.2315 M.2315 M.2315 M.2315\n\nhad applied for a second protective order against the Petitioner with similar allegations. \nNo credible evidence of family violence was ever presented in thirteen months of litigation but has been used as a barrier from accessing the home where the Petitioner is needed.  \n73. The contextual evidence of falsity (her normal familial behavior with\n"}
{"id": "1c565e5ca0f7ee5b00a8b42a3780f24d92cf574e", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "ted in thirteen months of litigation but has been used as a barrier from accessing the home where the Petitioner is needed.  \n73. The contextual evidence of falsity (her normal familial behavior with\nPetitioner the same day she sought Protection) defeated  her sworn claims of \"fear\" or \nviolence and display that they were indeed fabricated. At the very least, her contradictory sworn assertions – e.g. claiming on Dec. 18 to have an \"active\" protective order based on family violence (to justify a divorce waiver) when in truth none existed – demonstrate a reckless disregard for the truth under oath. \n74. These false protective order filings were not isolated incidents but part of a\ncalculated strategy to remove Petitioner from the family home and children's lives. The timing of these filings —immediately after the discovery of Respondent's extramarital \nrelationship with Mr. Kazlauskas—reveals their true purpose: not to protect against genuine violence, but to preemptively silence Petitioner and prevent him from exposing Respondent's infidelity and financial misconduct. By falsely claiming fear while simultaneously engaging in normal family activities with Petitioner, Respondent demonstrated the fabricated nature of her allegations.  \n75. The pattern of deception is unmistakable: Respondent drained the family bank\naccount on December 15 -16, filed false indigency claims on December 18, falsely \nclaimed an existing protective order in her divorce petition that same day, then filed yet another protective order application on December 22—all while continuing to interact M.2316 M.2316\nM.2316 M.2316 M.2316 M.2316\n\nnormally with Petitioner at home. This coordinated sequence of events shows a \npremeditated plan to use the legal system as a weapon against Petitioner rather than as the shield of protection it was designed to be. \nControlling Law \n76. False testimony or affidavits in a civil proceeding can warrant severe\nconsequences. While the proper remedy for \"intrinsic\" frau"}
{"id": "07b4e6a6f6aa0cbda7e4e70b83c67905e91424d8", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": " the shield of protection it was designed to be. \nControlling Law \n76. False testimony or affidavits in a civil proceeding can warrant severe\nconsequences. While the proper remedy for \"intrinsic\" fraud (false statements on issues litigated at trial) is often a new trial or sanctions rather than voiding a judgment, courts do not hesitate to act on clear perjury. Texas courts have inherent authority to address fraud on the court, and criminal prosecution for aggravated perjury is a possibility for egregious \nlies under oath. Indeed, aggravated perjury in court proceedings is a felony punishable by \n2–10 years' imprisonment (Tex. Penal Code § 37.03(b)). \n77. That is precisely what has occurred in this case, and Respondent should face\nsome consequences for her actions, but Petitioner believes that prolonged incarceration would not be in the best interests of his children, but that some form of legal repercussion is necessary to deter similar behavior in the future. She has made no effort to defend these claims, no effort to prosecute her case, and the Petitioner prays that this court realize the severity of this situation on those effected most: the children.  \nV. BEST INTEREST OF THE CHILDREN\n78. The Texas Family Code references \"the best interest of the child\" 109 times\nthroughout its text, and throughout the entirety of the code itself – the word \"always\" only appears once. TEX. FAM. CODE. Sec. 153.002. (The best interest of the child shall M.2317 M.2317\nM.2317 M.2317 M.2317 M.2317\n\nalways be the primary consideration of the court in determining the issues of \nconservatorship and possession of and access to the child.) \n79. Here, this statutory mandate was grossly violated by the Respondent and her\npurported counsel, who have suddenly become active in the litigation here despite remaining silent for over eight months in the parallel case destined for dismissal.  \n80. Indeed, the instant case reveals a Mother with an agenda to erase the parent\nthe children relied on t"}
{"id": "b2e98429e9790eee5ec92957c2b2d91ff5233a2a", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": " despite remaining silent for over eight months in the parallel case destined for dismissal.  \n80. Indeed, the instant case reveals a Mother with an agenda to erase the parent\nthe children relied on the most from their lives despite a valid legal reason, and has disregarded their livelihood in the process. \n81. Respondent's conduct constitutes a blatant violation of the \"best interest\"\nstandard mandated by Texas Family Code §§ 153.001 and 153.002. Texas law declares it the public policy of this state to assure that children have frequent and continuing contact with parents who act in the child's best interest, to provide a safe and stable environment for the child, and to encourage both parents to share in raising the child. Moreover, the best interest of the child must always be the court's primary consideration in matters of conservatorship and access. Respondent has flagrantly defied these principles by prioritizing her extramarital relationship with Mr. Damen Kazlauskas over the emotional, psychological, and familial stability of her own children. \nOrchestrated Campaign of Deception at the Family's Expense \n82. The evidence reveals a disturbing pattern: Respondent orchestrated a\ncomprehensive campaign of deception that sacrificed her children's emotional well-being and family stability to pursue her extramarital relationship. This was not a series of isolated incidents but a calculated strategy that unfolded in precise sequence: M.2318 M.2318\nM.2318 M.2318 M.2318 M.2318\n\n83. First, Respondent engaged in an extramarital relationship with Mr. Kazlauskas\n(evidenced by over 6,500 text messages); \n84. Second, upon discovery of this relationship, she immediately sought\nassistance from Mr. Branthoover to draft legal documents; \n85. Third, she drained the family's financial resources ($1,576) that were intended\nfor the children's Christmas gifts; \n86. Fourth, she filed false protective order applications and a fraudulent indigency\naffidavit;  \n87. Fifth, she misrepresen"}
{"id": "8ab58bbbf968ff0c8034b658bc75de7b2a9e8944", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": " resources ($1,576) that were intended\nfor the children's Christmas gifts; \n86. Fourth, she filed false protective order applications and a fraudulent indigency\naffidavit;  \n87. Fifth, she misrepresented to the court that an active protective order existed\nwhen none did; \n88. Finally, she used these fraudulent filings to remove Petitioner from the family\nhome and children's lives. \n89. Each step in this sequence was designed not to protect the children but to\nadvance Respondent's personal agenda at their expense. The children have been collateral \ndamage in Respondent's effort to reconstruct her life with Mr. Kazlauskas, who she now publicly acknowledges as her partner \"since February 2024\"—a relationship that began while she was still actively living with Petitioner and the children.  \nDeception and Psychological Confusion of the Children \n90. Respondent has knowingly misled the minor children about the status of their\nfamily by telling them that she and Petitioner are already divorced, even though the divorce is not final. This deliberate falsehood serves Respondent's personal narrative but M.2319 M.2319\nM.2319 M.2319 M.2319 M.2319\n\nwreaks emotional havoc on the children. They are left in a state of confusion—believing \ntheir family has been permanently fractured when in fact the legal marriage remains intact. By intentionally misrepresenting such a fundamental truth, Respondent has shown a willingness to confuse and emotionally harm her children to justify her own choices, in direct contravention of her duty to prioritize the children's emotional well-being. \nPrioritizing an Extramarital Relationship Over Family  \n91. Compounding the harm, Respondent is openly celebrating a relationship with\nMr. Kazlauskas – a man with whom she entered an extramarital relationship while still married to Petitioner. She has flaunted this relationship and positioned Mr. Kazlauskas as \na replacement father figure to the children, celebrating milestones with him that should be \nreser"}
{"id": "5f8f41e09e361571c68095370a0aa0ab3c457761", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "ile still married to Petitioner. She has flaunted this relationship and positioned Mr. Kazlauskas as \na replacement father figure to the children, celebrating milestones with him that should be \nreserved for family. In doing so, Respondent elevates her personal relationship over her children's need for stability and continuity with their real father. This behavior sends the children a disturbing message: that their father's role in their lives is interchangeable or unimportant. Such a message is detrimental to the children's best interests, as it undermines their sense of security, identity, and trust in their family structure and the close relationship that they have shared with their father throughout their lives. \nActive Alienation and Erasure of the Father  \n92. Respondent has gone to alarming lengths to minimize and erase Petitioner's\npresence in the children's lives. She has introduced Mr. Kazlauskas to the children as if he were a new parent, while simultaneously telling the children that Petitioner (their father) is no longer in their lives. This calculated act of alienation strikes at the very heart M.2320 M.2320\nM.2320 M.2320 M.2320 M.2320\n\nof Texas public policy, which seeks to ensure children maintain frequent and continuing \ncontact with both parents. \n93. Instead of fostering the father–child relationship, Respondent has deliberately\nattempted to sever it. The children are being taught through Respondent's words and actions that their father has effectively disappeared and been substituted by a stranger, causing profound emotional damage and confusing the children about who their father is. This behavior is not only cruel; it is directly contrary to the children's best interests and Texas's clear directives that children benefit from the love and involvement of both parents.  \n93. The children's current living situation—being raised primarily by elderly\ngreat -grandparents rather than their capable and willing father—further demonstrates \nhow Responden"}
{"id": "59e6fde359e2fcf4332e10c6cb889df444005874", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "nt of both parents.  \n93. The children's current living situation—being raised primarily by elderly\ngreat -grandparents rather than their capable and willing father—further demonstrates \nhow Respondent's personal agenda has superseded the children's needs. Rather than allowing Petitioner to fulfill his parental role and provide daily care and support to the children, Respondent has relegated this responsibility to extended family members, depriving the children of their father's presence, guidance, and care during crucial developmental years. \n94. Respondent's systematic use of false protective orders, perjured testimony,\nand procedural manipulation has created a legal fiction that has kept Petitioner from his children for over thirteen months. This separation was not based on any legitimate safety concern or the children's best interests, but solely on Respondent's desire to reconstruct her family unit with Mr. Kazlauskas at the center —effectively erasing Petitioner from the \nchildren's lives to accommodate her new relationship. M.2321 M.2321\nM.2321 M.2321 M.2321 M.2321\n\n95. The harm to the children from this prolonged, unjustified separation from their\nfather cannot be overstated. Research consistently shows that children benefit from the \nactive involvement of both parents, and that unnecessary disruption of the parent-child bond can cause lasting psychological damage. By prioritizing her personal relationship over her children's need for both parents, Respondent has demonstrated a fundamental misalignment with the \"best interest\" standard that Texas law demands be the \"primary consideration\" in all matters affecting children.  \n96. Despite the Respondent’s egregious actions, the Petitioner wishes her no ill\nwill as she is the mother of his Children and only seeks an amicable path forward that suits their best interests. As of now, the Children need their father, and this situation engineered by the Respondent shows that her fitness as a parent has been called i"}
{"id": "5a9d7a1a28514fcf9ae74367cd5598947275b76a", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "n amicable path forward that suits their best interests. As of now, the Children need their father, and this situation engineered by the Respondent shows that her fitness as a parent has been called into question, and her priorities are not in the correct place. Petitioner vows his return to the family home will only bring much needed stability to his children and will be in their best interests for their day -to-day livelihood. \nVI. PRAYER\nWHEREFORE, PREMISES CONSIDERED, Petitioner respectfully prays that this Honorable Court: \n(1). Issue an immediate Temporary Restraining Order for the safety and welfare \nof the children without notice to Respondent, restraining Respondent from: \na. Denying Petitioner access to the children;M.2322 M.2322\nM.2322 M.2322 M.2322 M.2322\n\nb. Denying Petitioner access to the family residence at 6641 Anne Court,\nWatauga, Texas 76148; \nc. Disturbing the peace of the Children;\nd. Disrupting the status quo of the children as it existed on March 6, 2024;\nc. Removing the children from Tarrant County, Texas;d. Making disparaging remarks about Petitioner to or in the presence of\nthe children; \ne. Interfering with Petitioner's possession of and access to the children;\nf. Destroying, removing, concealing, encumbering, transferring, or\notherwise harming or reducing the value of the property of the parties; \ng. Falsifying any records relating to the children or property;h. Misrepresenting any facts to the children regarding the marriage,\ndivorce proceedings, or Petitioner's role in their lives; \ni; Bringing the Children near DAMEN GAULT KAZLAUSKAS;  \n(5). Set a hearing on Petitioner's request for a Temporary Injunction at the earliest \npossible date not later than 14 days from the electronic  delivery of this TRO to the \nRespondent; \n(6). After hearing, issue a Temporary Injunction containing the same prohibitions \nas this Temporary Restraining Order; M.2323 M.2323\nM.2323 M.2323 M.2323 M.2323\n\n(7). After trial, if no agreement can be reached, grant "}
{"id": "bdf283698a702fbc117cd2a16a345da17c17e945", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 2000, "text": " issue a Temporary Injunction containing the same prohibitions \nas this Temporary Restraining Order; M.2323 M.2323\nM.2323 M.2323 M.2323 M.2323\n\n(7). After trial, if no agreement can be reached, grant Petitioner primary \nconservatorship of the children; \n(8). After trial, if no agreement can be reached, grant Petitioner exclusive \npossession of the family residence until damages can be fully restored and alternative residency can be established  nearby the Children; \n(10). Grant such other and further relief to which Petitioner may be justly entitled. \nIt’s been a long road. The Petitioner prays he may now return home to his children and prepare for this difficult time in a manner which comports with their fundamental needs. \nThank you. Respectfully submitted,  \n/s/ Charles Dust in Myers \nCHARLES DUSTIN MYERS, Pro Se  \n6641 Anne Court \nWatauga, Texas 76148 Phone: 817-546-3693 \nEmail: CHUCKDUSTIN12@GMAIL.COM  M.2324 M.2324\nM.2324 M.2324 M.2324 M.2324\n\nCERTIFICATION OF COMPLIANCE WITH LOCAL RULE 4.11(11)(e)\nPetitioner certifies that after diligent attempts to reach both the \nRespondent and her Counsel, all attempts were unsuccessful.\n/s/ Charles Dustin Myers\n6641 Anne Court\nWatauga, TX\n817-546-3693\nCHUCKDUSTIN12@GMAIL.COMCHARLES DUSTIN MYERSM.2325 M.2325\nM.2325 M.2325 M.2325 M.2325\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98863782\nFiling Code Description: Proposed Order\nFiling Description: PROPOSED ORDER\nStatus as of 3/26/2025 3:31 PM CST\nCase Contacts\nName\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/25/2025 2:10:47 PM\n3/25/2025 2:10:47 PMStatus\nNOT SENT"}
{"id": "6b918595ff32ee536b73df629bed24f8f6c23817", "vector_id": 19, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 19, "char_len": 2000, "text": "3:31 PM CST\nCase Contacts\nName\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/25/2025 2:10:47 PM\n3/25/2025 2:10:47 PMStatus\nNOT SENT\nNOT SENTM.2326 M.2326\nM.2326 M.2326 M.2326 M.2326\n\nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA  \nFM-FH-101-Temporary Restraini ng Order and Order Setting Hearing (Rev. 01-2021) \n©TexasLawHelp.org  Cause Number  \nPrint cause number and other court information exactly as it appears on the petition filed in this case.  \nIn the interest of:  In the: (check one):  \n1. \n2.  District Court  \n3. Court Number   County Court at \nLaw \n4. \n5. \nChild(ren)  County, Texas  \nTemporary  Restraining O rder \nand O rder Setting Hearing  \nOn _____________________  Petitioner,  ______________________________________  \nDate  Your full name  \npresented a motion for a temporary restraining order to this Court.  \nRespondent’s name is: ______________________________________________.\nRespondent’s full name \n The child(ren)  who are the subject of this suit are:  \nChild’s name  Date of Birth  Gender  \n1. \n2. \n3. \n4. \n5. \n1.The Court finds that the issuance of a temporary restraining order is necessary to protect the\nchild(ren)  who are the subject of this suit.\nIT IS THEREFORE ORDERED that the Clerk of this Court issue a temporary restraining order \nthat immediately restrains Respondent from doing the following:  \n(check off each rest raint that the J udge orders at the hearing)  \n Threatening the child(ren)  with imminent bodily injury. (See Texas Family Code 6.501(a)(5))\n Causing bodily injury to the child(ren) . (See Tex as Family Code 6.501(a)(4))  \n Disturbing the peace of the child(ren) . (See Texas Family Code 105.001(a)(3))  233-765358-25FILED\nTARRANT COUNTY\n3/24/2025 4:42 PM\nTHOMAS A. WILDER\nDISTRICT CLERK233-765358-25\n233-765358-25\nM.E.M.\nC.R.M.\n233\nTARRANT\n03/24/2025\nCHARLES DUSTIN MYERS\nMORGAN MICHELLE MYERS\nMARA EVONNE MYERS\nCAROLINE ROSE MYERS\n06/20/2016\n04/12/2018\nFEMALE\nFEMALEM.2"}
{"id": "562a5d8644b5bf625baca9cccc2bec22cd6c67b3", "vector_id": 20, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 20, "char_len": 2000, "text": "R\nDISTRICT CLERK233-765358-25\n233-765358-25\nM.E.M.\nC.R.M.\n233\nTARRANT\n03/24/2025\nCHARLES DUSTIN MYERS\nMORGAN MICHELLE MYERS\nMARA EVONNE MYERS\nCAROLINE ROSE MYERS\n06/20/2016\n04/12/2018\nFEMALE\nFEMALEM.2327 M.2327\nM.2327 M.2327 M.2327 M.2327□ \n□ \nIii Ii] ----□\n\nFM-FH-101-Temporary Restraini ng Order and Order Setting Hearing (Rev. 01-2021) \n©TexasLawHelp.org   Removing the child(ren)  beyond a geographic area identified by the Court. (See Texas Family\nCode 105.001(a)(4))\n Withd rawing the child(ren)  from the school or day -care facility where they are presently \nenrolled without the written consent of Petitioner.  \n Hiding or secreting the child(ren)  from P etitioner.  \n Engaging in any criminal activity while the child(ren)  are in the Respondent’s possession. \n Using alcohol or illegal drugs 24 hours prior to or during his/her possession of the \nchild(ren) . \n2.The Court further finds that it clearly appears from specific facts shown by Petitioner’s\naffidavit that immediate and irreparable injury or harm will result to the child(ren)  before notice\ncan be served and a hearing can be held.\nThe injury or har m to the child(ren)  is: \n____________________________________________________________________________\n____________________________________________________________________________\n________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________ \nThe above injury or harm  would be irreparable because:  \n____________________________________________________________________________\n______________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________"}
{"id": "36965669f54c03c98f1802fd1294d977cfc90d4b", "vector_id": 21, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 21, "char_len": 2000, "text": "__________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________________\n____________________________________________________________________________ The temporary restraining order is granted without notice because:  \n____________________________________________________________________________\n____________________________________________________________________________\nMR 7.27\nThe children are suffering daily from their father being prevented\naccess to the marital home. The Respondent has prevented access\nsince March 6, 2024, knowing the Petitioner's need for the residence to work.\nThis has left the children without the care of either parent for the majority\nof the time, and are being told that the divorce has been finalized\nand that their father is a bad person.\nPrior to the Respondent's removal, the Children were cared for both emotionally and financially by the Petitioner. The Respondent\nknowingly and willingly sabotaged this relationship to further her own agenda with a separate relationship.\nThe emotional well-being and stability of the children have been destroyed, and their stable life has been dismantled\nby the Respondent in bad faith. There exists no legal basis for the current situation to persist,\nand the children are already showing signs of distress, emotional trauma, and are beginning to struggle academically.\nThe children need the Petitioner's stable, nurturing care during this difficult time, and they will soon lose all access to their Father who will be homless given the circumstances.\nThe Petitioner has been fighting for over a year to get back into his residence to no avail. The Respondent has refused to participate, and \ncontinues to prioritize her new relationship over the children. Notice would only spark more deceptive legal actions from the Respondent to try and subv"}
{"id": "69612f33ee7cdce1509ff172b57b6189f6730171", "vector_id": 22, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 22, "char_len": 2000, "text": "The Respondent has refused to participate, and \ncontinues to prioritize her new relationship over the children. Notice would only spark more deceptive legal actions from the Respondent to try and subvert justice.M.2328 M.2328\nM.2328 M.2328 M.2328 M.2328Iii \nIii \nIii \nIii \n□\n\nFM-FH-101-Temporary Restraini ng Order and Order Setting Hearing (Rev. 01-2021) \n©TexasLawHelp.org  ____________________________________________________________________________\n____________________________________________________________________________ \nIt is therefore ordered that: \n The bodies of the child(ren)  be attached and that the child(ren)  be placed in the \npossession of:  \n The Petitioner  \n The following person:  _________________________________________________ \n(See Texas Family Code 105.001(c)(1- 2))\n Respondent is excluded from possession of or access to the child(ren)  until notice can be \nserved and a hearing can be held.\n Respondent’s possession of or access to the child(ren) is limited as follows until notice \ncan be served and a hearing can be held:  \n  Respondent is excluded from unsupervised possession of the child(ren) . \nPossession of the child(ren)  shall be supervised by:  \n Any person approved in writing by Petitioner  \n A person approved by the Court: ___________________________________ \n Respondent is excluded from overnight visits with the child(ren) . Any day visits shall \nbegin no earlier than ___________ a.m.  and shall end no later than ____________ p.m. \n Respondent may not allow the child(ren)  to have any contact with the following \nperson(s): \n______________________________________________________________________ \n Respondent may not engage in the following acts during any periods of possession \nor access: \n______________________________________________________________________ \n______________________________________________________________________ ______________________________________________________________________ \n3.This restraining order is effective"}
{"id": "875f7e17049c0ee10e119cee963f5dff0775ba49", "vector_id": 23, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 23, "char_len": 2000, "text": "__________________ \n______________________________________________________________________ ______________________________________________________________________ \n3.This restraining order is effective immediately and will continue in full force and effect until it\nexpires by its terms within a time period determined by the Court ( not to exceed 14 days ),\nunless within that time frame the order is extended for good cause shown, or unless the\nRespondent consents that it may be extended for a longer period. \nSee Texas  Rule of Civil  Procedure\n680. \nThis restraining order expires on the following date: _______________________________.  \nTHE VIOLATION  OF A TEMPORARY RESTRAINING ORDER IS PUNISHABLE BY \nCONTEMPT AND THE ORDER IS SUBJECT TO AND ENFORCEABLE UNDER CHAPTER  \n157 OF THE TEXAS FAMILY CODE. See Texas Family Code 105.001(f).    \nPetitioner will be able to surprise the children by picking them up from school, and they will finally be reuinted with their father, \nsomething that they anticipate and desperately need. The Respondent has shown no ability to act in the children's best interests.\nDAMEN GAULT KAZLAUSKAS\nRespondent must not forbid the Petitioner from access to the marital home. Respondent must not disturb the peace of the children.\nRespondent must maintain an amicable candor towards all members of the household.\nBoth parties must maintain the status quo as it was prior to the unlawful lockout of Petitioner which occurred on March 6, 2024.\n2025/04/12M.2329 M.2329\nM.2329 M.2329 M.2329 M.2329□ \n□ \n□ □ \n□ \n□ \n□ \nIii \nIii □ \n□\n\nFM-FH-101-Temporary Restraini ng Order and Order Setting Hearing (Rev. 01-2021) \n©TexasLawHelp.org  4.The requirement of a bond is waived. See Texas Family  Code 105.001(d) .\nOrder to Appear \nIT IS ORDERED that Petitioner’s  application for temporary injunction and temporary \norders be scheduled for a hearing at the earliest possible date and that the Clerk of this Court \nissue notice to Respondent t o appear in person before this Cour"}
{"id": "b774111f8320ce2356b8e0ce52cb5b524e18c045", "vector_id": 24, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 24, "char_len": 2000, "text": "r temporary injunction and temporary \norders be scheduled for a hearing at the earliest possible date and that the Clerk of this Court \nissue notice to Respondent t o appear in person before this Court at the following date, time, and \nplace (as  required by Texas Rule of Civil Procedure 680):   \nDate:  __________________________________________________ \nTime:__________________________________________________ \nAddress: _______________________________________________ \n_______________________________________________________ \n The purpose of the hearing is to determine whether the Court should order the following \ntemporary relief while this case is pending:  \na.Convert the preceding temporary restraining order into a temporary injun ction.\nb. Enter  temporary orders for the safety and welfare of the child(ren) , including but not\nlimited to conservatorship, possession and access.\nc.Enter  any other orders that are necessary for the safety and welfare of the child(ren) .\nSIGNED on __________ ___________, 20______, at ________________ __.m.  \n_____________________________ \nPRES IDING JUDGE  M.2330 M.2330\nM.2330 M.2330 M.2330 M.2330\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98863782\nFiling Code Description: Proposed Order\nFiling Description: PROPOSED ORDER\nStatus as of 3/26/2025 3:31 PM CST\nCase Contacts\nName\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/25/2025 2:10:47 PM\n3/25/2025 2:10:47 PMStatus\nNOT SENT\nNOT SENTM.2331 M.2331\nM.2331 M.2331 M.2331 M.2331\n\n233-765358-25\nTRO \nCOMMUNICAT\nIONSM.2332 M.2332\nM.2332 M.2332 M.2332 M.2332\n\nEXHIBIT 1\nTRO COMMUNICATI"}
{"id": "86d7f2ddf99fd0f118a177073394cdf36ce46c82", "vector_id": 25, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 25, "char_len": 2000, "text": "2:10:47 PM\n3/25/2025 2:10:47 PMStatus\nNOT SENT\nNOT SENTM.2331 M.2331\nM.2331 M.2331 M.2331 M.2331\n\n233-765358-25\nTRO \nCOMMUNICAT\nIONSM.2332 M.2332\nM.2332 M.2332 M.2332 M.2332\n\nEXHIBIT 1\nTRO COMMUNICATIONS\n03/21/25M.2333 M.2333\nM.2333 M.2333 M.2333 M.2333\n\nFUDSTOP <chuckdustin12@gmail.com>\nNotice of Temporary EX-Parte TRO\n2 messages\nFUDSTOP <chuckdustin12@gmail.com> Fri, Mar 21, 2025 at 10:44 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nMs. Carter,\nPursuant to Tarrant County Local Rule 3.30(c)   , this letter provides notice that I intend to present an Emergency Ex\nParte Application for Temporary Restraining Order (TRO)  seeking immediate relief in the interest of my children’ s well-\nbeing and to prevent irreparable harm to my property , family relationships, and ability to earn a living.\nThe TRO will NOT  request exclusive temporary use of the marital residence but that if your client has issue, she has\nalternative housing and has used possession of the residence to damage my livelihood and restrict my parenting time.\nThe application will include verified evidence supporting the necessity of immediate relief, including:\nVerified communications acknowledging my need for the home to work\nRecords of financial losses from displacement (Airbnb receipts, business losses, etc.)\nEvidence of your client disposing of or concealing my personal property\nProof that the children have been left unsupervised overnight by your client on multiple occasions.\nDocumentation from the school showing excessive absences and academic concerns regarding Mara.\nText evidence between myself and the multiple AIRBNB hosts showcasing the difficulty faced in setting up\noperations outside of the reliable setup of the house.Photographs and texts contradicting claims made in previous pleadings\nDental neglect of my youngest daughter (photos of untreated cavities)\nFinancial documents showing I paid all vehicle and rent obligations, contrary to your client’ s claims\nText messages between myself and th"}
{"id": "f99283aac1bbca2910b8898c617e2d3b19e4a405", "vector_id": 26, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 26, "char_len": 2000, "text": "eglect of my youngest daughter (photos of untreated cavities)\nFinancial documents showing I paid all vehicle and rent obligations, contrary to your client’ s claims\nText messages between myself and the grandparents of your client showing we can be amicable during this\nsituation and put the children first.Photo evidence showing the only way I have to communicate with my daughters is via an online game, ROBLOX,\ndue to your client preventing communications.My criminal record showing that I have never been convicted of a violent crime.\nThe current temporary orders which are facially void and can be collaterally attacked in any court at any time.\nAgain, there is absolutely zero reason to have me barred from the residence and strip the children of their parents. It\ncontradicts the lodestone of the Family Code which is in the best interests of the children. \nThis is the more logical solution. If we pursued this route in the beginning, we'd already be divorced and the children's\nfinancial stability wouldn't have been sacrificed. There is no risk of danger. There is no risk of harm to the children. There\nis only the possibility of recovery. That is in their best interests.\nThere is no legal reason your client has to want me out of the house other than just that. She cannot unilaterally decide\nthat I agree to everything and then do as she pleases with my personal belongings and neglect the children in multiple\nareas.\nYour argument that I agreed to the orders in place falls flat on its face for many reasons which will not be repeated here.\nI am providing this notice strictly to comply with Local Rule 11(e) . I will proceed to present the application to the Court\nwithout further delay  due to the nature of the harm and urgency involved.\nIf you wish to discuss these matters, I'm happy to do so - otherwise I will inform the court that you do not agree to the\norders upon submission.\nThis situation cannot continue, and the alternatives that are available must be pursued to uphold t"}
{"id": "cb3c9d0fe25b48779d1fd76190f751e5a456efe3", "vector_id": 27, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 27, "char_len": 2000, "text": "py to do so - otherwise I will inform the court that you do not agree to the\norders upon submission.\nThis situation cannot continue, and the alternatives that are available must be pursued to uphold the best interests of the\nchildren before any further damage to their well-being is sustained.\nRespectfully,\nCharles Dustin Myers4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 1/4M.2334 M.2334\nM.2334 M.2334 M.2334 M.2334M Gmail \n• • • • • • \n• • • • \n• \n• •\n\nFUDSTOP <chuckdustin12@gmail.com> Sat, Mar 22, 2025 at 3:17 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Wilson <morganmw02@gmail.com>\nCooper,\nPetitioner (your client) filed the original divorce petition in December 2023 in the 322nd District Court (Cause No. 322-\n744263-23). In that petition, she alleged false claims of family violence and sought a waiver of the 60-day waiting\nperiod for divorce, ostensibly to expedite temporary relief by labeling me as an abuser and claiming she had an active\norder of protection against me at the time of filing . \nOn February 1, 2024, a temporary orders hearing was held before an Associate Judge . The parties (through counsel)\nannounced an apparent agreement on temporary custody and other matters. The associate judge signed an “Associate\nJudge’ s Report for T emporary Orders” , titled as “Agreed Temporary Orders.” Importantly, this report did not itself\nconstitute a signed court order; instead, it outlined the agreed terms and directed further action before any order would\nbe final. Specifically, the report stated that Respondent's attorney (Dan Bacalis) would prepare a formal temporary\norders document, which would be prepared from 20 days from the date of signing, which would have been February\n22nd, 2024. It also required that both attorneys were to approve it to form within 5 days (have 5 days to approve\nthe order), and th"}
{"id": "080445d47f8b3c42ada0909c9652039b5f0a9b8e", "vector_id": 28, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 28, "char_len": 2000, "text": "om 20 days from the date of signing, which would have been February\n22nd, 2024. It also required that both attorneys were to approve it to form within 5 days (have 5 days to approve\nthe order), and that if no agreement on form was reached, a motion to sign would need to be filed within 30 days .\nThe report noted that the parties’ personal approval was not required for entry of the order, implying the attorneys’ sign-off\nor a court motion would suffice. No district judge signed an order at that time – the associate judge’s report was\nessentially a recommendation  to be formalized in a written order.  \nImmediately after the Feb 1 hearing, Respondent lost confidence in his attorney’ s actions and fired his attorney.\nBelieving that the “agreement” did not reflect the child’ s best interests or was entered under false pretenses (due to\nPetitioner ’s unfounded allegations), Respondent promptly withdrew his consent  to the announced terms. On February\n5, 2024, before any temporary order was signed by the court,  Respondent (now pro se) filed an Emergency Motion to\nReconsider and Vacate Temporary Orders . This motion put the court on notice that Respondent no longer consented  to\nthe supposed agreed terms and that he objected to any temporary order being entered as announced.  \nDespite this, the reconsideration was denied and no findings were ever entered. In fact, the order explicitly ordered\nRespondent to sign the orders to which he did not agree in violation of his own directives.\nTexas law is clear that an associate judge’ s report or proposed order is not a final, enforceable court order\nunless and until it is adopted and signed by the referring court.  Under the Family Code, an associate judge may\nconduct hearings and recommend orders, but those recommendations remain subject to approval by the district court\njudge.  Section 201.011 of the Texas Family Code provides that an associate judge’s report “may contain the associate\njudge’s findings, conclusions, or recommend"}
{"id": "0ef43a3fa6aff96e74581678e24dbbf5b2658147", "vector_id": 29, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 29, "char_len": 2000, "text": "ject to approval by the district court\njudge.  Section 201.011 of the Texas Family Code provides that an associate judge’s report “may contain the associate\njudge’s findings, conclusions, or recommendations and may be in the form of a proposed order”. In other words, the\nassociate judge’s report (even if titled “Temporary Orders”) is essentially a draft or advisory decision; it does not itself\ncarry the force of a court order until the proper procedures are completed.  \nFamily Code § 201.013 unambiguously outlines how and when an associate judge’s proposal becomes an order of the\ncourt. If a party timely requests a de novo hearing by the referring judge, the associate judge’ s proposed order may be\nenforced in the interim (except for certain matters) pending that hearing. However , if no timely request for a de novo\nhearing is filed, the statute states that “the proposed order or judgment of the associate judge becomes the\norder or judgment of the referring court only on the referring court’ s signing  the proposed order or judgment.”\nThus, absent a de novo appeal, an associate judge’ s recommendation must be signed by the district judge  to have any\nlegal effect. Until the judge signs it, it is merely a proposed  order , not an actual court order.  \nBecause the February 1, 2024 temporary orders were never signed or adopted by the court, Respondent was (and is)\nunder no legal obligation to follow them, and neither party could properly enforce those terms through contempt or other\nremedies. A party cannot be held in contempt for violating a non-existent court order . Here, the “Agreed Temporary\nOrders” are, at most, an agreement between the parties that was not entered as a judgment. When Respondent withdrew\nhis agreement (as discussed below), even that contractual underpinning fell apart.  The Family Code’s requirements were\nnot met, and thus the purported temporary orders are void ab initio  due to lack of rendition or entry by the referring\ncourt.  \nThe stage is t"}
{"id": "97ce75ab9d9724e1fead8f1851fea46fa0694a1c", "vector_id": 30, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 30, "char_len": 2000, "text": "pinning fell apart.  The Family Code’s requirements were\nnot met, and thus the purported temporary orders are void ab initio  due to lack of rendition or entry by the referring\ncourt.  \nThe stage is thus set for this Court to intervene, because as of now , there is no operative temporary order governing\nthe child’ s conservatorship or possession.   \nThe Purported Temporary Orders Are Void and Subject to Collateral Attack in This\nSAPCR 4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 2/4M.2335 M.2335\nM.2335 M.2335 M.2335 M.2335\n\nBecause the February 1, 2024 temporary orders were never properly entered as a court order (and would have been\ninvalid if entered without consent - which is clearly the case here), they are void and can be attacked in this proceeding.\nGenerally, once a court renders a final judgment, parties are constrained to challenge that judgment on direct appeal or in\nthe original case; collateral attacks  on final judgments are disfavored. However, only a void judgment is subject to\ncollateral attack in a separate proceeding. Browning v. Prostok, 165 S.W.3d 336, 346 (Tex. 2005)  (“Browning v.\nPlacke , 698 S.W.2d 362, 363  (Tex. 1985)”)\nIn this SAPCR, Respondent is effectively collaterally attacking  the temporary orders from the divorce case by asserting\ntheir invalidity . Such a collateral challenge is permissible here because those orders are void. As the Texas Supreme\nCourt has explained, “Only a void judgment may be collaterally attacked.” Id.\nAccordingly, Respondent asks this Court to formally declare  that the March 26, 2024 “Agreed Temporary Orders” (and\nany interlocutory rulings associated with them) in Cause No. 322-744263-23 are void, of no effect, and not binding  on\nthe parties. This declaration will remove any doubt or argument by Petitioner that those terms still govern the parties’\nrights. It wi"}
{"id": "6c71768b6f85ec39b198a0051538f2cd031f7f0a", "vector_id": 31, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 31, "char_len": 2000, "text": "use No. 322-744263-23 are void, of no effect, and not binding  on\nthe parties. This declaration will remove any doubt or argument by Petitioner that those terms still govern the parties’\nrights. It will also foreclose any attempt to enforce or rely on those non-orders (for example, in claims of violation or in\narguing res judicata). The Court has the authority in equity and under the Uniform Declaratory Judgments Act (T ex. Civ.\nPrac. & Rem. Code chapter 37) to declare the rights and status of the parties vis-à-vis that prior proceeding – particularly\ngiven that the SAPCR directly concerns the child who was also at issue in the divorce temporary orders. Granting such\nrelief is appropriate to prevent confusion and multiplicative litigation. Once the prior “orders” are declared void, this Court\ncan proceed to issue fresh temporary orders for the child without any conflict or cloud from the divorce case.  \nIn sum, the prior temporary orders are a legal nullity and this Court should treat them as such. The Court’s order declaring\nthem void will simply recognize the reality that, due to the procedural faults and lack of consent, those orders never had\nlegal existence. This clarification is critical to move forward in protecting the child’ s welfare, as discussed next.   \nImmediate Emergency Relief Is Necessary to Protect the Child’s Best Interest \nEvery day that passes without a valid temporary order is a day of potential harm or uncertainty for the child.  The\ncurrent situation – a divorce case stuck in limbo with no operative orders, and parents in dispute – is untenable for a\nchild’s well-being. The child has effectively been living under an informal or contested arrangement since February 2024.\nPetitioner has acted as though she has primary custody under the (void) temporary orders, while Respondent has been\nsidelined and denied the normal possession or decision-making that a proper order (or a true agreement) would have\nprovided him. This dynamic, fueled by Petition"}
{"id": "f7c71e4a9b36c578bbc390a790467a497834d913", "vector_id": 32, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 32, "char_len": 2000, "text": "rary orders, while Respondent has been\nsidelined and denied the normal possession or decision-making that a proper order (or a true agreement) would have\nprovided him. This dynamic, fueled by Petitioner’s unproven allegations of family violence, has caused significant stress\nand instability for the child. Respondent fears that Petitioner is leveraging the appearance of an order to restrict his\ncontact with the child and to make unilateral decisions that are not in the child’ s best interest. Meanwhile, the divorce\nproceeding has not moved forward to a final resolution – over 12 months  have elapsed since the March hearing, with no\ntrial setting in sight. This stalemate directly af fects the child: there is no clear court-sanctioned framework for\nconservatorship, visitation, or support, and your client has only introduced chaos into their lives.\nThis Court, now handling the SAPCR, has both the authority and the duty to step in and provide stability . Under T ex. Fam.\nCode §  105.001, “the court may make a temporary order, including the modification of a prior temporary order, for\nthe safety and welfare of the child,” including orders for temporary conservatorship and possession.\nThe Family Code specifically empowers courts to act expeditiously to protect a child: if there is immediate danger to the\nchild’ s physical or emotional health, the court can even issue temporary orders without notice (such as a temporary\nrestraining order) to address the emergency. Here, Respondent asserts that the child’s emotional welfare is indeed in\njeopardy . The lack of a valid order has enabled Petitioner to marginalize Respondent’s role in the child’s life, purportedly\nunder the guise of the void temporary orders. Petitioner’s false accusations of violence – never tested or proven in court –\nhave created a pretext for her to limit Respondent’s access. Consequently, the child is being unjustly deprived of time and\na relationship with Respondent, who has been a loving father with no hi"}
{"id": "772a6a31becd34d963c2609e4f9a33c7c9ba6dcd", "vector_id": 33, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 33, "char_len": 2000, "text": "rt –\nhave created a pretext for her to limit Respondent’s access. Consequently, the child is being unjustly deprived of time and\na relationship with Respondent, who has been a loving father with no history of abuse. This scenario is precisely what\nemergency temporary orders are designed to prevent. The Court should not allow a procedural quagmire to result in a\nchild effectively losing a parent or receiving inferior care.  \nMost importantly, the “best interest of the child” is the paramount consideration in any conservatorship or\npossession decision. See 153.002 TEX. F AM. CODE.\nAll Texas courts must ensure that their orders first and foremost serve the child’s best interest. By that standard,\ncontinuing under the shadow of void orders and parental discord is plainly not in this child’ s best interest. Instead, the\nchild’s best interest calls for fresh, valid temporary orders that set forth clear, fair, and safe arrangements for custody and\nvisitation while the parents’  disputes are resolved. The Court should craft these orders based on current evidence and the\nchild’s needs – not based on an outdated and unconsented plan from February. The Family Code’s public policy (Tex.\nFam. Code § 153.001) favors frequent, continuing contact with fit parents and stable environments free of violence or\nabuse. Here, Respondent is ready, willing, and able to care for the child and poses no danger, and he simply seeks a\nnormal custody schedule that allows the child to have both parents in his life. Petitioner ’s unsupported claims of family4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 3/4M.2336 M.2336\nM.2336 M.2336 M.2336 M.2336\n\nviolence (made to gain a litigation advantage) should not dictate the child’ s reality any longer, especially since those\nclaims have not been substantiated in any court hearing.  \nWhy your consolidation motio"}
{"id": "2c8d9fd41b84f3905af76787d4548764091db224", "vector_id": 34, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 34, "char_len": 2000, "text": "(made to gain a litigation advantage) should not dictate the child’ s reality any longer, especially since those\nclaims have not been substantiated in any court hearing.  \nWhy your consolidation motion and response are insufficient, and will fail, or be\nmet with mandamus if granted (after reconsideration)\n Normally, even without continuing exclusive  jurisdiction, a prior pending  suit would require the new suit to be consolidated\nor abated (as discussed above with §  6.407 and dominant jurisdiction). The mother (divorce petitioner) could argue that\nthe original court “has jurisdiction” over the children by virtue of the pending divorce, so the SAPCR should not proceed\nseparately. However, the void nature of the prior temporary orders is a game-changer. If those orders are void, then\nthe original case has not effectively adjudicated anything regarding the children’s current custody or support. The SAPCR\npetitioner can contend that because the prior orders are null, there is no valid existing order or active management of the\nchildren’s case, and the new court is free to act in the children’s best interests. This is the EXACT argument made . In\neffect, the argument is that the divorce case’s jurisdiction over the children lapsed into dormancy or “dormant jurisdiction”\ndue to your failure to prosecute the case.\nIt’s important to distinguish jurisdiction  from orders . The continuing jurisdiction doctrine  would typically prevent a\ndifferent court from issuing orders if a final order existed or if another court was actively handling the case. But here the\nSAPCR is filed in the same county as the divorce. There is no risk of two different counties competing; it’s an internal\nissue. The SAPCR ef fectively asks the  court to take up a new cause number and to recognize that the old cause has\nstalled and its orders are void.  \nEVEN IF the void argument fails, there is another nuance to this area of law . Despite the lack of a final order, the\npending divorce still technical"}
{"id": "e36ab99e091255465de428f51c9ba6828bc611ca", "vector_id": 35, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 35, "char_len": 2000, "text": "e old cause has\nstalled and its orders are void.  \nEVEN IF the void argument fails, there is another nuance to this area of law . Despite the lack of a final order, the\npending divorce still technically invokes the court’ s jurisdiction over the children. Typically, the proper course is to revive or\ndismiss  the dormant divorce, rather than maintain a wholly separate SAPCR on the side. Texas courts adhere to the\nprinciple that the first suit filed (here, the divorce) should dominate; a later-filed suit concerning the same subject (the\nchildren) can be abated to prevent conflicting rulings. In fact, in  In re Shifflet , for example, a party attempted parallel\nlitigation regarding child custody, and the court emphasized that modifications must be filed in the court with jurisdiction\nover the original case\nThe only exception  to the one-court rule is narrow. Texas law does allow a court to lose dominant jurisdiction if the\nparty with the first suit proceeded in bad faith or the suit is not actively pursued. Both apply here. The first suit was\nunquestionably brought in bad faith, as the declaration of an active protective order being in ef fect against the\nRespondent was an intentional fabrication designed to provide your client with an advantage. Despite this, the\nTexas legislature should have prevented the first hearing from ever happening, because 6.405b of the T exas Family\nCode required your client to present the alleged order to the court BEFORE ANY HEARING. \nCONCLUSION \nThus, the SAPCR is appropriately before the court, and the only argument you made in your Response fails. The court\ndenied my attempt to open this separate suit, requiring me to file a 17 page argument as to why the case should be\naccepted, and then it was.\nSo your response effectively mirrors the first denial from the court,  which amounts to no response being filed at all.\nIt is clear you are not representing your client in a manner to uphold the law or the best interests of the children, but to"}
{"id": "dc1bb9800b58e0a9002be9a6abe71bfc7fdc6fbd", "vector_id": 36, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 36, "char_len": 2000, "text": "st denial from the court,  which amounts to no response being filed at all.\nIt is clear you are not representing your client in a manner to uphold the law or the best interests of the children, but to\nonly appear when needed to obstruct the much needed justice that the children need and deserve.\nThis is my position.\nCharles Dustin Myers4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 4/4M.2337 M.2337\nM.2337 M.2337 M.2337 M.2337\n\nFUDSTOP <chuckdustin12@gmail.com>\nCAUSE# 233-765358-25 EX-PARTE TRO\n5 messages\nFUDSTOP <chuckdustin12@gmail.com> Wed, Mar 26, 2025 at 5:48 PM\nTo: FLCCoordinator@tarrantcountytx.gov\nHello, \nThis is Charles Dustin Myers, Petitioner in the above captioned cause, and I received an automated reply deferring me to\nthis email when originally reaching out to the Honorable Coordinator .\nThe original email's purpose was to inform the Honorable Coordinator that I had just received notification through the EFM\nthat the emergency ex-parte TRO had been accepted by the court.\nI am following up to inquire about the status of the request.\nI thank you for your attention to this urgent matter, and I will wait for further directive from the court to proceed accordingly.\nAs mentioned in the motion, the Respondent in this matter and her counsel of record have been duly notified of the relief\nbeing sought and the motion itself, but have not responded to any attempts to communicate regarding this urgent matter .\nThank you and have a wonderful evening.\nRespectfully ,\nCharles Dustin Myers\nchuckdustin12@gmail.com\n817-546-3693\nTegan B. Allison <TBAllison@tarrantcountytx.gov> Thu, Mar 27, 2025 at 8:45 AM\nTo: FUDSTOP <chuckdustin12@gmail.com>\nThis order needs to be presented in person. Likewise, you need to inform opposing counsel of the date and\ntime you intend to present this order to the court.\nThank you,\nTegan Allison\nAuxili"}
{"id": "ab78566b36d8c5c01d1baedee57b06abbd5c1ced", "vector_id": 37, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 37, "char_len": 2000, "text": "gmail.com>\nThis order needs to be presented in person. Likewise, you need to inform opposing counsel of the date and\ntime you intend to present this order to the court.\nThank you,\nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E Weatherford\nFort Worth, TX 76196\nTBAllison@tarrantcountytx.gov4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 1/5M.2338 M.2338\nM.2338 M.2338 M.2338 M.2338M Gmail\n\nYou don't often get email from chuckdustin12@gmail.com . Learn why this is importantFr om:  FUDSTOP < chuckdustin12@gmail.com >\nSen t: Wednesday, March 26, 2025 5:49 PM\nT o: Courts - FLC Coordinator < FLCCoordinator@tarrantcountytx.gov >\nSubject:  CAUSE# 233-765358-25 EX-PARTE TRO\nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 8:59 AM\nTo: \"Tegan B. Allison\" <TBAllison@tarrantcountytx.gov>\nMs. Allison,\nThank you for the update.\nIs there a time available tomorrow to come and present the order? Preferably between 9am and 2pm? \nI have informed the opposing party of the intent to present the order and will provide the time and date upon determination\nof the court's availability.\nThank you for your assistance.\nCharles Dustin Myers\nChuckdustin12@gmail.com  \n817-546-3693\n[Quoted text hidden]\nimage001.jpg\n6K\nTegan B. Allison <TBAllison@tarrantcountytx.gov> Thu, Mar 27, 2025 at 9:05 AM\nTo: FUDSTOP <chuckdustin12@gmail.com>\nYou may present the order during that time. Please keep in mind that the court will be closed from 12pm-\n1:30pm for lunch and administrative tasks.\nThank you,4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 2/5M.2339 M.2339\nM.2339 M.2339 M.2339 M.2339\n\nTegan"}
{"id": "be7b8ba3a750c979ff75d0f0fb84ba090846f0b8", "vector_id": 38, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 38, "char_len": 2000, "text": "X-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 2/5M.2339 M.2339\nM.2339 M.2339 M.2339 M.2339\n\nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E Weatherford\nFort Worth, TX 76196\nTBAllison@tarrantcountytx.gov\nFr om:  FUDSTOP < chuckdustin12@gmail.com >\nSen t: Thursday, March 27, 2025 9:00 AM\nT o: Tegan B. Allison <TBAllison@tarrantcountytx.gov >\nSubject:  Re: CAUSE# 233-765358-25 EX-PARTE TRO\nEXTERNAL EMAIL ALERT! Think Before You Click!\nMs. Allison,\nThank you for the update.\nIs there a time available tomorrow to come and present the order? Preferably between 9am and 2pm?  \nI have informed the opposing party of the intent to present the order and will provide the time and date upon determination\nof the court's availability.\nThank you for your assistance.\nCharles Dustin Myers\nChuckdustin12@gmail.com  4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 3/5M.2340 M.2340\nM.2340 M.2340 M.2340 M.2340\n\n817-546-3693\nOn Thu, Mar 27, 2025, 8:45  AM Tegan B. Allison < TBAllison@tarrantcountytx.gov > wrote:\nThis order needs to be presented in person. Likewise, you need to inform opposing counsel of the date\nand time you intend to present this order to the court.\nThank you,\nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E Weatherford\nFort W orth, TX 76196\nTBAllison@tarrantcountytx.gov\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 9:19 AM\nTo: \"Tegan B. Allison\" <TBAllison@tarrantcountytx.gov>\nMs. Allison,\nThank you very much. \nI have informed opposing counsel that I intend to present the TRO tomorrow at 9:00 AM, the relief being sought, and if\nanything changes I will inform the court and likewise the opposing"}
{"id": "f549a9a0e007879a0dcca2112f9fd964df70f364", "vector_id": 39, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 39, "char_len": 2000, "text": "ou very much. \nI have informed opposing counsel that I intend to present the TRO tomorrow at 9:00 AM, the relief being sought, and if\nanything changes I will inform the court and likewise the opposing party .\nHave a wonderful day.\nRespectfully,\nCharles Dustin Myers\nChuckdustin12@gmail.com\n817-546-3693\n[Quoted text hidden]\n4 attachments4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 4/5M.2341 M.2341\nM.2341 M.2341 M.2341 M.2341\n\n~WRD0000.jpg\n1K\nimage001.jpg\n6K\nimage001.jpg\n6K\n~WRD0000.jpg\n1K4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 5/5M.2342 M.2342\nM.2342 M.2342 M.2342 M.2342\n\nEXHIBIT 2\nTRO COMMUNICATIONS\n03/24/25M.2343 M.2343\nM.2343 M.2343 M.2343 M.2343\n\nFUDSTOP <chuckdustin12@gmail.com>\nRE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\n3 messages\nCooper Carter <coopercarter@majadmin.com> Mon, Mar 24, 2025 at 10:03 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood Morning,\nOpposing party is a pro se Petitioner in the above referenced case. He has filed a SAPCR petition regarding this matter .\nThere is a current pending divorce case that encompasses issues regarding children. Our of fice has filed an Answer as\nwell as a Motion to Consolidate and proposed order in this case to consolidate this SAPCR into the pending divorce\nproceeding in the 322nd.\nCould you please provide dates and times that the Court is available to hear my motion?\nOpposing party has been cc-ed to this e-mail for convenience.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR "}
{"id": "3fbf7597d8b754cf14d0b71b368c7d2efe6fa30e", "vector_id": 40, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 40, "char_len": 2000, "text": "oper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 1/3M.2344 M.2344\nM.2344 M.2344 M.2344 M.2344M Gmail\n\nWILL NOT RESPOND.\nFr om:  Cooper Carter < coopercarter@majadmin.com>\nSen t: Monday, March 24, 2025 10:03 AM\nT o: Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov>\nCc: 'Charlie Vids' < chuckdustin12@gmail.com>\nSubject:  RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Mon, Mar 24, 2025 at 10:15 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nMs. Wierzbicki, Mr. Carter,\nThank you for the update. However, I must respectfully object to the assertion that this is a mandatory consolidation.\nUnder Texas Rule of Civil Procedure 174(a), consolidation is discretionary and not automatic where doing so would cause\ndelay, injustice, or prejudice to a party. Additionally, the Texas Supreme Court in Curtis v. Gibbs, 511 S.W.2d 263 (Tex.\n1974) expressly carved out exceptions to dominant jurisdiction where:\nThe original case was file"}
{"id": "893817753a5ff49789b83e3ecc381cb74f61e719", "vector_id": 41, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 41, "char_len": 2000, "text": "or prejudice to a party. Additionally, the Texas Supreme Court in Curtis v. Gibbs, 511 S.W.2d 263 (Tex.\n1974) expressly carved out exceptions to dominant jurisdiction where:\nThe original case was filed in bad faith,\nThe case isn't been prosecuted;\nEquity and justice require an independent forum.\nAll three conditions are present here. The SAPCR was filed in good faith after the 322nd case became procedurally\nstalled and legally defective—with no Notice of Remand, no evidentiary rulings on the children, and pending dispositive\nmotions including unopposed requests for dismissal. \nIt would be prejudicial to the children to consolidate a case that had no ability to proceed.\nThank you.\nRespectfully,\nCharles Dustin Myers\nPro Se Petitioner\n[Quoted text hidden]4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 3/3M.2345 M.2345\nM.2345 M.2345 M.2345 M.2345\n\nAngie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov> Mon, Mar 24, 2025 at 10:08 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood morning,\nThe Motion to Consolidate just needs to be filed in the 322nd Divorce case and sent to their Judge to sign; no hearing\nnecessary, it’s a mandatory consolidation.\nThank you,\nAngie D. Wierzbicki\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. W eatherford St ., 5th Floor\nFt. Worth, TX 76196\n***PLEASE NOTE: YOU MUSTPROVIDE LOCAL COURT RULE\nDOCUMENTS IFYOU ARE SET FOR A HEARING INEITHERCOURT.\nFAILURE TOPROVIDE LOCAL COURT RULEDOCUMENTS COULD\nRESULTINTHE RESET OFYOURCASE***\nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRE4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=al"}
{"id": "bbe574e38c8639ecddcb42064c4ab544214222c7", "vector_id": 42, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 42, "char_len": 2000, "text": "IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRE4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 2/3M.2346 M.2346\nM.2346 M.2346 M.2346 M.2346\n\nEXHIBIT 3\nTRO COMMUNICATIONS\n03/26/25M.2347 M.2347\nM.2347 M.2347 M.2347 M.2347\n\nFUDSTOP <chuckdustin12@gmail.com>\nNotice\n1 message\nFUDSTOP <chuckdustin12@gmail.com> Wed, Mar 26, 2025 at 7:19 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Myers <morganmw02@gmail.com>\nFriends on other side,\nThe Emergency EX-PARTE TRO has been filed and accepted by the court and is awaiting the judge's review. \nIf a hearing is required, I will CC Cooper in the email correspondence.\nIf a hearing is not required, I will serve each of you with a copy of the TRO and proposed order in accordance with the\nrules no later than seven days prior to the hearing.\nThe TRO has the following provisions:\n*Respondent is PROHIBITED from preventing Petitioner from entering the matrimonial residence located at 6641\nAnne Ct, Watauga, TX 76148.\n* Respondent is PROHIBITED from disturbing the peace of the minor children named in this suit.\n*Petitioner and Respondent are PROHIBITED from acting without candor towards all members of the household\nin the presence of the children.\n*Respondent is PROHIBITED from bringing the children in the presence of DAMEN GAUL T KAZLAUSKAS.\n* Respondent is PROHIBITED from taking the children outside of Tarrant County, Texas.\nThese provisions, if granted, will be in effect until a full hearing is held no later than 14 days after the order is signed by\nthe judge.\nOnce the notice of hearing is served on all parties, I will be filing a motion for pre-trial conference to discuss the Rule 12\nmotion filed and served last week to ensure those issues are resolved prior to trial. \nAt the hearing, the relief I am seeking is to convert the provisions from the TRO into "}
{"id": "0921910868902605038eb84559ef20b979da8dbc", "vector_id": 43, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 43, "char_len": 2000, "text": "ce to discuss the Rule 12\nmotion filed and served last week to ensure those issues are resolved prior to trial. \nAt the hearing, the relief I am seeking is to convert the provisions from the TRO into temporary injunctions which will be\nthe exact same but will ask for them to remain until further order of the court and reset the status quo to March 6, 2024,\nwhich was the last peaceful time enjoyed by all parties prior to the Respondent's unlawful lockout.\nIf a continuance is needed in order to get your affairs in order for the Rule 12 conference, please reach out as I have no\nproblem signing an agreed continuance if more time is needed.\nI am not seeking sanctions at this time.\nIf granted, I believe the preceding details suit the best interests of Mara and Caroline, preserves their emotional and\nfinancial well-being, allows myself to repair the substantial damage caused from the prior thirteen months, promotes an\namicable co-parenting relationship, and most importantly upholds Texas Law in ensuring that children have continuous,\nfrequent access to both parents  and that parents are encouraged to work together during and after divorce because\ndoing so is in their best interests.\nI'm not looking to punish, hurt, or ruin anyone. I'm simply looking to do what's best for the kids and start working together\nto finish this so we can all move on with our lives.\nIf you have any suggestions, modifications, or alternative solutions, please feel free to reach out and let me know , or\nschedule a time and place to meet in person that best meets your schedule.\nRespectfully,4/12/25, 1:04 PM Gmail - Notice\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&simpl=msg-a:r825366924926110… 1/2M.2348 M.2348\nM.2348 M.2348 M.2348 M.2348M Gmail\n\nCharles Dustin Myers\nchuckdustin12@gmail.com\n817-546-36934/12/25, 1:04 PM Gmail - Notice\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&s"}
{"id": "76d2ef472240b34098dcdbcd9dc9034484810548", "vector_id": 44, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 44, "char_len": 2000, "text": "il\n\nCharles Dustin Myers\nchuckdustin12@gmail.com\n817-546-36934/12/25, 1:04 PM Gmail - Notice\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&simpl=msg-a:r825366924926110… 2/2M.2349 M.2349\nM.2349 M.2349 M.2349 M.2349\n\nEXHIBIT 4\nTRO COMMUNICATIONS\n03/27/25M.2350 M.2350\nM.2350 M.2350 M.2350 M.2350\n\nFUDSTOP <chuckdustin12@gmail.com>\nTRO + Exhibits + Proposed Order\n1 message\nFUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 5:54 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Myers <morganmw02@gmail.com>\nAttached for your reference is the TRO, proposed order, and exhibits.\nRespectfully,\nCharles Dustin Myers\n6641 Anne Ct, Watauga, TX 76148\n817-546-3693\nchuckdustin12@gmail.com\n3 attachments\nemergency_motion_formatted (3) (2).pdf\n273K\nPROPOSED ORDER (2).pdf\n185K\nEXHIBITS - TRO.pdf\n8784K4/9/25, 11:44 AM Gmail - TRO + Exhibits + Proposed Order\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-7307259866084711537&simpl=msg-a:r-72989974457063… 1/1M.2351 M.2351\nM.2351 M.2351 M.2351 M.2351M Gmail\n\nFUDSTOP <chuckdustin12@gmail.com>\nITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\n6 messages\nCooper Carter <coopercarter@majadmin.com> Thu, Mar 27, 2025 at 6:20 PM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood Evening,\nI have received communication from opposing party who is pro se that he will be walking through an Emergency TRO.\nOur office has a hearing scheduled for tomorrow morning in Parker County and is unable to attend. However, I will be\navailable by cell phone regarding this matter if the Judge would like to speak to me regarding the Emergency TRO.\nPlease contact our of fice to patch me in for any calls that Judge would like to have.\nAdditionally , this case already is pending in the 322nd for a divorce proceeding regarding property and children matters.\nWe will be consolidating the case and walking it"}
{"id": "6e9f3d188bd9f7e7d8dc093cecb316ff3c19af37", "vector_id": 45, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 45, "char_len": 2000, "text": "at Judge would like to have.\nAdditionally , this case already is pending in the 322nd for a divorce proceeding regarding property and children matters.\nWe will be consolidating the case and walking it through the 322nd for signature next week.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 1/7M.2352 M.2352\nM.2352 M.2352 M.2352 M.2352M Gmail\n\nFUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 7:03 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCourt staff,\nMs. Carter’s recent correspondence is improper for several reasons, and appears to be an attempt to delay or interfere\nwith proceedings in which she has otherwise failed to meaningfully participate in. The following reasons support this\nstatement:\n1. An objection to consolidation is already on file and remains unopposed. It cites controlling Texas precedent. Any\nsuggestion that consolidation is agreed upon or inevitable is misleading. Instead, she should properly file with the court\nwhy the consolidation is improper or at the very least argue against Petitioner's position.\n2. Ms. Carter has not fulfilled her obl"}
{"id": "289edaf20723190df13e1673e76b2932e270e5b6", "vector_id": 46, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 46, "char_len": 2000, "text": "able is misleading. Instead, she should properly file with the court\nwhy the consolidation is improper or at the very least argue against Petitioner's position.\n2. Ms. Carter has not fulfilled her obligation under Texas Rule of Civil Procedure 237a to file a Notice of Remand. Until\nshe does, she is prohibited from proceeding or filing anything in the 322nd District Court as they currently do not have\njurisdiction over this matter until this obligation is fulfilled.\n3. Her authority to represent the Respondent remains under challenge pursuant to a Rule 12 motion filed September 20,\n2024. No hearing has been held, no written statement of authority has been filed, and no ruling has been made. Until\nresolved, Rule 12 bars her from participating in either proceeding.\n4.Ms. Carter has not prosecuted the case in the 322nd District Court in over eight months. This inaction has prejudiced\nthe Petitioner and delayed resolution of urgent matters af fecting the children.\n5. She has failed to file any objections, responsive pleadings, or legal arguments opposing the relief requested—including\nthe Emergency TRO now pending.\n6. Rather than reaching out to Petitioner to resolve any scheduling conflict, Ms. Carter improperly attempted to influence\nthe court by email. This violates the spirit of cooperation required by the rules, particularly where her participation is\nprocedurally barred.\n7. Ms. Carter’s conduct appears designed to delay relief and subvert the best interest of the children, despite her failure to\noppose the requested relief in any meaningful way.\n8. She has been provided with full notice of the Emergency TRO, the proposed order, supporting exhibits, and the time\nand location of presentment. She has no legal basis to subvert Petitioner's due process rights.\nIn summary, Ms. Carter has not provided anything of substance in either Court, has not prosecuted the case, has not\nargued on behalf of her client, or followed proper procedure.\nSimply labeling the opposition as p"}
{"id": "be5c45075185619f15df36cc4a3a236685293a78", "vector_id": 47, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 47, "char_len": 2000, "text": "s. Carter has not provided anything of substance in either Court, has not prosecuted the case, has not\nargued on behalf of her client, or followed proper procedure.\nSimply labeling the opposition as pro se and claiming that the consolidation will be filed without disclosing the above facts\nis dishonest and should not be permitted as it will only cause further unnecessary delays to the relief being sought without\nany substance being provided.\nAgain, all of these points have been argued in both courts, and it is her duty as counsel to handle these matters in\naccordance with Texas Law.\nThese matters should be handled between the parties - not attempt to influence court staf f after hours.\nThe reason we are here in the first place is due to the above unanswered facts. Ms. Carter has had ample time to file an\nobjection, response, or counter argument, but has chosen not to do so.\nIt would've been far more appropriate for Ms. Carter to have reached out to me directly to discuss scheduling conflicts.\nPrior to the latest email, there was no indication Ms. Carter intended to participate at all despite being provided with all\nrelevant materials.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 2/7M.2353 M.2353\nM.2353 M.2353 M.2353 M.2353\n\nThe court should disregard this email correspondence in its entirety for the reasons stated herein as it is highly prejudicial\nto Petitioner and the children.\nPro se litigants are expected to follow the rules of procedure to the same extent licensed attorneys are.\nThis email chain should be disregarded in its entirety.\nHave a good evening.\nRespectfully,\nCharles Dustin Myers\nPetitioner, Pro Se\n[Quoted text hidden]FUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 7:07 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nC"}
{"id": "b30743a53abc27857fd164b4bee990a261caf52e", "vector_id": 48, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 48, "char_len": 2000, "text": "ner, Pro Se\n[Quoted text hidden]FUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 7:07 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCourt staff,\nMs. Carter’s recent correspondence is improper for several reasons, and appears to be an attempt to delay or interfere\nwith proceedings in which she has otherwise failed to meaningfully participate in. The following reasons support this\nstatement:\n1. An objection to consolidation is already on file and remains unopposed. It cites controlling Texas precedent. Any\nsuggestion that consolidation is agreed upon or inevitable is misleading. Instead, she should properly file with the court\nwhy the consolidation is improper or at the very least argue against Petitioner's position.\n2. Ms. Carter has not fulfilled her obligation under Texas Rule of Civil Procedure 237a to file a Notice of Remand. Until\nshe does, she is prohibited from proceeding or filing anything in the 322nd District Court as they currently do not have\njurisdiction over this matter until this obligation is fulfilled.\n3. Her authority to represent the Respondent remains under challenge pursuant to a Rule 12 motion filed September 20,\n2024. No hearing has been held, no written statement of authority has been filed, and no ruling has been made. Until\nresolved, Rule 12 bars her from participating in either proceeding.\n4.Ms. Carter has not prosecuted the case in the 322nd District Court in over eight months. This inaction has prejudiced\nthe Petitioner and delayed resolution of urgent matters af fecting the children.\n5. She has failed to file any objections, responsive pleadings, or legal arguments opposing the relief requested—including\nthe Emergency TRO now pending.\n6. Rather than reaching out to Petitioner to resolve any scheduling conflict, Ms. Carter improperly attempted to influence\nthe court by email. This violates the spirit of cooperation required by the rules, particularly where her participatio"}
{"id": "c4c40ff708bc4007b38a97b6934a3e46b42e087e", "vector_id": 49, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 49, "char_len": 2000, "text": " to resolve any scheduling conflict, Ms. Carter improperly attempted to influence\nthe court by email. This violates the spirit of cooperation required by the rules, particularly where her participation is\nprocedurally barred.\n7. Ms. Carter’s conduct appears designed to delay relief and subvert the best interest of the children, despite her failure to\noppose the requested relief in any meaningful way.\n8. She has been provided with full notice of the Emergency TRO, the proposed order, supporting exhibits, and the time\nand location of presentment. She has no legal basis to subvert Petitioner's due process rights.\nIn summary, Ms. Carter has not provided anything of substance in either Court, has not prosecuted the case, has not\nargued on behalf of her client, or followed proper procedure.\nSimply labeling the opposition as pro se and claiming that the consolidation will be filed without disclosing the above facts\nis dishonest and should not be permitted as it will only cause further unnecessary delays to the relief being sought without\nany substance being provided.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 3/7M.2354 M.2354\nM.2354 M.2354 M.2354 M.2354\n\nEXHIBIT 5\nTRO COMMUNICATIONS\n03/28/25M.2355 M.2355\nM.2355 M.2355 M.2355 M.2355\n\nAgain, all of these points have been argued in both courts, and it is her duty as counsel to handle these matters in\naccordance with Texas Law.\nThese matters should be handled between the parties - not attempt to influence court staf f after hours.\nThe reason we are here in the first place is due to the above unanswered facts. Ms. Carter has had ample time to file an\nobjection, response, or counter argument, but has chosen not to do so.\nIt would've been far more appropriate for Ms. Carter to have reached out to me directly to discuss scheduling conflicts.\nPrior to the lates"}
{"id": "03d910ee4e7724a4896c6dfa772686cad2b34554", "vector_id": 50, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 50, "char_len": 2000, "text": " response, or counter argument, but has chosen not to do so.\nIt would've been far more appropriate for Ms. Carter to have reached out to me directly to discuss scheduling conflicts.\nPrior to the latest email, there was no indication Ms. Carter intended to participate at all despite being provided with all\nrelevant materials.\nThe court should disregard this email correspondence in its entirety for the reasons stated herein as it is highly prejudicial\nto Petitioner and the children.\nPro se litigants are expected to follow the rules of procedure to the same extent licensed attorneys are.\nThis email chain should be disregarded in its entirety.\nHave a good evening.\nRespectfully,\nCharles Dustin Myers\nPetitioner, Pro Se\n[Quoted text hidden]Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov> Fri, Mar 28, 2025 at 9:15 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood morning,\nMr. Myers appeared before me to schedule the hearing for the TRO; my apologies I did not realize this was that\nsame case.  We can go ahead and set the TRO with us, but most likely the case will be transferred prior to the\nhearing date and the case needs to be transferred prior to that date.\nMr. Myers will be emailing with dates available for the hearing.\nThank you,\nAngie D. Wierzbicki\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. W eatherford St ., 5th Floor\nFt. Worth, TX 761963/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 4/7M.2356 M.2356\nM.2356 M.2356 M.2356 M.2356\n\n***PLEASENOTE:YOUMUST PROVIDE LOCALCOURT RULE\nDOCUMENTS IF YOUARE SET FORA HEARINGIN EITHER COURT. \nFAILURE TO PROVIDE LOCALCOURT RULE DOCUMENTS COULD\nRESULT IN THERESETOFYOUR CASE***\nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOS"}
{"id": "d0f9493f7fb7b06cc0d308133cc0a20d07f605dc", "vector_id": 51, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 51, "char_len": 2000, "text": "T FORA HEARINGIN EITHER COURT. \nFAILURE TO PROVIDE LOCALCOURT RULE DOCUMENTS COULD\nRESULT IN THERESETOFYOUR CASE***\nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRESENTED LITIGANTS, I\nWILL NOT RESPOND.\nFr om:  Cooper Carter < coopercarter@majadmin.com>\nSen t: Thursday, March 27, 2025 6:20 PM\nT o: Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov>\nCc: 'Charlie Vids' < chuckdustin12@gmail.com>\nSubject:  ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nAngie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov> Fri, Mar 28, 2025 at 9:19 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nAdditionally, since there is an objection to the consolidation, y’all will need to reach out to request how to proceed\nwith the 322nd as I am usure of their procedures.\nThank you,\nAngie D. Wierzbicki3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 5/7M.2357 M.2357\nM.2357 M.2357 M.2357 M.2357\n\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. Weatherford St ., 5th Floor\nFt. Worth, TX 76196\n***PLEASENOTE:YOUMUST PROVIDE LOCALCOURT RULE\nDOCUMENTS IF YOUARE SET FOR A HEARING IN EITHER COURT. \nFAILURE TO PROVIDE LOCALCOURT RULE DOCUMENTS COULD\nRESULT IN THERESETOFYOUR CASE***\nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRESENTED LITIGANTS, I\nWILL NOT RESPOND.\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Fri, Mar 28, 2025 at 9:59 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nHello all,\nSorry for the delay. I had to hunt down wifi.\nAvailable dates are:\n04/10/25 at 930 AM\n0"}
{"id": "fc6c825764061f8b1f1f00a93ad8d4c2046d2bb4", "vector_id": 52, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 52, "char_len": 2000, "text": "Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nHello all,\nSorry for the delay. I had to hunt down wifi.\nAvailable dates are:\n04/10/25 at 930 AM\n04/09/25 at 130 PM\n04/08/25 at 930 AM\n04/07/25 at 130 PM\nThank you.3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 6/7M.2358 M.2358\nM.2358 M.2358 M.2358 M.2358\n\nAny of these dates work for me.\nRespectfully,\nCharles Myers\n8175463693\n[Quoted text hidden]\nimage001.png\n120K3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 7/7M.2359 M.2359\nM.2359 M.2359 M.2359 M.2359\n\nEXHIBIT 6\n03/28/25M.2360 M.2360\nM.2360 M.2360 M.2360 M.2360\n\nM.2361 M.2361\nM.2361 M.2361 M.2361 M.2361~ J,.,,., -\nSIGNEOon______ 70--al ___ _ _m \nPRESii'iiNt JUDGE\n\nEXHIBIT 7\nTRO COMMUNICATIONS\n04/03/2025M.2362 M.2362\nM.2362 M.2362 M.2362 M.2362\n\nFUDSTOP <chuckdustin12@gmail.com>\nRE MOTION FOR CONSOLIDATION CL-12105\n2 messages\nCooper Carter <coopercarter@majadmin.com> Thu, Apr 3, 2025 at 1:33 PM\nTo: Charlie Vids <chuckdustin12@gmail.com>\nGood Afternoon,\nThis is to inform you that I will be walking through the attached Motion for Consolidation and Proposed Order tomorrow\nmorning at 9:00 a.m. in the 322nd for signature.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort W orth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED R"}
{"id": "d83cc4653a54bb64df8b4ba664898133ff7574f1", "vector_id": 53, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 53, "char_len": 2000, "text": "THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n2 attachments\nMotion to Consolidate V.1.pdf\n13K4/12/25, 1:03 PM Gmail - RE MOTION FOR CONSOLIDATION CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1828407429439264551&simpl=msg-f:182840742943926455… 1/2M.2363 M.2363\nM.2363 M.2363 M.2363 M.2363M Gmail\n\nOrder on Motion to Consolidate V1.pdf\n10K\nFUDSTOP <chuckdustin12@gmail.com> Thu, Apr 3, 2025 at 1:55 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCooper,\nI've already objected.\nYou have no legal authority to do so until you address my objection filed and served to you.\nFurthermore, you have not sent the Notice required by rule 237a of the Texas Rules of Civil Procedure and have not\nshown you authority to represent the Petitioner in this matter.\nFinally, you claimed to have been retained in your individual capacity yet are claiming Marx Altman and Johnson is filing\npleadings on your behalf, and Roderick D. Marx is not a party in this suit nor has he made a formal appearance.\nYou're well aware of these obligations, and any order resulting from this motion will be challenged via the proper legal\nproceedings.\nYou cannot continue to disregard the rules of procedure, fail to respond to motions or evidence served to you, and\ncontinue to expect favors from the bench in leu of you performing your duties as a licensed attorneys.\nYou are put on notice that if any such motion is presented to the court in the face of the above facts or the unanswered\nobjection already served to you, I will move for your disqualificati"}
{"id": "883dab3c71ee87c323e34fb120f6b7d61aeca2a7", "vector_id": 54, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1\\03_24_2025_233_765358_25_emergency_tro_and_order_setting_hearing_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.2025_233-765358-25 EMERGENCY TRO AND ORDER SETTING HEARING-1.pdf", "source_exists": true, "page": null, "chunk_index": 54, "char_len": 1761, "text": "attorneys.\nYou are put on notice that if any such motion is presented to the court in the face of the above facts or the unanswered\nobjection already served to you, I will move for your disqualification immediately and will provide the Texas OAG with your\ninformation and detailed misconduct as well as the State Bar of Texas.\nFurther, you have not provided or served a copy of the proposed order which you intend to present, which is required.\nThis conversation will be filed and made apart of the official court record. \nRespectfully submitted,\nCharles Myers\n817-546-3693\nChuckdustin12@gmail.com\n[Quoted text hidden]4/12/25, 1:03 PM Gmail - RE MOTION FOR CONSOLIDATION CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1828407429439264551&simpl=msg-f:182840742943926455… 2/2M.2364 M.2364\nM.2364 M.2364 M.2364 M.2364~\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99676236\nFiling Code Description: No Fee Documents\nFiling Description: SAPCR Cover-letter\nStatus as of 4/15/2025 12:57 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/15/2025 10:28:09 AM\n4/15/2025 10:28:09 AM\n4/15/2025 10:28:09 AM\n4/15/2025 10:28:09 AMStatus\nSENT\nSENT\nSENT\nSENTM.2365 M.2365\nM.2365 M.2365 M.2365 M.2365"}