{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\06.10.25 - Notice of Related Federal RICO Litigation-1.pdf",
  "base_name": "06_10_25_notice_of_related_federal_rico_litigation_1",
  "page_count": 8,
  "pages": [
    {
      "page_number": 1,
      "text": "DKT (364)\n*** FROM 322-744263-23 *** NOTICE OF RELATED CASE\n(CIV-24-1311-R WEST DIST 06/05/2025 OF OKLAHOMA)\nFILED ON:  06/05/2025\nFEE: $0.00\nFILER/REQUESTOR:  N/A",
      "char_length": 163
    },
    {
      "page_number": 2,
      "text": "NO. 322-744263-23  \nIN THE 32\n2nd DISTRICT COURT OF TARRANT \nCOUNTY, TEXAS \n   RESPONDENT’S NOTICE  \nOF RELATED FEDERAL RICO \nLITIGATION \nT\nO THE HONORABLE 322ND DISTRICT COURT OF TARRANT COUNTY:  \nR\nespondent, CHARLES DUSTIN MYERS, respectfully submits this notice with the \ncourt regarding concurrent litigation with overlapping claims docketed as Civil No. 5:24- cv-\n01311 in the Western District of Oklahoma, and in support thereof, shows the court the following: \nI. INTRODUCTION\n1. On December 16, 2024, the Respondent initiated a suit in the Western District of\nOklahoma against Daniel Kenneth Branthoover, stepfather of the Petitioner in this suit, Morgan \nMichelle Myers.  \n2. On June 7, 2025, Respondent notified the Western District of Oklahoma of his intent to\namend the complaint to establish federal question jurisdiction and enjoin Morgan Michelle Myers, the Petitioner in this suit, as an additional defendant with the possibility of enjoining additional defendants into the suit. This correspondence was in response to an order to show the ITMOMO , § \nMORGAN MICHELLE \nMYERS, \n       Petitioner,  § \n§ \nv. § \n§ \nCHARLES DUSTIN MYERS \nRespondent.  \nAnd in the interest of M.E.M and   \nC.R.M, two children§ § § \n§ \n§",
      "char_length": 1231
    },
    {
      "page_number": 3,
      "text": "cause for the delay in effectuating service.  \n 3. The federal action alleges violations of the Racketeer Influenced and Corrupt \nOrganizations Act (\"RICO\"), 18 U.S.C. §§ 1961- 1968, related to certain conduct involving wire \nfraud and subsequent acts , including the preparation of false documents as mentioned above.  \n4. While the federal action involves some of the same parties and certain overlapping \nfactual allegations as this divorce proceeding, the federal case seeks remedies under federal law \nthat are separate and distinct from the relief sought in this divorce ac tion. \n5. This Notice is being filed solely to inform the Court of the existence of related federal \nlitigation that may involve matters relevant to this proceeding.  \n6. The undersigned party will provide this Court with any significant developments in the \nfederal case that may affect matters before this Court.  \nII. THE RACKETEER INFLUENCED AND CORRUPT ORGANIZATIONS ACT  \nThe Racketeer Influenced and Corrupt Organizations Act (RICO) is codified in 18 U.S.C. \n§§ 1961 -1968. This federal law provides both criminal penalties and civil remedies for \nracketeering activities conducted through an enterprise. The statute was originall y enacted to \ncombat organized crime but has been interpreted broadly to apply to various forms of organized unlawful activity.  \nIn Cruz v. FXDirectDealer , LLC, 720 F.3d 115 (2d Cir. 2013), the court explained: \"To \nestablish a RICO claim, a plaintiff must show: (1) a violation of the RICO statute,  18 U.S.C. § \n1962; (2) an injury to business or property; and (3) that the injury was caused by the violation of  \nSection 1962.\" In other words, to establish a violation of § 1962(c), a plaintiff must show that a person engaged in \"(1) conduct (2) of an enterprise (3) through a pattern (4) of racketeering activity.\"",
      "char_length": 1839
    },
    {
      "page_number": 4,
      "text": "III. RICO ELEMENTS  \n1. Conduct of an enterprise  \nFor a RICO claim to exist, there must be an \"enterprise,\" defined as \"any individual, \npartnership, corporation, association, or other legal entity, and any union or group of individuals \nassociated in fact although not a legal entity\" (18 U.S.C. § 1961(4)). In the instant matter, the Respondent believes he has enough evidence to prove that there  exists an association -in-fact \nenterprise consisting of multiple individuals that have been working together toward a common \npurpose. The participants include:  \ni. The mother, Morgan Michelle Myers, Petitioner to this suit; \nii. The stepfather (in Oklahoma), Daniel Kenneth Branthoover;  \niii. Potentially the grandmother, Margie Evonne Wilson;  \nAs noted in Sundquist v. Hultquist , Cause No. 1:20- CV-275-HAB (N.D. Ind. Sep 09, \n2020) , \"Any RICO enterprise must consist of more than a group of people who get together to \ncommit a pattern of racketeering activity.\" The enterprise must be \"distinct, separate, and apart \nfrom a pattern of racketeering activity: although a pattern of racketee ring activity may be the \nmeans through which the enterprise interacts with society, it is not itself the enterprise.\"  \nHere, the enterprise appears to be a family -based association with the common purpose of \nremoving the father from his home/business and depriving him of marital assets. This association exists beyond the specific racketeering acts themselves, suggesting a distinct enterprise for RICO purposes.  \n2. Pattern of racketeering activity  \nA \"pattern of racketeering activity\" requires at least two acts of racketeering activity \nwithin a ten -year period ( 18 U.S.C. § 1961(5)). Furthermore, these acts must be related and",
      "char_length": 1741
    },
    {
      "page_number": 5,
      "text": "amount to or pose a threat of continued criminal activity. The scenario in this case describes \nmultiple potential acts that could qualify as \"racketeering activity\" under  18 U.S.C. § 1961. \ni. The attempt to obtain an ex- parte temporary order of protection on December 14, \n2023, under false pretenses – obstruction of justice. (18 U.S.C. § 1503).  \nii. The transfer of $1,576 on December 15 across state lines from the joint marital bank account to the stepfather’s PayPal account -  wire fraud (18 U.S.C. § 1343). \niii. Filing a fraudulent divorce petition and false affidavit of indigency -  obstruction \nof justice  by making several perjurious statements under oath.  \niv. Serving an eviction notice citing a divorce and protective order that hadn't been filed yet -  obstruction of justice. \nThese acts are not isolated events, but are  related, as they share the common purpose of \nremoving the father from his home/business and depriving him of marital assets. They also demonstrate continuity, as they occurred over a period and involved multiple coordinated \nactions.  \n3. Interstate commerce  \nRICO requires that the activities of the enterprise affect interstate or foreign commerce. In \nthis scenario, the activities clearly cross state lines between Texas and Oklahoma:  \ni. Communication between individuals in different states;  \nii. Transfer of funds across state lines via PayPal;  \niii. Travel between states to execute parts of the scheme.  \nAs noted in RICO: A Primer  (2022), on page 2:  \n\"Notably, there must be some nexus to interstate or foreign commerce -it is a \njurisdictional element of a civil RICO claim. Thus, predicate acts will often occur in",
      "char_length": 1679
    },
    {
      "page_number": 6,
      "text": "several States.\"  \nThe interstate nature of the activities described in this scenario satisfies this element as \nPetitioner’s transfer of $1,576 made across state lines to Daniel Branthoover was made with the \nintent to defraud both the Respondent and this Court. 4. Injury to Business or Property  \nFor a civil RICO claim, the plaintiff must demonstrate an injury to business or property \ncaused by the RICO violation. In this scenario, the Respondent has suffered several concrete injuries:  \ni. Loss of access to joint marital funds;  \nii. Removal from his home, which is also his business location;  \niii. Significant financial losses resulting from the removal;  \niv. Enforcement of a fraudulent settlement agreement, including the prevention of contact between Respondent and his children by the Mother.  \nThese are concrete financial injuries to both Respondent’s property interests and business \noperations, which would satisfy the injury requirement for a civil RICO claim. Here, the \nRespondent has suffered significant losses due to his at -home business operations being interrupted \nby the scheme, which is ongoing.  \nIV. JURISDICTIONAL CONSIDERATIONS  \nWhile federal courts have exclusive jurisdiction over RICO claims according to some \nauthorities like  Intel Corp. v. Hartford Acc. and Indem. Co., others such as  Karel v. \nKroner  suggest concurrent jurisdiction between state and federal courts. This jurisdictional \nuncertainty further emphasizes the importance of notifying this Honorable Court about related federal proceedings to avoid procedural pitfalls. When RICO claims are \"inextricably entangled\"",
      "char_length": 1625
    },
    {
      "page_number": 7,
      "text": "with state divorce proceedings, especially concerning marital property as noted in Sakyi v. Berko , \ncoordination between courts becomes particularly important to prevent inconsistent rulings and \npreserve both courts' authority to adjudicate matters within their respective jurisdictions. \nThis notice serves a hybrid role in informing the court and raising the issues here to \nprevent preclusion issues from being raised by defense counsel.  \nV. THE UNJUSTIFIABLE CONDUCT DOCTRINE  \nIn this case, the mother's action s attempting to obtain a fraudulent ex- parte order, \nemptying the joint marital bank account across state lines, filing a fraudulent divorce petition with false claims of abuse, serving an eviction notice referencing a non -existent divorce and \nprotective orde r, and serving a settlement agreement without consent —could all be considered \nunjustifiable conduct. These actions were clearly intended to manipulate the legal system and gain an unfair advantage in the divorce proceedings.  \nBased on the unjustifiable conduct doctrine, t his court could potentially decline to \nexercise jurisdiction or, more likely, take steps to remedy the consequences of fraudulent  \nconduct. This might include reconsidering orders that were based on fraudulent information, such as the order removing the Respondent  from his home. \nVI. CONCLUSION \n This court has unintentionally become an instrument in a broader scheme aimed at \ndefrauding Respondent CHARLES DUSTIN MYERS of his home, business, children, and livelihood. The scheme involved coordinated interstate actions and fraudulent filings. Given these developments, Respondent seeks to amend his federal complaint in the Western District of \nOklahoma to include additional responsible parties, including Petitioner Morgan Michelle Myers , potentially Margie Evonne Wilson, add and additional claims. Respo ndent respectfully",
      "char_length": 1892
    },
    {
      "page_number": 8,
      "text": "submits this notice to ensure the court remains informed and will update promptly regarding any \nsignificant developments. \nRespectfully submitte d, \n/\ns/ Charles Dustin Myers \nC HARLES DUSTIN MYERS  \n817-546-3693\nC\nHUCKDUSTIN12@GMAIL.COM\nPr o-se Respondent\nC\nertificate of Service  \nP ursuant to Rule 21a of the Texas Rules of Civil Procedure, this notice has been duly served on all parties of record via the Texas Supreme Court approved EFM on 06/10/2025. \n/\ns/ Charles Dustin Myers \nC HARLES DUSTIN MYERS  \nPro-se Respondent",
      "char_length": 528
    }
  ]
}