{"id": "ca5f59380713d354794efcbd83202c32627b2dd8", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HONORABLE JAMES MUNFORD: \nThe record reveals a pattern of the Court acting beyond its jurisdiction: on January 16, \n2024 , the Court ousted Respondent from the marital residence withou t any fin ding of  family \nviolen\nce or  protective order; on March 26, 2024, the C ourt entered “Agreed” Temporary \nOrders without R espondent’s c onsent , flouting the statutory procedures for entry of such \norders. These actions violate Respondent’s due proc ess rights an d the Texas Family C ode. U nder \nTexas la w, orders issued without j urisdiction  or in the absence of  a party’s consent are void \nand cannot confer jurisdiction. Respondent asks the Court to recogni ze these fundamental de fects \nand dismi ss the  current orders a s  a matter of  law. \nUntil the se orders are resolved , or the court issues w ritten find ings regarding  thei r \nlegitim acy, Responde nt will not  appea r and  risk further deprivation  of his  right s from this court. IN THE INTEREST OF M.E.M., C.R.M., two \nchildren) \nMORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , Plea to the Jurisdiction \nRespondent.  \n2025-04-24 322-744263-23 FILED\nTARRANT COUNTY\n4/24/2025 12:34 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\nI.INTRODUCTION\nPetitioner filed a divorce petition under Title 5 of the Texas Family Code on December \n18, 2023. That petition did not seek exclusive possession of the residence or ask that Respondent \nbe excluded from the home. Shortly thereafter, on December 22, 2023, Pet itioner filed a separate \nApplication for Protective Order  under Title 4 of the Family Code, in which she explicitly \nrequested exclusive possession of the home, removal of Respondent, and child support. The Court consolidated the protective‐order case into the divorce case.  \nOn January 16, 2024, the court—without holding an evidentiary hearing or finding family \nviolence—entered Temporary Orders granting Petitioner exclusive possession"}
{"id": "a6c164c3a00d2ea5640a25c00f6dcda0874989cc", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "‐order case into the divorce case.  \nOn January 16, 2024, the court—without holding an evidentiary hearing or finding family \nviolence—entered Temporary Orders granting Petitioner exclusive possession of the home and primary custody and child support, and requiring Respondent to vacate the res idence that same \nday. No protective order was ever issued and no findings of family violence were made, even though Tex. Fam. Code §§ 83.006 and 85.001 plainly require such findings. In the weeks that followed, the court continued these arrangements and ul timately entered “Agreed” Temporary \nOrders (March 26, 2024) allocating parenting time and support. All of these extreme orders were based solely on Petitioner’s Title 4 application (and allegations of family violence), and no amendments to the pleadings we re ever filed to convert the case into a Title 5 SAPCR. \nRespondent never received any notice or hearing on custody, possession, or support issues under Title 5.  \nII. Legal Standards\nThe trial court’s authority is strictly limited by the statutes and pleadings. It may consider \nonly the claims and relief expressly pleaded by the parties, and must follow the Family Code’s procedures for protective orders and SAPCRs. Subject‐matter jurisd iction is a threshold issue: if\n\nthe court acted beyond the law, its orders are void. A plea to the jurisdiction is decided as a \nmatter of law when the relevant facts are undisputed (see Tex. Dep’t of Parks & Wildlife v. Miranda, 133 S.W.3d 217, 228 (Tex. 2004)). Here, the material jurisdictional facts are not in dispute.  \nIII. Title 4 (Protective Order) Proceedings Cannot Support Custody or Support  \nUnder Texas law, a protective‐order proceeding (Title 4) is not  a custody (SAPCR) \nproceeding (Title 5). The San Antonio Court of Appeals recently reaffirmed that without a proper SAPCR petition under Title 5, a court may not award conservatorship, possession, or support. In Rivera v. Figueroa (Tex. App.–San Antonio 2019), the court held"}
{"id": "66517113713512cf9354f47189c40cca94dbbe2c", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "ecently reaffirmed that without a proper SAPCR petition under Title 5, a court may not award conservatorship, possession, or support. In Rivera v. Figueroa (Tex. App.–San Antonio 2019), the court held that orders issued in a protective‐order case cannot support conservatorship or child‐support relief unless a Title 5 petition was filed and noticed. Likewise, In re Sheffie ld, 639 S.W.2d 270 (Tex. App.–Dallas \n1982), long held that Title 4 and Title 5 proceedings are jurisdictionally separate: “a court may not grant relief beyond the scope of the protective‐order statute without compliance with the SAPCR statutes” (sheffield, 6 39 S.W.2d at 272- 73). Here, Petitioner’s December 22 Title 4 \napplication was never amended or converted into a Title 5 petition. Respondent never waived notice or a hearing on conservatorship/possession issues. The court’s decision to exclude Respondent from the home and divest him of custody on January 16, 2024 therefore had no \njurisdictional basis. In short, “[w]ithout a valid protective order in place, the court lacked \njurisdiction to continue enforcing the extreme relief originally granted”.  \nIV . Statutory Prerequisites for Exclusion and Protective Orders Were Not Met  \nEven if the court treated the relief as a protective‐order, the Family Code’s strict \nrequirements were ignored. Tex. Fam. Code § 83.006(a) permits exclusion of a party from the\n\nhome only  if (1) the applicant files a sworn affidavit describing facts requiring exclusion, and (2) \nappears at the hearing to testify on those facts. Section 83.006(b) further requires that the court \nmake three findings: (i) the applicant resides (or recently resi ded) at the premises, (ii) the other \nparty committed family violence within the past 30 days, and (iii) there is a clear and present danger of future family violence. Likewise, § 85.001(a) mandates that at the close of a protective‐order hearing, the court must explicitly find whether family violence occurred. If so, \nthe court"}
{"id": "21cf2f73739950c46712965e11519207e80eb133", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "ent danger of future family violence. Likewise, § 85.001(a) mandates that at the close of a protective‐order hearing, the court must explicitly find whether family violence occurred. If so, \nthe court “ shall ” issue a protective order against the perpetrator. In this case, none of these \nprerequisites were satisfied. Petitioner did file an application and affidavit, but no hearing on January 16 (or thereafter) produced any finding of family violence. The court did not issue a protective order as the statute requires, and instead simply extended the eviction and custody restrictions indefinitely. By failing to hold a hearing, make any family‐violence finding, or enter a protective order, the court “bypass[ed] the statutory prerequisites” entirely. Without those statutorily required findings, the January 16 “kick‐out” and custody order was outside the court’s \npower. \nV . All Orders Exceeding the Pleadings or Statutory Authority Are Void\nIt is a bedrock rule that a Texas court must confine its rulings to the relief requested by \nthe pleadings and authorized by statute. Any order beyond that scope is void. The Houston First \nCourt of Appeals has stated that “[a]n order purporting to grant relief beyond the pleadings is void ab initio”. In Guillory v. Boykins, 442 S.W.3d 682, 690 (Tex. App.–Houston [1st Dist.] 2014, no pet.), the court held that where a trial court lacks jurisdiction or statutory authority to grant the relief, the order is void . Similarly, In re P .M.G., 405 S.W.3d 406, 416–17 (Tex. App.–\nTexarkana 2013, no pet.), confirms that orders entered without pleadings or outside statutory scope are null. Here, not only did the protective‐order pleadings not include any SAPCR claims,\n\nbut the later “agreed” orders on March 26, 2024 were not signed or even consented to by \nRespondent (violating Tex. R. Civ. P. 11). In short, every custody and exclusion order in this case was “predicated on a void order” . As th e Second Court of Appeals recognized in In re C.L."}
{"id": "eda2ce4f2b824bbeb1222f2561bb54a754f084c4", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "d to by \nRespondent (violating Tex. R. Civ. P. 11). In short, every custody and exclusion order in this case was “predicated on a void order” . As th e Second Court of Appeals recognized in In re C.L., 933 \nS.W.2d 402, 405 (Tex. App.–Fort Worth 1996, no writ), an order that is void ab initio “cannot form the basis for any valid subsequent judgment” .  That’s exactly what is happening here. The \ncourt is now moving to finalize fraud, constitutional deprivation, and is trying to finalize its’ original excision of Respondent’s constitutional rights. The court cannot destroy a family and then move to finalize that without a lawful basis, and over orders that are fundamentally void.  \nIV . Violation of Respondent’s Constitutional Rights to Due Process and Family Integrity  \nThe trial court’s actions not only violated statute but also trampled Respondent’s \nfundamental constitutional rights. By evicting the Respondent from his home and effectively separating him from his children with no prior notice or opportunity to be heard , the court \ndeprived him of liberty and property without due process of law. This violates Article I, § 19 of the Texas Constitution  (the “due course of law” guarantee) and the Fourteenth Amendment to \nthe U.S. Constitution . Now, the court seeks to finalize this fundamental error amidst an ongoing \nappeal, showing a continuous and complete disregard for the Respondent’s rights.  \nA. Deprivation of Property Without Due Process  \nThe January 16 order forced Respondent to vacate his own home on the same day it was \nissued. A person’s right to occupy their home is a significant property interest, protected by due process. Yet Respondent was ousted immediately, with no notice that such  relief would be sought \nand no chance to contest the allegations. The Texas Constitution and the 14\nth Amendment both \nforbid the State from depriving any person of property without due process of law. Fuentes v. \nShevin, 407 U.S. 67, 81- 82 (1972) (even tempo rary, no"}
{"id": "45dfa34313094d3f519fe30797eb7eb143ac3e93", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": " Texas Constitution and the 14\nth Amendment both \nforbid the State from depriving any person of property without due process of law. Fuentes v. \nShevin, 407 U.S. 67, 81- 82 (1972) (even tempo rary, non- final deprivations of property require\n\nnotice and hearing absent extraordinary circumstances). While Texas law does allow ex parte \norders in truly exigent circumstances, those orders must be narrowly tailored and followed promptly by a full hearing. Here, the statutory requirements for an ex pa rte kick -out were \ndisregarded, and Respondent was left homeless and separated from his belongings based on one -\nsided assertions. This is precisely the kind of state action that due process is meant to guard against.  \nB. Deprivation of Parental Rights Without Due Process  \nEven more critically, the court’s orders infringed Respondent’s fundamental right to \nparent his children, also without due process. A parent’s interest in the care, custody, and control of their children is fundamental . The United States Supreme Court has recognized that “the \ninterest of parents in the care, custody, and control of their children…is perhaps the oldest of the \nfundamental liberty interests  recognized by this Court.” Troxel v. Granville, 530 U.S. 57, 65 \n(2000) (plurality op.). Likewise, the Texas Supreme Court has affirmed that “the fundamental right of parents to make decisions concerning the care, custody, and control of their children” is constitutionally protected. In re C.J.C., 603 S.W.3d 804, 811 (Tex. 2020) (citing Troxel , 530 U.S. \nat 66). Governmental interference with this right is subject to strict scrutiny and must be accomplished only with rigorous procedural safeguards.  \nHere, Respondent’s removal from the home effectively altered custody of the children  \nwithout any hearing or finding of unfitness. Respondent went from being an equal managing conservator of the children to having zero possession or access (by virtue of being excluded from the home and the children’"}
{"id": "f9a08b9b7feb81d8c5c63e2a781fcef5c0bbec7b", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "aring or finding of unfitness. Respondent went from being an equal managing conservator of the children to having zero possession or access (by virtue of being excluded from the home and the children’s presence) overnight and without notice. This is a profound deprivation of parental rights. As the U.S. Supreme Court held in Stanley v. Illinois , an unwed \nfather could not be presumed unfit and have his children taken without a hearing – “the Due\n\nProcess Clause of the Fourteenth Amendment requires that [a father] be given a hearing on \nhis fitness as a parent before  his children are removed from his custody.” Stanley v. Illinois , 405 \nU.S. 645, 649 (1972) (emphasis added). The State “cannot, consistently with due process, merely presume”  a parent’s unfitness or danger and bypass a hearing; “parental unfitness \nmust be established on the basis of individualized proof”  before a child is taken away. Id. at \n647, 649. Yet in Respondent’s case, the court did exactly what Stanley  forbids – it presumed the \nnecessity of removing the father, without any adversarial testing of the evidence or finding of actual misconduct and left the determination for later (a hearing that kept getting postponed). This violated Respondent’s procedural due process rights to be heard before  being deprived of \ncustody of his children.  \nMoreover, the substantive  aspect of due process was violated. There is a “strong \npresumption that the best interest of a child is served by remaining with a fit parent.” Troxel , \n530 U.S. at 68- 69. The government may not “infringe on the fundamental right of parents to \nmake child rearing decisions simply because a state judge believes a ‘better decision’ could be made .” Id.  at 72 (plurality op.). In the absence of any evidence or finding that Respondent \nwas an unfit or dangerous parent, removing his children from him was an arbitrary infringement on his fundamental liberty interest. The orders entered in this case prioritized a one -sided \nallegat"}
{"id": "ed8b7b91ae94f053e6c22b7ef22060756d4bff26", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "t \nwas an unfit or dangerous parent, removing his children from him was an arbitrary infringement on his fundamental liberty interest. The orders entered in this case prioritized a one -sided \nallegation over a father’s constitutional rights, in a manner repugnant to both the Texas and U.S. Constitutions. Article I, Section 19 of the Texas Constitution guarantees that no citizen shall be deprived of liberty or property except by the due course of the law of the land  – here, \nRespondent was deprived of both without the lawful procedures or any adjudication of wrongdoi ng.\n\nIn sum, the process (or lack thereof) employed by the court fell far short of constitutional \nrequirements. This constitutional infirmity is independently sufficient to render the court’s orders \nvoid. A judgment entered in violation of due process is void a nd subject to collateral attack. \nPeralta v. Heights Medical Center, Inc., 485 U.S. 80, 84- 85 (1988) (judgment rendered without \nproper notice violates due process and is void). The proper remedy for a void order that stems from a due process violation is to  declare it a nullity and dismiss any action that cannot proceed \nwithout it.  \nVI. Plea to the Jurisdiction Must Be Granted  \nThe undisputed record shows no factual or legal basis for the court’s jurisdiction over the \nextreme relief granted. Under Miranda v. Texas Dept. of Parks & Wildlife , a plea to the \njurisdiction should be granted as a matter of law if the jurisdictional facts are undisputed or uncontroverted by competent evidence. Here, there is no genuine issue that (a) no protective order was issued and no findings of family violence were made, (b) no Title 5 SAPCR notice  of \nhearing exists on the record, or  was ever on file, and (c) all of Petitioner’s requests for home \nexclusion and support were styled under Title 4 and unsupported by any pleaded conservatorship claim. The court cannot “proceed further on the merits” without first resolving these fundamenta l \ndefects. Bec"}
{"id": "64bf84c31bc4f538991b659796b5a9657c74f9b4", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "on and support were styled under Title 4 and unsupported by any pleaded conservatorship claim. The court cannot “proceed further on the merits” without first resolving these fundamenta l \ndefects. Because these jurisdictional defects are purely legal, a full ev identiary hearing is \nunnecessary – the Court should rule as a matter of law that it never had authority to enter any of the challenged orders , vacate them accordingly, and allow the status quo to reset. Additionally, \nthe March 14, 2024, orders are a mere extension of the initial orders, which claim consent where consent is not present. These orders must be vacated as a matter of law as this court has no power \nto rule on void orders.\n\nRespondent puts the court on notice that this plea serves as non -appearance notice in that \nhe will not participate in any further proceedings until these issues are resolved in writing on the \nrecord, and will challenge any orders or decisions made prior to the resolution of these issues.  \nVII. PRAYER  \nWHEREFORE, PREMISES CONSIDERED, Charles Dustin Myers respectfully prays that the \nCourt:  \n1. Rule, as a matter of law, that the January 16, 2024, exclusion and custody order and all \nsubsequent temporary orders are void ab initio  for lack of subject -matter jurisdiction;  \n2. Vacate and rescind those orders, and dismiss with prejudice any custody, possession, or support claims that rest on them; alternatively, dismiss all SAPCR claims for want of proper pleadings, notice, and jurisdiction;  \n3. Issue a written ruling on this plea as required by law, and stay all further proceedings in this case pending resolution of this jurisdictional challenge; and \n4. Grant such other and further relief, at law or in equity, to which Respondent may be justly entitled.  \nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148 \n 817-546-3693 \n Chuckdustin12@gmail.com\n\nCERTIFICATE OF SERVICE  \nI hereby certify that a true and "}
{"id": "b879f5eda17e36986ab21ccb8b291a8a707ea90d", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_24_25_plea_to_jurisdiction_1\\04_24_25_plea_to_jurisdiction_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.24.25 - PLEA TO JURISDICTION-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 1103, "text": "ted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148 \n 817-546-3693 \n Chuckdustin12@gmail.com\n\nCERTIFICATE OF SERVICE  \nI hereby certify that a true and correct copy of this Plea and Motion has been served on counsel \nfor Petitioner on this 24th  day of  April  2025.  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n Pro-se respondent\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 100044997\nFiling Code Description: Motion (No Fee)\nFiling Description: PLEA TO THE JURISDICTION\nStatus as of 4/24/2025 2:56 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.CarterBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n4/24/2025 12:34:31 PM\n4/24/2025 12:34:31 PMStatus\nSENT\nSENT"}