{"id": "9cb65b9f63ea1bd6b71142c54dd24786b6f8ce0d", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n 322-744263- 23 \nIN THE 32 2ND DISTRICT COURT  \nOF \nTARRANT COUNTY , TEAXS  \n) \n) \n) \n) \n)   NOTICE: RICO UPDATE  \n) \n) \n) \n) \n) \n \n \nTO THE HONORABLE JUDGE OF SAID COURT:  \n Respondent CHARLES DUSTIN MYERS respectfully submits this RICO UPDATE to \nthis Court to provide recent updates regarding concurrent Federal litigation closely related to the \ninstant proceedings  and shows this Court the following:  \nI. Introduction  \n 1. As an initial reminder, th is divorce matter was initiated on December 18, 2023, and an \napplication for a protective order followed on December 22, 2023.  \n 2. On January 16, 2024, the parties named herein appeared before the C ourt, where the \nRespondent was ordered to vacate the family residence prior to any evidentiary hearing taking place, and the setting concluded without the required findings mandated by the Texas Family Code.  I.T.M.O.M.O  \n \nMorgan Michelle Myers,  \n  Petitioner,  \n & \nCharles Dustin Myers,  \n  Respondent.  \n \nAnd in the interest of M.E.M.  \n& C.R.M., two minor children.\n\n2 \n  3. As this Court and staff are well aware – a litigant cannot be deprived of fundamental \nrights  prior t o being afforded an equal opportunity to be heard, and all custody determinations \nmust be in the be st interests of the Children involved.  \n 4. Despite these prohibited actions, this Court shelved both of these requirements, and \nhelped participate in the destr uction of the s tatus quo and the emotional and financial stability of \nthe two minor children involved. \n 5. With not hing other than the claims of the Petitioner to go off of, this Court and its ’ staff \ncontinues to disregard basic principles  of Texas law for reasons that cannot be determined from \nthe case documents itself.  \n 6. This has lead to the Respondent  seeking answers throughout the Texas Judiciary for the \nprior 18 months  only to received unexplained denials and refusals to take action by our State ’s \nhighest Court.   7. Notably, these denials do not disprove th"}
{"id": "f21390a2e5e74c490e3af2d949734d828bd20e4f", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "throughout the Texas Judiciary for the \nprior 18 months  only to received unexplained denials and refusals to take action by our State ’s \nhighest Court.   7. Notably, these denials do not disprove the Respondent ’s legal position, or i mply that he \nis incorrect in his claims . \n 8. Due to this Court and the opposing counsel ’s inaction , Respondent  has taken matters \ninto his own hands and seeks to hold the Petitioner accountable for her actions leading up to the \ninitiation of this divorce suit, which is being prosecuted in the Western District of Oklahoma . \n1 \n 9. This case must be dismissed as it has no path towards a lawful resolution. \n \n1 See \nhttps://r.search.yahoo.com/_ylt=AwrEpkMX0YdoCwIA.y5XNyoA;_ylu=Y29sbwNiZjEEcG9zAzEEdnRpZAMEc2Vj\nA3Ny/RV=2/RE=1754940952/RO=10/RU=https%3a%2f%2fwww.pacermonitor.com%2fpublic%2fcase%2f56\n217911%2fMyers_v_Branthoover/RK=2/RS=4iw2V .Bk6moIgBHajbq2ay3Apx8 -\n\n3 \n II. R ICO Developments  \n 10. On July 24, 2025, Petit ioner Morgan Michelle Myers filed a pro -se Motion to \nDismiss in federal court, claiming that the allegations raised in the complaint are domestic issues, \nand requested the case be dismissed . \n 11. At the same time, Petitioner hides behind her alleged attorney here in this matter, and \nhas not prosecuted the case in over 12 months. This Court  and its ’ reviewing sta ff must ask \nthemselves: why can she participate pro -se in federal court, but remains absolutely silent here in \nthis Court?  \n 12. T he answer is simple: because she has no valid lega l representation , and this Court \nknows that. \nIII. Analysis  \n 13. In a normal case with a fair and impartial tribunal, the consequences for an attorney \nnot prosecuting a divorce case for over 12 months can be severe. Under Rule 165a of the Texas Rules of Civil Procedure, courts have authority to dismiss cases that are not disposed of within the Supreme Court's time standards. Additionally, courts possess inherent power to dismiss cases not prosecuted with due "}
{"id": "bc5b08929101677a101c48f99c09b2c52bb512d1", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "cedure, courts have authority to dismiss cases that are not disposed of within the Supreme Court's time standards. Additionally, courts possess inherent power to dismiss cases not prosecuted with due diligence. When a case has been dormant for an extended period without reasonable explanation, courts may presume abandonment and dismiss the case for want of prosecuti on, though the attorney may have an opportunity to reinstate the case by showing good \ncause for the delay.  \n 14. Not only has Respondent repeatedly brought this to the Court ’s attention, but he has \nalso filed a Motion to Dismiss for Want of Prosecution which this Court has the inherent power to set at an y time given the delay in prosecut ion by our friends on the other side.\n\n4 \n 15. Courts in Texas have authority to dismiss cases for want of prosecution from two \nprimary sources: Rule 165a of the Texas Rules of Civil Procedure and the court's inherent power.  \nA. Rule 165a Dismissal  \n 16. Rule 165a explicitly authorizes courts to dismiss cases that are not disposed of within \nthe time standards promulgated by the Supreme Court. According to Villarreal v. San Antonio \nTruck & Equip., 994 S.W.2d 628, 42 Tex. Sup. Ct. J. 662 (Tex. 1999) , \"A trial court may dismiss \nunder Rule 165a on 'failure of any party seeking affirmative relief to appear for any hearing or trial of which the party had notice,' TEX. R. CIV . P. 165a(1), or when a case is 'not disposed of \nwithin the time standards promul gated by the Supreme Court....'\" . This latter provision, found in \nRule 165a(2), is particularly relevant to cases that have been dormant for extended periods, such as those not prosecuted for over 12 months , which is the case here.  \n17. Furthermore, Whallon v. Candlelight Trails I Ass'n, NO. 01- 18-00493 -CV (Tex. App. \nNov 14, 2019)  reiterates this authority: \"A trial court may dismiss a suit under Rule 165a if (1) a \nparty seeking affirmative relief fails to appear for any hearing or trial of which the par"}
{"id": "735ec7fc3480af95c4a6cc15ae5f4acae9be727c", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": ". App. \nNov 14, 2019)  reiterates this authority: \"A trial court may dismiss a suit under Rule 165a if (1) a \nparty seeking affirmative relief fails to appear for any hearing or trial of which the party had notice or (2) the case is not disposed of within the time standards prom ulgated by the Texas \nSupreme Court under its administrative rules.\"  The question remains: why does this Court \ncontinue to permit this behavior  to continue , and what incentive is the Court operating under that \nis permitting such blatant  misconduct to persist , and why has it not utilized its ’ inherent power to \nrestore justice to these proceedings?  \nB. Inherent Power to Dismiss  \n 18. In addition to the explicit authority granted by Rule 165a, courts also have inherent \npower to dismiss cases that are not prosecuted with due diligence. Whallon v. Candlelight Trails\n\n5 \n I Ass'n , NO. 01 -18-00493- CV (Tex. App. Nov 14, 2019)  states that \"A trial court's authority to \ndismiss a suit for want of prosecution arises from: (1) Texas Rule of Civil Procedure 165a and \n(2) the trial court's inherent authority to control its own docket.\" This inherent power exists independently of the procedural rules.  \n19. Villarreal v. San Antonio Truck & Equip., 994 S.W.2d 628, 42 Tex. Sup. Ct. J. 662 \n(Tex. 1999) , a seminal case on this issue, clearly establishes that \"The trial court's authority to \ndismiss for want of prosecution stems from two sources: (1) Rule 165a of the Texas Rules of Civil Procedure, and (2) the court's inherent power.\"  \n20. Jimenez v Transwestern Property Co ., 999 S.W.2d 125 (Tex. Ct. App. 1999)  further \nexplains: \"Trial courts possess inherent and express power to dismiss cases that have not been prosecuted with diligence. S ee Rotello , 671 S.W.2d at 509. In a dismissal for want of \nprosecution, the test is not abandonment; the test is due diligence.\" This highlights that the key consideration is whether the attorney has demonstrated due diligence in prosecuting the case, "}
{"id": "6c4dc307b49b89a34664048f85b54080e3589fa0", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "nt of \nprosecution, the test is not abandonment; the test is due diligence.\" This highlights that the key consideration is whether the attorney has demonstrated due diligence in prosecuting the case, not whether the case has been explicitly abandoned.  \n21. When a case has been inactive for an extended period, courts may presume that the \nplaintiff has abandoned the suit . Roush v. Metro. Life Ins. Co., No. 07- 17-00458- CV (Tex. App. \nFeb 26, 2019)  explains that \"A delay of unreasonable duration, if not reasonably explained, will \ngive rise to a conclusive presumption that the plaintiff abandoned the suit.\" This presumption then justifies dismissal under either Rule 165a or the court's inherent power .  \n22. Despite this capability , this Court  only seems interested in prolonging the matter \nindefinitely, allowing the non- prosecution to leave the parties in legal limbo, and refuses to \nrequire any form of written participation from the other side.\n\n6 \n III. C onclusion  \n 23. In the beginning, this Court reversed t he burden of proof and placed the burden on the \nRespondent to show why he should not have a protective order issued against him. Now, rather \nthan the opposing counsel having the burden of showing good cause for the unreasonable delay in this case, the Court continues to sit on its ’ hands, allowing more precious time to be wasted, judicial \nresources to be consumed, and with no final resolution possible that would comport with Texas Law.  \n 24. As the c ase continues to languish, this notice is a reminder that despite the inaction \nhere, the Respondent is doing everything he can – in every forum that he can – to ensure that justice \nis served to himself, his children, and that the Petitioner is held accountable for her egregious actions that are the f oundation of this case.  \n Respectfully  submitted.  \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE RESPONDENT  \n \nCERTIFICATE OF SERVICE \n"}
{"id": "4a000557dba2098f896d94f82c3f1c408f482408", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\07_28_25_notice_of_rico_update_1\\07_28_25_notice_of_rico_update_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\07.28.25 - NOTICE OF RICO UPDATE-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 544, "text": "undation of this case.  \n Respectfully  submitted.  \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE RESPONDENT  \n \nCERTIFICATE OF SERVICE \n On July 28, 2025, Respondent CHARLES DUSTIN MY ERS certifies that a true and \naccurate copy of this notice has been provided to all parties of record via the EFM approved by the Texas Supreme Court and in accordance with Rule 21a  of the Texas Rules of Civil Procedure . \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n PRO -SE RESPONDENT"}