{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\06.05.25 - REQUEST FOR HEARING ON DWOP-1.pdf",
  "base_name": "06_05_25_request_for_hearing_on_dwop_1",
  "page_count": 17,
  "pages": [
    {
      "page_number": 1,
      "text": "IN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTo the Honorable 322nd District Court of Tarrant County : \nSince first obtaining relief at the show cau se hearing on January 16, 2024, the Petitioner  \nin that matter , MORGAN MICHELLE MYERS, has not done her part in this lawsuit. Starting \nwith vile claims against the undersigned, and later shrouded in the illusion of representation  and \nagreement , she has escaped no t only her burden of proof for the initial claims, but every fa cet of \nthe undersigned’ s warnin gs first pled to this C ourt have materialized. A n extraordinary amount of \ntime has been wasted, irreparable harm is ongoing, and the f oundation of this matter coupled \nwith the procedural posture and lack of participation from our friends on the other  side is \nastonishing. We ’ve let the pro -se bias cloud the judgement and the purpose of why we are here: \nto dissolve a marriage in a manner that best suits the best interests of the children  and in \naccordance with Texa s law .  \nSo far  – the opposite has been occurring, and it must not  continue.  \nIN THE INTEREST OF M.E.M., C.R.M., two \nchildren)  \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS,  Requ est for Hearing  on Motion to Dismiss for \nWant of Prosecution  \n \n  \nRespondent.   \n  \n  \n2025 -06-05",
      "char_length": 1327
    },
    {
      "page_number": 2,
      "text": "I. INTRODUCTION \n  This case was filed on December 18, 2023, and was consolidated with a later filed \nprotective order suit . The amount of case activity is remarkable in two aspects:  \n1. The voluminous pleadings, exhibits, and other materials filed and served to \nthe Petitioner and her legal representative that have received no response . \n2. The lack thereof from the Petition er and her legal representative which have \nbeen properly responded to. \nIn sum, the Pe titioner has filed as a pro -se par ty:  \n1. An Emergency Ex -Parte Order  (12.14.23)1 \n2. Original Petition for Divorce (12.18.23)  \n3. Affidavit of Inability to Pay Court Costs (12.18.23)  \n4. A Request Form for Uncontested Cases (12.18.23)  \n5. Application for Protective Order (12.22.23)  \n6. Motion for Temporary Orders2 \nThroughout these pleadings, Petitioner claimed abuse, harassment, sexual harassment, \ndrug use, child endange rment, and credit card fraud in contrast to her request for joint -managing \nconserv atorship and standard visitation. All these claims were made while still cohabitating with \nthe undersigned, which  was the case up until this Court removed the undersigned from the home, \ntemporarily terminated his parental rights, and awarded the Petitioner on all issues central to the \ncase prior t o a formal hearing . Since that day Petitioner  has vanished , and her claims abandoned.  \n \n1 This pleading is reference d in the original petition for divorce at 9B.  \n2 This pleading has not been served on the Respondent and is referenced in the March 2 6 Temporary Orders on Page \n1. Included further claims of drug use and child endange rment  and credit card fraud .",
      "char_length": 1667
    },
    {
      "page_number": 3,
      "text": "This is because on January 22, 2024, Petitioner allegedly retained the services of \nCOOPER L. CA RTER  in her individual capacity for one purpose: to hi de behind her actions. \nThis attorney, who has been served hundreds of documents a nd exhibits – has not responded to \none of  them.  In fact, in total – the Petitioner ’s counsel has filed the followi ng pleadings in this \nmatter3: \n1. First Amended Petition for Divorce  (01.31.2024)  \n2. Moti on for Pre -Trial Conf erence (04.24.2024)  \n3. Respondent ’s Original Answer (03.20.2025)  \n4. Motion to Consolidate ( 03.20.2025)  \n5. Motion to Consolidate (0 4.03.2025)  \nThe Peti tioner, in just a few weeks of being a pro -se litigant, filed more documents than \nthe legal representative that she allegedly retained in over fifteen months of litigation .  \n The undersigned must pause for a moment here an d address  the Court directly : he is n ot \nan angry litigant, or a parent unhappy with a r uling. He does not t hink negatively of any \nHonorable Judge who has presided over these matters  as an individual, and he unde rstands that \nhis pleadings may not be perfect or may come off as s contempt uous to the Court or reviewing \nstaff. Nor does he  think negatively of the opposing party or the opposing counsel . The record \nbefore this Court is nothing more than a  product of a litigant who was deprived of his  children, \nhome, and a bility to earn a living initially due to claims which  painted a false first impr ession  \nupon himself and hi s family  – including false claims of indigency  by the Petitioner . \nFor the forthcoming reasons , the C ourt should consider dismissing this matter : \n \n3 These pleadings wer e not directly  filed by COOPER L. CARTER, but on her behalf by RODERICK D. MARX.",
      "char_length": 1767
    },
    {
      "page_number": 4,
      "text": "II. REASONS TO DISMISS  \nA.  ABUSE OF PROCESS  \n1. Under Texas law, abuse of process occurs when a party makes an illegal, improper, or \nperverted use of legal proceedings for an ulterior purpose, resulting in damage to the other party. \nThe described conduct —where the petitioner raised serious allegations b ut failed to prosecute \nthem for 14 months, retained custody while the respondent was unable to obtain relief, and used court appearances primarily to block progress —appears to satisfy all three elements required for \nan abuse of process finding. \n2. The petitioner's pattern of behavior suggests the legal system was being used not to \nresolve legitimate disputes but rather to gain and maintain an unfair advantage . Texas courts have \nconsistently held that using legal process as \"a threat or a club\" to obtain collateral advantages constitutes an abuse of process. In this case, the collateral advantage has been  maintaining \ncustody without having to substantiate the initial allegations of vio lence, drug use, and fear for \nher safety as well as  financial indigenc y.  \n3. The claims made to gain this advantage were significant – such as falsifying the \nexistence of protective orders, which is further explained in the First Amended Case Memorandum filed in cause number 25- 0361 before the Texas Supreme Court. \n4. To prevail on a claim of abuse of process, the e ssential elements that must be satisfied \nin Texas  are: \ni. The [ Petitioner] made an illegal, improper, or perverted use of the process, a use \nneither warranted nor authorized by the process;",
      "char_length": 1583
    },
    {
      "page_number": 5,
      "text": "ii. The [ Petitioner] had an ulterior motive or purpose in exercising such illegal, \nperverted, or improper use of the process; and  \niii. Damage resulted to the [Respondent] from the irregularity.  \n5. This three -part test has been consistently applied across Texas jurisprudence, as \narticulated in multiple cases including  In re Garate , 13-24-00625- CV (Tex. App. Mar 13, 2025) \n(\"Alvarado's sole cause of action against Garate, abuse of process, 'is the malicious use or \nmisapplication of process in order to accomplish an ulterior purpose.'\"), Human Power of N Co. v. Turturro (Tex. App. 2024), Univ. of Tex. of Permian Basin v. Banzhoff , No. 11- 17-00325- CV \n(Tex. App. May 31, 2019), Moore v. Lisa Bushman & Integrity Land Servs. & Invs., LLC , 559 \nS.W.3d 645 (Tex. App. 2018), Liverman v. Payne -Hall, 486 S.W.3d 1 (Tex. App. 2015), Davis v. \nWest, 433 S.W.3d 101 (Tex. App. 2014), Nath v. Texas Children's Hosp., NO. 14- 11-00034- C V,  \nNO. 14 -11-00127 -CV (Tex. App. May 03, 2012), Pitts & Collard, L.L.P . v. Schechter , 369 \nS.W.3d 301 (Tex. App. 2011), Whitehead v. Mackenzie , NO. 02- 09-00383- CV (Tex. App. Jul 14, \n2011), Preston Gate, LP v. Bukat y, 248 S.W.3d 892 (Tex. App. 2008), Hunt v. Baldwin, 68 \nS.W.3d 117 (Tex. App. 2001), Bossin v. Towber , 894 S.W.2d 25 (Tex. App. 1994), Detenbeck v. \nKoester , 886 S.W.2d 477 (Tex. App. 1994), Futerfas v. Park Towers , 707 S.W.2d 149 (Tex. App. \n1986), Lozano v. Tex -Paint, Inc., 606 S.W.2d 40 (Tex. Ct. App. 1980), and Tandy Corp. v. \nMcGregor , 527 S.W.2d 246 (Tex. Ct. App. 1975).  \n6. In the family law context specifically, Texas courts have addressed patterns of behavior \nsimilar to those described in our scenario here. In  Saavedra v. Schmidt , 96 S.W.3d 533 (Tex. \nApp. 2002) , the court identified a pattern of behavior that included \"fail[ing] to comply with \nprior court orders relating to the children,\" \"refus[ing] to allow supervised visits,\" \"engag[ing] in \nchild alienation,\" and \"agree[ing] to share parenting orders with no intent to carry out that",
      "char_length": 2044
    },
    {
      "page_number": 6,
      "text": "agreement or comply with those orders.\" The court recognized that such conduct could constitute \nimproper use of the legal process in family court proceedings .  \n7. In the present matter, these patterns of behavior exist . Despite the undersigned’ s \nzealous opposition to the orders in place, he still follows him to the best of his ability out of respect to the Honorable Judge who signed them. However, the same cannot be said for the Petitioner. The undersigned has provided evidenc e that she  has been  disposing of his personal \nbelongings, preventing the children from contacting him, exposing the children to unsafe environments , neglecting the children medically , and refusing to communicate or co -parent . This \nsituation adds unnecessary  layers to the tragedy  and in no logical way could be in the best \ninterests of the children.  \nB. WANT OF PROSECUTION \n 8. The petitioner's failure to actively pursue the case for over 14 months provides \nsufficient grounds for dismissal under Texas Rule of Civil Procedure 165a and the court's \ninherent power to dismiss cases not prosecuted with due diligence. The significant de lays and \nprejudice to the respondent further strengthen the case for dismissal, as Texas courts consistently uphold dismissals based on unreasonable delays and lack of prosecution activity.  \n9. Under Texas law, a court may dismiss a case for want of prosecution through two \nindependent sources of authority: Texas Rule of Civil Procedure 165a and the court's inherent power to maintain and control its docket. Rule 165a provides specific grounds for dismissal, including failure to appear for hearings or trials and failure to dispose of a case within the time standards promulgated by the Supreme Court. Additionally, courts have inherent authority to dismiss cases when plaintiffs fail to prosecute their  claims with due diligence.",
      "char_length": 1875
    },
    {
      "page_number": 7,
      "text": "10. In this case, the petitioner's 14- month period of inaction despite raising serious \nallegations initially, coupled with the significant delays and prejudice caused to the respondent, \nstrongly justifies dismissal under Rule 165a and the court's inherent powe r. In considering a \ndismissal,  the court should consider f actors including the length of time a case has been pending, \nthe extent of activity in the case, whether trial settings were requested, and the existence of reasonable excuses for delay. The absence of diligent prosecution over such a prolonged period, with resulting prejudice to the respondent who has been unable to obtain relief, presents \ncompelling grounds for dismissal for want of prosecution. \n11. In Texas, trial courts derive their authority to dismiss cases for want of prosecution \nfrom two independent sources: (1) Texas Rule of Civil Procedure 165a and (2) the court's inherent power to maintain and control its docket. Carson v. Webster , 11-23-00225- CV (Tex. \nApp. Nov 07, 2024)  (\"The trial court's authority to dismiss a pending case for want of \nprosecution generally stems from two sources: (1) Rule 165a of the Texas Rules of Civil \nProcedure, and (2) the court's inherent power... The plaintiff's failure to prosecute a case with reasonable diligence will justify dismissal either under Rule 165a or the trial court's inherent \nauthority...\"). \n12. This dual basis for dismissal has been consistently recognized in Texas  for \ndecades . Villarreal v. San Antonio Truck & Equip., 994 S.W.2d 628, 630 (Tex. 1999), cited in \nnumerous recent cases, established this principle, which has been consistently applied by Texas courts. Dueitt v. Arrowhead Lakes Property Owners , 180 S.W.3d 733 (Tex. 2005)  (\"A trial court's \npower to dismiss a suit for want of prosecution originates from two sources: (1) Texas Rule of Civil Procedure 165a and (2) the trial court's inherent authority.\"). There is no doubt this court \nhas the discretion to dismiss a cause in consideration of these factors.",
      "char_length": 2034
    },
    {
      "page_number": 8,
      "text": "13. As far as Rule 165a , it provides three independent grounds upon which a trial court \nmay dismiss a case for want of prosecution:  \ni. Failure to appear for hearings or trials  \nii. Failure to comply with time standards  \niii. Failure to prosecute with due diligence under the court's inherent authority  \n14.  For grounds of dismissal pursuant  to the inherent authority of the Court, due \ndiligence would be a relevant consideration. Texas law imposes a clear duty on parties seeking \naffirmative relief to prosecute their cases diligently.  McGilvray v. Graceland Logistics , LLC, 07-\n23-00364- CV (Tex. App. Jul 31, 2024)  (\"A plaintiff must prosecute her suit with reasonable \ndiligence or the trial court may dismiss it for want of prosecution.\").  \n15. Here, there has been a complete absence of diligence by the opposing party. They \nmay argue that the Respondent has been delaying the case unreasonably, but this argument fails \nconsidering no material argument can be found on the record in opposition of th e relief being \nsought.  \nC. FALSE AFFIDA VIT OF INDIGENCY  \n 16. Notwithstanding the above, the Petitioner ’s divorce petition was filed with an \naffidavit of indigency, claims raised in a still pending summary judgment motion filed on \nFebruary 22, 2024. Pe titioner c annot prevail in proving these claims, and is an independent \nreason why this c ase can be dismissed pursuant to the Texas P ractice and Remedies Code Sec. \n13.001.",
      "char_length": 1457
    },
    {
      "page_number": 9,
      "text": "III. CONCLUSION AND PRAYER  \n For all these reasons, after notice and hearing, this case should be dismissed . The \nundersigned’ s efforts in seeking relief for his Children in contrast to the lack thereof by the \nPetitioner , alongside the claims of abuse of process  and the false claim of indigency should be \ntaken into account in the court ’s determination.  \n  \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTo the Honorable 322nd District Court of Tarrant County : \nSince first obtaining relief at the show cau se hearing on January 16, 2024, the Petitioner  \nin that matter , MORGAN MICHELLE MYERS, has not done her part in this lawsuit. Starting \nwith vile claims against the undersigned, and later shrouded in the illusion of representation  and \nagreement , she has escaped no t only her burden of proof for the initial claims, but every fa cet of \nthe undersigned’s warnin gs first pled to this C ourt have materialized. A n extraordinary amount of  \nIN THE INTEREST OF M.E.M., C.R.M., two \nchildren)  \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS,  Requ est for Hearing  on Motion to Dismiss for \nWant of Prosecution  \n \n  \nRespondent.   \n  \n  \n2025 -06-05",
      "char_length": 1210
    },
    {
      "page_number": 10,
      "text": "time has been wasted, irreparable harm is ongoing, and the f oundation of this matter coupled \nwith the procedural posture and lack of participation from our friends on the other  side is \nastonishing. We ’ve let the pro -se bias cloud the judgement and the purpose of why we are here: \nto dissolve a marriage in a manner that best suits the best interests of the children  and in \naccordance with Texa s law .  \nSo far  – the opposite has been occurring, and it must not  continue. \nI. INTRODUCTION \n  This case was filed on December 18, 2023, and was consolidated with a later filed \nprotective order suit . The amount of case activity is remarkable in two aspects:  \n3. The voluminous pleadings, exhibits, and other materials filed and served to \nthe Petitioner and her legal representative that have received no response . \n4. The lack thereof from the Petition er and her legal representative which have \nbeen properly responded to. \nIn sum, the Pe titioner has filed as a pro -se par ty:  \n7. An Emergency Ex -Parte Order  (12.14.23)4 \n8. Original Petition for Divorce (12.18.23)  \n9. Affidavit of Inability to Pay Court Costs (12.18.23)  \n10. A Request Form for Uncontested Cases (12.18.23)  \n11. Application for Protective Order (12.22.23)  \n12. Motion for Temporary Orders5 \n \n4 This pleading is reference d in the original petition for divorce at 9B.  \n5 This pleading has not been served on the Respondent and is referenced in the March 2 6 Temporary Orders on Page \n1. Included further claims of drug use and child endange rment  and credit card fraud .",
      "char_length": 1565
    },
    {
      "page_number": 11,
      "text": "Throughout these pleadings, Petitioner claimed abuse, harassment, sexual harassment, \ndrug use, child endange rment, and credit card fraud in contrast to her request for joint -managing \nconserv atorship and standard visitation. All these claims were made while still cohabitating with \nthe undersigned, which  was the case up until this Court removed the undersigned from the home, \ntemporarily terminated his parental rights, and awarded the Petitioner on all issues central to the \ncase prior t o a formal hearing . Since that day Petitioner  has vanished , and her claims abandoned.  \n This is because on January 22, 2024, Petitioner allegedly retained the services of \nCOOPER L. CA RTER  in her individual capacity for one purpose: to hi de behind her actions. \nThis attorney, who has been served hundreds of documents a nd exhibits – has not responded to \none of  them.  In fact, in total – the Petitioner ’s counsel has filed the followi ng pleadings in this \nmatter6: \n6. First Amended Petition for Divorce  (01.31.2024)  \n7. Moti on for Pre -Trial Conf erence (04.24.2024)  \n8. Respondent ’s Original Answer (03.20.2025)  \n9. Motion to Consolidate ( 03.20.2025)  \n10. Motion to Consolidate (0 4.03.2025)  \nThe Peti tioner, in just a few weeks of being a pro -se litigant, filed more documents than \nthe legal representative that she allegedly retained in over fifteen months of litigation .  \n The undersigned must pause for a moment here an d address  the Court directly : he is n ot \nan angry litigant, or a parent unhappy with a r uling. He does not t hink negatively of any \nHonorable Judge who has presided over these matters  as an individual, and he unde rstands that \n \n6 These pleadings wer e not directly  filed by COOPER L. CARTER, but on her behalf by RODERICK D. MARX.",
      "char_length": 1790
    },
    {
      "page_number": 12,
      "text": "his pleadings may not be perfect or may come off as s contempt uous to the Court or reviewing \nstaff. Nor does he  think negatively of the opposing party or the opposing counsel . The record \nbefore this Court is nothing more than a  product of a litigant who was deprived of his  children, \nhome, and a bility to earn a living initially due to claims which  painted a false first impr ession  \nupon himself and hi s family  – including false claims of indigency  by the Petitioner . \nFor the forthcoming reasons , the C ourt should consider dismissing this matter : \nII. REASONS TO DISMISS  \nA.  ABUSE OF PROCESS  \n1. Under Texas law, abuse of process occurs when a party makes an illegal, improper, or \nperverted use of legal proceedings for an ulterior purpose, resulting in damage to the other party. \nThe described conduct —where the petitioner raised serious allegations b ut failed to prosecute \nthem for 14 months, retained custody while the respondent was unable to obtain relief, and used court appearances primarily to block progress —appears to satisfy all three elements required for \nan abuse of process finding. \n2. The petitioner's pattern of behavior suggests the legal system was being used not to \nresolve legitimate disputes but rather to gain and maintain an unfair advantage . Texas courts have \nconsistently held that using legal process as \"a threat or a club\" to obtain collateral advantages constitutes an abuse of process. In this case, the collateral advantage has been  maintaining \ncustody without having to substantiate the initial allegations of vio lence, drug use, and fear for \nher safety as well as  financial indigenc y.",
      "char_length": 1657
    },
    {
      "page_number": 13,
      "text": "3. The claims made to gain this advantage were significant – such as falsifying the \nexistence of protective orders, which is further explained in the First Amended Case \nMemorandum filed in cause number 25- 0361 before the Texas Supreme Court. \n4. To prevail on a claim of abuse of process, the e ssential elements that must be satisfied \nin Texas are:  \ni. The [ Petitioner] made an illegal, improper, or perverted use of the process, a use \nneither warranted nor authorized by the process;  \nii. The [ Petitioner] had an ulterior motive or purpose in exercising such illegal, \nperverted, or improper use of the process; and  \niii. Damage resulted to the [Respondent] from the irregularity.  \n5. This three -part test has been consistently applied across Texas jurisprudence, as \narticulated in multiple cases including  In re Garate , 13-24-00625- CV (Tex. App. Mar 13, 2025) \n(\"Alvarado's sole cause of action against Garate, abuse of process, 'is the malicious use or misapplication of process in order to accomplish an ulterior purpose.'\"), Human Power of N Co. v. Turturro (Tex. App. 2024), Univ. of Tex. of Permian Basin v. Banzhoff , No. 11- 17-00325- CV \n(Tex. App. May 31, 2019), Moore v. Lisa Bushman & Integrity Land Servs. & Invs., LLC , 559 \nS.W.3d 645 (Tex. App. 2018), Liverman v. Payne -Hall, 486 S.W.3d 1 (Tex. App. 2015), Davis v. \nWest, 433 S.W.3d 101 (Tex. App. 2014), Nath v. Texas Children's Hosp., NO. 14- 11-00034- C V,  \nNO. 14 -11-00127 -CV (Tex. App. May 03, 2012), Pitts & Collard, L.L.P . v. Schechter , 369 \nS.W.3d 301 (Tex. App. 2011), Whitehead v. Mackenzie , NO. 02- 09-00383- CV (Tex. App. Jul 14, \n2011), Preston Gate, LP v. Bukat y, 248 S.W.3d 892 (Tex. App. 2008), Hunt v. Baldwin, 68 \nS.W.3d 117 (Tex. App. 2001), Bossin v. Towber , 894 S.W.2d 25 (Tex. App. 1994), Detenbeck v.",
      "char_length": 1817
    },
    {
      "page_number": 14,
      "text": "Koester , 886 S.W.2d 477 (Tex. App. 1994), Futerfas v. Park Towers , 707 S.W.2d 149 (Tex. App. \n1986), Lozano v. Tex -Paint, Inc., 606 S.W.2d 40 (Tex. Ct. App. 1980), and Tandy Corp. v. \nMcGregor , 527 S.W.2d 246 (Tex. Ct. App. 1975).  \n6. In the family law context specifically, Texas courts have addressed patterns of behavior \nsimilar to those described in our scenario here. In  Saavedra v. Schmidt , 96 S.W.3d 533 (Tex. \nApp. 2002) , the court identified a pattern of behavior that included \"fail[ing] to comply with \nprior court orders relating to the children,\" \"refus[ing] to allow supervised visits,\" \"engag[ing] in \nchild alienation,\" and \"agree[ing] to share parenting orders with no intent to carry out that agreement or comply with those orders.\" The court recognized that such conduct could constitute \nimproper use of the legal process in family court proceedings .  \n7. In the present matter, these patterns of behavior exist . Despite the undersigned’s \nzealous opposition to the orders in place, he still follows him to the best of his ability out of \nrespect to the Honorable Judge who signed them. However, the same cannot be said for the \nPetitioner. The undersigned has provided evidenc e that she  has been  disposing of his personal \nbelongings, preventing the children from contacting him, exposing the children to unsafe environments , neglecting the children medically , and refusing to communicate or co -parent . This \nsituation adds unnecessary  layers to the tragedy and in no logical way could be in the best \ninterests of the children.  \nB. WANT OF PROSECUTION \n 8. The petitioner's failure to actively pursue the case for over 14 months provides \nsufficient grounds for dismissal under Texas Rule of Civil Procedure 165a and the court's \ninherent power to dismiss cases not prosecuted with due diligence. The significant de lays and",
      "char_length": 1866
    },
    {
      "page_number": 15,
      "text": "prejudice to the respondent further strengthen the case for dismissal, as Texas courts consistently \nuphold dismissals based on unreasonable delays and lack of prosecution activity.  \n9. Under Texas law, a court may dismiss a case for want of prosecution through two \nindependent sources of authority: Texas Rule of Civil Procedure 165a and the court's inherent power to maintain and control its docket. Rule 165a provides specific grounds for dismissal, including failure to appear for hearings or trials and failure to dispose of a case within the time standards promulgated by the Supreme Court. Additionally, courts have inherent authority to dismiss cases when plaintiffs fail to prosecute their  claims with due diligence.  \n10. In this case, the petitioner's 14- month period of inaction despite raising serious \nallegations initially, coupled with the significant delays and prejudice caused to the respondent, strongly justifies dismissal under Rule 165a and the court's inherent powe r. In considering a \ndismissal,  the court should consider f actors including the length of time a case has been pending, \nthe extent of activity in the case, whether trial settings were requested, and the existence of reasonable excuses for delay. The absence of diligent prosecution over such a prolonged period, with resulting prejudice to the respondent who has been unable to obtain relief, presents \ncompelling grounds for dismissal for want of prosecution. \n11. In Texas, trial courts derive their authority to dismiss cases for want of prosecution \nfrom two independent sources: (1) Texas Rule of Civil Procedure 165a and (2) the court's inherent power to maintain and control its docket. Carson v. Webster , 11-23-00225- CV (Tex. \nApp. Nov 07, 2024)  (\"The trial court's authority to dismiss a pending case for want of \nprosecution generally stems from two sources: (1) Rule 165a of the Texas Rules of Civil Procedure, and (2) the court's inherent power... The plaintiff's failure to prosecute a case with",
      "char_length": 2008
    },
    {
      "page_number": 16,
      "text": "reasonable diligence will justify dismissal either under Rule 165a or the trial court's inherent \nauthority...\"). \n12. This dual basis for dismissal has been consistently recognized in Texas  for \ndecades.  Villarreal v. San Antonio Truck & Equip., 994 S.W.2d 628, 630 (Tex. 1999), cited in \nnumerous recent cases, established this principle, which has been consistently applied by Texas courts. Dueitt v. Arrowhead Lakes Property Owners , 180 S.W.3d 733 (Tex. 2005)  (\"A trial court's \npower to dismiss a suit for want of prosecution originates from two sources: (1) Texas Rule of Civil Procedure 165a and (2) the trial court's inherent authority.\"). There is no doubt this court \nhas the discretion to dismiss a cause in consideration of these factors.  \n13. As far as Rule 165a , it provides three independent grounds upon which a trial court \nmay dismiss a case for want of prosecution:  \niv. Failure to appear for hearings or trials  \nv. Failure to comply with time standards  \nvi. Failure to prosecute with due diligence under the court's inherent authority  \n14.  For grounds of dismissal pursuant  to the inherent authority of the Court, due \ndiligence would be a relevant consideration. Texas law imposes a clear duty on parties seeking \naffirmative relief to prosecute their cases diligently.  McGilvray v. Graceland Logistics , LLC, 07-\n23-00364- CV (Tex. App. Jul 31, 2024)  (\"A plaintiff must prosecute her suit with reasonable \ndiligence or the trial court may dismiss it for want of prosecution.\").  \n15. Here, there has been a complete absence of diligence by the opposing party. They \nmay argue that the Respondent has been delaying the case unreasonably, but this argument fails",
      "char_length": 1696
    },
    {
      "page_number": 17,
      "text": "considering no material argument can be found on the record in opposition of th e relief being \nsought.  \nC. FALSE AFFIDA VIT OF INDIGENCY  \n 16. Notwithstanding the above, the Petitioner ’s divorce petition was filed with an \naffidavit of indigency, claims raised in a still pending summary judgment motion filed on \nFebruary 22, 2024. Pe titioner c annot prevail in proving these claims, and is an independent \nreason why this c ase can be dismissed pursuant to the Texas P ractice and Remedies Code Sec. \n13.001. \n \nIII. CONCLUSION AND PRAYER  \n For all these reasons, after notice and hearing, this case should be dismissed . The \nundersigned’s efforts in seeking relief for his Children in contrast to the lack thereof by the \nPetitioner , alongside the claims of abuse of process  and the false claim of indigency should be \ntaken into account in the court ’s determination.",
      "char_length": 880
    }
  ]
}