{"id": "f7267877b7abe50f66e9de64c08d983ad063533b", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 233-765358-25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \n \nINTRODUCTION \n1. Texas law does generally require consolidation of divorce and custody matters  to \navoid conflicting parallel litigation. Under Family Code § 6.407, if a SAPCR involving the child \nis already pending in one court when a divorce is filed in another court, the SAPCR must be \ntransferred to the divorce court  so that one judge handles everything. Likewise, if the parents \nare in the middle of a divorce, any new custody suit typically should be joined into that divorce \ncase instead of proceeding separately. The policy behind this is to have one court speak on all \nparent -child issues at a time, preven ting inconsistent orders. In a normal scenario, if Parent A \nfiled for divorce (including child custody) in Court X, Parent B would not be allowed to file a \nseparate SAPCR in Court Y  at the same time – the law would mandate that the child’s case be \nheard in the first-filed divorce court. \n2. So, generally, an active divorce case would mean any custody claims belong in that \nlawsuit, not in a new, independent suit elsewhere.  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n PETITIONER’S OBJECTION TO \nCONSOLIDATION  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-24  233-765358-25 FILED\nTARRANT COUNTY\n3/24/2025 12:46 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n3. However, § 6.407 assumes the initial divorce suit is properly filed and being pursued. \nIts joinder and transfer rules are meant to coordinate valid, concurrent  proceedings. It does not \nexplicitly address  a situation where the original divorce/SAPCR is essentially a sham or has \nstalled out. In your case, while technically the divorce case exists, it was filed in bad faith and \nhas produced no valid orders or final judgment. This puts it outside the typical scenario §  6.407 \ncontemplates. If the original case is on track to be dismissed or is proven to be jurisdictionally defect"}
{"id": "79157034f4f80730920f70fb1c3a50bc1e13bc52", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "roduced no valid orders or final judgment. This puts it outside the typical scenario §  6.407 \ncontemplates. If the original case is on track to be dismissed or is proven to be jurisdictionally defective, there may soon be no “pending” case to join into . Thus, the usual mandatory joinder \nrule may not pose a long- term barrier, especially if you move to dismiss the old case for lack of \nprosecution. In short, ordinarily you must litigate child issues in the divorce suit , but when \nthat suit is effectively defunct or void, the rationale for mandatory joinder falls away. \nII. Dominant Jurisdiction and Exceptions for Bad- Faith First Filings  \n4. Even when no final order exists, Texas follows a “first in time” rule for parallel cases: \nthe court where a suit is first filed generally has dominant jurisdiction , meaning it has the \nprimary right to proceed, and any later -filed suit involving the same parties and issues should be \nabated (paused) or dismissed . Applied here, because the divorce case was filed earlier, a new \nSAPCR in another court would normally face a plea in abatement from the first filer. The second court would typically defer to the first -filed court’s authority over the matter . But importantly, \nTexas law also recognizes exceptions  to the first- filed rule in cases of inequitable conduct. If the \nperson who filed the first suit did so merely to gain an upper hand (for example, to lock in a preferred venue or harass the other parent) without any genuine intent to prosecute the case , \nthat behavior can estop  (prevent) them from claiming the benefits of dominant jurisdiction. \n5. Here, this is precisel y what has occurred. COOPER L. CARTER, attorney for \nRespondent, has not prosecuted the first -filed case in over eight months . Her authority r emains\n\nin question under rule 12 of the Texas Rules of Civil Procedure, and hasn ’t filed the mandatory \nnotice of remand  after federal removal, which occurred back in December of 2024. This \nprocedural"}
{"id": "b4f1060bd36db546c0778a112e6713e281e7cf90", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "ns\n\nin question under rule 12 of the Texas Rules of Civil Procedure, and hasn ’t filed the mandatory \nnotice of remand  after federal removal, which occurred back in December of 2024. This \nprocedurally prevents the case from moving forward until this requirement is met, which has not \nonly been pointed out to Ms. Carter, but has been wholly disregarded.  \n6. Now, Ms. Carter is before this court  seeking to consolidate the SAPCR suit filed and \ncaptione d above back into the original suit in which she has not been prosecu ting. Su ch action \nwould further prejudice the children , and Ms. Carter should have to explain why she has failed to \nprosecute the main case, but yet can show up here and request consolidation. If M s. Carter were \ngenuinely looking to uphold the best interests of the children in this case, she wouldn’ t allow \ntheir well- being to hang in the balance within the originally filed case – but she has been – which \nis why this SAPCR was brought be fore this court.  \n7. Further , The Texas Supreme Court in Curtis v. Gibbs  explained that a first filer’s bad \nfaith or fraud can remove the shield of the first -filed rule and allow a later suit to go forward. \nThis also applies here. Ms. Carter ’s client initiated the divorce action in bad f aith, and waived the \n60-day waiting period for divorce c laiming an active order of protection was in effect against the \nundersigned. This was elected for the sole purpose of gaining an unfair advantage in the divorce \nproceed ings. Once this advantage was gained, she stopped prosecuting the suit.  \n8. Generally, if Suit 1 was essentially a placeholder or manipulation (filed “merely to \nobtain priority, without a bona fide intention to prosecute the suit”  and the filer’s conduct kept \nSuit 2 from being filed sooner, a court can find that Suit 1 was an inequitable sham . In that event, \nthe second court may deny the plea in abatement and take the case , effectively jumping past \nthe first court . Id. Here, the fac"}
{"id": "2bd2ca163b4a0e984ddd7da2b87051487cd30aa6", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "a court can find that Suit 1 was an inequitable sham . In that event, \nthe second court may deny the plea in abatement and take the case , effectively jumping past \nthe first court . Id. Here, the facts suggest the prior divorce action was in bad faith and then \nabandoned – precisely the kind of scenario in which Texas courts allow an exception to the\n\n“first -filed” rule. The Respondent in this matter had no serious intent to pursue the \ndivorce/SAPCR  (e.g. they filed to harass or to get temporary orders, then let the case languish), \ngiving this court the discretio n to refuse to abate/ consolidate  this SAPCR. The first court’s \ndominant jurisdiction dissolves if the first suit was a null effort. Therefore, give n the \ncircumstances, the opposing counsel should have to explain the reasoning behind her failure to \nprosecute  before consolidation ordered under the assertion that it is “ mandatory” . \nIII. Filing a New SAPCR in a Different Court Under These Circumstances  \n9. Given the above, nothing in Texas law absolutely bars  the undersigned from filing \na new SAPCR for his  children in this  court, because the original case truly produced no final \norders and is effectively moribund. Texas Family Code § 155.001(d) explicitly provides that if no final order has been rendered in a SAPCR, any subsequent suit  regarding the child is simply \ntreated as a new original proceeding . \n9. That means the undersigned legally permitted to start fresh with a new custody suit \nbecause the first case never culminated in a final judgment. Additionally, the Texas Supreme Court has described a subsequent SAPCR in these circumstances as “a new suit  in which no \ncourt has continuing exclusive jurisdiction” . Curtis v. Gibbs, 511 S.W.2d 263, 267 (Tex. 1974) \n(orig. proceeding)  - confirming that a pending- but-unresolved prior case does not freeze the \nundersigned out of seeking relief from this court on behalf of his children.  \nI V.  T h e  Old Case F aces Statutory D ismissal  "}
{"id": "e26c0d749e13b35c7db17b99a897ea831db6a9cd", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "irming that a pending- but-unresolved prior case does not freeze the \nundersigned out of seeking relief from this court on behalf of his children.  \nI V.  T h e  Old Case F aces Statutory D ismissal  for Failure to Pr osecute \n 10. Inte restingly , the first case has already had a motion to dismiss for want of \nprosecution filed. Unfortunately, due to Ms. Carter ’s inability to prosecute the case, it remains in \nprocedural limbo never properly remanded from federal court. So even if the cases were\n\nconsolidated, she would have no ability to proceed with the litigation, effectively putting this \nscenario back in the same spot, which would be pre judicial to the children.  \n 11. Under the Curtis v. Gibbs  line of cases, the new court has authority to determine if the \nfirst filer’s conduct was inequitabl e. The Petitioner in this matter has not received any counter \nargument or denial regarding the claims of the Respondent ’s inequitable conduct , only \ncontinuous attempts to subvert justice  for the children named  in this suit.  \n 12. T he key point is that no “continuing, exclusive” jurisdiction binds the \nundersigned or the children  to the old case , and an abandoned/invalid suit should not \nprevent a parent from protecting their child’s interests in a new forum . The law intends for \none court at a time to handle a child’s case, but it does not reward a party who tried to game the system by filing first and then dropping the ball. The undersigned has proceeded diligently and \ntransparently in the new SAPCR, and Texas law provides a path for him  to do so. \nIV . CONCLUSION \n13. Because the prior divorce/SAPCR never resulted in a valid final order (and its only \ninterim orders are void), that court never obtained continuing, exclusive jurisdiction over the children . In the INTEREST OF A.F ., W.J., A.J., and J.J., Children No. 02- 19-00117- CV. A parent \nin this situation is generally free to initiate a new SAPCR as an original proceeding in the appropriate court "}
{"id": "355891ca202fdc8f865e3ae7774e82b88415aaec", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "In the INTEREST OF A.F ., W.J., A.J., and J.J., Children No. 02- 19-00117- CV. A parent \nin this situation is generally free to initiate a new SAPCR as an original proceeding in the appropriate court . TEX. FAM . CODE 155.001(b)(2). While Texas law usually tries to funnel all \ncustody matters into one court, it will not force you to remain tethered to a lawsuit that was filed in bad faith and then abandoned. The doctrines of continuing exclusive jurisdiction and mandatory joinder do not bar a new suit  when the original case is effectively a nullity . Here, \nthat is precisely the ca se, and until these points are rebutted by the opposing party , they prevail.\n\nRespectfully submitted , \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  6641 ANNE COURT  \n  WATAUGA, TEXAS 76148  \n 817-546-3693 \n CHUCKDUSTIN12@GMAIL.COM\n\nCERTIFICATE OF SERVICE\nPetitioner, Charles Dustin Myers, hereby certifies that a true and correct copy of the \nforegoing \nPETITIONER'S OBJECTION TO CONSOLIDATIO N was served on \nRespondent's counsel of record, Cooper L. Carter, via the via email to \ncooperlcarter@majadmin.com (email address on file) on this 24th day of March, 2025, \nin accordance with the Texas Rules of Civil Procedure and to Petitioner, MORGAN \nMICHELLE MYERS, through the Electronic Filing Manger in accordance with Texas \nRules of Civil Procedure 21a to her email address MORGANMW02@GMAIL.COM.\n/s/ Charles Dustin Myers\nCHARLES DUSTIN MYERS\n6641 Anne Court\nWatauga, Texas 76148\nChuckDustin12@gmail.com\n817-546-3693\nPro Se\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98851189\nFiling Code Description: No Fee Documents\nFiling Description: OBJECTIO"}
{"id": "dd63720c12220741686b274518b88cabb644adb3", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1\\03_24_25_petitioner_s_objection_to_consolidation_03_26_25_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - PETITIONER'S OBJECTION TO CONSOLIDATION - 03.26.25-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 580, "text": "ve not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98851189\nFiling Code Description: No Fee Documents\nFiling Description: OBJECTION TO CONSOLIDATION\nStatus as of 3/26/2025 8:25 AM CST\nCase Contacts\nName\nMORGAN MICHELLEMYERS\nCHARLES DMYERS\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nMORGANMW02@GMAIL.COM\nCHUCKDUSTIN12@GMAIL.COM\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/25/2025 11:34:47 AM\n3/25/2025 11:34:47 AM\n3/25/2025 11:34:47 AM\n3/25/2025 11:34:47 AMStatus\nSENT\nSENT\nSENT\nSENT"}