{"id": "f7e39bacaa8aca77b0d02759acf5c13562e8f498", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.23.25 - Objection to Trial Setting and Request for Stay of Proceedings-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322- 744263- 23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \n \nTO THE HONORABLE COURT:  \n The undersigned, Charles Dustin Myers, respectfully objects to any attempt to set the  \nabove referenced matter for any trial setting, and in support of this objection, shows the  \nfollowing:  \nThree concurrent mandamuses  \n There are currently three pending mandamus petitions awaiting resolution in the Second  \nCourt of Appeals seeking redress from recent actions taken by COOPER L. CARTER, counsel  \nfor Petitioner, to thwart emergency TRO proceedings in the 233rd District Court of Tarrant  \ncounty.  \n In sum, these mandamus petitions address the following alleged errors:  \n1. V oid orders ; (this case)  02-25-00166- CV \n2. Improper consolidation; 02-25-00171 -CV \n3. Refusal to rule.  02-25-00164- CV ITMOMO  \n(AITIO M.E.M., C.R.M., two children ) \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS , Objection to Trial Setting and Request for Stay \nof Proceedings \n \n  \nRespondent.   \n  \n2025 -04-23\n\nCurrent issues \n Currently, there are several issues that remain unaddressed that need to be resolved:  \n1. The entire case foundation is fraudulent  due to Petitioner’s pleadings . \n2. The undersigned has sought relief from this situation since March 14, 2024, \nwhen the original orders issued on January 16, 2024, which removed the \nundersigned from his home without the required findings, were leveraged into \na settlement agreement that was not consented to by all of the parties and did not serve the best interests of the children.  \n3. COOPER L. CARTER’s authority remains in question, and her inactivity combined with the ambiguity surrounding her representation must be addressed . \n4. The undersigned has been forced to live in transient housing and incur \nextraordinary damages  to his business operations  due to the Petitioners \nfraudulent allegations which were never supported by evidence. \n5. The children in this matter continue to suffer"}
{"id": "a06ae48bc96cd792dc2cbf6ba82f489c247edefc", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.23.25 - Objection to Trial Setting and Request for Stay of Proceedings-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " and incur \nextraordinary damages  to his business operations  due to the Petitioners \nfraudulent allegations which were never supported by evidence. \n5. The children in this matter continue to suffer ongoing and irreparable harm  \nfrom being separated from their father unjustifiably . \n6. There is no child support set up for the children.  \nInformal service  \n Furthermore, the court continues to issue notices informally through the court \ncoordinator, which is improper.  \nPursuant to Texas Rules of Civil Procedure Rule 21a, service of a notice via email \ndirectly, rather than through the electronic filing manager (EFM), does not constitute proper\n\nservice if the email address is on file with the EFM. Texas courts have consistently held that \nelectronic service must be made through the EFM when the recipient's email address is registered there.  The undersigned’s email is registered with the EFM.  \nConclusion \n Because the undersigned has an email on file with the EFM, there is no court order \nrequiring alternative service, and there is no agreement waiving formal service, any notice of \ncourt proceedings  not in compliance with rule 21a of the Texas Rules of Civil Procedure is \nimproper.  \n Furthermore, because there are several issues that remain unaddressed, such as COOPER \nCARTER’S authority, the ongoing mandamus proceedings, the ongoing irreparable harm  to the \nchildren , and the facially void orders which have caused detrimental effects  to the undersigned, \nthe risk of these issues creating future delays remains high.  \n The undersigned is prepared to challenge any adverse actions taken against him in the \nface of these issues and will seek relief until this matter is resolved in accordance with the \nprinciples of fairness and justice.  The undersigned requests that the court stay all fu ture \nproceedings until the above matters are resolved.  \n Respectfully submitted,  \n   /s/ Charles Dustin Myers  \n   CHARLES DUSTIN MYERS  \n   CHUCKDUSTIN12@GMAIL.COM  \n   "}
{"id": "4abfc5ab8cfcad6090b881bc09c2b38455a9a420", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1\\04_23_25_objection_to_trial_setting_and_request_for_stay_of_proceedings_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.23.25 - Objection to Trial Setting and Request for Stay of Proceedings-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 259, "text": "that the court stay all fu ture \nproceedings until the above matters are resolved.  \n Respectfully submitted,  \n   /s/ Charles Dustin Myers  \n   CHARLES DUSTIN MYERS  \n   CHUCKDUSTIN12@GMAIL.COM  \n   6641 ANNE COURT  \n   WATAUGA, TEXAS 76148  \n   817-546-3693"}