{"id": "f031ab91bd2732f29d461eb2e6223464355ecd36", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322 -744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , \nTEXAS  \nRespondent formally requests the forthcoming discovery  materials  \npursuant to the  level 2 discovery control plan . Given that this is the ﬁrst request \nfor discovery in this suit, the discovery period ends thirty days prior to the date \nof the ﬁnal tr ial pursuant to Rule 190.3 of the Tex as Rules of Civil Procedure.  \nI. Respondent’s Request for Disclosure  \nA. Under Subchapter B, Chapter 301, F amily Code, Section Pursuant to  \nSec. 301.051 and Sec. 301.052 of the Texas Family Code, Respondent \nformally requests that Petitioner disclose, not later than 30 days after the date \nof service of this request, the following information and material described \npursuant to Section 301.052 of the Texas Family Code: \n1. The correct names of the parties to the action.  \n(Sec. 301.052(a)(1)) Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. RESPONDENT’S FIRST REQUEST \nFOR DISCLOSURE , PRODUCTION, \nAND ADMISSIONS  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2024 -09-19  322-744263-23\n\n2 \n 2. The name, address, and telephone number of any potential parties.  \n(Sec. 301.052(a)(2)) \n3. The legal theories and, in general, the factual bases of the \nPetitioner’s claims or defenses.  \n(Sec. 301.052(a)(3)) \n4. The name, address, and telephone number of any person having knowledge of relevant facts and a brief statement of each identified person’s connection with the action.  \n(Sec. 301.052(a)(5)) \n5. Any discoverable settlement agreement described by Rule 192.3(g), Texas Rules of Civil Procedure.  \n(Sec. 301.052(a)(7)) \n6. The name, address, and telephone number of any person who may be designated as a responsible third party.  (Sec. 301.052(a)(11 )) \nII. Respondent’s Request for Production  \nB. Pursuant to Rule 196 of the Texas Rules of Civil Procedure, \nRespondent formally requests that Petitioner produce the following documents \nwithin 30 days of service of this request. The documents sho"}
{"id": "404e283ce2a6bfc42a67ea8d51b3cbb0dd556acf", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " Pursuant to Rule 196 of the Texas Rules of Civil Procedure, \nRespondent formally requests that Petitioner produce the following documents \nwithin 30 days of service of this request. The documents should be made \navailable and filed with the E-filing system prior to 5:00 P.M. on 10/19/2024:  \n1.  All bank statements from December 2023 through September \n2024 regarding the bank account solely in Petitioner’s name.  \n2.  A certificate of completion regarding the “Children in the \nMiddle” parenting course,  which was due on May 5th, 2024, or in the \nalternative – a written statement explaining the reasons for not having \nthe certificate of completion.  \n3.  Receipt of rent payment for the last six  months made by the \nPetitioner in regard to 6641 Anne Court, Watauga TX, 76148.  \n4.  All documents related to the children’s healthcare, dental care, \nor any attempts to acquire healthcare and dental care for the children.  \n5.  Current employer and address, date of employment, and average \nhours per week worked.\n\n3 \n 6.  A list of all any exhibits that are to be presented at the final trial \nthat have not been served to the Respondent under Rule 21a of the \nTexas rule of Civil Procedure.  \n7.  The names, addresses, and telephone numbers of all witnesses \nexpected to testify at trial.  \n8.  The names, addresses, and telephone numbers of all persons \nwho care for the minor children on a regular basis, the times of day the \nchildren are in their care, and for what purpose, and the cost of care, if \nany. \nIII. Respondent’s Request for Admissions  \nC. Pursuant to Rule 198.1 of the Texas Rules of Civil Procedure, \nRespondent Charles Dustin Myers requests that Petitioner Morgan Michelle \nMyers  admit or deny the following statements within the scope of discovery. \nEach admission or denial must be provided within 30 days of service of this \nrequest. Failure to respond in a timely manner may result in the admissions \nbeing deemed admitted by the Court and a motion to compel to foll"}
{"id": "67826db578cff77a03f1f0294bd3a4c26007f637", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "enial must be provided within 30 days of service of this \nrequest. Failure to respond in a timely manner may result in the admissions \nbeing deemed admitted by the Court and a motion to compel to follow.  For \neach denial, if any, Petitioner must provide a full explanation of the basis for the denial, along with any supporting facts, evidence, or documentation \nsubstantiating the denial: \n1. Admit or deny that between July 2015 and January 16, 2024, \nRespondent resided at the residence located at 6641 Anne Court, Watauga, \nTX 76148, with Petitioner.  _______________.  \n \nIf denied , provide the factual basis for the denial and any supporting \ndocumentation or proof of other residences during that time period.  \n \nResponse:\n\n4 \n 2. Admit or deny that on January 26, 2021 , Respondent made an \nemployment switch to work from home, which contributed to the financial \nstability of the family leading up to January 16, 2024.  _______________.  \n \nIf denied , provide an explanation and any financial records or employment \ninformation to support the denial.  \n \nResponse:  \n \n \n \n \n \n3. Admit or deny that Petitioner transferred $1,576 to Daniel \nBranthoover’s PayPal account on December 15, 2023, which resulted in the \nmarital bank account being overdrawn by $-800.  _______________.  \n If denied , provide all facts, bank records, and other evidence supporting the \ndenial.  \n \nResponse:  \n     \n4. Admit or deny that over the weekend of December 15, 2023, \nPetitioner took the children to Oklahoma where she received  assistance from \nDaniel Branthoover in filing the divorce paperwork. _______________.  \n If denied , explain the purpose of the trip, the role of Daniel Branthoover, and \nprovide relevant documents or correspondence regarding the trip.  \n \nResponse:\n\n5 \n 5. Admit or deny that over the weekend of December 15, 2023, \nPetitioner influenced her grandparents to serve an eviction notice to \nRespondent, citing a protective order and divorce petition that had not yet \nbeen fi"}
{"id": "d4877f4f6aec5081885ccaddc93fbcb35bfa3e28", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "that over the weekend of December 15, 2023, \nPetitioner influenced her grandparents to serve an eviction notice to \nRespondent, citing a protective order and divorce petition that had not yet \nbeen filed.  _______________.  \n \nIf denied , provide all facts and any documents relating to the eviction notice \nand its justification, including communications with Petitioner’s grandparents.  \n \nResponse:  \n \n \n \n \n \n6. Admit or deny that on December 18, 2023, the Original Petition \nfor Divorce filed by Petitioner contains false and misleading statements \nregarding family violence and an active order of protection. ______________.  \n \nIf denied , provide the factual basis for the accuracy of the statements made in \nthe Original Petition for Divorce.  \n Response:  \n  \n \n  \n7. Admit or deny that on December 22, 2023, the Original Protective \nOrder  filed by Petitioner contained additional claims of family violence, and \nat the time of filing, no active order of protection existed,  and no such order \nhas existed throughout the marriage.  _______________.  \n \nIf denied , provide the factual basis for any claims that an active protective \norder was in place during the marriage and during the filing of the protective \norder.  \n Response:\n\n6 \n 8. Admit or deny that on March 6, 2024, during Petitioner’s visitation \nwith the children, while Respondent was walking the children to school, \nPetitioner ran inside the family residence and locked the Respondent out.  \n_______________.  \n If denied , provide an explanation and any evidence contradicting this event, \nincluding witness statements or other documentation.  \n \nResponse:  \n \n \n \n \n9. Admit or deny that during the course of these proceedings following \nMarch 14\nth, 2024, Petitioner has made no claims of abuse, drug use, or any \nconcerns of violence or threat of violence made by Respondent aimed at the \nPetitioner and has not served any documents related to the above to the \nRespondent during the pendency of the case through her"}
{"id": "47e7c73acd628bf2c580d502828e0ece5c9f4e99", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "cerns of violence or threat of violence made by Respondent aimed at the \nPetitioner and has not served any documents related to the above to the \nRespondent during the pendency of the case through her attorney of record.  \n_______________.  \n If denied , provide all documents, pleadings, or correspondence where such \nclaims have been raised, filed, or served.  \n \nResponse:  \n \n \n10. Admit or deny that during the marriage, Petitioner directly \nbenefitted from and was aware of Respondent's work-from-home business \nup until his removal on January 16\nth, 2024.  _______________.  \n If denied , provide a full explanation and any financial documents or records \nto support the denial.  \n \nResponse:\n\n7 \n 11. Admit or deny that during the pendency of the case, Petitioner is \naware that Respondent has lived in several different locations, seeking relief \nfrom ongoing damages caused by the removal of his home.  ______________.  \n If denied , provide an explanation and all relevant documents supporting the \ndenial.  \n \nResponse:  \n \n \n \n12. Admit or deny that the Petitioner has made no meaningful effort to \nensure that the Children’s status quo is preserved during the pendency of the \ncase.  _______________.  \n \nIf denied, provide an explanation and all relevant documents supporting the \ndenial.  \nResponse:  \n     \n \n 13. Admit or deny that the Respondent has ab ided by the current \ntemporary orders in place to the best of his ability, and that the child support \ncalculat ions, the child custody arrangements, and the current injunctions in \nplace have no legal or factual foundation.  \n If denied, provide an explanation and all relevant documents that can be found on the clerk’ s record supporting the denial and supporting the current \narrangements.  \n \nResponse:\n\n8 \n I V.  Time for Compliance and Filing Instructions  \nD. Petitioner is hereby reminded that all responses to this Request for \nDisclosure, Discovery, and Admissions, along with any requested documents, \nmust be provid"}
{"id": "9d672d95e34606bab39d5019aee6db700a9b1a12", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_19_24_request_for_discovery_1\\09_19_24_request_for_discovery_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.19.24 - REQUEST FOR DISCOVERY-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 1878, "text": "Compliance and Filing Instructions  \nD. Petitioner is hereby reminded that all responses to this Request for \nDisclosure, Discovery, and Admissions, along with any requested documents, \nmust be provided no later than 30 days after the date of service of this request.  \nAll documents and materials must be filed using the Electronic Filing Manager under the \"service only\"  option and served on the Respondent. \nFailure to respond in a timely manner may result in the filing of a Motion to \nCompel, and any objections to the requests for admissions being deemed \nwaived and the matters admitted by the Court.  \n \n• Please note that as of the time of this request, there are no formal pending settings that have been properly served on the Respondent pursuant to Texas Rules of Civil Procedure Rule 21a.  \n \nRespectfully submitted,  \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court Watauga, TX 76148  \nchuckdustin12@gmail.com\n \n817-507-6562\n\n9 \n CERTIFICATE OF SERVICE  \nRespondent hereby certifies that on 09/19/2024, a true and correct copy \nof the Respondent’s First Request for Disclosure, Discovery, and \nAdmissions was served on the following parties via electronic service \nthrough the Electronic Filing Manager (EFM) and via email to the email \naddress on record, pursuant to Texas Rules of Civil Procedure 21a and 191.4. \nServed to: \n• Morgan Michelle Myers , Petitioner via electronic filing system.  \n• Cooper Carter, Counsel for Petitioner via electronic filing system.  \n• Email Addresses for Service:  \ncoopercarter@majadmin.com & morganmw02@gmail.com  \nService was made using the \"service only\" option via the Electronic Filing \nManager and was also served via email to Respondent's email address: \nchuckdustin12@gmail.com. \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148  \nchuckdustin12@gmail.com  \n817-507-6562"}