{"id": "695c274bd1413b08f176df1da0fa29fc409de218", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n 322-744263 -23 \nIN THE 322ND DISTRICT COURT  \nOF TARRANT COUNTY, TEXAS  \n \nMorgan Michelle Myers,  \n \n                                   Petitioner,  \n               v.  \n \nCharles Dustin Myers,  \n   \n                     Respondent.  \n \nAnd In the interest of M.E.M. and \nC.R.M., two children.  § \n§ \n§ \n§ \n§   MOTION TO RECUSE   \n§                    \n§ \n§ \n§ \n \nTO THE HONORABLE JUDGE OF THIS COURT:  \n COMES NOW, Respondent, CHARLES DUSTIN MYERS, who respectfully submits \nthis Motion to Recuse , and in support thereof, shows the Court the following:  \nI. INTRODUCTION  \n 1. There exists no excuse , nor any law or reasoning that could justify the events that have \ntranspired throughout this case. Respondent notes t hat this is the third recusal motion filed in this \nmatter, making it a tertiary recusal  pursuant to Tex. Gov ’t. Code § 25.00256. The term includes \nany third or subsequent motion filed in the case by the same party, regardless of whether that motion is filed against a different judge than the judge or judges against whom the previous motions for recusal or disqualification were filed.  \n 2. In pra ctice, and pursuant to the statute, this gives Honorable James Munford the ability \nto move the case to final disposition as though a tertiary recusal motion had not been filed.  \nHowever, I urge this court to pay close attention for the forthcoming reasons:\n\n2 \n *All docket references herein are market with DKT  followed by the corresponding number.  \n 3. Resp ondent, on day one, was divested o f his property, his children, and his normal \nplace of busines s. DKT 19.  \n 4. The Petitioner, Morgan Michelle Myers, was allowed to approach this Court, submit \nfacially fraudulent pleadings , and walk away with full custody and sole use of the residency \nbefore anything was ever adjudicated. She was permitted to falsify her indigency, claim abuse, \nand fabricate an emergency when the record before this court has held the truth, and remains unopposed. DKT 1, 3, 5 "}
{"id": "0fe98582628ab4080936babd00beeb5a09b2597e", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ing was ever adjudicated. She was permitted to falsify her indigency, claim abuse, \nand fabricate an emergency when the record before this court has held the truth, and remains unopposed. DKT 1, 3, 5 & 27.   5. The Respondent has provided this Court, the Second Court of Appeals, the Texas \nSupreme Court , the State Commission on Judicial Conduct, the State Bar o f Tex as, and the \nOffice of the  Attorney G eneral with every possible opportunity to correct this situation, and each \nbody has refused to do so. He has not received one argument, not one explanation, and not one justification for what has transpired. DKT passim.  \n 6. Now, while the review er may  pause here and claim th is motion is meritless , the reality \nof this situation is that after careful review of the record, the fact pattern of this case, and after receiving not a single response in  any of the six appellate cases from any implicated judge  on \nappeal , and with zero sum  participation from the other side of the table, the record facially \nestablishes that Honorable James Munford, Honorable Jeff Kaitcer, Court Coordinator Lindsey Baker, opposing attorney Cooper L. Carter, and Petitioner Morgan Michelle Myer s, collectively, \nhave exhbited conduct of an enterprise through a pattern of racketeering activity . \n 7. Accordingly, absent any swift corrective action, Honorable James Munford must \nrecuse himself  from this matter , which is supported by the forthcoming facts  found in the record :\n\n3 \n II. RECUSAL STANDARDS AND PROCEDURE  \n 8. Texas appellate courts have consistently held that recusal is mandatory —not \ndiscretionary —when a judge’s impartiality might reasonably be questioned ( Ex parte Thuesen, \n546 S.W.3d 145 (Tex. Crim. App. 2017)). The test is whether a reasonable member of the public, \nknowing all the facts, would have a reasonable doubt about the judge’s impartiality ( Rodriguez v. \nNewton, NUMBER 13-19-00309-CV (Tex. App. Jul 16, 2020);  In re Moore , NUMBER 13-19-\n00551-CV (Tex"}
{"id": "999b5a2387bf0785160015f8c69882cde0e85f66", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": " \nknowing all the facts, would have a reasonable doubt about the judge’s impartiality ( Rodriguez v. \nNewton, NUMBER 13-19-00309-CV (Tex. App. Jul 16, 2020);  In re Moore , NUMBER 13-19-\n00551-CV (Tex. App. Oct 30, 2019);  Johnson-Todd v. Morgan, NO. 09 -17-00168-CV, NO. 09-\n17-00194-CV (Tex. App. Dec 20, 2018);  Kniatt v. State , 239 S.W.3d 910 (Tex. App. 2007);  Sears \nv. Nueces County Sherriff Olivarez , 28 S.W.3d 611 (Tex. App. 2000)). This standard is applied \nregardless of whether actual bias exists; the appearance of bias is sufficient.  \n 9. When a recusal motion is filed, the judge must either recuse themselves or refer the \nmotion to another judge for decision; the challenged judge cannot unilaterally determine the sufficiency of the allegations ( De Leon v. Aguilar , 127 S.W.3d 1 (Tex. Crim. App. 2004)). \n 10. A federal lawsuit against a judge, particularly  one alleging conspiracy with a party in \na RICO action, creates an immediate and substantial conflict of interest that requires the judge’s prompt recusal from presiding over this matter , because the judge’s impartiality would \nreasonably be questioned under both constitutional and statutory standards. The integrity of the judicial process and the appearance of fairness demand recusal in such circumstances to preserve public confidence and due process , which has already been tain ted by these proceedings. \n 11.\n The Texas Constitution provides a foundational rule: no judge may preside over a \ncase in which they have an interest, or where there is a connection to the parties by affinity, consanguinity, or prior involvement as counsel (Tex. Const. art. 5 § 11). This constitutional mandate is echoed and elaborated in the Texas Government Code, which requires a judge to\n\n4 \n recuse themselves and request assignment of another judge if they are disqualified or should \notherwise recuse ( Tex. Gov't. Code § 24.002). The Texas Government Code also provides \nmechanisms for parties to object to a judge’s assi"}
{"id": "90d22ce41d41440bbff40b760c317e74d2e7aa0c", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "signment of another judge if they are disqualified or should \notherwise recuse ( Tex. Gov't. Code § 24.002). The Texas Government Code also provides \nmechanisms for parties to object to a judge’s assignment in civil cases, including divorce, and mandates recusal upon timely objection ( Tex. Gov't. Code § 74.053).  \n 12. Administrative regulations reinforce these requirements, specifying that a judge is \nsubject to recusal or disqualification on the same grounds as set out in Texas Rule of Civil Procedure 18b, and that motions to recuse must be made promptly and supported by admissible facts ( 1 Tex. Admin. Code § 155.152).  \n 13. The law is clear that the appearance of impropriety is as damaging as actual \nimpropriety. The Code of Judicial Conduct and the Texas Supreme Court have emphasized that judges must avoid situations where their impartiality might reasonably be questioned, as  public \nconfidence in the judiciary depends on the perception of fairness and neutrality (State v. Volkswagen Aktiengesellschaft , 692 S.W.3d 467 (Tex. 2022);  In re Moore , NUMBER 13-19-\n00551-CV (Tex. App. Oct 30, 2019)).  15. Allegations of conspiracy under RICO are not mere accusations of bias or error; they \nare claims of criminal conduct and collusion with a party. This elevates the conflict of interest to an extraordinary level, making it virtually impossible for the judge t o preside without \nundermining the legitimacy of the proceedings. The public, and the parties, would have every reason to doubt the judge’s impartiality, and the law requires recusal in such circumstances (Rodriguez v. Cantu (In re Rodriguez ), NUMBER 13-19-00230-CV, NUMBER 13- 19-00254-CV \n(Tex. App. Jun 25, 2019);  Johnson-Todd v. Morgan, NO. 09-17-00168-CV, NO. 09-17 -00194-CV \n(Tex. App. Dec 20, 2018)).  16. Absent  corrective acti on, immediate recu sal is warranted , supported by the following:\n\n5 \n III. GROUNDS FOR RECUSAL  \nA. WIRE FRAUD  \n 8. On October 7, 2024, Respondent filed a joint motion to rec"}
{"id": "2732c682e2a1c20bfc63dcaa120784178e24b0fe", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "Absent  corrective acti on, immediate recu sal is warranted , supported by the following:\n\n5 \n III. GROUNDS FOR RECUSAL  \nA. WIRE FRAUD  \n 8. On October 7, 2024, Respondent filed a joint motion to recuse District Judge James \nMunford and Associate Judge Jeffrey Kaitcer through the electronic filing manager, serving all \nparties with one hyperlinked document containing all exhibits and notarized af fidavits (DKT NO. \n227). This recusal was filed in good faith after all appellate efforts were denied without \nexplanation. See Cause No. 24-0395.  \n 9. On October 8, 2024, at 4:43 PM , correspondence was received  from Court Coordinator \nLindsey Baker regarding an  order of referral  and ruling letter transmitted by Di strict Judge James \nMunford to Regional Presiding Judge David L. Evans, declining to recuse himself  from this \nmatter  (DKT NOS. 228 -229). This emai l contained an unoriginal, modified version of the  joint \nmotion to recuse submitted to re:Search Texas  by the Respondent, and was missing the exhi bits \nand the affidavit.   \n 10. By CC’ing this email to  coopercarter@majadmin.com  on October 8, 2024, District \nJudge James Munford, through his court coordinator, relied  on interstate wire communications  \nbecause majadmin.com  can be traced to the IP address 74.208.236.18, w hich IP Geolocation \nplaces in Kansas City, at coordinates 39.0997,-94.5786. Combined with the intentional alteration \nof the pleading to withhold material exhibits/affidavit  to influence the recusal outcome, the \ntransmission constitutes wire fraud  under 18 U.S.C. § 1343, thereby supplying a RICO predicate \nact under 18 U.S.C. § 1961(1), committed by both Lindsey Baker and District Judge James \nMunford. At minimum, these facts plausibly allege the interstate-wire  and fraud elements  of this \nclaim  are supported by admissible evidence, that if true, would warrant his immediate recusal, \nand no further involvement from the Court Coordinator absent any swift corrective action.\n\n6 \n B"}
{"id": "0326ee96e341f9974725cf95f6cd8bb8d12f84c3", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": " this \nclaim  are supported by admissible evidence, that if true, would warrant his immediate recusal, \nand no further involvement from the Court Coordinator absent any swift corrective action.\n\n6 \n B. WIR E FRAUD – COUNT TWO  \n 11. On October 10, 2024, court coordinator Lindsey Baker transmitted a n “Amended \nOrder of Referral ” at 11:17 AM  and a  second judge ’s ruling lett er. (DKT 232, 233) This \ntransmission relied on the same interstate wires mentioned above.  \n 12. The original motion was on ce again modified, this time split into three separate files \n“due to the size of the motion ” which wa s well under the 35mb li mit allotted  from the efile Texas \nplatform , with hyperli nks removed, affecting its ’ readability . \n 13. When Respondent pointed these issues  out, Baker confirmed the pleading had been e -\nfiled and the full document was in the court's possession (DKT NOS. 230-231 see Exhibits ) \nshowing that there was no plausible re ason to modify them.  \nC. FAILURE TO FOLLOW MANDATORY RECUSAL PROCEDURES  \n 14. The primary legislative and regulatory authorities governing the handling of recusal \nmotions in Texas are Texas Rule of Civil Procedure 18a and various provisions of the Texas \nGovernment Code, including sections 25.00256, 29.055, and 74.059(c)(3).  \n 15. Texas Rule of Civil Procedure 18a  sets out the exclusive procedure for recusal or \ndisqualification  of judges in civil cases. Upon the filing of a recusal motion, the rule requires the \nrespondent judge, within three business days, to either recuse themselves or refer the motion to the regional presiding judge. The rule further mandates that the judge mus t take no further action \nin the case until the motion is resolved, except for good cause stated in writing or on the record.  \n 16. Texas Government Code § 25.00256 (and related provisions such as § 29.055 and § \n74.059(c)(3)) reinforce these requirements, specifying that the judge must forward the motion and all related documents in their o"}
{"id": "849bc7546b24bdcb063d33edcfaf0812e2b59113", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "nment Code § 25.00256 (and related provisions such as § 29.055 and § \n74.059(c)(3)) reinforce these requirements, specifying that the judge must forward the motion and all related documents in their original form or as certified copies to the presiding judge, and may not take f urther action in the case until the recusal motion is resolved.\n\n7 \n  17. Here , modifie d versions were transmitted , notably missing critical elements such as \nthe notarized affidavit and exhibits showing a long list of misconduct that remains unaddressed \nto this day.  Notwith standing the federal allegations above, there is a continuous pattern showing \nthat the law is being willfully disregarded by these individuals, and enabled by the Regional \nPresidin g Judge, who has permitted ruling s on non-existent motions, and the continued \ninvolvement of Baker despite clear ambiguities surrounding the prior two recusal proceedings.  \n 18. Texas Rule of Civil Procedure 18a  and Texas Government Code § 29.055 both require \nthe forwarding of the motion and all related documents in their original or certified form. The use \nof the term “all” and the requirement for original or certified copies preclude any alteration, omission, or selective transmission. This is f urther reinforced by case law, which consistently \nholds that the judge’s only permissible actions are recusal or referral, and that any other action—including any manipulation of the motion or its exhibits —is outside the scope of the judge’s \nauthority (In re Gold, 04-25-00085-CV (Tex. App. May 07, 2025);  In re Norman, 191 S.W.3d \n858 (Tex. App. 2006);  Carson v. Gomez , 841 S.W.2d 491 (Tex. App. 1992)).  \nIV. ETHICS  \n \n 19. The ethical consequences of the allegations are significant. The Texas Code of \nJudicial Conduct requires judges to comply with the law and maintain professional competence. \nIn In re Inquiry Concerning Honorable Bonnie Rangel  (677 S.W.3d 918, Tex. 2023), the Texas \nSupreme Court publicly admonished a judge for f"}
{"id": "5d0e9bd10e6c8ec3deebe30253090d408df2e83d", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": " comply with the law and maintain professional competence. \nIn In re Inquiry Concerning Honorable Bonnie Rangel  (677 S.W.3d 918, Tex. 2023), the Texas \nSupreme Court publicly admonished a judge for filing a response to a recusal motion, which is \nexpressly prohibited by Rule 18a. The Court found that this single act demonstrated a lack of \ncompetence in the law and a failure to compl y with legal requirements, violating Canons 2A and \n3B(2).\n\n8 20. By analogy, in this case,  a staff member who serves at the pleasure of the Judge\nfacing recusal was permitted to  transmit  non-original copies a government document through the \nuse of interstate wires  when the law clearly prohibits such behavior. \n21. Furthermore, these actions are not isolated but build  upon a growing pattern of\nmisconduct in furtherance of a broader scheme initiated by Petitioner Morgan Michelle Myers.  \nV. PURSUIT OF FEDERAL CLAIMS\n22. The actions alleged herein are part of a larger, broader scheme to def raud the\nRespondent of his business and property, and this Recusal serves as both a notice to any \nindividual reading this brief that the law is not optional. Whether  a judge, a n attorney, a clerk, or \na coordinator – t he law  is not below you.  \n23. In this case, several individuals have chosen to disregard the law, put their political\ninterests and bias before the Children and l aws of this State, and have inadvertently assisted the \nPetitioner, Morgan Michelle My ers, in a n elaborate scheme to defraud the Respondent of \nbusiness and property of whi ch affects interstate commerce currently being litigated in the \nWestern District of Oklahoma.  \nVI. CONCLUSION\n24. For these reasons, Judge James Munford should be immediately r ecused , or in the\nalternative, correct the mistakes that have remained unaddressed for two years and remain unopposed on the face of the record.  \n25. T\nhe re cord is clear: this is a one sided case, with a one sided outcome, and despite\nhaving every reason to correct"}
{"id": "545a2ca4dfe47b2614f9257c2138bc19948b32ce", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "ed unaddressed for two years and remain unopposed on the face of the record.  \n25. T\nhe re cord is clear: this is a one sided case, with a one sided outcome, and despite\nhaving every reason to correct the errors in the face of no opposition, this Court has chosen to \ndisregard the law, ethical standards, and has committed several predicate acts in the process which will be outlined in more detail if the subsequent federal action must be brought.\n\n9 \n  26. Nevertheless , the facts plead h erein support recusal , as any member of the public \nknowi ng all of the facts  of this case would clearly doubt it was conducted in an impartial manner . \nVI. PRA YER  \n  WHEREFORE, all premises considered, Respondent prays that the court:  \n1. Grant this motion to recuse , or in the alternative, provide corrective action  to \nremedy the injustice faced by the Respondent;  \n2. Prevent any involvement from Court Coordinator Lindsey Baker;  \n \n3. Provide any further relief that this Court deems equitable and just based on \nthese extraordinary and unjust circumstances;  \n \nRespectfully submitted,  \n  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne  Court  \n Watauga, Texas 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693\n\n10 \n AFFIDAVIT OF CHARLES DUSTIN MYERS  \nCOUNTY OF TARRANT  \n \nBEFORE ME, the undersigned authority, on this day Charles Dustin Myers personally appeared, \nwho, being by me duly sworn, deposed as follows:  \n \n1. My name is Charles Dustin Myers. I am over the age of eighteen, of sound mind, and \ncompetent to make this affidavit. The facts stated herein are within my personal \nknowledge and are true and correct.  \n \n2. On October 7, 2024, I filed a joint motion to recuse District Judge James Munford and Associate Judge Jeffrey Kaitcer through the electronic filing manager, serving all parties \nwith a single document containing all exhibits and a notarized affidavit.  \n \n3. On October 8, 2024, I received correspondence from Court Coordinator Lindsey Baker"}
{"id": "e825e1521fffd3388f5fdd310021ffb2395cfe9a", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "filing manager, serving all parties \nwith a single document containing all exhibits and a notarized affidavit.  \n \n3. On October 8, 2024, I received correspondence from Court Coordinator Lindsey Baker regarding an order of referral and ruling letter transmitted by Judge Munford to Regional Presiding Judge David L. Evans. The email contained a modified version of my joint \nmotion to recuse, which was missing the exhibits and affidavit that I had originally \nsubmitted.  \n \n4. On October 10, 2024, Ms. Baker transmitted an “Amended Order of Referral” and a second judge’s ruling letter. The original motion was again modified, split into three \nseparate files, and hyperlinks were removed, affecting its readability. The size of the \noriginal document was well under the 35MB limit for e-filing.  \n \n5. When I raised these issues with Ms. Baker, she confirmed that the full document was in the court’s possession, and there was no plausible reason for the modifications.  \n6. I believe that these actions, including the alteration and selective transmission of my filings, have affected the integrity of the recusal process and raise reasonable questions about the impartiality of Judge Munford in this case  and are based on my personal \nknowledge and believe , and is supported by admissible evidence on the face of the \nrecord.  \n \n7. Based on personal knowledge and belief, these actions are part of a larger criminal \nenterpris e including  Associate Judge  Jeffrey Kaitcer,  Court Coordinator Lindsey Baker, \nCooper Carter, and Morgan Michelle Myers  whic h will be pursued in Federal Court.\n\n11 \n Further affiant sayeth not.  \n \n \n /s/_______________________ \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693 \n PRO -SE \n \n \n  \n \nCERTIFICATE OF SERVICE  \n \n Pursuant to Rule 21a of the Texas Rules of Civil Procedure, a true and accurate copy of  \n \nthis MOTION TO RECUSE  has been served on all parties of record through the  \n \nSup"}
{"id": "d3d2d23602179ef0e2cf3c0931948d2d576fe5a7", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_05_25_motion_to_recuse_tieritary_1\\09_05_25_motion_to_recuse_tieritary_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.05.25 - Motion to Recuse (Tieritary)-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 787, "text": "TIFICATE OF SERVICE  \n \n Pursuant to Rule 21a of the Texas Rules of Civil Procedure, a true and accurate copy of  \n \nthis MOTION TO RECUSE  has been served on all parties of record through the  \n \nSupreme Court of Texas approved EFM (re:Search Texas) on this 5\nth day of September, 2025.  \n \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693 \n PRO -SE \n \nState of Florida\nCounty of Palm Beach\nSworn to (or affirmed) and subscribed before me by means of online notarization,\nthis 09/05/2025 by Charles Dustin Myers.\n___ Personally Known OR ___ Produced Identification\nType of Identification Produced _______DRIVER LICENSE\nNotarized remotely online using communication technology via Proof.Online Notary"}