{"id": "6092e5e328987a5f6470630fda072a96f41287d3", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322-744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT \nCOUNTY, TEXAS  \n \n \nTO THE HONORABLE JUDGE OF SAID COURT:  \nRespondent Charles Dustin Myers files this motion to designate \nresponsible third parties  pursuant to Rule 39 (a)(1) of the Texas Rules of \nCivil Procedure  and in support thereof, would respectfully show the Court \nthe following:  \nI. PARTIES  \n1. Petitioner : Morgan Michelle Myers, residing at 6641 Anne Court, \nWatauga, Texas 76148.  Morgan Michelle Myers ,  \n  \n  \nPetitioner,   \n  \nv. MOTION FOR JOINDER OF \nPERSONS NEEDED FOR JUST \nADJUDICATION  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2024 -06-23  \nDKT-215:001\n\n2. Respondent: Charles Dustin Myers, residing at 6641 Anne Court, \nWatauga, Texas 76148.1 \nII. DESIGNATED THIRD PARTIES  \n3. Pursuant to Tex. R. Civ. P . § 39(c) , Respondent names the following \nadditional parties : \na. Daniel Kenneth Branthoover  , whose last known address is 3100 \nCopan Ct, Yukon, OK 73099.  \nb. Margie Evonne Wilson, who  resides at 664 0 Anne Court, \nWatauga, TX 76148.  \nc. The parties above have not yet been joine d into this suit due to \nall important issues related being ruled on prematurely pri or to \nany evidentiary hearing, which didn’ t occur until March 14th, \n2024, nearly three mo nths after the divorce was filed by the \nPetitioner  – and where a court record was  not provide d as \nmandated by Tex. Fam. Code  § 105.003 . (A record shall be made \nas in civil cases generally unless waived by the parties with the consent of the court ). Respondent also has an un- answered  no-\nevidence summary judgement that is a re iteration  of the claims \nmade herein, which was judicially acknowledged on March 14\nth, \n2024, over 90 days ago by Judge Kaitcer . \n \n1 Respondent was ordered to vacate his residency and place of business on January \n16th, 2024, by District Judge James Munford , on January 22nd, 2024, by Associate \nJudge Jeffrey Kaitcer, and was locked out by the Petitioner on March 6th, 2024.  \nDKT-215"}
{"id": "551f30ec497f50fb7b1784f3561e87d7e0b177f8", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ace of business on January \n16th, 2024, by District Judge James Munford , on January 22nd, 2024, by Associate \nJudge Jeffrey Kaitcer, and was locked out by the Petitioner on March 6th, 2024.  \nDKT-215:002\n\nd. The above-mentioned cause is currently pending on appeal in the \nSupreme Court of Texas regarding the interlocutory orders \nrendered on March 26th, 2024 . Pursuant to the Texas  Family \nCode, this court has the ability on its ’ own motion  after noti ce \nand hearing to grant temporary orders for the preservation of \nproperty during the appeal.  Id § 6.709.  \nIII. FACTS  \n \n4. On December 13th, 2024, Morgan Michelle Myers opened up a bank \naccount in her own name .  \n5. On the evening of December 13th, 2024, Morgan Michelle Myers \nhad a meeting with Margie Evonne Wilson at her residency at  \napproximately 9:55PM  where they had a four -hour long private \ndiscussion  relating to divorce matters . \n6. On December 1 4th, 2024,  Morgan Michelle Myers requested an ex -\nparte temporary order of protection from this Court, which was denied.  \n7. On December 15\nth, 2023, Charles Dustin Myers was contacted by \nDaniel Kenneth Branthoover, now Morgan’s stepfather , where he \nstated  his intention to  “help with the divorce” and that it would be “a \ngood move” to allow  Morgan Michelle Myers and the Children to \nvisit his residency in Y ukon, Oklahom a over the weekend of \nDecember 15th, 2024.   \nDKT-215:003\n\n8. Immediately following this phone call, Mr. Branthoover advised \nMorgan to withdraw all of the available joint finances into her own personal account that she had just opened on December 13\nth, 2023, \nwhich amounted to $1,576.  \n9. Respondent timely requested that the money be put back after \ndiscovering the joint bank account was overdrawn $-800 on \nDecember 16th,  2023,  at approximately 3:54P.M., stating that the \nmoney was needed for bills and the Children’s Christmas gifts.  \n10. At 8:23 P.M. CST on December 16th, 2023, Mr. Branthoover replied \nstating that the "}
{"id": "e53f0882ec128b3d8ca5bfdea0b7fc529cbfadb9", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": ",  at approximately 3:54P.M., stating that the \nmoney was needed for bills and the Children’s Christmas gifts.  \n10. At 8:23 P.M. CST on December 16th, 2023, Mr. Branthoover replied \nstating that the money was hers, and that he would be helping Morgan file the divorce paperwork while she and the Children were at his residency  that weekend . \n11. On December 17\nth, 2024, at approximately 11:00 A.M. CST, Margie \nEvonne Wilson served Charles with an eviction notice  by hand \ndelivery, where the grounds for eviction were cited as follows:  \na. Divorce \nb. Protective order filed.  \nc. He must leave. Her and the Children may stay.  \n12. On the evening of December 17th, 2023, Morgan returned to the \nfamily home with a can of pepper spray indicating a narrative for protection. She also acquired a  second phone, given to her by Daniel \nBranthoover while visiting his residency.  \n13. On December 18\nth, 2023, Morgan filed for divorce . \nDKT-215:004\n\n14. On December 19th, 2023, Charles was contacted once again by Mr. \nBranthoover, who claimed to be Morgan’s legal representative, and \ninstructed Charles to not contact ‘his client’ regarding the divorce suit \n15. On December 22\nnd, 2023, Morgan filed for a standard order of \nprotection. \n16. On December 27th, 2023, Charles was served with the Original \nPetition for Divorce, and the Eviction. \n17. On December 28th, 2023, Charles was served the Original Petition \nfor divorce.  \n18. Between the dates of December 29th, 2023, and January 16th, 2024, \nthe Respondent cohabitated with the Petitioner,  where the Children \nwere left in the Respondent ’s care while she worked her part -time \njob, which preserved the status quo of the minor children of this \ncase.  \n19. At the show cause hearing on January 16th, 2024, despite denying \nthe initial emergency protective order sought on December 14th by \nMorgan, Judge James Munford , on his own motion, consolidated the \ncase with the divorce and granted a continuance despite ordering the \nRespo"}
{"id": "1ae1d7248983d8f283c91b1007ff00d0bde9bf7a", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "al emergency protective order sought on December 14th by \nMorgan, Judge James Munford , on his own motion, consolidated the \ncase with the divorce and granted a continuance despite ordering the \nRespondent out of his residency, business, and Children’ s lives . \n20. This constitutional violation from the onset of the case combined \nwith the fraudulent nature of the Petitioner ’s pleadings, and the \nconspirat orial and malicious intent fueling them has left the \nDKT-215:005\n\nRespondent without any legal justification  for the decisions rendered \nin this case , and the children have been left with a parent who is \nunable to provide for them emotionally, financially, and as evidence \nwill show – has introduced chaos into their lives . \n21. On June 2nd, 2024, the Respondent was contacted by Margie Evonne \nWilson who raised concerns about the children, Morgan’ s behavior, \nand stated she “ could not afford for the m to live there much longer \ndue to no rent being paid. ” \n22. On June 20th, 2024, Respondent reached out to Daniel Branthoover \nafter receiving a friend request from him on social media, expressing \nconcern over the detrimental impact of Daniel’s actions on the welfare of the minor children involved in this case. Respondent explained how Daniel’s actions had directly undermined the financial and emotional stability of the children, both currently and in the foreseeable future. In response, Daniel attempted to justify his behavior and further revealed his malicious intent by stating that he  \nhad been \"thoroughly enjoying\" seeing the Respondent’s attempts for relief being denied.  \n23. During the pendency of the case  - Morgan Michelle Myers has \nmoved additional family members into the fa mily residence,  has \nintroduc ed a new male figure into the children ’s lives on an ongoing \nbasis, works  less hours than when the orders were rendered, and has \nDKT-215:006\n\nleft the children in the  sole custody of the male individual on at least \none occasion . \nIV.  LEG"}
{"id": "2c63ee0a37d2211b424d8af5a9071d674224b45f", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "es on an ongoing \nbasis, works  less hours than when the orders were rendered, and has \nDKT-215:006\n\nleft the children in the  sole custody of the male individual on at least \none occasion . \nIV.  LEGAL BASIS FOR DESIGNATION  \n24. Pursuant to Rule 39 (a)(1)  of the Texas Rules of Civil Procedure, “[a] \nperson who is subject to service of process shall be joined as a party \nin the action if  in [their]  absence complete relief cannot be accorded \namong those already parties …” Id. The Respondent  and the marital \nestate have been undergoing substantial and ongoing harm due to the \ncollective actions of Morgan, Mr. Branthoover, and Margie , and the \nbest interests of the children have been disregarded entirely due to the deceptive nature of her  pleadings.\n2 Their addition to the case is \nnecessary  so this court will have jurisdiction for the relief being \nsought by the Respondent.  \n25. Morgan Michelle Myers, Daniel Kenneth Branthoover, and Margie Evonne Wilson acted in concert with malicious intent with the common goal of removing the Respondent  from the family \nresidence by fil ling a fraudulent divorce petition, protective order, \nand eviction notice during the weekend of December 15\nth, 2023, to \ncreate a false narrative of protection to present to this Court.  All \nclaims herein are substantiated with text message evidence. \n \n2 Attached hereto is the Respondent ’s income whic h has significantly dropped and \nis continuously dropping without a stable residency to perform h is normal \noccupation which the Children in this case, Margie Evonne Wilson, and Morgan \nMichelle Myers all rely on.  \nDKT-215:007\n\n26. Despite raising the  exact facts mentioned above in the very first \npleading submitted to this court, which was a motion to consolidate, \nwhich   has been attached hereto for the court’s reference – it was \nignored outright and was not taken into consideration in any of the temporary orders rendered in this case.  \n27. Due to Dan iel’s involvement and the fr"}
{"id": "75901b73c4375c97e1e3b73eab2e1a889f09f2b3", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "hed hereto for the court’s reference – it was \nignored outright and was not taken into consideration in any of the temporary orders rendered in this case.  \n27. Due to Dan iel’s involvement and the fraudulent nature of the \nOriginal Petition for Divorce – no hearing regarding custody \ndeterminations should have  been  held until Tex. Fam. Code § \n6.405(b) were to be satisfied, which requires : \n(b) The petitioner shall attach to the petition a copy of each order \ndescribed by Subsection (a)(1) in which a party to the suit or the child of a \nparty to the suit was the applicant or victim of the conduct alleged in the \napplication or order and the other party was the respondent or defendant of \nan action regarding the conduct alleged in the application or order without \nregard to the date of the order.  If a copy of the order is not available at the \ntime of filing, the petition must state  that a copy of the order will be filed \nwith the court before any hearing.  – Id (emphasis added)  \n \nDespite this statutory requirement, two hearings were held  which resulted \nin Charles’ unjust removal from his home, his business, and Children’s \nlives.  Despite invoking this rule at the March 14th, 2024 hearing – it was \nsustained on objection for relevance – with no court reporter to make an \nappeal.  \n \n28. Due to the fatal procedural errors committed in this case, the \nfraudulent nature that they were filed, the third party influence, the \nmalicious intent behind them, the ongoing damage caused, the lack of discovery, and the disregard for the best interests of the children, this Court has an obligation to re -visit the merits of this case  by \nDKT-215:008\n\nenjoining the above named parties into the suit so that the facts can \nbe before this court for the first time in nearly seven months of litigation.  \nV . CIVIL CONSPIRACY  AND FRAUD  \n29. To prove civil conspiracy, the plaintiff must show the following elements: (1) two or more persons; (2) an object to be accomplished; ("}
{"id": "498c03648810452291c4e651acfb83829e986773", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "en months of litigation.  \nV . CIVIL CONSPIRACY  AND FRAUD  \n29. To prove civil conspiracy, the plaintiff must show the following elements: (1) two or more persons; (2) an object to be accomplished; (3) a meeting of the minds on the object to be accomplished; (4) one or more unlawful, overt acts; and (5) damages as the proximate result. Triplex Communications, Inc. d/b/a Radio Station KZZB -95 \nFM v. Riley , 900 S.W.2d 716, 719 (Tex.1995); Massey v. Armco \nSteel Co ., 652 S.W.2d 932, 934 (Tex.1983) ; Bernstein v. Portland \nSav. & Loan Ass'n., 850 S.W.2d 694, 706 (Tex.App. --Corp us Christi \n1993, writ denied).  Respondent asserts that the record proves civil \nconspiracy on its’ face as text evidence and other relevant materials \nhave already been submitted with the clerk of this Court, but nonetheless will be shown to the clear and convincing standard of evidence following discovery .  \nVI. INTENTIONAL INFLICTION OF EMOTIONAL \nDISTRESS  \n30. A party claiming intentional infliction of emotional distress must prove:   \nDKT-215:009\n\n(1) the defendant acted intentionally or recklessly; (2) the defendant's \nconduct was extreme and outrageous; (3) the conduct caused the \nclaimant emotional distress; and (4) the emotional distress was severe. \nTiller v. McLure , 121 S.W.3d 709, 713 (Tex. 2003) (per curiam); \nTwyman v. Twyman, 855 S.W.2d 619, 621 (Tex. 1993).  \n \nAll four elements of this cause of action have been satisfied here. The actions by each named party herein resulted in the loss of the Respondent’s custodial rights, business, and property interests, and were initiated the weekend before Christmas void any legal basis for doing so. Respondent asserts that any reasonable finder of fact would conclude that the actions taken by the named parties are \"so \noutrageous in character, and so extreme in degree, as to go beyond all possible bounds of decency, and to be regarded as atrocious, and utterly intolerable in a civilized society.\" H offman- La Roche, Inc. v. \nZeltwan"}
{"id": "4e84e77b8cdd1c0f588f8a7a0de3b9fd5d03320d", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "racter, and so extreme in degree, as to go beyond all possible bounds of decency, and to be regarded as atrocious, and utterly intolerable in a civilized society.\" H offman- La Roche, Inc. v. \nZeltwanger , 144 S.W.3d 438, 445 (Tex. 2004); see also Creditwatch, \nInc. v. Jackson , 157 S.W.3d 814, 817 -18 (Tex. 2005).  \nVII. CRIMINAL CONDUCT  \n31. The admitted  actions of Daniel Kenneth Branthoover and Morgan \nMichelle Myers  have violated criminal statutes  under Texas law  and \nhave undermined this State’s interest in protecting the best interests of the Children by deceiving this Court . The specific criminal \nviolations include:  \nDKT-215:010\n\na. Daniel Kenneth Branthoover has impersonated a public \nservant by presenting himself as an attorney and performed  \nlegal acts without a license  such as requesting discovery, \nadvising Morgan Michelle Myers to t ransfer the available \nfunds in the marital estate to herself, directly influenced the pleadings in this case , and has caused significant and \nongoing harm on the Children and the Respondent in this case.  “A person commits an offense if they impersonate a \npublic servant with intent to induce another to submit to their pretended official authority or to rely on their pretended official acts. This offense is a felony of the third degree.” Texas Penal Code  § 37.11.  \nb. Morgan Michelle Myers knowingly and willingly filed fraudulent divorce paperwork under the advice of Daniel \nBranthoover “with intent to deceive and with knowledge of \nthe statement's meaning” when claiming an active order of protection existed against the Respondent for the purpose of \nacquiring property  as well as when filing for a protective \norder to achieve the same goal. Texas Penal Code § 32.32(b) . \nThe goal was to gain an advantage in the divorce suit by leveraging knowingly false statements of family vio lence \nand by creating a false narrative of protection.  An affidavit of \ninability to pay w as claimed despite both Daniel and Morgan "}
{"id": "63632c265dc73a2d29b3aa79c089306d11fcc729", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "orce suit by leveraging knowingly false statements of family vio lence \nand by creating a false narrative of protection.  An affidavit of \ninability to pay w as claimed despite both Daniel and Morgan \nDKT-215:011\n\nadmitting via text evidence that M organ had transferred \nmoney to herself just three days prior on December 15th, \n2024. \nc. Both Morgan Michelle Myers and Daniel Kenneth \nBranthoover knowingly and willingly committed acts of perjury. The perjury occurred when they conspired to transfer joint finances to Morgan through Daniel’s PayPal account  and immediately  following this act  proceeded to  file \nfor divorce swearing an affidavit of inability to pay costs  and \nthat an active order of protection existed against the Respondent . This affidavit was made under oath with the \nintent to deceive the court regarding her financial status , a \nclear violation of Texas Penal Code § 37.02(a)(1).  \nVIII. CONCLUSION  \n32. The actions taken by Morgan Michelle Myers and Daniel Kenneth Branthoover are not only legally reprehensible but also morally indefensible. Their calculated scheme to remove the Respondent , a \ndedicated stay -at-home father, from the lives of his children has \ncaused significant emotional and financial harm. By conspiring to fraudulently transfer joint finances, filing a deceitful affidavit of inability to pay costs, and manipulating legal pro cesses through \nperjury and impersonation, they have engaged in a toxic and egregious civil conspiracy , committed fraud, and destabilized the \nDKT-215:012\n\nlives of the minor children of this case for the sole benefit of \nMorgan Michelle Myers.  \n33. The Respondent has been the primary caregiver for his children, providing them with emotional support and stability. The deliberate efforts of Morgan and Daniel to sever this vital relationship have disrupted the children's lives, depriving them of the love and care they rely on. This malicious intent to manipulate the court and inflict \nharm on Charles and hi"}
{"id": "f6961dac5f1c7de86183a0c4cc589d2c88d9311c", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "o sever this vital relationship have disrupted the children's lives, depriving them of the love and care they rely on. This malicious intent to manipulate the court and inflict \nharm on Charles and his children cannot be overlooked.  \n34. While Margie Evonne Wilson's actions contributed to the harm caused, it is important to acknowledge that the Respondent does not believe her intent was driven by malice. The Respondent believes \nMargie was manipulated and placed in a difficult position by both Morgan and Daniel. Her inclusion into the case is necessary for the relief being sought regarding the preservation of the property.  \n35. Given the severity of these actions, it is imperative that this Court take decisive action. The Respondent respectfully requests that the \nCourt grant the relief sought, enjoin the responsible third parties, and if deemed necessary - forward the information regarding the  \ncriminal violations to the appropriate state prosecutors for further investigation . The well -being of the children and the integrity of the \nlegal system demand nothing less.  \n36. While Morgan Michelle Myers has committed criminal offenses in  \nthis State, the Respondent would request this court not pursue \nDKT-215:013\n\ncriminal charges against her as it would not serve the best interests \nof the Children.  \nXI. PRAYER AND RELIEF  \n29. Respondent requests the following relief:  \n1. Grant a temporary restraining order preventing Daniel Kenneth \nBranthoover from being in the presence of  the Respondent’s \nchildren  while the case is pending.  \n2. Require by order of this court  that Daniel Kenneth Branthoover \npay monetary and punitive damages for his fraudulent influence in these proceedings  by order of the court, which includes hotel \nbills, gas, tolls, and any punitive damages the court finds \nnecessary  to deter these actions in the future.  \n3. Grant the Respondent a  temporary injunction for the  \npreservation of the property  while this case is pending  to \nprese"}
{"id": "e917c93d5b7a2881de605440012aeb721e516170", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_motion_for_joinder_of_persons_1\\06_23_24_motion_for_joinder_of_persons_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 - MOTION FOR JOINDER OF PERSONS-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 1838, "text": "amages the court finds \nnecessary  to deter these actions in the future.  \n3. Grant the Respondent a  temporary injunction for the  \npreservation of the property  while this case is pending  to \npreserve the status quo for the Children.  \n4. An order requiring Morgan Michelle Myers to pay  all of \nRespondent’s attorney’s fees incurred from the retainment of \nDaniel Bacalis , amounting to $3,000. \n5. Issue a  temporary restraining order against Margie Evonne \nWilson to prevent any further harassment and to  preserve the \nstatus quo of the Children during the pendency of the transitionary period  for no less than eight months  by co ntinuing \nDKT-215:014\n\nto provide a stable li ving environment for the Children in this \ncase. \n6. Require that Morgan Michelle Myers, Daniel Branthoover, and \nMargie Evonne Wilson complete the Children in the Middle \nparent ing course .3  \n7. By order of this court - require that a monthly status report be \nprovided by Charles Dustin Myers , Morgan Michelle Myers, and \nMargie Evonne Wilson  on behalf of the Children. \n8. Grant a trial by jury on the merits of this case in lieu of any findings of fact.  \nWHEREFORE  PREMISES CONSIDERED, Respondent prays that \nthis Court grant the relief requested herein and such other and further relief to which Respondent may be justly entitled.  The State ’s mandated \nrequirement that the children ’s best interest  shall always be the primary \nconsideration of all decisions made  \n Respectfully submitted,  \n/s/ Charles Dustin Myer s\n  \n       Charles Dustin Myers  \n       6641 Anne Court,  \n                  Watauga, TX 76148  \n                  Chuckdustin12@gmail.com  \n       817-507-6562 \n  \n \n \n3 Morgan M ichelle Myers was already previously ordered by this court to complete this \ncourse by May 1st, 2024, which she failed to do.  \nDKT-215:015"}