{"id": "cf60aea1cc4199caee13192b870ba69f5bab8d99", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322 -744263 -23 & NO. 322 -744538 -23 \nIn the Matter of the Marriage of \n Morgan Michelle Myers &  Charles Dustin Myers  \nand in the Interest of \nM.E.M & C.R.M,  \nMinor Children.  \nNOTICE OF INTENT  \nTO REMOVE  \n \nIn the 322nd District Court . \n \nTarrant County, Texas  \n \n \n \n \n \n \nRespectfully submitted, \nCharles Dustin Myers\n\nI. INTRODUCTION \nRespondent, Relator, Defendant; representing himself in \nhis own individual capacity as CHARLES DUSTIN MYERS, hereby \nrefrains from referring to himself in third person.  \n I find it to be repugnant. In reality, I’m simply a \nfather. A father who was brought into this situation during \nthe most precious time of year.  Now, while I have the \nhighest respect for the judiciary, this court, and all of \nits’ participants –  today you have all left me scratching \nmy head as to how after passing through two judges, a panel \nof three judges in the Second Court of Appeals followed by \nthe entire court en banc, seven Justices at the highest \nlevel of the Texas judiciary, a regional presiding Judge, \nand a visiting retired Judge, in all of their collective \nexperience, could not see the issues within this case. \n Perhaps most shocking is how after over 1,500 pages of \ndocuments, pictures, sworn statements, and most importantly \n– without any opposition or engagement with any part of it \nfrom our friends on the other side, it’s not enough to \novercome the apparent, deep- seated antagonism that has only \nleft more questions unanswered and fraud unaddressed.\n\nI am here not out of disrespect, but because I was \ncompelled to be here. I am not seeking the world from this \ncourt, only answers. The relief I seek is not that of impossibility – but is that which is enshrined in the most \nfundamental protections our coun\ntry has to offer. It’s a \nrelief that has been continuously denied time and time \nagain, without any explanation.  \nIn fact, the latest denial actually makes the most \nsense out of any order issued so far in this case, so for "}
{"id": "8c3ea0c1e467b899191790acff90f4d61ffff70a", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "relief that has been continuously denied time and time \nagain, without any explanation.  \nIn fact, the latest denial actually makes the most \nsense out of any order issued so far in this case, so for \nthat I am hopeful. However, the latest denial, albeit legally justified on face value, was made in error, and the only exhibit attached to this motion is the reasons why I \nbelieve this to be true.  \nII.ISSUE\nA. EFM ISSUES PREVENTED THE FILING OF A CONTINUANCE\n1. Exhibit A is attached hereto for the purpose of\ndemonstrating a re\n-occurring theme in this case. Not only \ndid I have every intention of coming to the hearing, but \ngiven the circumstances, did everything in my power to \ncommunicate regarding the situation.\n\n2. These efforts only came second to the rules of law. \nThe inability to access the EFM at such a crucial juncture \nwas communicated to the court and all parties relevant to \nthe matter.   \n3. Furthermore, the circumstances in this case have \nleft me in a persistent state of planning for an inevitable appeal, such as here, where a denial as issued at the first opportunity and allows the court to escape any explanation \nfor the important questions being asked of it.  \n4. Given that my access to the EFM was unavailable \nduring the crucial time that a sworn continuance should \nhave been filed, it raises more questions which require \nanswers to protect my rights that have been continuously \nviolated. For example, given the circumstances, I can’t \nrely on the reason being a technicality regarding the EFM.  \nB. THE DENIAL ONLY CREATES MORE UNADDRESSED ISSUES \n5. The problem I have with this decision is that the \ndenial states that the opposing party appeared and that no \nevidence was admitted –  but makes no mention of the \nagreement made by the parties, the circumstances, and as\n\nmentioned, raises more questions without any answers being \nprovided.  \n6. This would leave one to believe that despite the \nmutual agreement, the opposing party showed up anyway and "}
{"id": "d0c509f3d3501fff6ef1d125fad15ebda9fd3f12", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "stances, and as\n\nmentioned, raises more questions without any answers being \nprovided.  \n6. This would leave one to believe that despite the \nmutual agreement, the opposing party showed up anyway and \nacted as if no agreement was made notwithstanding that it \nmentioned that she appeared by her attorney of record, which is currently under scrutiny and remains on the long \nlist of unanswered questions. \nIII. NO FURTHER STATE REMEDIES \n 7. After nearly eleven months of seeking answers, only more \nquestions have arisen.  \n 8. If the court wishes to revisit the denial of the recusal \ngiven the circumstances pointed out, or in the alternative, \nadopt the still-pending motion to enter judgement and original, unmodified joint motion to recuse, it has the discretion to do so. \n 9. I am awaiting proper service of the denial via the \nelectronic filing manager as required by law, and upon receipt \nwill be removing the case to federal district court to address the ongoing constitutional issues that the State refuses to address.\n\n10. The court in its perspective may see me as a \nnuisance, a pest, a fool. However, when taking a step back \nand looking at the full picture –  it’s worth a thousand \nwords, as they say: \n \nYou’ll notice –  no Cooper Carter. This picture is a \ncollection of all case files available on the EFM up until \nthe recusal was filed and is a combination of case numbers \n24-0395, 02-24-00149-CV, 322-744538-23, and 322- 744263-23 \nin the order in which they were filed.\n\n11. I’ve genuinely tried to provide every opportunity \nto the State to rectify this situation to no avail. \n \n12. The recusal wouldn’t be necessary and is not a \nreflection of the judges in this case. I’ve attempted every \nother legal avenue to accomplish such task to no avail, \nwhich leads us here. I hope the court can respect that.   \n13. I hope the court will reconsider its’ denial of the \nrecusal or do what is right so that the recusal will be \nmoot. Until the current orders are either vacated "}
{"id": "54b695d471362a3abbbc01bb0b72936fc880bf69", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "hope the court can respect that.   \n13. I hope the court will reconsider its’ denial of the \nrecusal or do what is right so that the recusal will be \nmoot. Until the current orders are either vacated or \nlegally justified, I must continue to fight for my family, \nwhich requires that I  seek federal intervention.\n\nIV. BASIS FOR REMOVAL \n14. Defendant, CHARLES DUSTIN MYERS, in the above-\ncaptioned matter hereby provides notice of intent to remove \nthis action to the United States District Court for the \nNorthern District of Texas pursuant to 28 U.S.C. § 1441(a) \nand § 1441(c)(1)(A). Removal is sought on the basis of \nsubstantial federal questions arising from alleged \nviolations of Defendant’s due process rights, procedural \nnegligence, and claims of unaddressed fraudulent actions by \nPlaintiff. Defendant submits the following in support of \nremoval: \nA. Federal Question Jurisdiction Due to Violations of Due \nProcess Rights \n15. This case raises significant federal questions \nunder the 14th Amendment to the United States Constitution, \nspecifically regarding Defendant’s right to due process. \nDefendant asserts that his due process rights have been repeatedly violated due to procedural negligence by the state court and the imposition of an agreement that was \nobtained through fraudulent claims by Plaintiff, without proper judicial scrutiny or procedural safeguards. The\n\nstate court has taken actions that have fundamentally \ndeprived Defendant of a fair opportunity to present his \ncase, as evidenced by the following: \ni. Plaintiff’s initial claims, including the \nunsubstantiated allegation of an active protective \norder, were not subjected to adequate evidentiary \nreview or discovery. Instead, these claims were used to pressure Defendant into a settlement agreement that has \nsince been revealed to be grounded in \nmisrepresentation. The lack of judicial oversight in \nthis process has effectively deprived Defendant of the \nability to defend his rights and property, consti"}
{"id": "f373a2b183d61b2524c4b7816794413dab8b77ff", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": " \nsince been revealed to be grounded in \nmisrepresentation. The lack of judicial oversight in \nthis process has effectively deprived Defendant of the \nability to defend his rights and property, constituting \na direct violation of due process. \nii. The state court compelled Defendant to accept \nand sign a settlement agreement that Plaintiff obtained \nthrough alleged fraudulent representations. When Defendant contested the validity of this agreement, the \ncourt disregarded his objections and ordered him to \ncomply without further review. This compelled \ncompliance without scrutiny or due process fails to\n\nmeet the fundamental fairness standards established \nunder the 14th Amendment. \niii. Plaintiff’s actions, including conversion, \nperjury, fraud upon the court, and intentional \ndestruction of marital assets remain unaddressed by the \nstate court, which has shown procedural negligence in \nallowing these issues to persist without a fair review process. The absence of required discovery and \nevidentiary procedures further denies Defendant an \nopportunity to contest these fraudulent claims, \ndepriving him of a fundamental right to a fair trial.  \nB. Failure of the State Court to Provide an Adequate Remedy \n16. The state court has demonstrated an unwillingness \nor inability to provide an adequate remedy in this matter, \nas illustrated by its failure to address the core issues at \nthe heart of Defendant’s claims. Defendant has repeatedly \nraised these issues before the state court, challenging the \nauthenticity of Plaintiff’s claims and the procedural fairness of the settlement agreement. However, the court \nhas continually declined to address these fundamental\n\nissues, thereby failing to provide Defendant with an \neffective state remedy. \n17. Upon filing the Joint Mo tion to Recuse, the court \nchose to stop recording the pleadings on the EFM, chose ot \nmodify the Defendant’ s documents upon forwarding them to \nthe 8th Administrative Regional Judge, and the state court \nis"}
{"id": "0cbda84c32c8a947a813e381a4ce3ee67e11b697", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "Recuse, the court \nchose to stop recording the pleadings on the EFM, chose ot \nmodify the Defendant’ s documents upon forwarding them to \nthe 8th Administrative Regional Judge, and the state court \nissued an erroneous denial, as outlined in Exhibit 1, without proper judicial scrutiny of either the situation or \nthe issues at hand, choosing to leave them unaddressed. \nThis denial is indicative of the court’s unwillingness to \nengage with the core issues of fraud and due process \nviolations that affect Defendant’s rights and has left \nDefendant with no adequate remedy at the state level. \n18. The state court’s avoidance of key claims— such as \nPlaintiff’s conversion of marital assets, her perjurious \nstatements, and intentional destruction of community \nproperty— has further deprived Defendant of the opportunity \nto have these matters fairly adjudicated. Defendant \ncontends that these fraudulent actions go directly to the \nheart of his claims and that the state court’s avoidance of \nthese matters amounts to a failure of procedural justice.\n\nThis avoidance underscores the need for federal \nintervention, as the state court has failed to uphold \nDefendant’s right to due process and a fair hearing. \nC. Domestic Relations Exception Does Not Apply \n19. The Domestic Relations Exception does not bar \nfederal jurisdiction in this case, as Defendant is not \nseeking federal court adjudication of traditional family \nlaw issues such as divorce or custody. Rather, this removal \nis sought to address alleged due process violations, fraudulent claims, and procedural negligence that have \ndeprived Defendant of his federally protected rights. \nDefendant seeks federal review to rectify the imposition of \na fraudulent settlement agreement that was coerced through \nmisrepresentation, extending beyond the traditional boundaries of domestic relations issues. Therefore, the Domestic Relations Exception does not apply to preclude federal review of the due process violations and fraudulent \nact"}
{"id": "07ff738e8facf35df7347368475866a02f74af14", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": " beyond the traditional boundaries of domestic relations issues. Therefore, the Domestic Relations Exception does not apply to preclude federal review of the due process violations and fraudulent \nactions central to this case. \nD. Rooker- Feldman Doctrine Does Not Apply \n20. The Rooker-Feldman Doctrine does not bar removal \nbecause the state court has not issued a final judgment.\n\nAll current orders remain interlocutory, and Defendant is \nnot seeking to challenge any final state court decision. \nDefendant’s removal is based on the need for federal review \nof ongoing procedural violations and due process issues that have not yet reached final adjudication in the state \ncourt. Since there is no final judgment, the Rooker- Feldman \nDoctrine does not apply to prevent federal intervention in \nthis matter. \nE. Younger Abstention Doctrine Does Not Apply \n21. The Younger Abstention Doctrine generally bars \nfederal intervention in active state proceedings. However, \nit does not apply here because Defendant is not attempting \nto disrupt the state court’s core jurisdiction over family \nlaw matters. Instead, Defendant seeks federal review due to ongoing procedural violations and unaddressed fraudulent actions by Plaintiff, which infringe upon Defendant’s federal rights. Federal oversight is necessary to ensure \nthe protection of Defendant’s due process rights and to \naddress the state court’s failure to enforce procedural \nsafeguards or address Plaintiff’s fraudulent actions.\n\nF. Ambiguity and Procedural Gaps Allow Removal Beyond the \n30-Day Window \n22. The ongoing procedural ambiguity and lack of \nresolution in the state proceedings justify removal beyond \nthe standard 30- day window. The state court’s failure to \nscrutinize Plaintiff’s claims, enforce discovery, or \nprovide clarifying documentation has created substantial ambiguity about the true basis for Plaintiff’s allegations \nand the validity of the coerced settlement agreement. This \nambiguity effectively extends the re"}
{"id": "04ee0a2f9672dc162e1e9755099560ff5b0a8531", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "fying documentation has created substantial ambiguity about the true basis for Plaintiff’s allegations \nand the validity of the coerced settlement agreement. This \nambiguity effectively extends the removal window, as \nDefendant has not received adequate information to properly \naddress these ambiguous and procedurally flawed claims. \n23. Plaintiff’s initial pleadings contain \nunsubstantiated claims impacting Defendant’s rights, and \nthe state court’s failure to require discovery has prevented Defendant from understanding the basis for these claims. Due to the state court’s lack of procedural \nenforcement and transparency, Defendant’s right to remove \nremains valid until clarification and compliance with \nprocedural standards are achieved.\n\n24. Additionally, Defendant notes that the state court \nhas the discretion to reconsider its prior denial, as it \nhas not been formally served in compliance with Texas Rules of Civil Procedure 21a and showcases an unwillingness to \naddress the issues herein. Should the court choose not to \nreconsider its prior ruling, Defendant intends to exercise \nhis right to remove the case to federal court upon receipt of the denial, as outlined in the present notice, pursue \nrelief from damages from Plaintiff.  \nV. CONCLUSION AND PRAYER \n In the instant case, the troubling reality of the \ncourt’s initial decision will bear a lifetime of \nconsequence on the lives of the children it has left out of \nthe equation.  \nGiven the significant procedural and factual issues in this \ncase, Respondent respectfully requests the Court adopt one \nof the following remedies to ensure a fair and just \noutcome: \n1. Recuse Judges James Munford and Jeffrey Kaitcer from \nfurther proceedings, or:\n\n2. Alternatively, deny the recusal but with instructions \nthat the Honorable James Munford:  \no Vacate the current temporary orders which are \nfraudulent;  \no Adopt the temporary orders and parenting plan \nsubmitted by Respondent, designed to prioritize the children's sta"}
{"id": "078b606922aefbd6ca2c02894f35815723fb1ff8", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "able James Munford:  \no Vacate the current temporary orders which are \nfraudulent;  \no Adopt the temporary orders and parenting plan \nsubmitted by Respondent, designed to prioritize the children's stability and continuity, and \nreflect what is in their best interests;  \no Order the parties to engage in mediation to \nfacilitate a cooperative resolution focused on the \nchildren’s best interests and future plans for \nboth parents, ensuring both parties’ livelihoods \nare maintained;  \no Require participation in family counseling to \nprioritize the children’s psychological well- being \nand assess the impact of the past 11 months;  \no Order that Petitioner complete the court- ordered \nChildren in the Middle parenting class, or in the \nalternative, file a notice of completion, given \nthe critical information provided in this program.\n\nGranting either of these alternatives would allow the \nCourt to rectify the underlying concerns of procedural \nfairness, ensuring that the children’s welfare and stability remain the focal points of all decisions. Such actions are essential to moving this case forward in the \nmost efficient and just manner.  \nThe issues in this case can be corrected just as \nswiftly as they were created. It is here, at the threshold \nof justice, that the court m ust exercise its’ discretion to \ncorrect these grave mistakes to prevent further escalation.  \n Respectfully submitted, \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS \n  6641 Anne Court \n  Watauga, TX 76148 \n  817-507-6562 \n  PRO-SE\n\nCERTIFICATE OF SERVICE \n \nI, CHARLES DUSTIN MYERS, certify that a true copy of this \nnotice of intent to remove and all exhibits \nwere served in accordance with Rule 21a of the Texas Rules of \nCivil Procedure on the following on \n11/12/24: \n \nCooper L. Carter (Counsel for real party in interest) \nby EMAIL/ESERVE at COOPERCARTER@MAJADMIN@COM \n Morgan Michelle Myers (real party in interest) \nby EMAIL/ESERVE at MORGANMW02@GMAIL.COM \n \nHolly L. Hayes, Texas Office of the"}
{"id": "34aedf81117a9d821c77d5397caad687e8881089", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "r real party in interest) \nby EMAIL/ESERVE at COOPERCARTER@MAJADMIN@COM \n Morgan Michelle Myers (real party in interest) \nby EMAIL/ESERVE at MORGANMW02@GMAIL.COM \n \nHolly L. Hayes, Texas Office of the Attorney General \nBy EMAIL/ESERVE at 914-filer@texas.oag.gov \n \n/s/ Charles Dustin Myers \nCharles Dustin Myers Chuckdustin12@gmail.com \n6641 Anne Court \nWatauga, TX 76148 \nTel: 1-817-507-6562 \nPro-se\n\nEXHIBIT 1\nEFFORTS IN COMMUNICATION\nAND DENIAL\n\n\n\n\n\n\n\n\n\n\n\n\n\nCharlie Vids <chuckdustin12@gmail.com>\nRE: ITMOMO MYERS, CAUSE NO. 322-744263-23, RECUSAL HEARING CL-12105\n1 message\nCooper Carter <coopercarter@majadmin.com> Thu, Nov 7, 2024 at 9:12 AM\nTo: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>\nCc: Charlie Vids <chuckdustin12@gmail.com>, \"Tegan B. Allison\" <TBAllison@tarrantcountytx.gov>\nGood Morning,\n \nMy client is in agreement with a reset at this \u0000me.\n \nWould you please provide dates for a rescheduling?  Thank you very much.\n \n \nCooper L. Carter\nAttorney at Law\n \nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\n \nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS ADDRESSED\nAND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM DISCLOSURE BY LAW. IF\nTHE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE EMPLOYEE OR AGENT\nRESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU ARE HEREBY NOTIFIED\nTHAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED THIS COMMUNICATION IN\nERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND RETURN THE ORIGINAL MESSAGE\nTO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n \n \n \n \nN e w11/12/24, 7:58 PM Gmail - RE: ITMOMO MYERS, CAUSE NO. 322-744263-23, RECUSAL HEARING CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1815077019602134104&simpl=msg-f:1815077019602134… 1/2\n\nFrom: Charlie Vids [mailto:chuckdustin12@gmail.com]\nSent: Thursday, Nove"}
{"id": "dc9f4646eac05bda3ea9a7d5c4a9ecd385aa6320", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": ".google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1815077019602134104&simpl=msg-f:1815077019602134… 1/2\n\nFrom: Charlie Vids [mailto:chuckdustin12@gmail.com]\nSent: Thursday, November 7, 2024 8:17 AM\nTo: Lindsey K. Baker; Cooper Carter\nSubject: RE: Today's hearing at 11 CL-12105\n \nDear Ms. Baker, and Mr. Carter,\n \nI am writing to respectfully request a rescheduling of today’s recusal hearing due to an unexpected medical issue. Late\nlast night, I began experiencing severe tooth pain, which has now escalated to significant facial swelling and intense\ndiscomfort. The pain is currently affecting my ability to speak, eat, and focus, making it challenging to fully participate in\ntoday’s proceedings.\n \nSpecifically, it's my bottom left molar which the nerve is open and exposed causing significant pain. \n \nI want to sincerely apologize for any inconvenience this may cause, especially given the efforts the court has made to\naccommodate this hearing. Please know that this request is made only out of necessity, and I deeply regret the timing as\nI would prefer to move the case forward.\n \nThis request comes with a high degree of reluctance given the unexpected technical difficulties experienced last time and\nwould not be making it if it wasn't absolutely necessary.\n \nThank you all for your understanding and consideration. I am committed to continuing with the hearing at the earliest\npossible opportunity as I am eager to move the case forward.\n \nI wanted to inform the court as soon as possible out of respect for the courts busy schedule.\n \nI currently am unable to locate the case on research texas, as I've been trying to file a formal notice but given the time I\nwanted to ensure the court was made aware as soon as possible of the situation.\n \nLines of communication are open for further discussion or if any further information is needed.\n \nWith respect,\nCharles Myers\nChuckdustin12@gmail.com \n \n \nN e w11/12/24, 7:58 PM Gmail - RE: ITMOMO MYERS, CAUSE NO. 322-74"}
{"id": "8d0fbf54355fe6f33ea6c9eb1c60d91bfa88868f", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "on are open for further discussion or if any further information is needed.\n \nWith respect,\nCharles Myers\nChuckdustin12@gmail.com \n \n \nN e w11/12/24, 7:58 PM Gmail - RE: ITMOMO MYERS, CAUSE NO. 322-744263-23, RECUSAL HEARING CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1815077019602134104&simpl=msg-f:1815077019602134… 2/2\n\n\n\nCharlie Vids <chuckdustin12@gmail.com>\nMyers 322-744263-23\n1 message\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Mon, Nov 11, 2024 at 12:32 PM\nT o: Charlie Vids <chuckdustin12@gmail.com>, Cooper Carter <coopercarter@majadmin.com>, \"CSD-legal-\n914@oag.texas.gov\" <csd-legal-914@oag.texas.gov>, \"CSD-legal-914@texasattorneygeneral.gov\" <CSD-legal-\n914@texasattorneygeneral.gov>\nAttached is an Order Denying Joint Motion to Recuse.\nThank you.\nLindsey Baker\n322nd Court Coordinator\nT arrant County Family Law Center\n200 E. Weatherford , 4th floor\nFort Worth, T exas 76196\nPhone: (817) 884-1597\n322-744263-23 MYERS-Order Denying Joint Motion to Recuse.pdf\n66K\n11/12/24, 8:00 PM Gmail - Myers 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view =pt&search=all&permthid=thread-f:1815451995077799402&simpl=msg-f:1815451995077799… 1/1\n\nCAUSE NO.322-744263-23 \nIN THE MATTER OF § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ IN THE DISTRICT COURT \nTHE MARRIAGE OF \nMORGAN MICHELLE MYERS \nAND \nCHARLES DUSTIN MYERS 322ND JUDICIAL DISTRICT \nAND IN THE INTEREST OF \nMARA MYERS AND CAROLINE \nMYERS, MINOR CHILDREN TARRANT COUNTY, TEXAS \nORDER DENYING JOINT MOTION TO RECUSE \nJUDGE MUNFORD AND JUDGE KAITCER \nOn the 7th day of November, 2024, came on to be heard the Joint Motion to Recuse \nJudge Munford and Judge Kaitcer filed in the above-entitled cause. The movant, Charles Dustin \nMyers, failed to appear. The respondent, Morgan Michelle Myers, appeared by and through her \nattorney of record. The movant failed to file a motion for continuance and the case was called by \nthe Court. No evidence was offered and the Court concluded th"}
{"id": "91558c0b57736769ad58a33a09ddb61034d62689", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_12_24_notice_of_intent_to_remove_1\\11_12_24_notice_of_intent_to_remove_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.12.24 - NOTICE OF INTENT TO REMOVE-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 565, "text": "lle Myers, appeared by and through her \nattorney of record. The movant failed to file a motion for continuance and the case was called by \nthe Court. No evidence was offered and the Court concluded that the motion should be \nDENIED. \nIT IS THEREFORE ORDERED that the Joint Motion to Recuse Judge Munford and \nJudge Kaitcer is DENIED. Any other relief requested in connection with this Joint Motion to \nRecuse Judge Munford and Judge Kaitcer and not granted herein is hereby Denied. \nSIGNED this ·lI.b day of Ji ove£r1 � 2024.\n��'7 \nSitting by Assignment \nPage 1 ofl"}