{"id": "080faba38120feb730649ef6130e772c45f6aff3", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322-744263-23 \n  \nIN THE MATTER OF                                                    IN THE DISTRICT COURT \nTHE MARRIAGE OF                                                  \nMORGAN MICHELLE MYERS  \nAND                                                322ND JUDICIAL DISTRICT \nCHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF  \nM.E.M. AND C.R.M.,  \nCHILDREN                                                                                TARRANT COUNTY, TEXAS  \n \n \nRESPONDENT ’S THIRD AMENDED COUNTER-P ETITION FOR DIVORCE  \n \nTO THE HONORABLE JUDGE OF SAID COURT:   \nA. Discovery Control Plan   \n1.  Discovery Level:  Discovery in this case is intended to be conducted under Level  2 of \nRule 190 of the Texas Rules of Civil Procedure. Respondent does not ask for additional \ndiscovery time as all matters are properly before the court at the time of filing this third amended \npetition.  \nB. Parties    \n2.  Petitioner:  Petitioner, Morgan Michelle Myers , is an individual who initiated this suit. \nShe may be served with notices and pleadings through her attorney of record in this cause.   \n3.  Respondent/Counter -Petitioner:  Respondent, Charles Dustin Myers , is an individual \nresiding in Texas who has appeared and is before the Court for all purposes. (Hereafter, Charles  \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n \n 322-744263-23FILED\nTARRANT COUNTY\n12/8/2025 2:24 AM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n2 \n Dustin Myers is referred to as “Respondent” when answering Petitioner’s claims and as \n“Counter -Petitioner” when asserting relief in this counter -petition.)   \n4. General Denial:  Pursuant to Rule  92 of the Texas Rules of Civil Procedure, Respondent \ngenerally denies each and every allegation in Petitioner’s latest live petition (the Second Amended Petition for Divorce) and demands strict proof of those allegations by a preponderance  \nof the evidence in accordance with the laws of the State of Texas.   \nC. Affirmative Defenses  \n5. Without waiving the foregoing general denial, Re"}
{"id": "6de2959f6e06bed38c1f8dda616d1ddd9e3e976b", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "rict proof of those allegations by a preponderance  \nof the evidence in accordance with the laws of the State of Texas.   \nC. Affirmative Defenses  \n5. Without waiving the foregoing general denial, Respondent pleads the following \naffirmative defenses to Petitioner’s claims:   \n     i. Waiver: Petitioner’s conduct and delay in pursuing her allegations constitute a waiver \n of any claims inconsistent with that conduct. Petitioner intentionally relinquished or \n abandoned certain rights or positions (for example, by nonsuiting her prior claims and not \n actively pursuing relief for an extended period), and she cannot now revive those claims \n to Respondent’s detriment.   \n     ii. Estoppel (Equitable and Judicial) : Petitioner is estopped from obtaining the relief \n she seeks because her own prior statements, filings, and conduct contradict her current \n allegations. Petitioner made representations (including in sworn statements to this or \n other courts) upon which Respondent and the Court relied, and it would be inequitable to \n allow her to assert positions contrary to those representations now. To the extent \n Petitioner previously urged a position or had facts adjudicated (such as the absence of \n family -violence findings in the protective order proceeding), she is judicially estopped  \n from taking an opposite position in this case.\n\n3 \n      iii. Laches:  Petitioner’s unreasonable delay in raising certain allegations and claims has \n caused undue prejudice to Respondent. By waiting nearly two years to actively pursue \n allegations of abuse and other complaints (and only asserting them on the eve of \n significant court action), Petitioner has made it difficult or impossible for Respondent to \n adequately defend against those stale claims. Equity bars Petitioner’s claims under the \n doctrine of laches due to her lack of diligence and the resulting harm to Respondent.   \n     iv. Unclean Hands:  Petitioner has acted with unclean hands by engaging in serious \n mis"}
{"id": "9a37baaa3f990a8492a3442a03e0998fb0e4738f", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "laims under the \n doctrine of laches due to her lack of diligence and the resulting harm to Respondent.   \n     iv. Unclean Hands:  Petitioner has acted with unclean hands by engaging in serious \n misconduct in relation to the matters before the Court. Petitioner’s false accusations, \n fraud on the community, misuse of legal process, and other bad-faith litigation tactics \n directly relate to the subject of this suit and undermine her requests for equitable relief. \n The Court should deny Petitioner any equitable relief (such as a disproportionate property \n division or restrictions on Respondent) because her own conduct has been wrongful and \n in bad faith, and detrimental to the well being of the Children in this case.  \n     v. Limitations: To the extent that Petitioner’s pleadings attempt to assert any causes of \n action independent of the divorce and conservatorship (for example, tort claims or other \n civil claims for damages), Respondent asserts that such claims are barred in whole or in \n part by applicable statutes of limitations . Petitioner should not be permitted to circumvent \n time limits for bringing claims by packaging them into a late-filed amended divorce \n petition. Respondent ’s allegations remain unrebutted on the record, and absent a \n response, Petitioner has not raised any defenses to the allegations brought against her.  \n Petitioner has shown a pattern of litigating only when to prevent an adverse ruling, and \n such conduct should not be tolerated by the Court. The Court should therefore take \n judicial notice of Petitioner ’s inconsistencies throughout this case.\n\n4 \n D. Jurisdiction and Venue    \n6.  Jurisdiction:  The Court has jurisdiction over this divorce proceeding, as well as over the \nchildren of the marriage, under the Texas Family Code. Petitioner or Respondent (or both) have \nbeen domiciled in Texas for the preceding six-month period and have been residents of Tarrant \nCounty for the preceding 90-day period, as required by Texas"}
{"id": "526be1db4e23e43d44243cc15bdced4beabb658f", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "de. Petitioner or Respondent (or both) have \nbeen domiciled in Texas for the preceding six-month period and have been residents of Tarrant \nCounty for the preceding 90-day period, as required by Texas Family Code § 6.301.   \n7.  Venue:  Venue is proper in Tarrant County, Texas, because it is the county of the parties’ \nresidence and the county where the children reside. No other court has continuing, exclusive \njurisdiction over the children. This Court has jurisdiction to make custody dete rminations as a \nSuit Affecting the Parent -Child Relationship (“SAPCR”) in conjunction with the divorce.   \n8.  Protective Order Proceedings:  There are no active protective orders in effect between \nthe parties at this time. Petitioner did previously file an application for a family violence protective order (a Title IV protective order) in late 2023, but that proceeding was nonsuited and resulted in no finding of family violence. Thus, no protective order currently restrains Respondent, and no prior finding of family violence exists in this case.   \nE. Children of the Marriage   \n9.  Children:  Petitioner and Respondent are the parents of two minor children, namely \nM.E.M.  and C.R.M . M.E.M. and C.R.M. are the only children born to or adopted by the parties \nduring the marriage, and both are subjects of this suit. To the best of Respondent’s knowledge, no other children were born to the Petitioner during the marriage, and Petitioner is  not pregnant at \nthis time.\n\n5 \n 10.  UCCJEA Disclosure:  In compliance with the Uniform Child Custody Jurisdiction and \nEnforcement Act (Texas Family Code Chapter  152), Respondent states the following: The \nchildren have lived with both Petitioner and Respondent in the State of Texas for their entire \nlives (and c ertainly within the last five years).  \n11. Residence History:  From their births until on or about March 6, 2024, the children \nresided with Petitioner or Respondent at the marital residence in Tarrant County, Texas. Since March 6"}
{"id": "9b0b5eb50e95d45ee1f9c8aa166c3bac2ac48697", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ears).  \n11. Residence History:  From their births until on or about March 6, 2024, the children \nresided with Petitioner or Respondent at the marital residence in Tarrant County, Texas. Since March 6, 2024, the children have resided primarily with Petitioner (their mother) in Tarrant \nCounty at the same marital residence (after Respondent  was illegally locked out by the \nPetitioner , as described below). The children have not lived outside the State of Texas at any time \nduring the past five years. Prior Custody Proceedings:  No court of any state has exercised \ncontinuing jurisdiction over the children prior to this case. Aside from the present suit, which \nincludes this SAPCR, there have been no prior or pending legal proceedings regarding custody \nor visitation of these childr en in any jurisdiction.  \n12. No CPS Conservatorship : The children are not under the managing conservatorship of \nthe Texas Department of Family and Protective Services (Child Protective Services), and, to \nRespondent’s knowledge, no governmental agency or third party has claimed any custody or visitation righ ts with respect to the children.   \n13. No Prior Orders / Pending Actions:  Aside from the temporary orders issued in this case, no \nprior court orders  have been entered regarding the conservatorship, possession, or support of the \nchildren. Likewise, there is no pending action in any other court concerning the parent -child \nrelationship of these children. The temporary orders currently in place in this case (entered on or about March 24, 2024) were obtained by Petitioner through a  proceeding that lacked a full \nevidentiary hearing. Respondent asserts that those temporary orders — obtained under what he\n\n6 \n alleges were false pretenses — do not reflect the children’s best interests and should be vacated \nfor intentional misrepresentations  made by the Petitioner and her alleged Counsel.   \nF. Grounds for Divorce    \n14.  Insupportability:  Counter -Petitioner seeks a divorce on"}
{"id": "027b8029600f34823b4de4b92de29021feedcd0d", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": " and should be vacated \nfor intentional misrepresentations  made by the Petitioner and her alleged Counsel.   \nF. Grounds for Divorce    \n14.  Insupportability:  Counter -Petitioner seeks a divorce on the no -fault ground of \ninsupportability, as provided by Texas Family Code § 6.001. The marriage has become insupportable due to discord or conflict of personalities between Petitioner and Respondent that has destroyed the legitimate ends of the marital relationship and prevents any reasonable expectation of reconciliation.   \n15.  Cruelty (Fault Grounds) : In the alternative, Respondent pleads the fault ground of cruel \ntreatment under Texas Family Code §  6.002. Petitioner’s conduct toward Respondent during the \nmarriage has been cruel and intolerable, rendering further living together insupportable. Specific ally, Petitioner has engaged in extreme and intentionally harmful acts, including (but not \nlimited to) making false accusations of abuse, filing fraudulent or groundless legal pleadings, and causing Respondent to be excluded from the family home without a lawful basis. These actions \nconstitute cruel treatment. If proven, Petitioner’s fault should be considered by the Court in making a just and right division of the community estate and in determining conservatorship and possession of the children.   \nG. Factual Background and Unrebutted Allegations    \n16.  Overview of Petitioner’s Conduct:  Respondent’s claims in this Third Amended \nCounter -Petition arise from a pattern of misconduct by Petitioner that, to date, remains \nessentially unrebutted in the record of this case. In late 2023 and 2024, Petitioner undertook a series of calculated action s designed to remove Respondent from the marital residence, deprive\n\n7 him of access to the parties’ children, and gain an unfair advantage in this litigation. These \nactions included false claims of domestic violence, misuse of community assets, and manipulation of court procedures. Petitioner has never substantively"}
{"id": "095a28bc5331c2beeaa82bf79c530147783c01b6", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": " an unfair advantage in this litigation. These \nactions included false claims of domestic violence, misuse of community assets, and manipulation of court procedures. Petitioner has never substantively answered or refuted the core facts underlying Respondent’s allegations of this misconduct. The following facts, drawn from the court record (including the mandamus record from related appellate proceedings), are deemed or established and provide context for the re lief Respondent now seeks:   \ni. False Protective-Order Claim: Petitioner falsely asserted that an “active protective\norder” was in place against Respondent, and further represented that a prior judicial finding of family violence had been made against him – when in fact no such order or finding ever existed. Petitioner did file a Title IV family -violence protective order \napplication in December 2023, but she later dropped (nonsuited) that proceeding, and it concluded with no finding of family violence or abuse by Respondent. Nevertheless, Petitioner invoked the illusion of an “existing” protective order (and non-existent family -\n violence finding) to justify removing Respondent from the home and restricting his \naccess to the children. This misrepresentation was material, intentional, and patently false, and Petitioner has never corrected or explained it.   \nii. Removal of Respondent Without Legal Basis : On or about March 6, 2024,\nRespondent was excluded  from the marital residence and from the children’s lives via a \nself-help eviction. The mandamus record from the appellate court confirms that \nRespondent was removed from the home “without any factual basis, without holding an evidentiary hearing, and without eliciting any testimony” from Petitioner. In other words, Petitioner orchestrated Respondent’s ouster through self-help tactics and a temporary order obtained on false pretenses, rather than through any merit-based determination.\n\n8 \n  This removal violated Respondent’s due process rights and disr"}
{"id": "6c95ff886bc11c1b1674945ee5c1df0389895a4a", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "ter through self-help tactics and a temporary order obtained on false pretenses, rather than through any merit-based determination.\n\n8 \n  This removal violated Respondent’s due process rights and disregarded the requirements \n of Texas Family Code §§ 83.006 and 85.001, which mandate a prompt hearing and \n supportive findings before a protective order can justify excluding a spouse from the \n residence. Petitioner never pursued a final protective order hearing after obtaining relief, \n effectively conceding that no true emergency or actual violence existed.  Any claims of \n an emergency now should be scrutinized by this Court.  \n    iii.  Misuse and Concealment of Community Assets:  Immediately prior to filing for \n divorce, Petitioner diverted and concealed community funds for her own use, in a manner \n designed to deprive Respondent of resources and to further Petitioner’s personal \n objectives (including an extramarital relationship). Specifically, on or about December \n 15, 2023, Petitioner caused approximately $1,576 to be transferred from the parties’ joint \n marital funds to a third party’s PayPal account (believed to belong to Petitioner’s \n stepfather, Mr. Branthoover). This transfer was done covertly in an effort to hide these \n funds from Respondent. Just days later, on December 18, 2023, Petitioner filed her \n Original Petition for Divorce, claiming to be indigent (unable to pay court fees) \n immediately after having siphoned off that $1,576. This transaction amounted to an \n actual fraud on the community estate intended to disadvantage Respondent. Petitioner has \n never denied or explained the disappearance of this money. In fact, when Respondent \n served Requests for Admission to confirm Petitioner’s conduct (including the PayPal \n transfer to her stepfather’s account), Petitioner failed to respond. By operation of law, \n Petitioner is deemed to have admitted  the $1,576 transfer and the related scheme to evict \n Respondent (Tex. R. Civ. P. 198.2(c)). T"}
{"id": "3efce05968cf0194a0f226d0b2a7145790615458", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "r’s account), Petitioner failed to respond. By operation of law, \n Petitioner is deemed to have admitted  the $1,576 transfer and the related scheme to evict \n Respondent (Tex. R. Civ. P. 198.2(c)). These deemed admissions conclusively establish\n\n9 \n  that Petitioner misappropriated community funds and attempted to mislead the Court \n about the couple’s financial situation.   \n    iv.  Procedural Misconduct and Bad-Faith Litigation: Petitioner effectively \n disengaged from this case for nearly two years after her initial filings, only to resurface at \n a critical juncture in an apparent effort to derail Respondent’s progress. On November 24, \n 2025 – just one day before a hearing was set on Respondent’s no-evidence motion for \n summary judgment – Petitioner filed a Second Amended Petition for Divorce brimming \n with brand-new allegations of long -term child abuse and neglect by Respondent. The \n timing and content of this filing strongly suggest that Petitioner sought to manufacture a \n last-minute “emergency” narrative to avoid an imminent adverse ruling (just as she did \n with the ex parte application at the case’s outset). Notably, these late assertions flatly \n contradict the established record (including evidence in the mandamus record and \n Petitioner’s deemed admissions) and were not accompanied by any new credible \n evidence. Petitioner has persisted in a discredited narrative – continuing to accuse \n Respondent of heinous conduct without evidentiary support – while ignoring the contrary \n proof on file. Texas courts have recognized such tactics as constituting bad-faith litigation \n and have approved sanctions in similar circumstances. Petitioner’s Second Amended \n Petition and related filings appear calculated primarily to prolong her control over the \n residence and children, and to prevent a merits -based resolution of Respondent’s claims, \n rather than to seek truth or justice.   \nH. Best Interests of the Children  \n17.  All of the foregoing unrebutted "}
{"id": "5d7a6e124a1e72fc20b725781dfceaa7ee22cc6e", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "nce and children, and to prevent a merits -based resolution of Respondent’s claims, \n rather than to seek truth or justice.   \nH. Best Interests of the Children  \n17.  All of the foregoing unrebutted facts demonstrate that Petitioner has subordinated the \nchildren’s best interests to her own tactical aims. By falsely claiming the children were in danger\n\n10 \n and by excluding a loving parent (Respondent) from the home, Petitioner disrupted the children’s \nstability and financial security without any legitimate justification. In contrast, Respondent has been the children’s primary financial provider and a consist ently positive presence in their lives. \nThere is no credible evidence that Respondent has ever physically or emotionally abused the \nchildren or Petitioner. Indeed, no court or agency has made any finding of family violence or \nabuse by Respondent. Under Texas law, the best interest of the child  is “the primary \nconsideration” in determinations of conservatorship, possession, and access (Tex. Fam. Code § 153.002). Moreover, absent credible evidence of a history or pattern of abuse, Texas public policy favors children having frequent and continuing contact with both parents in a safe, stable \nenvironment. Petitioner’s conduct – involving false protective -order claims, a self -help eviction \nof Respondent, blocking communication between the children and Respondent, and repeated attempts to deny Responde nt access without evidence of danger – is exactly the type of behavior \nthat courts deem contrary to a child’s best interests. In light of these facts, Respondent seeks the conservatorship and other relief outlined below to protect the children’s welfare an d restore \nstability to their lives. (Notably, Petitioner’s unilateral self -help eviction of March 6, 2024 has \nnever been substantiated with any proper evidence or justification.)   \nI. Conservatorship and Managing Conservator Request   \n18.  Conservatorship Requested:  Respondent requests that he be ap"}
{"id": "4b3e7a0ddd346ad12707895ff597431e13724573", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "4 has \nnever been substantiated with any proper evidence or justification.)   \nI. Conservatorship and Managing Conservator Request   \n18.  Conservatorship Requested:  Respondent requests that he be appointed Sole Managing \nConservator of the minor children, with Petitioner to be appointed as a Possessory Conservator . \nAs sole managing conservator, Respondent would hold all rights and duties afforded by law to a managing conservator, including (but not limited to) the exclusive right to designate the children’s primary residence. Respondent’s appointment as sole managi ng conservator is in the \nchildren’s best interest (Tex. Fam. Code §  153.002), given the circumstances described herein.\n\n11 \n Respondent is a fit and capable parent who has consistently acted in the children’s best interests, \nproviding for their financial, educational, and emotional needs. By contrast, Petitioner’s recent actions have destabilized the children’s living situation and needlessly deprived them of their father without any legitimate cause. There is no credible evidence of any history or pattern of \nfamily violence or abuse by Respondent that would weigh against his conservatorship (see Tex. Fam. Code § 153.004). In fac t, the record affirmatively demonstrates an absence of any such \nfindings despite Petitioner’s allegations to the contrary. Respondent further specifically rebuts the statutory presumption that appointing both parents as joint managing conservators is in the children’s best interest (Tex. Fam. Code §  153.131). Given Petitioner’s demonstrated disregard \nfor the children’s welfare and her manipulative conduct, appointing Petitioner as a joint managing conservator would not be in the children’s best interest and would significantly impair \nthe children’s emotional development and well -being. Therefore, the circumstances necessitate \nthat Respondent serve as the children’s sole managing conservator for their protection and stability until Petitioner can show that she can p"}
{"id": "ecf4f3ba8fbc6c6ccc60a42d0fc9ce32cafa5143", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "and well -being. Therefore, the circumstances necessitate \nthat Respondent serve as the children’s sole managing conservator for their protection and stability until Petitioner can show that she can prioritize the Children over her own personal \naffairs .   \n19.  Best-Interest Factors: The appointment of Respondent as the children’s managing \nconservator will ensure that they have a safe, stable, and nurturing home. Respondent can \nprovide continuity and meet the children’s needs without the turmoil that has resulted from \nPetitioner’s unsu bstantiated allegations. Texas public policy encourages that children have \nfrequent and continuing contact with parents who can act in their best interest (Tex. Fam. Code § 153.001). In this case, Respondent has demonstrated his commitment to the children’ s well -\nbeing by actively litigating to correct Petitioner’s damaging actions while Petitioner remained \nabsent or silent for long periods. Petitioner’s interference with the father –child relationship was\n\n12 \n not grounded in any actual risk to the children; maintaining such an unwarranted separation is, in \nitself, harmful to the children. The children’s best interests are served by restoring normal, healthy access to their father and by placing decision -making authority with the parent who has \nacted responsibly on their behalf.  There is no evidence or reason to assume that just because the \nPetitioner ’s grandparents reside next -door means that Petitioner is best suited to remain in the \nhome. This record reflects the opposite. Petitioner has introduced her affair into the Children ’s \nlives,  disrupted their day -to-day routine, and has  failed to provide any meaningful at tempt to \nfoster a relationship between Respondent and the children throughout this case , contrary to the \norders she obtained through false pretenses. \n20.  No Need for Restrictions on Respondent:  Because there is no evidence that Respondent \nposes any danger or risk of harm to the children, Res"}
{"id": "6939576aaff0a0666dc287dd25fbcb4ae3f72118", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": " to the \norders she obtained through false pretenses. \n20.  No Need for Restrictions on Respondent:  Because there is no evidence that Respondent \nposes any danger or risk of harm to the children, Respondent requests that no restrictive \nconditions  (such as supervised visitation or limited access periods) be placed on his possession of \nor access to the children. Respondent should enjoy the full rights of possession and access that \nnormally accompany sole managing conservatorship. Any prior temporary orders that curtailed Respondent’s access were issued without a full hearing on the merits and were based on Petitioner’s misleading claims  such as false consent, non-existent hearings, and non -existent \nevidence ; such orders should be dissolved or modified, as they are not supported by credible \nevidence. Under Texas Family Code § 153.004, a court may restrict a parent’s access only upon \ncredible evidence of a history or pattern of family violence or abuse by that  parent. Here, no such \nevidence exists with respect to Respondent. Thus, there is no statutory or factual basis to deny him any aspect of the usual rights and time with the children. On the contrary, continuing to limit \nRespondent’s role in the children’s lives would itself be contrary to the children’s best interests.\n\n13 \n 21.  Possessory Conservatorship for Petitioner : Respondent acknowledges that, absent a \nfinding under Texas Family Code § 161.001 (parental termination grounds) or other \nextraordinary circumstances, Petitioner (the mother) is ordinarily entitled to be appointed as at least a possessory conservator of the children with appropriate visitation. However, Respondent \nurges the Court to carefully condition  Petitioner’s possession and access on terms that truly \nprotect the children’s best interests, given Petitioner’s demonstrated willingness to undermine the children’s relationship with their father and to misuse legal processes. If Petitioner is appointed a \nconservator, Respondent"}
{"id": "a8e2577cf03001553177ad2c7ae3f76cb436daaa", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "t interests, given Petitioner’s demonstrated willingness to undermine the children’s relationship with their father and to misuse legal processes. If Petitioner is appointed a \nconservator, Respondent requests that the Court impose safeguards such as a “morality clause” (prohibiting overnight unrelated adults during possession) and orders enjoining Petitioner from making disparaging or false statements in the children’s presence, to prevent further emotional harm to the children. Additionally, as addressed below, if it is found that Petitioner knowingly made false reports of abuse concerning the children, Respondent asks that the Court impose any further restrictions on Petition er’s access — including supervised visitation, if necessary — that \nare authorized by law (Tex. Fam. Code § 261.107) to protect the children. Subject to such \nsafeguards, Respondent requests that Petitioner’s periods of possession be ordered in a specific, defined schedule consistent with the Texas Family Code’s Standard Possession Order (Tex. Fam. Code § 153.312) or as otherwise tailored by the Court to serve the children’s best interests.  In \nother words, Respondent proposes that Petitioner, as possessory conservator, receive the typical possession periods provided by statute (for example, weekends and mid-week periods per the Standard Possession Order) unless  the Court finds that a more restrictive or supervised schedule \nis necessary for the children’s safety and welfare in light of Petitioner’s conduct.\n\n14 \n 22.  Exclusive Use of Marital Residence:  Respondent requests that he be awarded the \nexclusive use, possession, and occupancy of the marital residence (the family home), effective \nimmediately. The marital residence is located at the address currently on file with this Court and has been the child ren’s home and the family’s primary residence throughout the marriage. \nRespondent was wrongfully evicted from this home in March 2024 by Petitioner’s unilateral actions, without any l"}
{"id": "a9e0895a7a50fc6b0ab0224ed01bc66dbde64455", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": " been the child ren’s home and the family’s primary residence throughout the marriage. \nRespondent was wrongfully evicted from this home in March 2024 by Petitioner’s unilateral actions, without any lawful court order authorizing such eviction at that time. The loss of the family home as a residence for Respondent and the children was a direct result of Petitioner’s fraudulent filings and misrepresentations, not due to any conduct by Respondent that would justify removal. It is in the children’s best interest to restore stability in their living arrangements by allowing them to reside once again in the marital home under Respondent’s care and primary custody. Respondent has maintained (and continues to have) the financial ability to support and upkeep the home, and he is pre pared to provide a safe, stable environment there for the children. \nGranting Respondent exclusive use of the residence will ensure continuity and familiarity for the children and will help prevent further conflict between the parties. Petitioner, having in stigated \nRespondent’s ouster without legal basis, should not be rewarded by being allowed to continue occupying the home. Respondent asks that Petitioner be ordered to vacate the marital residence (if she has not done so already) and to surrender any keys, garage door openers, passwords, or other access devices to the home. Furthermore, Respondent asks that Petitioner be enjoined from entering or coming about the residence without Respondent’s permission or a further order of the Court. Respondent asserts t hat the financial losses and domestic instability caused by Petitioner’s \nimproper actions can only be remedied by permitting Respondent to return to the home from which he was removed.  Petitioner has access to several alternative housing options while the Respondent maintains the status -quo, which woul d allow both parents to remain in their lives.\n\n15 \n 23.  Community Property and Liabilities : The parties have accumulated community \n"}
{"id": "14396ab9bb432b758ae02522c488d0471a178380", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "tions while the Respondent maintains the status -quo, which woul d allow both parents to remain in their lives.\n\n15 \n 23.  Community Property and Liabilities : The parties have accumulated community \nproperty and incurred community debts during their marriage, all of which need to be divided in \na just and right manner by the Court. Counter -Petitioner provides the following non -exhaustive \nlist of the categories of  community assets and liabilities: Assets – including, but not limited to, \n(a) vehicles owned by the parties (including any family automobiles); ( b) financial accounts such \nas bank accounts, credit union accounts, and cash on hand; (c ) retirement accounts, 401(k) plans, \npensions, and/or IRAs in either party’s name; (d) life insurance policies with cash value (if any); (e) household furniture, appliances, electronics, jewelry, clothing, and other personal property in \nthe parties’ possession; and (f) any business interests, investments, or other assets acquired by the parties during the marriage. Liabilities  – including, but not limited to, (i ) the mortgage loan (or \nhome equity loan) encumbering the marital residence (if any); (ii) credit card debts incurred during the marriage; (iii) any personal loans, lines of credit, or promissory notes owed by either party that were incurred for the benefi t of the community; (iv) any outstanding taxes or tax \nliabilities for years of the marriage; and (v) any other community debts or obligations incurred by either party from the date of marriage up to the time of trial. An Inventory and Appraisement  \ndetailing the parties’ property and debts has been filed by Respondent in accordance with this Court ’s order , and Respondent requests that such Inventory be considered and incorporated by \nreference as necessary. Respondent will ask the Court to divide the community estate in a manner that is fair and just, with special consideration as described below for Petiti oner’s \nfinancial misconduct and fraud on the"}
{"id": "1ffaaec4e6c22208d3f5d073614b204e1ce3b100", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": ". Respondent will ask the Court to divide the community estate in a manner that is fair and just, with special consideration as described below for Petiti oner’s \nfinancial misconduct and fraud on the community.   \nJ. Claims and Causes of Action Related to the Marriage    \n24.  Fraud on the Community (Waste of Assets):  Respondent asserts that Petitioner has \ncommitted fraud on the community by wrongfully disposing of, concealing, or wasting\n\n16 \n community assets, to the detriment of Respondent and the community estate. Texas Family Code \n§ 7.009 provides that if a spouse has committed actual or constructive fraud on the community, the Court shall : (1) determine the value by which the community estate was depleted by the \nfraud; (2) create a “reconstituted estate” as if the fraud had not occurred; and (3) divide the value \nof the reconstituted estate in a manner that is just and right (which may incl ude awarding a \nmoney judgment or an appropriate share of community property to the wronged spouse). In this case, Petitioner’s surreptitious transfer of $1,576 in community funds on December 15, 2023, as described above, was a fraudulent depletion of the community estate. Petitioner acted with actual intent to deceive both Respondent and the Court by moving this money to a third party (Mr. Branthoover) and hiding it, all on the eve of filing for divorce. The transaction was not made for community purposes or in the ordinary course of household expenses; rather, it was done for Petitioner’s personal advantage (to feign indigence and to deny Respondent access to funds). Respondent pleads that this act by Petitioner constitutes actual fraud on the community (fraud dolus ), or alternatively constructive fraud on the community (waste of community assets and \nbreach of fiduciary duty, as described below).  Petitioner further disposed of Respondent ’s \npersonal belongings, including clothing, tools, and other household items to be determined upon re-entry. \n25. Reconstitute"}
{"id": "8afc3a51d1c62f5b0ab87136acdcd28a5722acea", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "ry duty, as described below).  Petitioner further disposed of Respondent ’s \npersonal belongings, including clothing, tools, and other household items to be determined upon re-entry. \n25. Reconstituted Estate and Remedy:  Respondent requests that the Court make a finding of \nthe value by which the community estate was depleted due to Petitioner’s fraudulent conduct, \nand that the Court reconstitute the community estate under Tex. Fam. Code §  7.009. Specifically, \nRespondent asks the Court to calculate at least $1,576.00 as the value by which Petitioner’s \nactions depleted the community estate. Respondent further requests that the Court award a \ndisproportionate division of the remaining community estate in Respondent’s favor, so as to\n\n17 \n compensate for this loss and achieve a just and right division. Such relief may include, for \nexample, awarding Respondent a money judgment for the $1,576 (or awarding him an equivalent amount of property or value from the marital estate to offset that loss ), plus  any additional \namounts the evidence may show Petitioner dissipated or secreted away. To the extent the \nmisappropriated funds have not been fully accounted for by Petitioner, Respondent requests an accounting and turnover of those funds. Respondent also se eks any appropriate exemplary relief \nor fee reimbursement if the Court finds that Petitioner acted willfully and maliciously in defrauding the community. The Texas Supreme Court has recognized that a spouse’s intentional fraud can justify significant relie f in a divorce context, and Tex. Fam. Code § 7.009 mandates \nrobust remedies to rectify fraud on the community estate.   \n26.  Breach of Fiduciary Duty: Respondent pleads in the alternative that Petitioner’s conduct \nconstitutes a breach of fiduciary duty owed to Respondent with respect to the management of \ncommunity property. During the marriage, Petitioner and Respondent owed each other the \nhighest duty of good faith and fair dealing in handling community a"}
{"id": "d2fff4fae55984c4144d11589faa8ab1ceac0594", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 2000, "text": "espondent with respect to the management of \ncommunity property. During the marriage, Petitioner and Respondent owed each other the \nhighest duty of good faith and fair dealing in handling community assets and financial affairs. Petitioner breached  this fiduciary duty by willfully misusing community funds for her sole \nbenefit and by failing to be candid with Respondent (and the Court) about community finances. Specific acts of breach include: (a) withdrawing $1,576 of community funds without \nRespondent’s knowledge or consent and diverting those funds to a third party’s account; (b) \nattempting to hide or underreport community assets to the Court (for example, filing an \nindigency affidavit immediately after secreting away funds, thereby misrepresenting  the true \nfinancial picture); and (c) wrongfully expending community resources on personal litigation \nmaneuvers (such as obtaining legal services and ex parte orders under false pretenses) rather than \nfor legitimate community purposes. These actions were d one willfully and with intent to gain an\n\n18 \n unfair advantage in the divorce and custody dispute, to Respondent’s detriment. Under Texas \nlaw, a willful breach of fiduciary duty by one spouse in handling community property can warrant a disproportionate division of the community estate or other equita ble relief in favor of \nthe wronged spouse. Respondent seeks a finding that Petitioner breached her fiduciary duty, and \nhe requests that the Court award appropriate damages and equitable relief as a result. Such relief should include, inter alia, awarding Respondent an unequal (greater) share of the remaining community estate and/or a money judgment to compensate Respondent for the losses caused by Petitioner’s breach. If deemed appropriate, Respondent also seeks to recover his reasonable attorney’s fees  and costs necessary to uncover and prosecute the breach, as allowed by law.   \n27.  Conversion (Community Property):  Independently of the above claims, Resp"}
{"id": "75571ecb84bc5ffc914389855281b9e40294ca03", "vector_id": 19, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 19, "char_len": 2000, "text": "to recover his reasonable attorney’s fees  and costs necessary to uncover and prosecute the breach, as allowed by law.   \n27.  Conversion (Community Property):  Independently of the above claims, Respondent \nasserts a claim for conversion against Petitioner for wrongfully exercising dominion and control \nover community property that belongs in part to Respondent. The $1,576 in community funds \nthat Petitioner transferred and concealed was community property in which Respondent had a \npossesso ry and ownership interest. By intentionally taking and exercising control over those \nfunds for her exclusive use (and denying Respondent access to or use of them), Petitioner committed the tort of conversion under Texas law. Petitioner’s conduct meets all the elements of conversion: Respondent had a legal possessory interest in the funds; Petitioner wrongfully \nassumed and exercised dominion or control over the funds in a manner inconsistent with \nRespondent’s rights; and Respondent has been deprived of the use and benefit of the funds. \nPetitioner’s failure and refusal to return the $1,576 upon demand (evidenced by Respondent’s \npre-suit demand and Petitioner’s non -response in discovery) further confirms the wrongful nature \nof Petitioner’s possession of those funds. Respondent requests that the Court enter judgment in \nhis favor for the value of the property converted (at least $1,576), together with legal interest\n\n19 \n thereon, as well as any consequential damages proven to have resulted from Respondent’s loss of \nuse of the funds. Although Texas law often addresses a spouse’s financial misconduct through equitable division rather than separate tort damages, a specific fi nding of conversion in this case \nwill underscore the willful and wrongful nature of Petitioner’s actions and will support the relief \nsought under Tex. Fam. Code § 7.009 and the Court’s broad equitable powers in the division of property.   \n28.  False Reports of Child Abuse : To the extent the record sh"}
{"id": "bdda63cec839664d6847b56350924b2b53f52e89", "vector_id": 20, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 20, "char_len": 2000, "text": " and will support the relief \nsought under Tex. Fam. Code § 7.009 and the Court’s broad equitable powers in the division of property.   \n28.  False Reports of Child Abuse : To the extent the record shows that Petitioner knowingly \nmade false reports of child abuse or neglect against Respondent to any governmental authority (such as Child Protective Services or law enforcement), Respondent invokes Texas Family Code § 261.107. Under this statute, a person who knowingly makes a false report of child abuse commits an offense and may be held civilly liable, and the court may take certain remedial \nactions for the benefit of the falsely accused party. If the Court finds that Petitioner or her \ncounsel made an y report of abuse concerning the children that was false or made with no factual \nfoundation, Respondent requests the following relief pursuant to Tex. Fam. Code § 261.107: (a) \nan order restricting or conditioning Petitioner’s access to the children , including supervised \nvisitation if warranted, so as to protect the children from further manipulation or emotional harm; \nand (b) an order requiring Petitioner to pay Respondent’s reasonable attorney’s fees, court costs, \nand other expenses  incurred as a result of the false report. Making false abuse allegations is a \nsevere breach of parental responsibility and violates public policy, as it not only harms the accused parent and the children’s relationship with that parent, but also diverts attention and \nresources from legitimate claims of abuse. While Section  261.107 does not create an independent \ntort for damages in a divorce case, it does explicitly provide for sanctions and fee -shifting within \nthe custody determination context. Respondent pleads that the Court, in adjudicating\n\n20 \n conservatorship and possession, should make the findings and orders authorized by this statute if \nthe evidence establishes that Petitioner engaged in making false abuse reports. If Petitioner indeed made maliciously false report"}
{"id": "5ecdec6a7b962e1c1462135db3a059f36dfda4a1", "vector_id": 21, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 21, "char_len": 2000, "text": "n, should make the findings and orders authorized by this statute if \nthe evidence establishes that Petitioner engaged in making false abuse reports. If Petitioner indeed made maliciously false reports, such conduct further just ifies limiting her conservatorship \nrights and supports Respondent’s request to be sole managing conservator in the children’s best \ninterests.   \n29.  Sanctions for Groundless or Bad-Faith Pleadings : Respondent requests that the Court \nimpose appropriate sanctions  on Petitioner (and/or Petitioner’s counsel, as applicable) under \nTexas Rule of Civil Procedure 13 and Chapter 10 of the Texas Civil Practice and Remedies Code. Rule  13 and Chapter 10 authorize courts to sanction parties who file pleadings that are \ngroundl ess and brought in bad faith or for the purpose of harassment, and to sanction those who \nmake factual contentions without evidentiary support. In this case, Petitioner’s litigation conduct \nwarrants the imposition of sanctions for the following reasons:   \n    i.  Groundless Amended Petition : Petitioner’s Second Amended Petition for \n Divorce (filed November 24, 2025) is a prime example of a groundless and bad-faith \n pleading. It reasserts and embellishes allegations of “a history or pattern of family \n violence, child abuse, and child neglect” by Respondent at a time when Petitioner had \n already effectively lost her protective order case (with no findings of abuse) and had \n failed to respond to discovery requests aimed at those very allegations. By filing that \n amended petition – filled with accusations that directly contradict the established record – \n Petitioner persisted in a narrative that had been refuted by the evidence (including her \n own deemed admissions). She effectively attempted to mislead the Court with allegations \n lacking any reasonable evidentiary basis. Such conduct falls squarely within pleadings\n\n21 \n  made for an improper purpose and without support, which Rule  13 and Chapter 10 are \n designed "}
{"id": "8775ad7ff2123a70659cbe47da898de359f5d799", "vector_id": 22, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 22, "char_len": 2000, "text": "egations \n lacking any reasonable evidentiary basis. Such conduct falls squarely within pleadings\n\n21 \n  made for an improper purpose and without support, which Rule  13 and Chapter 10 are \n designed to address.   \n    ii.  Pattern of Abuse of Process : Petitioner’s pattern of conduct throughout this case \n reflects an abuse of the judicial process: she initiated claims and obtained orders based on \n false statements (e.g., the ex parte protective order and temporary custody orders), then \n abandoned those claims when challenged (e.g., nonsuiting the protective order \n proceeding) only to later raise new, inconsistent accusations, all while evading her \n discovery obligations. Texas appellate courts have upheld sanctions in analogous \n situations where a litigant files serial pleadings that ignore known facts or court orders \n and continue to accuse the opposing party without evidence. Petitioner’s actions appear \n calculated to maintain control of the residence and children by continuously changing her \n story and forcing Respondent to defend against shifting, unfounded claims. This is \n precisely the type of litigation conduct that Rule 13 and Chapter 10 seek to deter and \n punish.   \n30.  Requested Sanctions:  In light of the above, Respondent asks that the Court impose \nsanctions sufficient to punish Petitioner’s misconduct and deter similar abuse of the judicial \nprocess. Respondent specifically requests that the Court: (a) strike or dismiss  Petitioner’s Second \nAmended Petition for Divorce (and deny Petitioner any further leave to replead in this matter) as a sanction for her bad-faith and groundless pleading; (b) award monetary sanctions  in the form of \nreimbursement to Respondent of his attorney’s fees and expenses incurred because of Petitioner’s frivolous filings and discovery abuse; and (c) issue any further orders deemed necessary to curb Petitioner’s harassment of Respondent – such a s fines payable to the Court, or \nan injunction requiring Petitioner"}
{"id": "657324f009557d63057682e228f23e4019ddd4e5", "vector_id": 23, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 23, "char_len": 2000, "text": "lings and discovery abuse; and (c) issue any further orders deemed necessary to curb Petitioner’s harassment of Respondent – such a s fines payable to the Court, or \nan injunction requiring Petitioner to obtain court approval before filing additional pleadings in\n\n22 \n this case. These sanctions are expressly authorized by Tex. R. Civ. P.  13 and Tex. Civ. Prac. & \nRem. Code §§ 10.004–.005 (which permit monetary sanctions, injunctive remedies, and other \ndirectives to punish and prevent repetition of sanctionable conduct). Considering the egregiousness of Petitioner’s actions – including lying to the Court about a protective order, \norchestrating an unjustified eviction of Respondent, and attempting to derail the proceedings with last -minute false allegations – strong sanctions are justified to uphold the integrity of the \ncourt and to protect the best interests of the children.   \n31.  Rule 13 Certification : As required by Tex. Civ. Prac. & Rem. Code § 10.001, \nRespondent (by and through undersigned counsel, if any) certifies that the factual contentions in this pleading have evidentiary support or, at a minimum, are likely to have evidentiary support after further investigation and discovery. Respondent also certifies that this Third Amended \nCounter -Petition for Divorce is not brought for any improper purpose such as to harass or to \ncause unnecessary delay or needless increase in the cost of litigation. Respon dent further states \nthat he has tried in good faith to resolve the issues raised by Petitioner’s frivolous filings without \ncourt intervention, but such efforts have been unsuccessful due to Petitioner’s lack of cooperation.   \n32.  Judicial Notice and Deemed Admissions : Respondent respectfully requests that the \nCourt take judicial notice of certain facts and records in support of this Counter -Petition, \npursuant to Texas Rule of Evidence  201. In particular, Respondent asks the Court to take notice \nof the following:   \n    i.  Deemed Admissions:  "}
{"id": "4e715533bf5a9177e07ded12680db77e4fb3108a", "vector_id": 24, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 24, "char_len": 2000, "text": "s and records in support of this Counter -Petition, \npursuant to Texas Rule of Evidence  201. In particular, Respondent asks the Court to take notice \nof the following:   \n    i.  Deemed Admissions:  The fact that Petitioner failed to timely respond to \n Respondent’s  Requests for Admission (served on or about September 17, 2024), and that \n accordingly all matters in those Requests for Admission are deemed admitted  by\n\n23 operation of law (Tex. R. Civ. P. 198.2(c)). These deemed admissions include admissions \nthat Petitioner engaged in the specific misconduct alleged by Respondent (for example, the $1,576 transfer to Mr. Branthoover’s account, the lack of any genuine protective order or family -violence finding, and other fraudulent actions as outlined above). Respondent \nasks that the Court acknowledge these admissions as conclusively established facts for purposes of this case. Furthermore, Respondent requests that the Court enforce Tex. R. Civ. P. 193.6, which would prohibit Petitioner from introducing any evidence or testimony on matters she failed to disclose in discovery (absent a showing of good cause or lack of unfair surprise). In practical terms, Petitioner should not be permitted to suddenly produce evidence to contradict the deemed admissions or to support her late-\n arising allegations, given her discovery defaults.  \nii. Mandamus Record ( Appellate Proceeding s): The record of the Petition for \nWrit of Mandamus (including the Appendix and Record) that Respondent filed in the \nSecond Court of Appeals at Fort Worth – In re Charles Dustin  Myers, Relator, Cause No. \n25-0361 – in connection with this case is extensive (approximately 3,900 pages) and \ncontains  material evidenc e and s worn t estimony  pertaining  to the events i n question.  \nRespondent  requests t hat this C ourt t ake judicial not ice of  the contents of  that mandamus  \nrecord,  as it forms pa rt of the court f iles r elated to t his m atter and  was exp licitly \nreferenced in prior p"}
{"id": "cc06483d98192cae694f8fdd4650485873f0eb2c", "vector_id": 25, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 25, "char_len": 2000, "text": "uests t hat this C ourt t ake judicial not ice of  the contents of  that mandamus  \nrecord,  as it forms pa rt of the court f iles r elated to t his m atter and  was exp licitly \nreferenced in prior proceedings. In particular, the mandamus record documents the \ntimeline  and details of  Petitioner’s ac tions  (including  the PayPal transfer of  community \nfunds, the ex parte proceedings removi ng Respondent from t he home, correspondence \ninvolving Mr. Branthoover, photographs showing Petitioner and the childre n together \nafter t he alleged “e mergenc y,” etc.), non e of which P etitioner ha s ever rebutted.  The\n\n24 Court’s attention is drawn to those portions of the mandamus record that were cited in \nRespondent’s earlier filings (including Respondent’s Motion to Strike Petitioner’s Second Amended Petition). Respondent submits that the mandamus materials provide a comprehensive evidentiary backdrop for the relief now sought. To the extent permissible, Respondent asks that the Court rely on the mandamus record as part of the evidentiary foundation for adjudicating the issues of fraud, conservatorship, and sanctions in this case. (Respondent can promptly provide the Court with a copy of the mandamus record or specific excerpts, if not already in the Court’s file, for ease of reference.)   \n33. The above requests for judicial notice are made so that the Court may efficiently utilize\nthe established, unrebutted facts in the record without necessitating duplicative proof at trial. Recognizing these materials will help demonstrate that Respondent’s allegations have effectively already been proven or admitted, and that Petitioner’s contrary assertions (especially those raised belatedly) lack credibility. Respondent will also move, at the appropriate time, to formally admit into evidence the deemed admissions and pertinent parts of the mandamus record, but interim judicial notice will streamline the proceedings and focus the trial on any truly disputed issues.   \nPrayer "}
{"id": "60061101ebb504610f114989b72540434a9f5a51", "vector_id": 26, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 26, "char_len": 2000, "text": "into evidence the deemed admissions and pertinent parts of the mandamus record, but interim judicial notice will streamline the proceedings and focus the trial on any truly disputed issues.   \nPrayer for Relief  \nWHEREFORE, PREMISES CONSIDERED, Counter-Petitioner Charles Dustin Myers \n(Respondent) respectfully prays that upon final trial or hearing, the Court enter judgment granting the following relief:   \ni. Divorce Granted:  That the marriage between Petitioner and Respondent be\ndissolved, a nd that a Final Decree of Divorce be en tered after an appropriate time for \nrecovery that the parties will ag ree on. Respond ent requests that the divorce be gr anted\n\n25 \n  on the no-fault ground of insupportability (Tex. Fam. Code § 6.001). In addition, \n Respondent asks the Court to recognize Petitioner’s fault in the breakup of the marriage – \n specifically, cruel treatment of Respondent – as proven at trial, and to consider such fault  \n in making a just division of the community estate and in determining conservatorship of \n the children.   \n ii.  Conservatorship of Children:  That Respondent be appointed Sole Managing \n Conservator of the minor children, M.E.M. and C.R.M., with all rights and duties \n afforded by law to a sole managing conservator (including the exclusive right to \n designate the children’s primary residence). Respondent prays that Petitioner be \n appointed Possessory Conservator , with such rights, duties, and periods of possession as \n the Court finds are in the children’s best interest, subject to appropriate conditions or \n supervision that the Court deems necessary for the children’s safety and welfare \n (particularly if it is found that Petitioner made false abuse allegations). In particular, \n Respondent requests that Petitioner’s possession and access be defined in the Final \n Decree – for example, by awarding Petitioner a Standard Possession Order schedule \n pursuant to Tex. Fam. Code § 153.312 (or an alternative schedule suited to the child"}
{"id": "7e2a8890fcd6f63d02e847734f37bd9f83e6e136", "vector_id": 27, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 27, "char_len": 2000, "text": "ccess be defined in the Final \n Decree – for example, by awarding Petitioner a Standard Possession Order schedule \n pursuant to Tex. Fam. Code § 153.312 (or an alternative schedule suited to the children’s \n needs), unless the Court determines that more restrictive measures (such as supervised \n visitation or other limitations under Tex. Fam. Code §§ 153.001, 153.004, or 261.107) are \n required to protect the children.   \n iii.  Exclusive Use of Residence:  That Respondent be awarded the exclusive use, \n possession, and occupancy of the marital residence (family home) effective immediately \n (upon entry of the Court’s orders), and that Petitioner be ordered to vacate said residence \n (if she has not already done so) by a date certain and to surrender any and all keys, garage\n\n26 \n  door openers, security codes, or other access devices to Respondent. The Court’s order \n should further enjoin Petitioner  from entering or coming about the residence without \n Respondent’s express permission or a further order of the Court. This relief is requested \n to restore the children’s home stability and because Respondent has demonstrated the \n ability to maintain the home for the children’s benefit.   \n iv.  Child Support:  That the Court order Petitioner to pay child support  to \n Respondent for the support of the children. Respondent requests that child support be set \n in an amount in accordance with the Texas Child Support Guidelines (Tex. Fam. Code \n Chapter 154) or in such other amount as the Court finds just and appropriate under the \n circumstances (including consideration of any disproportionate division of the estate in \n Respondent’s favor). In particular, Respondent notes that under the guidelines, support \n for two children would typically be 25% of the obligor’s net resources  (Tex. Fam. Code \n § 154.125(b)), and Respondent asks that support be ordered at or around that percentage \n absent good cause for deviation. If the Court finds that Petitioner is currently ea"}
{"id": "4660ec22accb06abdb1d89b54b396204db0b14c7", "vector_id": 28, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 28, "char_len": 2000, "text": "sources  (Tex. Fam. Code \n § 154.125(b)), and Respondent asks that support be ordered at or around that percentage \n absent good cause for deviation. If the Court finds that Petitioner is currently earning \n little or no income, Respondent requests the Court to set child support at a reasonable \n minimum amount and to include a step -up provision or a future review, based on \n Petitioner’s earning potential or future employment, given that Petitioner has \n demonstrated the ability to manage substantial funds during the marriage and is capable \n of gainful employment.   \n v.  Health Insurance and Medical Support : That the Court order appropriate \n provisions for the children’s health insurance and medical support. Respondent \n respectfully requests that he be ordered to maintain health insurance coverage for the \n children (as it is available to him through employment at a reasonable cost), and that\n\n27 \n  Petitioner be ordered to contribute to the cost of the children’s health insurance premiums \n or pay cash medical support in an amount determined under the Texas Family Code \n guidelines. Additionally, Respondent asks that the Court order each party to pay fifty \n percent (50%) of all reasonable and necessary uninsured or unreimbursed medical, \n dental, vision, and pharmaceutical expenses incurred for the benefit of the children. These \n provisions are requested pursuant to Texas Family Code §§ 154.008, 154.181, and related \n statutes, to ensure the children’s healthcare needs are adequately met.   \n vi.  Division of Community Property:  That the Court make a just and right division \n of the parties’ community estate, with special consideration given to Petitioner’s fraud on \n the community  and breach of fiduciary duty as established at trial. Respondent requests \n that he be awarded a disproportionate share  of the community property to compensate for \n the financial losses and damage caused by Petitioner’s misconduct. In particular, \n Respondent requests that t"}
{"id": "eaae85d271fa99c10e9ef77621238bc29fcc61b8", "vector_id": 29, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 29, "char_len": 2000, "text": "hat he be awarded a disproportionate share  of the community property to compensate for \n the financial losses and damage caused by Petitioner’s misconduct. In particular, \n Respondent requests that the Court’s property division include, but not be limited to, the \n following elements:   \n     a. Money Judgment for Misappropriated Funds:  A judgment in favor of   \n  Respondent for the $1,576 that Petitioner removed from the community estate (or, \n  alternatively, an award to Respondent of other property of equivalent value to  \n  offset that loss), pursuant to Tex. Fam. Code § 7.009 (reconstitution of estate due  \n  to fraud).   \n     b. Unequal Division in Respondent’s Favor:  An unequal division of any remaining \n  community assets in Respondent’s favor (for example, awarding Respondent a  \n  greater share of the equity in the marital residence, a greater portion of the parties’ \n  financial accounts, a larger portion of retirement benefits, etc.) as necessary to\n\n28 \n   achieve a just result in light of Petitioner’s waste of community assets and her  \n  litigation misconduct.   \n     c. Confirmation of Separate Property / Reimbursement: Confirmation of any  \n  property found to be Respondent’s separate property (if any such property is  \n  identified by the record), and appropriate reimbursement  to Respondent’s separate \n  estate for any community funds or assets that Petitioner misused for her sole  \n  benefit (or for the benefit of her separate estate).   \n     d. Equitable Monetary Award : Any other equitable monetary award or the  \n  impressing of a constructive trust as needed to reimburse or restore  to Respondent \n  the value of community assets that Petitioner has concealed, spent, or otherwise  \n  disposed of in fraud of Respondent’s rights.   \n vii.  Fraud and Tort Findings:  That the Court, in its Final Decree, include specific \n findings  that Petitioner engaged in fraud on the community , breach of fiduciary duty , and \n conversion of community prop"}
{"id": "e01bf20fe1aed49fea07da4da3fc5b656d9adf12", "vector_id": 30, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 30, "char_len": 2000, "text": " and Tort Findings:  That the Court, in its Final Decree, include specific \n findings  that Petitioner engaged in fraud on the community , breach of fiduciary duty , and \n conversion of community property, and that such conduct was intentional or constituted \n constructive fraud on Respondent’s rights. Respondent further requests a finding that \n Petitioner conspired with one or more third parties to commit the foregoing wrongful \n acts. These findings will serve to support and justify the unequal property division and \n any monetary relief awarded to Respondent, and will establish the willful and malicious \n nature of Petitioner’s actions for the record. (To the extent allowable, Respondent also \n seeks exemplary damages or sanctions based on these findings, as set forth elsewhere in \n this pleading.)\n\n29 \n  viii. Sanctions (Rule  13 & Chapter  10): That the Court impose appropriate sanctions  \n against Petitioner under Texas Rule of Civil Procedure 13 and Chapter 10 of the Texas \n Civil Practice & Remedies Code, for filing groundless pleadings brought in bad faith and \n for abusing the judicial process. In particular, Respondent prays that the Court’s judgment \n or orders provide for the following sanctions:   \n     - Strike Pleadings:  An order striking or dismissing Petitioner’s Second Amended  \n  Petition for Divorce, and denying Petitioner any further opportunity to re -plead  \n  those stricken allegations, as a sanction for her bad -faith and harassing   \n  accusations that lacked evidentiary support.   \n   - Monetary Sanctions (Fees & Costs):  An award to Respondent of monetary  \n  sanctions suffici ent to cover all or a substantial portion of Respondent’s attorney’s \n  fees, court costs, and litigation expenses  that were incurred as a result of   \n  Petitioner’s frivolous pleadings and discovery abuse.  \n     - Penalty/Fine:  Assessment of an appropriate further penalty or fine against  \n  Petitioner (whether payable to the Court, to Respondent, or both, a"}
{"id": "0e1e7995bb2c69766c6befe269bab77ea6c647ea", "vector_id": 31, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 31, "char_len": 2000, "text": "’s frivolous pleadings and discovery abuse.  \n     - Penalty/Fine:  Assessment of an appropriate further penalty or fine against  \n  Petitioner (whether payable to the Court, to Respondent, or both, as the Court  \n  deems just) to deter Petitioner and others from similar misconduct.   \n     - Additional Sanctions:  Any other sanction or remedy that the Court finds just  \n  and proper, including but not limited to: contempt findings if warranted, an award  \n  requiring Petitioner to pay expert witness fees incurred by Respondent due to  \n  Petitioner’s conduct, and/or injunctive directives to control Petitioner’s future  \n  conduct in this litigation (such as requiring court approval before Petitioner files\n\n30 \n   additional pleadings or motions, if she has demonstrated a pattern of bad -faith  \n  filings).   \n ix.  Relief per Texas Family Code §  261.107 : The record shows that Petitioner \n knowingly made one or more false claims  of child abuse or neglect against Respondent, \n and pursuant to Texas Family Code § 261.107, Respondent requests that the Court grant \n appropriate relief, including:   \n     a. An order restricting Petitioner’s access to the children , such as requiring that  \n  any periods of possession by Petitioner be continuously supervised by a neutral  \n  third party or occur in a supervised visitation facility, and/or otherwise   \n  conditioning Petitioner’s access on terms that protect the children’s best interests  \n  and well -being; and   \n     b. A judgment awarding Respondent his reasonable attorney’s fees, court costs,  \n  and other expenses  incurred due to the false report(s) made by Petitioner.   \n x.  Judicial Notice & Admissions in Final Judgment : That the Court, in its final \n judgment or decree, expressly acknowledge and incorporate the following: (a) all facts \n that were deemed admitted  by Petitioner’s failure to respond to Respondent’s Requests \n for Admission – thereby making those facts conclusively established for purposes of"}
{"id": "ddb5cb14181e232071f839a7e6d720cc2c4b1bcb", "vector_id": 32, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 32, "char_len": 2000, "text": " following: (a) all facts \n that were deemed admitted  by Petitioner’s failure to respond to Respondent’s Requests \n for Admission – thereby making those facts conclusively established for purposes of this \n case; and (b) any pertinent facts or evidence from the appellate mandamus record (from \n In re Charles Dustin Myers , No.  25-0361 of which the Court has taken judicial notice or \n which have been admitted into evidence at trial. By incorporating these established facts \n into the final judgment, the Court will ensure that the judgment is based on the full and\n\n31 \n  true factual record as revealed by the unrebutted evidence, and not merely on Petitioner’s \n late-arising allegations.   \n xi.  Tax Exemptions : That the Court allocate the federal income tax dependency \n exemptions (and any associated child tax credits or other tax benefits) for the parties’ \n children in a manner that maximizes the children’s financial benefit. In particular, \n Respondent requests that he be awarded the right to claim the children as dependents for \n federal income tax purposes each year (or, alternatively, in alternating years or in \n proportion to the parties’ financial contributions, as the Court deems just). As the parent \n who will have primary custody of the children and bear the majority of their expenses, \n Respondent asks that he be entitled to claim the children and any available tax credits \n (such as the child tax credit or earned income credit, if applicable) in order to better \n provide for the children’s needs. If an IRS form (such as Form  8332) or other \n documentation is required to effectuate this allocation, Respondent requests that \n Petitioner be ordered to promptly execute any such form to confer the tax \n exemptions/credits to Respondent as ordered by the Court.   \n xiii.  General Relief : That Respondent be awarded such other and further relief, both \n general and special, at law or in equity, to which he may be justly entitled. This includes \n (but is not"}
{"id": "914e76d9008d4703d8a603ccde6f7a2f944a192a", "vector_id": 33, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 33, "char_len": 2000, "text": ".   \n xiii.  General Relief : That Respondent be awarded such other and further relief, both \n general and special, at law or in equity, to which he may be justly entitled. This includes \n (but is not limited to) an award of post -judgment interest at the highest lawful rate on any \n monetary judgment in Respondent’s favor from the date of judgment until paid, and all \n writs or orders necessary to enforce the final decree after a reasonable recovery period .   \nRespectfully submitted,\n\n32 \n /s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  (Respondent/Counter -Petitioner, Pro Se)   \n6641 Anne Court   \nWatauga, Texas 76148   \nTelephone: 817-546-3693   \nEmail: ChuckDustin12@gmail.com   \n \n \n \nCertificate of Service  \n I hereby certify that a true and correct copy of the foregoing Third Amended Counter -\nPetition for Divorce was served on Petitioner (through her attorney of record) in accordance with \nTexas Rule of Civil Procedure 21a on this 8th day of December , 2025, by electronic service (e -\nservice) to Petitioner’s counsel of record.   \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  (Pro Se Respondent/Counter -Petitioner)\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 108811543\nFiling Code Description: Amended Filing\nFiling Description: Respondent's Third Amended Counterpetition for\nDivorce\nStatus as of 12/9/2025 11:57 AM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n12/8/2025 2:24:50 AM\n12/8/2025 2:24:50 AM\n12/8/2025 2:24:50 AM\n12/8/2025 2:2"}
{"id": "f906d52a612f96ecc4fd35a0c80b54e0542d1834", "vector_id": 34, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_08_25_third_amended_counterpetition_for_divorce\\12_08_25_third_amended_counterpetition_for_divorce.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.08.25 - THIRD AMENDED COUNTERPETITION FOR DIVORCE.pdf", "source_exists": true, "page": null, "chunk_index": 34, "char_len": 233, "text": "kdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n12/8/2025 2:24:50 AM\n12/8/2025 2:24:50 AM\n12/8/2025 2:24:50 AM\n12/8/2025 2:24:50 AMStatus\nSENT\nSENT\nSENT\nSENT"}