{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\12.15.25 - NOTICE OF IMPROPER ASSIGNMENT.pdf",
  "base_name": "12_15_25_notice_of_improper_assignment",
  "page_count": 5,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 322-744263-23  \n  \nIN THE MATTER OF                                                    IN THE DISTRICT COURT  \nTHE MARRIAGE OF                                                  \nMORGAN MICHELLE MYERS  \nAND                                                322ND JUDICIAL DISTRICT  \nCHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF  \nM.E.M. AND C.R.M.,  \nCHILDREN                                                                       TARRANT COUNTY, TEXAS  \n \n NOTICE  OF INVALID ASSIGNMENT  \n \n TO THE HONORABLE DAVID L. EVANS OF THE 8TH ADMINISTRATIVE \nJUDICIAL REGION OF TEXAS:  \n COMES NOW, Respondent, CHARLES DUSTIN MYERS, who respectfully submits \nthis NOTICE to the Honorable David L. Evans of the 8th Administrative Region of Texas, and in \nsupport thereof, brings the following to the Court’s attention:  \nI. STATEMENT OF RELEVANT FACTS  \n1. On May 5, 2025, retired judge John H. Cayce, Jr. was assigned to hear a recusal motion \nnaming Honorable James B. Munford as the respondent judge.  \n2. On May 6, 2025, Respondent OBJECTED to this assignment naming two issues:  \n  i.  That the Court Coordinator, a non-neutral party, continued to be involved  \n   in the recusal process and was performing duties specifically assigned to  \n   the Clerk pursuant to § 18a(e) of the Texas Rules of Civil Procedure; and  § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§",
      "char_length": 1350
    },
    {
      "page_number": 2,
      "text": "2 \n   ii. That the assignment mischaracterized the motion as filed, because the  \n   assignment order referenced a motion to recuse Honorable Associate  \n   Judge Jeffrey Kaitcer, which was never filed. \n3. On May 15, 2025, Respondent’s objection was OVERRULED, leading to mandamus \npetition 25-0426.  \n4. On May 19, 2025, the visiting judge summarily denied both the recusal naming \nHonorable James B. Munford as the respondent, and the nonexistent motion, leading to \nmandamus petition 25-0458.  \nII. ELIGIBILITY AND ASSIGNMENT OF VISITING RETIRED JUDGES  \n5. Pursuant to publicly available information, the assignment of John H. Cayce to this \nmatter was both premature and improper, as he was not eligible to serve at the time he was assigned to this case, and even if he was, was not eligible to preside over fami ly law matters. See \nhttps://www.txcourts.gov/media/1459882/section-74055-retired -former -judges -eligible-to -serve -\nin-8th-ajr.pdf.  \n6. Therefore, his assignment was improper, and several provisions of the Texas Government \nCode were violated:  \nA. Texas Government Code § 74.054  \n6. This statute sets out which judges may be assigned as visiting judges. Only those who fall \nwithin the specified categories —such as active, senior, retired, or former judges who meet \ncertain requirements —are eligible for assignment by the presiding judge of the administ rative \nregion. The statute also imposes limits on the types of courts and matters to which certain judges may be assigned.",
      "char_length": 1506
    },
    {
      "page_number": 3,
      "text": "3 \n B. Texas Government Code § 74.055  \n7. This statute requires the presiding judge to maintain a list of retired and former judges \neligible for assignment, divided by area of specialty (criminal, civil, family, or domestic \nrelations). A retired or former judge may only be assigned to cases within their area o f specialty, \nand must meet service, experience, and certification requirements. The judge must be on the list and eligible at the time of assignment.  \nC. Texas Government Code § 74.056  \n8. This statute provides that only the presiding judge of the administrative region may \nassign judges to hold court within the region, and any reassignment of a retiree or former judge must comply with § 74.055. Assignments made before a judge is eligible or outside their specialty are not authorized.  \nD. Texas Government Code § 74.053  \n9. This statute allows parties to object to the assignment of a visiting judge, provided the \nobjection is timely. If a timely objection is made, the assigned judge must not hear the case.  \n“Unless there is a valid assignment of a visiting judge or retired judge, that judge has no more \njurisdiction to hear the case than the waiter at the Dairy Queen.  Hidalgo, In Interest of , 938 \nS.W.2d 492 (Tex. App. 1996) at 500. \nIII. ANALYSIS  \nE. Statutory Ineligibility and Lack of Authority 10. The judicial acts of a retired judge who has not met the statutory requirements to be an \nassigned judge at the time he  purports to act are absolutely void. Akin v. Tipps, 668 S.W.2d 432, \n434 (Tex.App.—Dallas  1984, no writ);  cf. Indemnity Insurance Company of North America v. \nMcGee,  163 Tex. 412, 356 S.W.2d 666 (1962).",
      "char_length": 1665
    },
    {
      "page_number": 4,
      "text": "4 \n 11. The facts indicate that Judge John H. Cayce was assigned to a family law matter on May \n7, 2025, but was not eligible for assignment until May 27, 2025, and lacked authorization to hear \nfamily law matters. Under Texas Government Code § 74.054, only judges w ho meet the statutory \ncriteria may be assigned as visiting judges. Section 74.055 further requires that a retired or former judge must be on the presiding judge’s list, must have the requisite experience, and may only be assigned to cases within their area of specialty (here, domestic relations/family law). Because Judge Cayce was not eligible or not listed as qualified in the domestic relations specialty as of May 7, 2025, the assignment was invalid under both §§ 74.054 and 74.055. F. Consequences of Ineligible Assignment  \n12. Texas appellate courts have consistently held that if a judge is not statutorily qualified or \neligible at the time of assignment, any orders or actions taken are void. In Houston General Ins. Co. v. Ater , 843 S.W.2d 225 (Tex. App. 1992), the court held that the acts of a retired judge who \nhad not met the statutory requirements for assignment were absolutely void. Similarly,  In Interest \nof Hidalgo, 938 S.W.2d 492 (Tex. App. 1996) confirmed that the qualifications of a retired judge to serve on assignment is a jurisdictional question that cannot be waived and can be raised at any time. These cases direct litigants to cite the relevant Government Code sections —§§ 74.054, \n74.055, 74.056—when challenging the validity of an assignment.  \nG. Subject -Matter Limitation  \n13. Section 74.055 requires that a retired or former judge may only be assigned to cases \nwithin their area of specialty.  Because  Judge Cayce was not listed as qualified in domestic \nrelations/family law, the assignment to a family law matter was unauthorized. Section 24.604 reinforces this by specifying that only retired judges of special juvenile or domestic relations courts may be  appointed to sit for a family district court judge.",
      "char_length": 2025
    },
    {
      "page_number": 5,
      "text": "5 \n IV. REGIONAL RECUSAL STILL PENDING  \n14. Finally, the Chief Justice of the Supreme Court has not acted on a regional recusal for \nmonths . This constitutes a failure to perform a mandatory, ministerial duty.  See 25-0861. \n15. These facts have been noted for the record to protect the Respondent’s rights, highlight \nthe persistent procedural errors that continue to occur in this matter, and preserve the issue for \nfuture litigation.  \nV. CONCLUSION  \n16. Based on the facts above and the controlling authorities, the assignment of Honorable \nJohn H. Cayce, Jr. was procedurally improper, and the entire recusal process was not followed in accordance with Texas law.  \n  Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  6641 Anne Court  \n  Watauga, Texas 76148  \n  Chuckdustin12@gmail.com  \n  817-546-3693 \n \n  \nCERTIFICATE OF SERVICE  \n \n I certify that on December 15, 2025, a true and accurate copy of this notice was served \nupon all parties of record pursuant to § 21a of the Texas Rules of Civil Procedure.  \n \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS",
      "char_length": 1107
    }
  ]
}