{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\08.27.25 - NOTICE OF INTENT TO FILE RECUSAL-1.pdf",
  "base_name": "08_27_25_notice_of_intent_to_file_recusal_1",
  "page_count": 13,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n 322-744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \nITMOMO,  \n    Morgan Michelle Myers  \n                                   Petitioner,  \n               v. \n Charles Dustin Myers,  \n                         Respondent  \n& in the interest of  \nM.E.M. & C.R.M.,  \nTwo minor children.  \n § \n§ \n§ \n§          \n§    Notice of Intent to File Tertiary  Recusal  \n§            \n§                     \n§ \n§ \n§ \n \nTO THE HONORABLE JUDGE OF THIS  COURT:  \n Respondent, Charles Dustin My ers, respectfully submits this notice \nregarding the intent to file a tertiary  recusal . The Respondent hereby puts the \nreviewing staff mem bers, the opposing party , the H onorable Judge of this Court, \nand the Regional Presiding Judge on notice to bring attention to the critical and \ncompounding issues that co ntinue to accrue within this matter.  \n The court and all officials involved  are statutorily and ethically obligated to \nensure that the motion , when filed, is handled in strict compliance with the law and \nwith the highest standards of fairness and integrity. The judge must continue to \npreside over the case unless and until the motion is sustained, but must also ensure \nthat the process is transparent, impartia l, and free from any appearance of \nimpropriety . See Tex. Gov't. Code § 25.00256 ).",
      "char_length": 1322
    },
    {
      "page_number": 2,
      "text": "2 \n I. Summary  \n 1. Respondent  has exhausted all available procedural and substantive \nremedies to have his concerns addressed, and the 322nd District Court is legally \nand ethically obligated to resolve these outstanding issues —especially those \ninvolving recusal, due process, and the in tegrity of prior orders —before \nproceeding to a final trial. To do otherwise would violate Texas constitutional, \nstatutory, and ethical mandates requiring fairness, impartiality, and public \nconfidence in the judiciary.  \n 2. The Texas judiciary is governed by a comprehensive framework of \nconstitutional provisions, statutes, and judicial conduct codes that collectively \nimpose strict obligations on courts and judges to act fairly, honestly, and with \nintegrity. These obligations are especially pronounced in matters involving recusal, \nwhere the appearance and reality of impartiality are essential to maintaining public \ntrust in the judicial system.  \n 3. When a party files a recusal motion —including a tertiary recusal —Texas \nlaw prescribes specific procedures to ensure that the motion is handled impartially \nand efficiently, and that the judge’s conduct does not undermine the integrity of the \nprocess. Judges  must avoid actual bias and even the appearance of impropriety and",
      "char_length": 1287
    },
    {
      "page_number": 3,
      "text": "3 \n must comply with both the letter and spirit of the law to uphold the legitimacy of \nthe courts.  \nII. Background and Relevant Law  \nA. Constitutional and Statutory Framework  \n 3. Texas law imposes strict constitutional, statutory, and ethical duties on \ncourts and judges to ensure that all proceedings, especially those involving recusal \nand allegations of bias, are handled with the utmost fairness, integrity, and \ntransparency. Respondent  has repeatedly invoked these protections, filing verified \nmotions, objections, and requests for hearings, and has documented procedural \nirregularities, unaddressed motions, and violations of due process and the Texas \nFamily Code; the court’s failure to address these matters before moving to final \ntrial would undermine the legitimacy of the judicial process and erode public trust.  \n 4. Texas courts are vested with inherent powers to control proceedings, \nensure justice is done, and require that all proceedings are conducted with dignity \nand order . See Tex. Gov't. Code § 21.001 . Judges are statutorily required to \ndiligently discharge their administrative responsibilities, rule on cases within \nspecified timeframes, and, crucially, follow established procedures for recusal and \ndisqualification to address any potential bias or conf lict of interest . See Tex. Gov't. \nCode § 74.059 .",
      "char_length": 1351
    },
    {
      "page_number": 4,
      "text": "4 \n  5. The 322nd District Court must resolve all pending recusal motions, \nprocedural objections, and due process concerns before setting the case for final \ntrial, as required by the Texas Constitution, Government Code, Family Code, and \nbinding Texas Supreme Court  precedent. Proceeding to trial without first \naddressing these threshold issues would not only contravene established law but \nalso risk disciplinary consequences for the court and  continuous  irreparable harm \nto the children , especially where the record reflects a pattern of unaddressed bias, \nprocedural irregularities, and violations of fundamental rights.  \nB. Recusal and Disqualification Procedures  \n 6. Texas law provides a detailed framework for recusal and disqualification. \nWhen a motion for recusal is filed, the judge must either recuse themselves or refer \nthe motion to the presiding judge for assignment to another judge ( Tex. Gov't. \nCode § 29.055 ). For tertiary recusal motions (the third or subsequent recusal \nmotion by the same party), the judge must continue to preside over the case and \nmove it toward final disposition unless and until the motion is sustained ( Tex. \nGov't. Code § 25.00256 ). However, the judge must still comply with all applicable \nprocedural rules for recusal and disqualification, and the process must be handled \nin a manner that is transparent, impartial, and consistent with due process ( Tex. \nGov't. Code § 25.00255 ).",
      "char_length": 1446
    },
    {
      "page_number": 5,
      "text": "5 \n  7. The Texas Rules of Civil Procedure, specifically Rule 18a, require that a \nmotion to recuse be verified, state with particularity the grounds for recusal, and be \nserved on all parties. Once a sufficient motion is filed, the judge must either recuse \nthemselv es or request the presiding judge of the administrative judicial district to \nassign another judge to hear the motion. If a recusal motion is timely and facially \nsufficient, a hearing is mandator y. \nC. Due Process and Family Law Protections  \n 8. Due process under the United States and Texas Constitutions requires that \nno person be deprived of life, liberty, or property without notice and an opportunity \nto be heard at a meaningful time and in a meaningful manner . See In re V .K ., 607 \nS.W.3d 471 (Tex. App. 2020) ). In family law, the natural right between parents and \nchildren is of constitutional dimension, and courts must strictly adhere to statutory \nrequirements before issuing orders that affect these rights ( Tex. Fam. Code § \n83.006 ). \nD. Judicial Conduct and Ethical Standards  \n 9. Judges  are required to act at all times in a manner that promotes public \nconfidence in the integrity and impartiality of the judiciary. They must avoid both \nactual bias and the appearance of bias, and recuse themselves when their",
      "char_length": 1307
    },
    {
      "page_number": 6,
      "text": "6 \n impartiality might reasonably be questioned . See Sears v. Nueces County Sherriff \nOlivarez , 28 S.W.3d 611 (Tex. App. 2000) .  \n 10. In the present case, these requirements have fallen short in every aspect, \nas several outstanding issues remain ignored despite the court being fully aware of \nthe issues.  \nIII. Analysis  \nE. Respondent ’s Exhaustion of Remedies  \n 11. The record demonstrates that Charles Myers has taken every reasonable \nand available step to have his concerns addressed by the 322nd District Court. He \nhas: \n i.  Filed verified motions to recuse, stating with particularity the  \n  grounds for recusal as required by Rule 18a;  \n ii.  Objected to procedural irregularities, including the improper  \n  involvement of the court coordinator in recusal matters, which  \n  is not  authorized by the Texas Rules of Civil Procedure;  \n iii.  Sought hearings on his motions, as mandated by law;  \niv. Filed objections to orders and assignments that \nmischaracterized the operative pleadings or included judges not \nnamed in the recusal motion;",
      "char_length": 1063
    },
    {
      "page_number": 7,
      "text": "7 \n v. Documented the failure of the court to address dispositive \nmotions, including motions for summary judgment, motions to \ncompel, and motions to dismiss for want of prosecution;  \nvi. Raised due process violations, including the lack of notice, \nopportunity to be heard, and the absence of required findings \nbefore being excluded from his home or deprived of parental \nrights;  \nvii. Pursued appellate remedies, including petitions for writ of \nmandamus and appeals to the Texas Supreme Court, all of \nwhich were denied or remain unresolved;  \nviii. Provided notice to all parties and the court of ongoing harm to \nhis children, including medical emergencies, and the failure of \nthe court to act on these urgent matters.  \nix. Has opened co ncurrent  litigation in the Western District of \nOklahoma to address the Petitioner ’s illegal acts leading up to \nthe divorce suit.  \nx. Has provided the opposing counsel with evidence that remains \nunopposed regarding false claims of violence, in digency, and \nreceived no response.",
      "char_length": 1033
    },
    {
      "page_number": 8,
      "text": "8 \n These actions satisfy, and indeed exceed, the procedural and substantive \nrequirements imposed by Texas law for a party seeking judicial relief and \naccountability.  \nF. The Court’s Legal and Ethical Obligations  \n 12. The 322nd District Court is bound by constitutional, statutory, and \nethical mandates to address all pending recusal motions, procedural objections, and \ndue process concerns before proceeding to a final trial. The Texas Constitution and \nGovernment Code requ ire judges to act with integrity, avoid bias, and ensure that \nall proceedings are conducted fairly and in accordance with the law ( Tex. Const. \nart. 5 § 1 -a; Tex. Gov't. Code § 74.059 ). \n 13. When a recusal motion is filed, the judge must either recuse themselves \nor refer the motion to the presiding judge for assignment to another judge ( Tex. \nGov't. Code § 29.055 ). The judge may not take further action in the case until the \nrecusal motion is resolved, except for good cause stated in the order. For tertiary \nrecusal motions, the judge must continue to preside over the case, but this does not \nrelieve the court of its  duty to ensure that the recusal process is handled impartially \nand in strict compliance with procedural rules ( Tex. Gov't. Code § 25.00256 ). \n 14. Failure to follow these procedures undermines the integrity of the \njudicial process and can result in disciplinary action, removal from office, or",
      "char_length": 1414
    },
    {
      "page_number": 9,
      "text": "9 \n reversal of judicial decisions ( Tex. Const. art. 5 § 1 -a; Sun Exploration and \nProduction Co. v. Jackson , 783 S.W.2d 202 (Tex. 1989) ). \n 15. Therefore, if this Court chooses to not act sua sponte within a reasonable \ntime, when the recusal motion follows – the involvement of the court coordinator \nshould  be prohibi ted, as her involvement in the prior two recusal proceedings lead \nto questionable ac tions, delay, and created  conflict s of interest . The recusal \nprocedure is designed to ensure public confidence in the judiciary , and her \ncontinued involvement has proven to have the opposite effect . \nG. The Importance of Addressing Threshold Issues Before Final Trial  \n 16. Proceeding to a final trial without first addressing the la ck of \nparticipation by the opposing side , the current ‘agreed orders ’ that bear one side ’s \nsignature,  due process violations, and procedural objections would violate the \nfundamental principles of fairness and impartiality that underpin the Texas judicial \nsystem. The Texas Supreme Court has made clear that even the appearance of \nimpropriety or bias is suff icient to require recusal, as public confidence in the \njudiciary is paramount . See Sun Exploration and Production Co. v. Jackson , 783 \nS.W.2d 202 (Tex. 1989) ; See also Sears v. Nueces County Sherriff Olivarez , 28 \nS.W.3d 611 (Tex. App. 2000) ).",
      "char_length": 1370
    },
    {
      "page_number": 10,
      "text": "10 \n  17. Moreover, Texas law provides that an interlocutory appeal from certain \norders, such as those granting or refusing a temporary injunction, stays the \ncommencement of a trial in the trial court pending resolution of the appeal ( Tex. \nCiv. Prac. and Rem. Code § 51.014 ). This underscores the principle that threshold \nissues must be resolved before a case can proceed to final disposition.  \nH. The Consequences of Judicial Inaction  \n 18. The record reflects a pattern of judicial inaction, procedural \nirregularities, and potential bias that, if left unaddressed, would not only harm the \nparties but also erode public confidence in the judiciary. The Texas Supreme Court \nhas held that judicial d ecisions rendered under circumstances that suggest bias, \nprejudice, or favoritism undermine the integrity of the courts and thwart the \nprinciples on which the judicial system is based . See Sun Exploration and \nProduction Co. v. Jackson , 783 S.W.2d 202 (Tex. 1989) ). \n 19. In this case, the court’s failure to address dispositive motions, recusal \nproceedings in accordance with the Texas Rules of Civil Procedure , and due \nprocess violations —despite repeated and documented efforts by the R espondent —\nraises serious questions about the impartiality and integrity of the proceedings. The \ncourt’s obligation is not merely to move cases to final trial, but to ensure that \njustice is done in an orderly, fair, and transparent manner ( Tex. Gov't. Code §",
      "char_length": 1470
    },
    {
      "page_number": 11,
      "text": "11 \n 21.001 ). Here, this Court has permitted a non -prosecuting attorney to exist merely \nto block relief , not participate in the issues, and not  comply with discovery \nrequests , while allowing her client, Morgan Michelle Myers, to escape \naccountability for the decepti ve pleadings and harm caused to the children.  \nIV. Conclusion  \n 20. The Respondent, Charles Myers has done everything the law requires —\nand more —to have his concerns addressed by the 322nd District Court. The court \nis legally and ethically obligated to resolve all outstanding dispositive motions, \nprocedural objections, and due process concerns before proceeding to a final trial. \nTo do otherwise would violate the Texas Constitution, Government Code, Family \nCode, and binding Texas Supreme Court precedent, and would undermine the \nintegrity of the judi cial process and public confidence in the judiciary. The court \nmust act now to restore fairness, impartiality, and justice to these proceedings . \n 21. Shall the court not provide an explanation for the conduct alleged herein, \nor at least sua sponte set a hearing on these issues, Respondent will initiate recusal \nproceedings, will  pursue further Mandamus relief , and will pursue Federal \nInjunctive Relief for all involved parties in their individual capacities who have  \nacted ultra -vires and p layed a part in the willful deprivation of constitutionally",
      "char_length": 1402
    },
    {
      "page_number": 12,
      "text": "12 \n protected ri ghts, and will seek media attention to shed light on this unprecedented  \nsituation.  \n 22. There is a national c risis regarding parental rights, an d it’s ramping up \nfast. Individuals such as Jeff Younger, Jeff Morgan, Jessica Saxton, Texas for \nJudicial Accountability, Robert Garza, and many others  – many of whom the \nRespondent is in close connection with – are pushing for change .  \n 23. The startling numbers from the 8th Administrat ive Region highlight s an \nongoing systemic issue regarding the public confidence in the judiciary. This court \nis now provided with another opportunity to help restore that confidence . \n \n Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12 @GMAIL.COM  \n  DATED: 08/27/2025  \n  PRO -SE RESPONDENT",
      "char_length": 822
    },
    {
      "page_number": 13,
      "text": "13 \n CERTIFICATE OF SERVICE  \n Pursuant to Rule 21a of the Texas Rules of Civil Procedure, Respondent, \nCHARLES DUSTIN MYERS, certifies that a true and accurate copy of this notice \nwas prov ided to all parties of record . \n \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12 @GMAIL.COM  \n  DATED: 08/27/2025  \n  PRO -SE RESPONDENT",
      "char_length": 368
    }
  ]
}