{
  "source": "C:\\code\\LEGAL_DESTROYER\\INCONSISTENCIES\\First Amended Petition for Divorce 01.31.24-f07c4047-1.pdf",
  "base_name": "first_amended_petition_for_divorce_01_31_24_f07c4047_1",
  "page_count": 11,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322-744263 -23 \n \nIN THE MATTER OF  § IN THE DISTRICT COURT  \nTHE MARRIAGE OF  §  \n §  \nMORGAN MYERS  §  \nAND  § 322ND JUDICIAL DISTRICT  \nCHARLES MYERS  §  \n §  \nAND IN THE INTEREST OF  §  \nMARA MYERS AND CAROLINE \nMYERS, CHILDREN  § TARRANT COUNTY, TEXAS  \n \nFIRST AMENDED PETITION FOR DIVORCE \n \n1. Discovery Level \nDiscovery in this case is intended to be conducted under level 2 of rule 190 of the Texas \nRules of Civil Procedure. \n2. Parties \nThis suit is brought by MORGAN MYERS, Petitioner.   \nCHARLES MYERS is Respondent. \n3. Domicile \n Petitioner has been a domiciliary of Texas for the preceding six-month period and a \nresident of this county for the preceding ninety-day period. \n4. Service \n No service on Respondent is necessary at this time. \n5. Protective Order Statement \n An application for a protective order under title 4 of the Texas Family Code is pending \nwith regard to a party.  The application for protective order was filed in December 22, 2023  in \nthe 322nd Judicial District Court in Cause No. 322 -744538-23. 322-744263-23 FILED\nTARRANT COUNTY\n1/31/2024 5:08 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1300
    },
    {
      "page_number": 2,
      "text": "6. Dates of Marriage and Separation \nThe parties were married on or about July 20, 2015, and ceased to live together as \nspouses on or about December 1, 2023. \n7. Grounds for Divorce \n The marriage has become insupportable because of discord or conflict of personalities \nbetween Petitioner and Respondent that destroys the legitimate ends of the marriage relationship \nand prevents any reasonable expectation of reconciliation. \n 8. Children of the Marriage \n Petitioner and Respondent are parents of the following children of this marriage who are \nnot under the continuing jurisdiction of any other court: \nName:  MARA MYERS \nSex:  female \nBirth date:  06/20/2016 \nName:  CAROLINE MYERS \nSex:  female \nBirth date:  04/12/2018 \n There are no court-ordered conservatorships, court-ordered guardianships, or other court-\nordered relationships affecting the children the subject of this suit. \n Information required by section 154.181(b) and section 154.1815 of the Texas Family \nCode will be provided at a later date.  \n No property of consequence is owned or possessed by the children the subject of this suit. \n Petitioner and Respondent, on final hearing, should be appointed joint managing \nconservators. Petitioner requests the Court to apportion the rights and duties of a parent set out in \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1468
    },
    {
      "page_number": 3,
      "text": "section 153.132 of the Texas Family Code. \n Petitioner should be designated as the conservator who has the exclusive right to \ndesignate the primary residence of the children.    Respondent should be ordered to provide \nsupport for the children, including the payment of child support and medical and dental support \nin the manner specified by the Court.  Petitioner requests that the payments for the support of the \nchildren survive the death of Respondent and become the obligations of Respondent's estate. \n9. Division of Community Property \n Petitioner believes Petitioner and Respondent will enter into an agreement for the \ndivision of their estate.  If such an agreement is made, Petitioner requests the Court to approve \nthe agreement and divide their estate in a manner consistent with the agreement.  If such an \nagreement is not made, Petitioner requests the Court to divide their estate in a manner that the \nCourt deems just and right, as provided by law. \n10. Separate Property \nPetitioner owns certain separate property that is not part of the community estate of the \nparties, and Petitioner requests the Court to confirm that separate property as Petitioner's separate \nproperty and estate. \n11. Request for Temporary Orders and Injunction \n Petitioner requests the Court, after notice and hearing, to dispense with the issuance of a \nbond, to make temporary orders and issue any appropriate temporary injunctions for the \npreservation of the property and protection of the parties as deemed necessary and equitable.  \nPetitioner requests that the Court enjoin Respondent from the following: \n 1.  Communicating with Petitioner in person or in any other manner, including by \ntelephone or another electronic voice transmission, video chat, in writing, or electronic \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1955
    },
    {
      "page_number": 4,
      "text": "messaging, in vulgar, profane, obscene, or indecent language or in a coarse or offensive manner. \n 2.  Threatening Petitioner in person or in any other manner, including by telephone \nor another electronic voice transmission, video chat, in writing, or electronic messaging, to take \nunlawful action against any person. \n 3.  Placing one or more telephone calls, anonymously, at any unreasonable hour, in \nan offensive and repetitious manner, or without a legitimate purpose of communication. \n 4.  Causing bodily injury to Petitioner or to a child of either party. \n 5.  Threatening Petitioner or a child of either party with imminent bodily injury. \n 6.  Destroying, removing, concealing, encumbering, transferring, or otherwis e \nharming or reducing the value of the property of one or both of the parties. \n 7.  Falsifying any writing or record, including an electronic record, relating to the \nproperty of either party. \n 8.  Misrepresenting or refusing to disclose to Petitioner or to the Court, on proper \nrequest, the existence, amount, or location of any tangible or intellectual property of one or both \nof the parties, including electronically stored or recorded information. \n 9.  Damaging or destroying the tangible or intellectual property of one or both of the \nparties, including electronically stored or recorded information. \n 10.  Tampering with the tangible or intellectual property of one or both of the parties, \nincluding electronically stored or recorded information, and causing pecuniary loss to Petitioner. \n 11.  Selling, transferring, assigning, mortgaging, encumbering, or in any other manner \nalienating any of the property of one or both of the parties, whether personal property, real \nproperty, or intellectual property, and whether separate or community property, except as \nspecifically authorized by order of this Court. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2029
    },
    {
      "page_number": 5,
      "text": "12.  Incurring any debt, other than legal expenses in connection with this suit, except \nas specifically authorized by order of this Court. \n 13.  Withdrawing money from any checking or savings account in any financial \ninstitution for any purpose, except as specifically authorized by order of this Court. \n 14.  Spending any money in either party's possession or subject to either party's \ncontrol for any purpose, except as specifically authorized by order of this Court. \n 15.  Withdrawing or borrowing money in any manner for any purpose from any \nretirement, profit-sharing, pension, death, or other employee benefit plan, employee savings \nplan, individual retirement account, or Keogh account of either party, except as specifically \nauthorized by order of this Court. \n 16.  Withdrawing, transferring, assigning, encumbering, selling, or in any other \nmanner alienating any funds or assets held in any brokerage account, mutual fund account, or \ninvestment account by one or both parties, regardless of whether the funds or assets are \ncommunity or separate property and whether the accounts are self-managed or managed by a \nthird party, except as specifically authorized by order of this Court. \n 17.  Withdrawing or borrowing in any manner all or any part of the cash surrender \nvalue of any life insurance policy on the life of either party or the parties' children, except as \nspecifically authorized by order of this Court. \n 18.  Entering any safe-deposit box in the name of or subject to the control of one or \nboth of the parties, whether individually or jointly with others. \n 19.  Changing or in any manner altering the beneficiary designation on any life \ninsurance policy on the life of either party or the parties' children. \n 20.  Canceling, altering, failing to renew or pay premiums on, or in any manner \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2001
    },
    {
      "page_number": 6,
      "text": "affecting the level of coverage that existed at the time this suit was filed of, any life, casualty, \nautomobile, or health insurance policy insuring the parties' property or persons including the \nparties' children. \n 21.  Opening or diverting mail or e-mail or any other electronic communication \naddressed to Petitioner. \n 22.  Signing or endorsing Petitioner's name on any negotiable instrument, check, or \ndraft, including a tax refund, insurance payment, and dividend, or attempting to negotiate any \nnegotiable instrument payable to Petitioner without the personal signature of Petitioner. \n 23.  Taking any action to terminate or limit credit or charge cards in the name of \nPetitioner. \n 24.  Discontinuing or reducing the withholding for federal income taxes from either \nparty's wages or salary. \n 25.  Destroying, disposing of, or altering any financial records of the parties, including \nbut not limited to a canceled check, deposit slip, and other records from a financial institution, a \nrecord of credit purchases or cash advances, a tax return, and a financial statement. \n 26.  Destroying, disposing of, or altering any e-mail, text message, video message, or \nchat message or other electronic data or electronically stored information relevant to the subject \nmatter of this case, whether stored on a hard drive, in a removable storage device, in cloud \nstorage or in another electronic storage medium. \n 27.  Modifying, changing, or altering the native format or metadata of any electronic \ndata or electronically stored information relevant to the subject matter of this case, whether \nstored on a hard drive, in a removable storage device, in cloud storage, or in another electronic \nstorage medium. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1893
    },
    {
      "page_number": 7,
      "text": "28.  Deleting any data or content from any social network profile used or created by \neither party or the parties' children. \n 29.  Using any password or personal identification number to gain access to \nPetitioner's e-mail account, bank account, social media account, or any other electronic account. \n 30.  Terminating or in any manner affecting the service of water, electricity, gas, \ntelephone, cable television, or any other contractual service, including security, pest control, \nlandscaping, or yard maintenance, at the home in which she current resides or in any manner \nattempting to withdraw any deposits for service in connection with any of those services. \n 31.  Excluding Petitioner from the use and enjoyment of the residence in which she \ncurrently resides. \n 32.  Entering, operating, or exercising control over any motor vehicle in the \npossession of Petitioner. \n 1.  Tracking or monitoring personal property or a motor vehicle in the possession of \nPetitioner, without Petitioner's effective consent, including by using a tracking application on a \npersonal electronic device in the possession of Petitioner, using a tracking device, or physically \nfollowing Petitioner or causing another to physically follow Petitioner. \n Petitioner requests that Respondent be authorized only as follows: \n To make expenditures and incur indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medical care. \n To make expenditures and incur indebtedness for reasonable attorney's fees and expenses \nin connection with this suit. \n13. Request for Temporary Orders Concerning Use of Property \nPetitioner requests the Court, after notice and hearing, for the preservation of the property \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1915
    },
    {
      "page_number": 8,
      "text": "and protection of the parties, to make temporary orders and issue any appropriate temporary \ninjunctions respecting the temporary use of the parties' property as deemed necessary and \nequitable, including but not limited to the following: \n Awarding Petitioner the exclusive use and possession of the residence in which she \ncurrently resides, as well as the furniture, furnishings, and other personal property at that \nresidence, while this case is pending, and enjoining Respondent from entering or remaining on \nthe premises of the residence and exercising possession or control of any of this personal \nproperty, except as authorized by order of this Court. \n Awarding Petitioner exclusive use and control of ay motor vehicle in her possession and \nenjoining Respondent from entering, operating, or exercising control over it. \n14. Request for Temporary Orders Regarding Children \nPetitioner requests the Court, after notice and hearing, to dispense with the necessity of a \nbond and to make temporary orders and issue any appropriate temporary injunctions for the \nsafety and welfare of the children of the marriage as deemed necessary and equitable, including \nbut not limited to the following: \n Appointing Petitioner and Respondent temporary joint managing conservators, and \ndesignating Petitioner as the conservator who has the exclusive right to designate the primary \nresidence of the children.  Petitioner requests the Court to apportion the rights and duties of a \nparent set out in section 153.132 of the Texas Family Code. \n15. Request for Permanent Injunction  \nPetitioner requests the Court, after trial on the merits, to grant the following permanent \ninjunction: \n16. Attorney's Fees, Expenses, Costs, and Interest \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1906
    },
    {
      "page_number": 9,
      "text": "It was necessary for Petitioner to secure the services of Cooper L. Carter, a licensed \nattorney, to prepare and prosecute this suit.  To effect an equitable division of the estate of the \nparties and as a part of the division, and for services rendered in connection with conservatorship \nand support of the children, judgment for attorney's fees, expenses, and costs through trial and \nappeal should be granted against Respondent and in favor of Petitioner for the use and benefit of \nPetitioner's attorney and be ordered paid directly to Petitioner's attorney, who may enforce the \njudgment in the attorney's own name.  Petitioner requests postjudgment interest as allowed by \nlaw. \n17. Prayer \nPetitioner prays that citation and notice issue as required by law and that the Court grant a \ndivorce and all other relief requested in this petition. \n Petitioner prays that the Court, after notice and hearing, grant a temporary injunction \nenjoining Respondent, in conformity with the allegations of this petition, from the acts set forth \nabove while this case is pending. \n Petitioner prays that, on final hearing, the Court enter a permanent injunction enjoining \nRespondent, in conformity with the allegations of this petition, from the acts set forth above. \n Petitioner prays for attorney's fees, expenses, and costs as requested above. \n Petitioner prays for general relief. \nRespectfully submitted, \n \nMARX ALTMAN & JOHNSON \n2905 Lackland Rd. \nFT. WORTH, Texas 76116 \nTel: (817) 926-6211 \nFax:   (817) 926-618 8 \n \n \n \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1698
    },
    {
      "page_number": 10,
      "text": "By:/s/ Cooper L. Carter   \nCooper L. Carter \nState Bar No. 24121530 \ncoopercarter@majadmin.com \nAttorney for Petitioner \n \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 293
    },
    {
      "page_number": 11,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nRoderick Marx on behalf of Cooper Carter\nBar No. 24121530\nMAJFIRM@YAHOO.COM\nEnvelope ID: 84016389\nFiling Code Description: Amended Filing\nFiling Description: FIRST AMENDED PETITION FOR DIVORCE\nStatus as of 2/1/2024 11:35 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERSBarNumber Email\nmorganmw02@gmail.comTimestampSubmitted\n1/31/2024 5:08:20 PMStatus\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nDaniel Bacalis\nTammy L.Johnson\nDaniel R.Bacalis\nCHARLES MYERSBarNumber Email\nservice@dbacalis.com\ntjohnson@dbacalis.com\ndbacalis@dbacalis.com\nchuckdustin12@gmail.comTimestampSubmitted\n1/31/2024 5:08:20 PM\n1/31/2024 5:08:20 PM\n1/31/2024 5:08:20 PM\n1/31/2024 5:08:20 PMStatus\nSENT\nSENT\nSENT\nSENT\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1273
    }
  ]
}