{"id": "318a16ba74d310318cd0e5d4337ad113cb03d767", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NOTICE OF \nRELATED \nCASE\n12.13.24M.1445 M.1445\nM.1445 M.1445 M.1445 M.1445\n\n1 IN THE 322ND DISTRICT COURT \n TARRANT COUNTY, TEXAS \nCivil No.: 322-744263-23 \nNOTICE OF RELATED CASE  \nRespondent, Charles Dustin Myers, respectfully files this Notice of Related Case \nand notifies the Court of a related cause of action, Case No. 5:24-cv -01311, filed in the \nUnited States District Court for the Western District of Oklahoma, wherein the \nRespondent has initiated claims against Defendant Daniel Kenneth Branthoover. The actions of Defendant Branthoover directly impacted the proceedings in this matter and bear materially on the issues before this Court. ITMOMO  \nMorgan Michelle Myers, § \n§ \n§ \n         Petitioner, § \n§ \nv. § \n§ \nCharles Dustin Myers  \n            Respondent. § \n§ \n§ § \n§M.1446 M.1446\nM.1446 M.1446 M.1446 M.1446\n\n2 \n SUMMARY \n1. This case was procured through fraudulent means, intended to deprive \nRespondent of custody of his children and his marital home at 6641 Anne Court, \nWatauga, Texas 76148. On January 16, 2024, Respondent was removed from the \nresidence based on court orders influenced by the false representations made in this \nmatter. Furthermore, on March 6, 2024, Petitioner unlawfully locked Respondent out of the home, exacerbating the harm caused by these proceedings. \n2. Prior to filing the divorce proceedings, Petitioner utilized Defendant \nBranthoover’s PayPal account to transfer marital funds into a concealed bank account, depriving Respondent of access to financial resources. Immediately following this transfer, Petitioner submitted an Affidavit of Inability to Pay Court \nCosts (IFP Statement) to this Court. \n3. Petitioner’s Original Petition for Divorce misrepresented the facts by alleging \nthe existence of an active protective order against Respondent and claiming findings \nof family violence during the marriage, both of which were demonstrably false. Additionally, Petitioner’s Application for a Protective Order relied on baseless claims of "}
{"id": "18b9ec65ec90c7263d77f02cf2936625f04f7b5b", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ondent and claiming findings \nof family violence during the marriage, both of which were demonstrably false. Additionally, Petitioner’s Application for a Protective Order relied on baseless claims of family violence that caused significant damage to Respondent’s livelihood and the financial stability of the children. No supporting evidence was provided to \nsubstantiate these allegations. \n4. At the time of these filings, Petitioner was self-represented and enlisted the \nassistance of Defendant Branthoover, who is not an attorney but has extensive M.1447 M.1447\nM.1447 M.1447 M.1447 M.1447\n\n3 \n knowledge of protective orders and a documented history of falsifying government \nrecords. Branthoover’s involvement included drafting and preparing legal documents designed to mislead the Court, furthering the fraudulent scheme. \n5. These actions have been detailed in the related federal lawsuit as well as within \nthis matter, where the claims remain uncontested. The issues presented in the federal case bear directly on the integrity of the proceedings before this Court. \nCONCLUSION \nConsidering the above, Respondent respectfully requests this Court to take \njudicial notice of the related federal case and should use its discretion to dismiss  this \nmatter without prejudice to avoid the continued waste of judicial resources.  \nRespondent believes further that Petitioner has no ability to prosecute the case. \nRespondent reserves the right to seek additional relief as necessary to preserve his \nlegal rights and protect the best interests of his children.  \nRespectfully submitted on this 31st day of December 2024. Wishing the Court a prosperous and Happy New Year, \n \n/s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS \n6641 ANNE COURT \nWATAUGA, TEXAS 76148 \nCHUCKDUSTIN12@GMAIL.COM  \n817-507-6562 \nPro-se M.1448 M.1448\nM.1448 M.1448 M.1448 M.1448\n\n4 CERTIFICATE OF SERVICE \nDefendant, CHARLES DUSTIN MYERS, hereby certifies that on 12/31/2024 a true \nand accurate copy of the Notice of Rel"}
{"id": "9b7ee2c339c5822ef010e3aa7acf0db92bcbf22c", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "07-6562 \nPro-se M.1448 M.1448\nM.1448 M.1448 M.1448 M.1448\n\n4 CERTIFICATE OF SERVICE \nDefendant, CHARLES DUSTIN MYERS, hereby certifies that on 12/31/2024 a true \nand accurate copy of the Notice of Related Case was served on the following parties via \nemail and the Texas Supreme Court -approved electronic filing manager (EFM): \nCooper L. Carter (Counsel for Plaintiff)  \nEmail: COOPERCARTER@MAJADMIN@COM  \nMorgan Michelle Myers (Plaintiff)  \nEmail: MORGANMW02@GMAIL.COM  \nHolly L. Hayes, Texas Office of the Attorney General \nEmail: 914-filer@texas.oag.gov \nRespectfully submitted,  \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \nPro-se \n6641 Anne Court, Watauga TX, 76148 \n817-507-6562Chuckdustin12@gmail.comM.1449 M.1449\nM.1449 M.1449 M.1449 M.1449\n\nCivil No.: \n5:24-cv-01311\nMYERS V. \nBRANTHOOVER\nWESTERN DISTRICT \nOF OKLAHOMAM.1450 M.1450\nM.1450 M.1450 M.1450 M.1450\n\n1 IN THE UNITED STATES DISTRICT COURT \nFOR THE WESTERN DISTRICT OF OKLAHOMA \nCivil No.: 5:24-cv-01311 \nFIRST AMENDED COMPLAINT \nPlaintiff, Charles Dustin Myers, files this complaint against Defendant, Daniel \nKenneth Branthoover, (“Branthoover, or “Defendant”), and alleges the foregoing: \nSUMMARY \nThis case represents a chilling narrative of betrayal, deceit, and calculated malice. \nThe Defendant, Daniel Kenneth Branthoover, did not merely engage in misconduct —\nhe orchestrated a deliberate and malicious scheme to dismantle the Plaintiff’s family, \nlivelihood, and reputation. With reckless disregard for the truth, the Defendant \nmanipulated legal processes, misappropriated marital assets, and weaponized the legal system to inflict maximum harm on the Plaintiff. The Defendant’s actions, supported by a disturbing pattern of harassment, theft, and intimidation, reveal a profound disregard CHARLES DUSTIN MYERS,  § \n         Plaintiff, § \n§ \nv. § \n§ \nDANIEL KENNETH \nBRANTHOOVER \n            Defendant. § \n§ \n§ \n§ \n§M.1451 M.1451\nM.1451 M.1451 M.1451 M.1451\n\n2 for the principles of justice and decency. The Plaint"}
{"id": "5e28fdd4255bb2438c4dabe5865e26340bc2d730", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": " \n         Plaintiff, § \n§ \nv. § \n§ \nDANIEL KENNETH \nBRANTHOOVER \n            Defendant. § \n§ \n§ \n§ \n§M.1451 M.1451\nM.1451 M.1451 M.1451 M.1451\n\n2 for the principles of justice and decency. The Plaintiff brings this action not only to hold \nthe Defendant accountable but also to shine a light on his reprehensible conduct and \nseek damages that reflect the egregious nature of these offenses. \nJURISDICTION AND VENUE \n1. Jurisdiction is proper in this United States District Court pursuant to 28 U.S.C. \n§ 1332(a) because the matter in controversy exceeds the sum or value of $75,000, \nexclusive of interest and costs, and is between citizens of different states. The plaintiff, \nCharles Dustin Myers, is a citizen of Watauga, Texas, and the defendant, Daniel \nKenneth Branthoover, is a citizen of Yukon, Oklahoma. Furthermore, the defendant has \nsufficient minimum contacts with the forum state to establish personal jurisdiction. \n2. Venue is proper in this Court under 28 U.S.C. § 1391(b)(1) because the \nDefendant resides in this judicial district and additionally under § 1391(b)(2) because a \nsubstantial part of the events or omissions giving rise to the claim occurred within this \njudicial district over the weekend of December 15, 2023, at Defendant’s domicile \nlocated at 3 100 Copan Ct in Yukon, Oklahoma , 73099. \nSTATE MENT OF FACTS \nDefendant is referred to in this section as “Branthoover” \n3. Plaintiff and Wife were married on June 20th, 2015, and resided together at  \n6641 Anne Court, Watauga, TX 76148 until Plaintiff’s removal on January 16, 2024, \nand share two daughters, M.E.M and C.R.M, aged 8 and 6. M.1452 M.1452\nM.1452 M.1452 M.1452 M.1452\n\n3 4. Plaintiff began working from home in January of 2021 when he built his\nown business out of the family residence involving real-time market data solutions for \nclients across the United States and Canada. \n5. Wife announced her desire to divorce from Plaintiff on December 1, 2023.\n6. On December 14, 2023, Branthoover became "}
{"id": "7940d420e4004619b1c489774f8ef218d94320ec", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "l-time market data solutions for \nclients across the United States and Canada. \n5. Wife announced her desire to divorce from Plaintiff on December 1, 2023.\n6. On December 14, 2023, Branthoover became involved in Plaintiff’s family\naffairs, exchanging a to tal of 92 text messa ges with Wife b etween Branthoover’s \nnumber, 940-312-3434, and Wife’s number, 817-235-5189. (Exhibit 1) \n7. On December 14, 2023, at 9:41 A.M., Branthoover texted Plain tiff at his \ncellular number 817-507-6562 and requested Plaintiff to call him regarding the recent \ndivorce announcement at Branthoover's number at 940-312-3434 and asserted his \ndesire to help  Plaintiff . (Exhibit. 2) \n8. During the phone conversation on December 14, 2023, Branthoover\nconvinced Plaintiff that his Wife should bring the children to his residency and claimed \nit would be a “good move”. \n9. Wife and the children left for Yukon, Oklahoma on December 15, 2023, to \nstay with Branthoover at his residence until December 17, 2023. \n10. On December 16, 2023, at 5:01 A.M., Plaintiff was notified that his bank \naccount was overdra wn by $800 due to $1,576 of funds being transferred to \nBranthoover’s account.  (Exhibit 3) \n11. Plaintiff contact ed Branthoover on December 16, 2023, at 3:54 P.M. and \nrequested via text message that the funds be returned. (Exhibit 4) M.1453 M.1453\nM.1453 M.1453 M.1453 M.1453\n\n4 12. Branthoover responded via text message at 8:20 P.M. on December 16,\n2023, and claimed that Wife transferred the money to her own account which \n[Plaintiff] stated was hers and claimed Texas is a community property state. (Exhibit 5) \n13. Plaintiff’s bank statement from December 2023 defeats Branthoover’s\ndefense, as it clearly shows that the $1,576 was transferred to “dmb575”, which is the Defendant’s PayPal account. (Exhibit 6) \n14. On December 16, 2023, at exactly 8:23 P.M., Branthoover’s true intentions\nbehind Wife’s visit to his residency became known, which was to help Wife with paperwork to initiate divorce p"}
{"id": "eaf52fcbe326e5922b336a427a2c4366654d85a1", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "Exhibit 6) \n14. On December 16, 2023, at exactly 8:23 P.M., Branthoover’s true intentions\nbehind Wife’s visit to his residency became known, which was to help Wife with paperwork to initiate divorce proceedings. (Exhibit 7) \n15. Branthoover purchased Wife a second phone on December 16, 2023, which\nis registered under 817-940-0852 as well as a can of pepper-spray mace. (Exhibit 8) \n16. The 817-940-0852 number was used on the original petition for divorce\nfiled on December 18, 2023, the affidavit of inability to pay court costs filed on December 18, 2023, and an application for a protective order filed on December 22, 2023, which were all prepared under Branthoover’s directive. (Exhibit 9) \n17. On December 19, 2023, the day after the divorce was filed, Branthoover\nreached out to Plaintiff via text message and held himself out to be Wife’s attorney \nand referred to her as “his client”, that he wanted to ‘work together to write up the \ndecree’, ‘has never lied to Plaintiff.’, and has told Plaintiff ‘exactly his plans since the beginning.’ (Exhibit 10 ) M.1454 M.1454\nM.1454 M.1454 M.1454 M.1454\n\n5 18. When s erved with the documents prepared under the d irective of \nBranthoover, they contained allegations of family violence, sexual harassment, and \nsought to have Plaintiff removed from the residence under the narrative of needing \nprotection, and wai ved the 60-day waiting period for divorce claiming that an active \norder of protection existed against Plaintiff and that family violen ce had been found to \nhave occurred during the marriage. (Exhibit 11) \n19. On January 16, 2024, Branthoover’s willful involvement in preparing these  \ndocuments culminated in Plaintiff’s removal from his residence. (Exhibit 12) \n20. On June 20, 2 024, Plaintiff received a friend request from Branthoover on \nFaceboo k to which Plaintiff responded via Facebook Messenger and then blocked him. \n(Exhibit 13) \n21. Branthoover then responded via text message at 9:47 P.M. on June 20, \n2024, calling "}
{"id": "0bcff3a963829cf20278e9e383f9889c55a1304a", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "nthoover on \nFaceboo k to which Plaintiff responded via Facebook Messenger and then blocked him. \n(Exhibit 13) \n21. Branthoover then responded via text message at 9:47 P.M. on June 20, \n2024, calling Plaintiff “pathetic” and informing Plaintiff that he has “enjoyed watching \nevery filing get denied” referring to Plaintiff’s efforts to obtain relief in the Second \nCourt of Appeals in Texas  in April and March of 2024 . (Exhibit 14) \n22. On June 23rd Plaintiff filed a motion in state court entitled MOTION FOR \nJOINDER OF P ERSONS NEED ED FOR JUST ADJUDICATI ON at 12:14 P.M. \n(Exhibit 15) \n23. On June 23rd at 1:54 P.M., Branthoover texted Plaintiff stating “Lol. And \nhere comes another denial. Please sue me individually. Please.”, referring to the earlier \nfiled motion. (Exhibit 16) Branthoover welcomes this suit against him.M.1455 M.1455\nM.1455 M.1455 M.1455 M.1455\n\n6 24. On December 1 0th, 2024, Bran thoover reached out once more a nd stated\n“When things all over you get to deal with me. Just a heads up.”, a persistent theme \nsince his involvement  in mid December of 2023 . (Exhibit 17) \n25. Branthoover’s egregious behavior is part of a larger pattern of conduct that\nhas led to significant financial and emotional harm suffered by Plaintiff and is rooted \nin intentional deceptio n, entitling Plaintiff to recover damages because of the deceit. \nCOUNT ONE: DECEIT \nDefendant’s actions constitute a violation of Title 76 OS § 1 et seq., as he \nknowingly and willfu lly deceived Plain tiff with the specific inten t to induce \ndetrimental relian ce, thereby exposing Plaintiff to injury. Consequently, t he \nDefendant is liable for the damages resulting from his conduct. \n26. Paragraphs 1 through 25 are incorporated herein by reference.\n27. Defendant persuaded the Plaintiff that his wife bringing their children to his\nresidence was beneficial, suggesting a fact not believed to be true, as his real intention was to facilitate her legal actions against the Plaintiff, violating el"}
{"id": "62ee93b2983d2e5462103fd9cd3289edca07aec1", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "s wife bringing their children to his\nresidence was beneficial, suggesting a fact not believed to be true, as his real intention was to facilitate her legal actions against the Plaintiff, violating element 1 of deceit 76 OK Stat § 3(1). \n28. Defendant knew this assertion to be false, as prior to making this statement\nhe was actively assisting wife in an effort to have the Plaintiff removed from his home through an ex-parte temporary order of protection. See Exhibit  \n29. Defendant's selective disclosure to the Plaintiff about the discussions\nsurrounding the divorce, while concealing his significant involvement in drafting legal documents for the Wife, constitutes deceit under element 3 of 76 OK Stat § 3(3). By presenting only partial information and withholding his full participation, Defendant M.1456 M.1456\nM.1456 M.1456 M.1456 M.1456\n\n7 provided misleading context that was likely to—and did—mislead the Plaintiff \nregarding the nature of his involvement, which lead to significant damages, making defendant liable for any damage which he thereby suffered. \nCOUNT TWO: CONVERSION  \nDefendant’s PayPal account was used as a medium to unlawfully convert $1,576 \nfrom the Plaintiff’s marital estate the week before Christmas. \n30. Paragraphs 1 through 29 are incorporated herein by reference.31.Plaintiff had a le gal right to the funds in the joint PNC bank account,\nincluding the specific sum of $1,576, as joint marital property. \n32. Defendant knowingly and intentionally exercised unauthorized control over\nthese funds by directing the transfer of $1,576 to his PayPal account  on December 15, \n2023.  \n33. Defendant’s actions deprived Plaintiff of the use and benefit of these funds,\ncausing financial harm, including an overdraft of $800, the loss of $1,576, the discontinuation of certain business advertising, and prevented him from getting his \nchildren Christmas gifts as he had planned to purchase over the weekend.  \n34.Under Oklahoma and Texas law, conversion is complete whe"}
{"id": "4c90b7b5a564f0c21a303fd03b3c2eb7895887aa", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "certain business advertising, and prevented him from getting his \nchildren Christmas gifts as he had planned to purchase over the weekend.  \n34.Under Oklahoma and Texas law, conversion is complete when the holder of\npersonal property asserts rights inconsistent with the title of the owner. Russell v. City State Bank of Wellington, Texas, 264 F. Supp. at 574.\n In this case, Defendant’s conduct \ndemonstrates an assertion of rights inconsistent with the Plaintiff’s ownership and legal entitlement to the funds. By knowingly and intentionally directing the transfer of $1,576 from the joint marital account to his PayPal account without Plaintiff’s consent, M.1457 M.1457\nM.1457 M.1457 M.1457 M.1457\n\n8 Branthoover depri ved Plaintiff of his rightf ul possessi on and contro l over the funds, \ncompleting the tort of conversion as descri bed in Russell. \nCOUNT THREE:  INTENTIONAL INFLI CTION OF EMOTIONAL \nDISTRESS \nDefendant acted intentionally and recklessly, his conduct was extreme and \noutrageous, Plaintiff has suffered actual damages from this conduct, Plaintiff \nexperienced emotional distress, and the emotional distress [is] severe. Ishmael v. \nAndrew, 2006 OK CIV APP 82, 19, 137 P.3d 1271, 1277; Breeden v. League \nServices Corp., 1978 OK 27, 7, 575 P.2d 1374, 1376. \n35. Paragraphs 1 through 34 are incorporated herein by reference.\n36. Defendant’s conduct constitutes intentional infliction of emotional distress\nas defined in the Restat ement (Second) of Torts § 46 (1965), which states that “one \nwho by extreme and outrageous conduct intentionally or recklessly causes severe \nemotional distress to another is subject to liability for such emotional distress.”. Defendant’s conduct was both intentional and reckless, as the fraudulent documents prepared by him lead to the loss of Plaintiff’s business, home, and the custody of this \nChildren. \n37. After Plaintiff suffered these losses, Defendant continued to harass the\nPlaintiff by texting him throughout the proceeds he helped "}
{"id": "c77a76a439be20115bf8a2c67048a54982030318", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "Plaintiff’s business, home, and the custody of this \nChildren. \n37. After Plaintiff suffered these losses, Defendant continued to harass the\nPlaintiff by texting him throughout the proceeds he helped initiate, calling him \n“pathetic” and stating that he has “enjoyed watching every filing get denied”. This conduct is outrageous because the harm suffered by Plaintiff was a direct cause of \nDefendant’s actions, and Defendant’s clear interest in the case has been made apparent M.1458 M.1458\nM.1458 M.1458 M.1458 M.1458\n\n9 notwithstanding his enjoyment of the damages he has caused to Plaintiff through his \nown admission. \n38. Further, Defendant knew that Plaintiff operated his business out of his\nresidency, knew of his recent success, his close relationship with his daughters, and \nwas aware that Plaintiff was the primary breadwinner in the household, yet played an \nintegral role in his unjust removal through deceptive measures. \n39. Finally, Defendant inflicted severe emotional distress on Plaintiff by\nassisting in the act of up-ending his life by influencing his marriage to its’ detriment, helping sever the close relationship he had with his children, and playing a crucial role in the destruction of Plaintiff’s business he had built to provide for his family, causing reckless financial and emotional harm that has been ongoing since his involvement. \n40. Defendant’s self-admitted enjoyment of Plaintiff’s distress is particularly\negregious as it has affected far more than just Plaintiff’s well-being, but has undone years of hard work and the damage is ongoing and is expected to persist into the future considering that the case he helped initiate is fundamentally flawed and has been stagnant for nearly 10 months. \nDAMAGES \nDefendant’s actions alleged herein have caused significant and irreparable harm \nto Plaintiff and his family, who seeks redress in damages; compensatory and \nspecial, and seeks punitive damages to deter this behavior from occurring in the \nfuture.  \n41. "}
{"id": "ef8ac8a80f98e0422289098b527991f7a5fe170a", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "cant and irreparable harm \nto Plaintiff and his family, who seeks redress in damages; compensatory and \nspecial, and seeks punitive damages to deter this behavior from occurring in the \nfuture.  \n41. Paragraphs 1 through 40 are incorporated herein by reference.M.1459 M.1459\nM.1459 M.1459 M.1459 M.1459\n\n10 42. Under Oklahoma law, any person who suffers detriment from the unlawful\nact or omission of another may recover compensation in the form of damages. (See \nOkla. Stat. tit. 23, § 3). Plaintiff has suffered significant detriment due to Defendant's conduct, including the loss of income, increased living expense, personal and marital \nproperty, harm to his business, and harm to his familial relationships, which have all \ncaused  severe emotional distress. \nLoss of income \n43. Startin g in December 2023, the Defendant’s involvement directly disrupted\nPlaintiff’s ability to focus on business operations and maintain client relationships. \nThis disruption coincided with an accelerated decline in income, as reflected by \nPlaintiff’s income showing a sharper drop in monthly earnings. \n44. Prior to the Defendant’s involvement, Plaintiff’s average monthly income\nfrom Source 1 was approximately $3,612.83 over the 13 months preceding December \n2023. Following the Defendant’s involvement, Plaintiff’s average monthly income \ndropped to $1,813.02, representing a significant reduction of nearly 50%. Over the subsequent 13 months, this decline resulted in a total income loss of approximately $23,397.60 (Exhibit A) as a direct result of Defendant’s actions. \n45. Similarly, Plaintiff’s Source 2 transaction revenue data reflects a comparable\ntrend. The annual transaction revenue dropped from $26,514.94 in 2023 to $15,099.78  \nin 2024, resulting in a loss of $11,415.16  over that period. (Exhibit B) M.1460 M.1460\nM.1460 M.1460 M.1460 M.1460\n\n11 46. The total realized loss of income, combining the actual reductions in earnings\nfrom Source 1 and Source 2, is $34,812.76 since being remove"}
{"id": "671380b115427689f7a5a30e8dc576c1ba3613e6", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "Exhibit B) M.1460 M.1460\nM.1460 M.1460 M.1460 M.1460\n\n11 46. The total realized loss of income, combining the actual reductions in earnings\nfrom Source 1 and Source 2, is $34,812.76 since being removed from the residence. The \nprojected loss of income over the next 12 months, based on forward-looking projections \nfor Source 1 and Source 2, is $33,012.94 in consequential damages. Combined, the total \nloss of income is projected at $67,825.69 by this time next year given all circumstances \nare the same and factoring in consequential damages. \n47. Defendant’s actions have caused advertisements to stop running for\nPlaintiff’s business, which have resulted in lost business opportunities and decreased website traffic, leading to lost business opportunities estimated at $14,200. (Exhibit C)  \nIncreased living expenses \n48. During the pendency of the litigation instigated by Defendant, Plaintiff has\nbeen unable to access his home, resulting in a substantial increase in living costs to remain near his children as they had been accustomed to. \n49. This forced Defendant to stay in hotels to exercise Thursday visitation and\nrequired him to rent local Airbnb locations to provide a stable living space for his children during extended periods.\n The total cost of Airbnb during the relevant period is \n$14,553.89, and additional hotel costs amount to $873.31 to maintain the status quo of \nthe Children to the best of Plaintiff’s ability. (Exhibit D) \n50.Plaintiff also incurred toll costs while exercising visitation to see his children,\ntotaling $2,160.28. This includes $450.61 and $492.00 on June 9, $887.92 on April 11, \nand $329.75 on April 26. These incurred expenses would not have been necessary if not M.1461 M.1461\nM.1461 M.1461 M.1461 M.1461\n\n12 for Defendant’s involvement, and the receipts of these transactions will be provided at \ntrial. \n51. Total damages for cost-of-living increases and travel expenses that would not\nhave been made without Defendant’s involvement amount to $1"}
{"id": "01f5223d472864ed9053358683f2c13aa4a293bc", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "eceipts of these transactions will be provided at \ntrial. \n51. Total damages for cost-of-living increases and travel expenses that would not\nhave been made without Defendant’s involvement amount to $17,587.48. \nCost of litigation \n52. Plainti ff has also incurred damages relating to the cost of litigation, which\namounts to $3,000 for the retainment of his prior attorney used to fight the baseless allegations of violence, $155 to file a mandamus in the Second Court of Appeals, $255 to obtain certified copies of the pleadings, and $405 when attempting to remove the \ncase to federal court, totaling $3,815 in litigation costs. \nDamages from conversion \n53. Plaintiff incurred damages amounting to $1,576 from Defendant’s\nunauthorized control over Plaintiff’s marital assets on December 15, 2023. \nRequest for Jury Determination of Punitive Damages \n53. In this case, the Defendant exploited his offer of assistance to the Plaintiff,\nsubsequently diverting marital funds and orchestrating the initiation of divorce proceedings with the intent to cause harm. These actions displaced the Plaintiff from \nhis livelihood and were accompanied by mockery of his efforts to seek relief. Such reckless conduct constitutes calculated deceit carried out with malice. M.1462 M.1462\nM.1462 M.1462 M.1462 M.1462\n\n13 54. The Def endant's prior convictions for violating protective orders and\ntampering with government documents further highlight a troubl ing pattern of \nbehavior that necessitates punitive damages. This damage is critical not only to hold \nthe Defendant accountable but also to deter future misconduct and protect others from \nsimilar harm, which as here, has destroyed t he Plaintiff’s family. \nPRAYER FOR RELIEF \nWHEREFORE, Plaintiff respectfully requests that this Honorable Court issue \nsummons on Defendant at his domicile and:\n1. Plaintiff prays for special damages amounting to $90,804.18 from the \nincreased cost of living, loss of income, loss of business opportunity, litigation \nexp"}
{"id": "d206a8847ee57559aa73813c4c509d129a07865a", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\12_13_24_notice_of_related_case_1\\12_13_24_notice_of_related_case_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\12.13.24 - Notice of Related Case-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 1556, "text": "mmons on Defendant at his domicile and:\n1. Plaintiff prays for special damages amounting to $90,804.18 from the \nincreased cost of living, loss of income, loss of business opportunity, litigation \nexpenses, and increased cost of travel caused by Defendant’s malicious actions; \n2. Plaintiff seeks general damages for emotional distress caused by Defendant’s  \nactions, including loss of enjoyment of life, disruption of familial relationships,  loss of \nbusiness opportunities, and distress from Defendant’s threatening behavior; \n3. Plaintiff prays for punitive damages in an amount to be determined by a jury  \nin a bifurcated trial  should a settlement not be reached ; \nSERVICE OF PROCESS\n4. Plaintiff requests that this Court authorize service of process on Defendant by \na United States Marshal, deputy marshal, or other person specially appointed by the \nCourt pursuant to Rule 4(c)(3) of the Federal Rules of Civil Procedure; M.1463 M.1463\nM.1463 M.1463 M.1463 M.1463\n\n14 5. Plaintiff request s such other and further relief as the Court deems just and \nequitable. \nDEMAND FOR JURY TRIAL \nPlaintiff hereby demands a trial by jury s olely for the determination of punitive \ndamages pursuant to Rule 38(c) of the Federal Rules of Civil Procedure if permitted by \nlaw and should settlement not be reached by the parties.\nRespectfully submitted on this 28th day of January 2025, \n/s Charles Dustin Myers \nCHARLES DUSTIN MYERS 6641 \nANNE COURT WATAUGA, \nTEXAS 76148 \nCHUCKDUSTIN12@GMAIL.COM  \n817-507-6562\nPro-seM.1464 M.1464\nM.1464 M.1464 M.1464 M.1464"}