{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\05.12.2025_AFFIDAVIT OF CHARLES DUSTIN MYERS-1.pdf",
  "base_name": "05_12_2025_affidavit_of_charles_dustin_myers_1",
  "page_count": 13,
  "pages": [
    {
      "page_number": 1,
      "text": "25-0361\nAFFIDAVIT OF CHARLES DUSTIN MYERS\n05.12.25M.3488 M.3488\nM.3488 M.3488 M.3488 M.3488",
      "char_length": 91
    },
    {
      "page_number": 2,
      "text": "25-0361\nIN THE SUPREME COURT \nOF TEXAS\nIN RE: CHARLES DUSTIN MYERS , RELATOR . \nOn Petition for Writ of Mandamus  \nto the 322nd Judicial District Court, Tarrant County  \n322-744263-23 & 322-744538-23  & 233-765358-25\nOn Mandamus Review from case number :\n02-25-0016 6-CV\nin the Second District Court of Appeals, Fort Worth, Texas  \nHon. Jeff Kaitcer  Presiding \nAFFIDA VIT OF CHARLES DUSTIN MYERS  \nRespectfully submitted by:  \nCharles Dustin Myers , Relator  \n817-546-3693\nCHUCKDUSTIN12  \n@GMAIL.COM  \nPro-se Relator  \nFILED\n25-0361\n5/12/2025 9:54 AM\ntex-100698063\nSUPREME COURT OF TEXAS\nBLAKE A. HAWTHORNE, CLERKM.3489 M.3489\nM.3489 M.3489 M.3489 M.3489",
      "char_length": 655
    },
    {
      "page_number": 3,
      "text": "Affidavit of Charles Dustin Myers (Relator) \nSTATE OF TEXAS, COUNTY OF DENTON \nBefore me, the undersigned authority, on this day of May 12, 2025,  \npersonally appeared Charles Dustin Myers, who being duly sworn, deposed \nas follows:  \nTO THE HONORABLE SUPREME COURT OF TEXAS:  \n1.My name i s Charles Dustin Myers. I am over the age of 18, of  \nsound mind, and competent to make this affidavit. I am the Relator  \nin the above-c aptioned matter before the Supreme Court of Texas.  \nAll facts stated herein are within my personal knowledge or belief \nand are true and correct or are stated with factual support from the  \nConsolidated Mandamus record attached as Exhibit A in  the Motion \nto Consolidate as amended, filed on May 8, 2025.\n2.I am the father of two minor children, M.E.M. and C.R.M., (ages 7  \nand 8)  who are the subject of this case. Morgan Michelle Myers  \n(“Morgan”) is my wife and the mother of our children. I make this  \nsworn statement in support of my request for an emergency stay , \nwith the sole objective of protecting our children’s well-b eing and  \nreuniting with them in our family home pending resolution of these  \nmatters. I declare the following under penalty of perjury:M.3490 M.3490\nM.3490 M.3490 M.3490 M.3490",
      "char_length": 1245
    },
    {
      "page_number": 4,
      "text": "Prior to the State’s intervention on January 16, 2024, (R. 158) I was \nan active, involved, and loving father that cared for both of my daughters \neach day. I helped them get ready in the mornings, walked them to school, \nvisited them for lunch time, and picked them up. While they were at school, \nI worked from home where I would provide real-t ime market data services \nto clients across the United States and Canada. I was responsible for all the \nhousehold finances, including rent, both car payments, a nd ensuring our \nchildren and my spouse remained f inancially sta ble and safe, and used the \ndaytime t o ensure t hese obl igations were met . When the children return \nhome from school, I would assist t hem w ith any homework, play with them \noutside, and prepare meals for them . \nMorgan M ichell e My ers benefitted from t hese effort s and worked part \ntime at the Watau ga Recreation Center during the evenings ( R. 65 at 5), \nwhere I would wa tch over the c hildren, he lp them with their after -school \nactivities, including homework and extra -curriculars s uch as d ance class, and \nwould get t hem rea dy for bed each night a nd read them a stor y. In essence, I \nwas i nvolved in every aspect of t heir lif e from t he time t hey woke up in the \nmorning until they went t o sleep in the e venings. \nAround October of 2022 , Morg an began communicating extensively \nwith an individual n amed D amen K azlauskas, w hich exponentially grew i nto M.3491 M.3491\nM.3491 M.3491 M.3491 M.3491",
      "char_length": 1505
    },
    {
      "page_number": 5,
      "text": "an extramarital affair which peaked right around the sudden Divorce \nannouncement made by Morgan  on December 1, 2023 . The levels of \ncommunication between these individuals  exceed ed all other contacts other \nthan Debbie Price, a friend of hers, who helped facilitate this extramarital \naffair. (R. 231). The discovery of these interactions led to the subsequent \npleadings that followed, which were prepared in part by third parties not \nnamed in the suit (R . 1686) .  \n In totality, Morgan intentionally lied to the trial court below when she \nstated  the following : \n1. That she was financially  indigent. (R. 60-72) Morgan  had access to \nthe joint ma rital bank account, which she depleted with the \nassistance of a third party , who admitted this.  (R. 1685) Morgan \nherself even admitted that this occurred. (R . 1691- 1692) The bank \nstatement also s hows this transaction occurred. (R. 1682)  \n2. That we stopped living together as couples on December 1, 2023.  I \nremained in our family home  caring for our daughters up until my \nremoval on January 16, 2024 and continued to pay for bills and \nhousehold expenses. ( R. 1711)  \n3. I affirm my sincere belief that any reasonable person reviewing Morgan’s Original Petition for Divorce  would immediately M.3492 M.3492\nM.3492 M.3492 M.3492 M.3492",
      "char_length": 1309
    },
    {
      "page_number": 6,
      "text": "recognize multiple internal contradictions that warrant concern. On \none hand, she requested joint managing conservatorship ( R. 51 \nat a-2), while simultaneously asserting that she had filed for an \nemergency protective order  on December 14, 2023 ( R. 54 at \n9B). In that same filing, she claimed that a protective order was \nalready in effect and that it included a judicial finding of family violence  committed by me during the marriage (R. 54 at 10)— a \nserious allegation that has never been substantiated by evidence, hearing, or court order.  \n4. In that same initial pleading, Morgan declared both family vehicles \nas her separate property ( R. 55 at 11B ). \n5. She further alleged that she would be abused or harassed if I were \ngranted access to her contact information, a claim that directly contradicts her stated request for joint managing conservatorship, which necessarily requires regular and \ncooperative communication between both parents for decision-\nmaking related to the children.  (R. 57 at 15) \n6. Compounding the confusion, Morgan proceeded to file a second \napplication for a protective order on December 22, 2023—just \neight days after her claim that she had already sought emergency M.3493 M.3493\nM.3493 M.3493 M.3493 M.3493",
      "char_length": 1254
    },
    {
      "page_number": 7,
      "text": "protection on December 14 and that an order was already in place. \nThis second application (R. 79 –80) reiterated many of the same \nallegations, which remain unproven and unsupported by any judicial finding to this day.  \n7. On December 22, 2023, Morgan filed a second application for a \nprotective order in which she alleged that an incident of family violence occurred on December 18, 2023. However, on December \n19, 2023 —one day after the alleged event —she sent me a text \nmessage stating, “The only thing filed is a petition for divorce. It's \nnot an actual agreement. All the details that we need to sit down \nand agree on will officially happen in 61 days.”  (R. 1692)  \nThese deceptive actions are apparent from the face of the record, have \nbeen alleged without any rebuttal or denial of these claims, and lead to the removal of my home, business, and children’ s lives on January 16, 2024. \nThese were not minor errors. These false allegations were  so significant, and \nhave had life -altering effects on myself and my children, whose  relationship \nhas been affected by these initial decisions substantially.  What ’s worse  is \nthat after her adv antage was secured, she began to cut me out of our \nchildren’ s lives, replacing me with the same individual she was texting in the \nbeginning of this ordeal , Dame n Kazlauskas. Her deception is extraordinary.  M.3494 M.3494\nM.3494 M.3494 M.3494 M.3494",
      "char_length": 1414
    },
    {
      "page_number": 8,
      "text": "CONCLUSION  \n In sum, I have maintained respect for the tribunal below and for all \nparties involved. But what has occurred in this case is egregious, damaging, \nand unredressed . For over fourteen months , I have sought clarity as to how \na situation this self -evidently flawed could persist without correction—\nunopposed, undisputed, and unadjudicated. A failure of this magnitude \nshould never occur, especially when the record shows silence from the party \nthat obtained everything and accountability from the one left with nothing. \nBased on the totality of the record and my direct experience, I solemnly affirm the following to be true and/or believe them to be true under penalty \nof perjury:  \n1. I believe  I was denied a meaningful forum to assert my rights from \nthe outset. From day one , I was placed at a significant disadvantage, \nstripped of my home, children, and livelihood , and every proceeding \nthereafter was procedurally imbalanced.  \n2. I believe  Morgan’s pleadings were so materially deceptive  and \nfundamentally fraudulent  that they created a prejudicial narrative that \nforeclosed any fair opportunity for me to respond or defend myself.  M.3495 M.3495\nM.3495 M.3495 M.3495 M.3495",
      "char_length": 1212
    },
    {
      "page_number": 9,
      "text": "3. I believe  that my decision to terminate prior counsel and proceed \npro se, while necessary, deepened the imbalance created by the initial \nmisrepresentations.  \n4. I believe  Morgan’s current counsel lacks lawful authority to \nprosecute this case. There has been no substantive litigation effort or \nevidentiary advancement, and the silence is conspicuous. It is also highly suspect that a party who declared financial indigency could \nimmediately retain counsel  upon being compelled to substantiate her \nclaims.  \n5. I know  that I have never been granted a fair or complete opportunity \nto present evidence refuting Morgan’s claims or to fully defend myself \non the record.  \n6. I know  that Morgan has not supported any meaningful co- parenting \nrelationship. I routinely go weeks without contact  with my children—\nincluding on major holidays and birthdays—despite our previously \nclose and daily bond.  \n7. I know  that Morgan routinely leaves the children in the care of \nrelatives during the day, depriving them of both parental presences they once had under one roof.  M.3496 M.3496\nM.3496 M.3496 M.3496 M.3496",
      "char_length": 1123
    },
    {
      "page_number": 10,
      "text": "8. I know  that Morgan intentionally  concealed her extramarital \naffair —discovered on December 12, 2023—and has since pursued it \nto the point of being engaged  to Damen Kazlauskas , a man now \nintroduced into our children’s lives in my absence.  \n9. I know  that the settlement agreement executed early in this case was \ndrafted while I was under extreme procedural duress and misled \ncircumstances, and that my own counsel’s actions in preparing it led \nto his termination and my formal challenge of the agreement.  \n10. I know  that if no temporary relief or stay is granted by May 16, \n2025, I will become homeless , without a place to live , work,  and with \nno access to my children, which I believe is precisely the outcome \nMorgan has orchestrated.  \n11. I know  that had this matter been heard in a neutral and properly \nbalanced tribunal from the beginning, Morgan would not have received sole custody or exclusive possession of the residence. A fact -\ndriven court would have concluded the obvious: I am a fit, loving father , and the last year and a half has been spent trying—against all \nodds—to protect my children’s future from a parent whose conduct \nhas caused lasting harm.  M.3497 M.3497\nM.3497 M.3497 M.3497 M.3497",
      "char_length": 1237
    },
    {
      "page_number": 11,
      "text": "12. I know that if temporary relief is granted, I will immediately return \nto the family residence, conduct myself with calm and civility , reunite \nwith my children, and begin restoring what was unjustly taken from \nthem —a stable home with both parents involved in their lives . \n13. Finally, I know that mistakes happen . We are all human. And \ndespite the pain and injustice I have endured, I remain deeply grateful for this institution of law , and the fact that this remedy  exists. Without \nthis Court’s jurisdiction, all would have already been lost. But through these proceedi ngs, I place my trust in a system that —when it works—\nhas the power to correct what lower tribunals failed to.  \nIt is not vengeance I seek, but restoration. It is not suffering I wish to inflict—but only explanation I seek to extract. It is not conflict I bring, but a \nplea for healing—to permit my return home and allow my daughters to have \ntheir father again, so tha t we may navigate this divorce as the Family Code \nintended: with dignity, fairness, and without the irreversible  sacrifice of a \nloving parent.  \nFURTHER AFFIANT SAYETH NOT.  \n \nCharles Dustin Myers, Affiant  \nM.3498 M.3498\nM.3498 M.3498 M.3498 M.3498",
      "char_length": 1212
    },
    {
      "page_number": 12,
      "text": "DESCRIPTION OF ATTACHED  DOCUMENT\nTitle or Type of Document: _______________________________________________________  \nDocument Date: _____________________________\nNumber  of Pages  (including notarial certificate): _______________\n1105/12/2025Jurat\nState of Nevada\nCounty of Clark\nSigned and sworn to (or affirmed) before me\non 05/12/2025 by Charles Dustin Myers.\nNotarized remotely using audio-video communication technology via Proof.M.3499 M.3499\nM.3499 M.3499 M.3499 M.3499",
      "char_length": 478
    },
    {
      "page_number": 13,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below:\nEnvelope ID: 100698063\nFiling Code Description: Unlisted\nFiling Description: Affidavit of Charles Dustin Myers\nStatus as of 5/12/2025 10:03 AM CST\nCase Contacts\nName\nCHARLES DMYERS\nHONORABLE JEFFREY NKAITCER\nDeterrean Gamble\nNicole Loya\nMORGAN MICHELLEMYERS\nMatthew DealBarNumber Email\nCHUCKDUSTIN12@GMAIL.COM\nLKBaker@tarrantcountytx.gov\ndeterrean.gamble@oag.texas.gov\nnicole.loya@oag.texas.gov\nMORGANMW02@GMAIL.COM\nmatthew.deal@oag.texas.govTimestampSubmitted\n5/12/2025 9:54:59 AM\n5/12/2025 9:54:59 AM\n5/12/2025 9:54:59 AM\n5/12/2025 9:54:59 AM\n5/12/2025 9:54:59 AM\n5/12/2025 9:54:59 AMStatus\nSENT\nSENT\nSENT\nSENT\nSENT\nERRORM.3500 M.3500\nM.3500 M.3500 M.3500 M.3500",
      "char_length": 889
    }
  ]
}