{
  "source": "C:\\code\\LEGAL_DESTROYER\\INCONSISTENCIES\\Temporary Ex Parte Protective Order 12.22.23-aabb7e6e-1.pdf",
  "base_name": "temporary_ex_parte_protective_order_12_22_23_aabb7e6e_1",
  "page_count": 4,
  "pages": [
    {
      "page_number": 1,
      "text": "26 \nl .J \nCause No.:322 7 4· 4 5 3 8 2 3 \nApplicant: MtJr..GC\\:cl tJ\\,c\\bsll t fV\\iEY2-S § \n§ \n§ \n§ \n§ In the _ __,V'--/'-'S=-I._.e.-\"\"'-'---1 t=-r_.__ ____ Court \nV. of \nRespondent: l\\-\\kQ,,LE<; 1)l)S,T\"( N NW -~-,4-e,'--''-=--'-).?_,_f'r_N_T ____ County, Texas \n. {Y \nt • rder \nGo to the cour h • • JO_ -~~i\\.~ \nCourt Address: ---Lr---:-+.U..?!...~-tt~~~s~ui~=::;;,-Lb~~l.A_~=--=-.::0f;..$..-l--:~Cl:::._ U:::::_U~C::::::__ __ \nFindings: The Co r 1~ swor Affidavit or eclatat1on a(leWo~J~licati~ for Protective Order \nfiled in this case that there is a clear and present danger that the Respondent named below will commit acts of family \nviolence that will cause the Applicant, Children, and/or Other Adults named below immediate and irreparable injury, \nloss, and damage, for which there is no adequate remedy at law. The Court. therefore, enters this Temporary' Ex Parte \nProtective Order without further notice to the Respondent or hearing. No bond is required. \n1 Respondent: The person named below is ordered to follow all Orders marked with a check. \nName: U-\\A e.u~-S D\\)51] rJ M~ EJ2. S County of Residence: 1-A:J?(?_p.. N 'f \n2 Protected People: The following people are protected by the terms of this PROTECTIVE ORDER: \nName: County of Residence: \n0 Applicant:· tv\\DC.,GA JJ N\\\\Ct\\JJL~ M~OS \n□ Children: N\\f\\'2-A ~ V 0·1,HJ I: , t,!\\'-/ f; f? S \nD Other \nAdults: CMD U N f @-0£ f /Vl','E ~.s \n3 Temporary Orders -To prevent family violence, the Court orders the Respondent to obey all orders marked \nwith a check. II' \nThe Respond t (person named in 1) must: \na. 'efl._ Not commit n act agai' st any person named in 2 above that is intended to result in physical harm, bodily \ninjury, assault, r sexL I assault or that is a threat that reasonably places those people in fear of imminent ~hfical harm, b ii¾ injury, assault, or sexual assault. • \nb. & 4it communicate • a reatening or harassing manner with any person named in 2 above. \nc. ~ Not communicat ugh any person to any person named in 2 above. \nTemoorary t:x P'1.rte 0rctectr~·e Qr(!er \nForm Approved by the SuorPme Court of Texas Page 1 of 4 322-744538-23\nFILED\nTARRANT COUNTY\n12/28/2023 9:56 AM\nTHOMAS A. WILDER\nDISTRICT CLERK\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2370
    },
    {
      "page_number": 2,
      "text": "27 \n-\nd. ~ Not· ommunicate or attempt to communicate in any manner with: (Check all that apply) ~ A licant D Children D Other Adults named in 2 above. The Respondent may communicate through: \n----->,----,-------------------- or other person the Court appoints. \nGood ca se exists for prohibiting the Respondent's direct communications. \ne. ~ Not go wit in 200 yards of the (Check all that apply): \n,.Q, Applican D Children D Other Adults named in 2 above. (except to go to court hearings) \nf. &_ Not go within 00 yards of the Residence, workplace, or school of the: (Check all that apply) \n. ~pplicant D her Adults named in 2 above. . \nThe addresses o the prohibited locations are: (Check all that apply) \nD Deemed confide tial. The Clerk is ordered to strike the information fro all public court records and maintain \na confidential rec d of the information for Court use only. \nD Disclosed as folio \nApplicant's Residen e: ---------------+---------------­\nApplicant's Workplac School: ------------+----------------\nOther: ------->r---__,;,----------+-----------------\ng. t/Not possess a firearm or am unition, unless the Respondent is peace officer actively engaged in \nemployment as a sworn, full-ti e paid employee of a state ag ncy or political subdivision. \nh. ~ Not go within 200 yards of the C ildren's Residence, child-c re facility, or school, \nThe addresses of the prohibited lo ations are: (Check all t t apply) \nD Deemed confidential. The Clerk \\·s ordered to strike th information from all public court records and \nmaintain a confidential record oft e information for ourt use only. \nD Disclosed as follows: • \nChildren's Residence: -------'-,------+----------------Chi Id re n's Child-care/School: \\ -----,----+-------------,------\n----O~e~r ~: ~==~~:~::=::::~~~i~~~;;~;;::::::i-;=:-;--;=:~:-~~= i. ~ Not stalk, follow, or engage in conduct directe s ecifically towa p~ Children.,_ or Other Adults \nnamed in 2 above that is reasonably likely to ha {:lSS, annoy, alarm, abuse, torm~arrass them, \nincluding tracking or monitoring a car or other ro'perty. \nj. ~ i'Jot remove the Children from their school child.:~~e facility, or the Applicant's possession. \nk. '$... Not remove the Children from the jurisd· tion of the ~urt. • . . . \nI. D Not take, harm, or interfere with the c re, custody, or control of the following pet, companion animal, \nor assistance animal: \\ (describe the animal). \nm .'fj:-• • • f the Residence loc~ted at: le~ 4 \\ A N N [ CI \n--1..>1+.__....'-'--'~-'-L...._.--'-\"--~'--'-~------------>.:· including, but not limited to, disconnecting \nsuch services to be di onnected. \nn. 00.. ssession of the follm ·ng property: \nL\\/52?;1 \no. ¢..., Not damage, transfer encumber, or otherwise dispose of any property ~nt!Y owned or \nleased by the Appli nt and Respondent, except in the ordinary course of bu~ness or for reasonable and \nnecessary living , penses, including, but not limited to, removing or disabling any vehicle owned \nor possessed b the Applicant or jointly by the parties (whether so titled or not). \nTemporary Ex Parte Protecfr1e Order \nForm Aporoved by the Supreme Court of Tex::is Page 2 of 4 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 3312
    },
    {
      "page_number": 3,
      "text": "28 \n4 ~ Order: cate Residence Immediately 4 iMJ \nThe Court I s that the Residence located at: lele \\ AN Nf c;r Wfrtro)~ft JX 1t; TT'b(Check one): \n~ is jointly o d or leased by the Applicant and Respondent; \n□ is solely owne or leased by the Applicant; or \n□ is soley owned b e Respondent; and the Respondent is obligated to support the Applicant or a child in \nin the Applicant's po ession. \nThe Court further finds that t Applicant currently resides at the Residen , or has resided there within 30 \ndays prior to the filing of the Ap ication for Protective-Order in this case, nd that the Respondent has \ncommitted family violence agains member of the household within 3 days prior to the filing of the \nApplication for Protective Order in t • case. There is a clear and pre ent danger that the Respondent is \nlikely to commit family violence agains a member of the househ61 . \nThe Respondent is therefore ORDERED t vacate the Reside e on or.before: ____ u a.m. □ p.m. on: \n_________ (date) and to remai at least 200 yar s away from the Residence until further order \nof the Court. The Applicant shall have exclusi use and p session of the Residence until further order of \nthe Court. \ntI!J /iT IS FURTHER ORDERED that the sheriff, consta e, or chief of police shall provide a law enforcement I ~fficer to accompany the Applicant to the Reside e, o inform the Respondent that the Court has ordered \nthe Respondent to vacate the Residence, and t provi e protection while the Applicant takes possession of \nthe Residence, and if the Respondent refuse to vacate he Residence, provide protection while the \nApplicant takes possession of the Applican ·s necessary rsonal property. \n5 ©._ Confidentiality of Information \nThe Court Clerk is ordered to strike ntact information for Pr tected People, including: addresses, m'ailing \naddresses, county of residence, te phone numbers, places of mployment, businesses, child-care facilities, and \nschools from the public records the Co_urt, and maintain a con ·dential record of this information. The Clerk of \nthe Court is prohibited from r easing contact information of Prate ed People except to the Court or to law \nenforcement for the purpos of entering the information into the De rtment of Public Safety law enforcement \ninformation system. It is rdered that all contact information fort e Protected People is confidential. \nm._ It is ordered that t e following person is designated as a person to r ceive any notice or documents filed with \nthe Court relate o the application on behalf of the Applicant: \nName: W\\lSDiJ \nAd \nil,_ 1t is ordered that the following person is designated as a person to receive a y notice or documents filed with the \nCourt. \n6 '$J... Go to the Court Hearing \nIT IS FURTHER ORDERED that notice issue to the Respondent to appear, and the Respondent is ORDERED \nto appear in person before this Court at the time and place indicated on page 1 of this form. \nThe purpose of this hearing is to determine whether the Court should issue the Protective Orders and \nother relief requested in the Application for Protective Order filed in this case. \n7 Duration of Order: This Order is effective immediately and shall continue in full force and effect until twenty \n(20) days from the date it is signed, or further order of the Court. \nTemporary Ex Parte for Protective Order \nForn~ .Ar,::proved by the Sl,;pre::1e Court of Tex3s Page 3 of 4 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 3578
    },
    {
      "page_number": 4,
      "text": "29 \n8 □ War • g: A person who violates this order may be punished for contempt of court by a fine of as much as \n$500 or confinement in jail for as long as six mon~hs, f both. \nNo person, in uding a person who is protected by th' order, may give permission to anyone to ignore or \nviolate any pro • ion of this Order. During the time • which this Order is valid, every provision of this \nOrder is in full for e and effect unless a court cha ges the Order. \nIt is unlawful for any rson, other than a pea e officer, as defined by Section 1.07, Penal Code, actively \nengaged in employmen s a sworn, full-tim paid employee of a state agency .or political subdivision, who \nis subject to a Protective rder to posse0 firearm or ammunition. \nIf a person subject to a prote ive ord ~s released from confinement or imprisonment following the date \nthe order would have expired, ~✓ft e order would have expired not later than the first anniversary of the \ndate the person is released from c nfinement or imprisonment, the order is automatically extended to \nexpire on: (1) the first anniversa o the date the person is released, if the person ),Vas sentenced to \nconfinement or imprisonment orate of more than five years; or (2) the second anniversary of the date \nthe person is released if the erson wa sentenced to confinement or imprisonment for a term of ffve years \nor less. \nA violation of this O~d by commission of an ct prohibited by the Order may be punishable by a fine of as \nmuch as $4,000 or b confinement in jail for as I g as one year, or both. An act that results in family \nviolence may be PJ secuted as a separate misdem anor or felony offense. If the act is prosecuted as a \nseparate felon(ffense, it is punishable by confine nt in prison for at least two years. . \nThis is a Court Order. No one -except the Court -can change this Order. \nTemporcny Ex Parte Prctectr/e Order \nForm Apr roved by the Supr2me Court of Texas Page 4 of 4 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2112
    }
  ]
}