{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\12.15.25 - Motion for Judgment as a Matter of Law.pdf",
  "base_name": "12_15_25_motion_for_judgment_as_a_matter_of_law",
  "page_count": 12,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 322-744263-23  \n  \nIN THE MATTER OF                                                    IN THE DISTRICT COURT  \nTHE MARRIAGE OF                                                  \nMORGAN MICHELLE MYERS  \nAND                                                322ND JUDICIAL DISTRICT  \nCHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF  \nM.E.M. AND C.R.M.,  \nCHILDREN                                                                       TARRANT COUNTY, TEXAS  \n \nRespondent’s Motion for Judgment as a Matter of Law (JNOV) and To Render Take -\nNothing Judgment on Petitioner’s Contested Claims  \n \nTO THE HONORABLE JUDGE OF SAID COURT:  \n COMES NOW, Respondent CHARLES DUSTIN MYERS  (“Father”), who submits this \nmotion for judgment as a matter of law (JNOV), and in support thereof, shows this court the \nfollowing:  \nI. INTRODUCTION  \n1. Under Tex. R. Civ. P. 166a(i), once a proper no-evidence motion is filed after an adequate \ntime for discovery, the nonmovant must come forward with more than a scintilla of competent \nsummary judgment evidence on each challenged element or the court must gr ant the motion. \nPetitioner’s response to Father’s no -evidence motion was unsigned and relied on future \ntestimony and unauthenticated materials; it failed to direct the Court to competent, cited \nsummary judgment proof and thus could not defeat the motion. At trial, Petitioner admitted \nmaterial falsities concerning indigence and family violence and offered no exhibits or competent \nproof on her pleaded claims, confirming the total failure of proof.  § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§",
      "char_length": 1583
    },
    {
      "page_number": 2,
      "text": "2 \n 2. Despite this record, the Court denied Father’s no -evidence motion by letter ruling and set \nthe matter for trial; Petitioner’s counsel did not submit the order as directed. The trial proceeded; \nno exhibits were admitted by Morgan Michelle Myers (“Petitioner ”); and the Court took the case \nunder advisement. The complete absence of evidence on essential elements requires judgment as a matter of law in Father’s favor on Petitioner’s contested claims. The Court should now render judgment accordingly and enter final orders consistent with Respondent’s live pleadings and the \nevidence of record.  \nII. BACKGROUND AND PROCEDURAL POSTURE  \n3. Father filed a no -evidence motion specifically challenging essential elements of \nPetitioner’s claims, including: (i) family violence; (ii) existence of any protective order with a finding of family violence; (iii) Petitioner’s indigence on filing; (iv) no tice and hearing \nsupporting February 1, 2024 temporary relief; (v) alleged agreement to March 14, 2024 \n“Agreed” orders; and (vi) best -interest proof for onerous temporary orders . \n4. Petitioner filed an unsigned response asserting that there were genuine issues for trial and \nrequesting fees, but identified no competent summary judgment proof by citation and relied on \nanticipated trial testimony and unauthenticated materials.  \n5. By letter dated December 9, 2025, the Court denied Father’s no-evidence motion and \ndirected Petitioner’s counsel to prepare an order denying relief prior to the December 10, 2025 trial. No proposed order was submitted by Petitioner’s counsel; trial commen ced; Petitioner \npresented no exhibits; and the Court took the matter under advisement  after Petitioner admitted \non the record to lying about family violence to obtain the children and the residence. 6. She also brought unfounded allegations not raised in her pleadings for the first time at \ntrial.",
      "char_length": 1908
    },
    {
      "page_number": 3,
      "text": "3 \n III. LEGAL STANDARDS  \nA. No-evidence summary judgment  \n7. Under Tex. R. Civ. P. 166a(i ), after adequate time for discovery, a movant may challenge \nspecific elements on which the nonmovant bears the burden. The nonmovant must produce more \nthan a scintilla of competent summary judgment evidence raising a genuine issue on each \nchallenged element or the court must grant the motion. See King Ranch, Inc. v. Chapman, 118 \nS.W.3d 742 (Tex. 2003); Mack Trucks, Inc. v. Tamez , 206 S.W.3d 572 (Tex. 2006).  \nB. Competent summary judgment evidence and specificity  \n8. Pleadings and unsworn assertions are not evidence; oral testimony at the hearing is \nprohibited. Tex. R. Civ. P. 166a(c). The response must specifically identify, with record citations, the competent proof on file to be considered. General references or promises of future testimony \nare insufficient. See DeGrate v. Executive Imprints, Inc., 261 S.W.3d 402, 408 (Tex. App.—Tyler \n2008, no pet.).  \nC. Judgment as a matter of law following trial  \n9. In a bench trial, the court must render judgment in accordance with the law and the \nevidence. A claim fails for legal insufficiency when there is a complete absence of evidence of a \nvital fact or the evidence is no more than a scintilla. See King Ranch, 118 S.W.3d at 751. The \ncourt may render judgment notwithstanding the absence of competent proof or on deemed \nadmissions. See Tex. R. Civ. P. 301.  \nD. Deemed admissions and unpleaded claims \n10. Unanswered requests for admissions are deemed admitted and conclusively establish the \nmatter unless withdrawn by motion and order. Tex. R. Civ. P. 198.2(c), 198.3. Issues not raised",
      "char_length": 1658
    },
    {
      "page_number": 4,
      "text": "4 \n by the pleadings are tried by consent only if the parties clearly consent; otherwise, the court must \nconfine judgment to pleaded issues. Tex. R. Civ. P. 67, 301. \nIV. ANALYSIS  \nA. Petitioner failed to defeat the no-evidence motion; the Court should render take -nothing \non the challenged elements.  \n \n11.  Father’s motion identified the specific elements for which no evidence existed and shifted \nthe burden to Petitioner. Petitioner’s unsigned response relied on generalized assertions, \nunauthenticated materials, and future testimony; it did not direct the Co urt to competent, cited \nproof on file. This is legally insufficient to defeat a Rule 166a(i) motion as a matter of law. See DeGrate , 261 S.W.3d at 408. \n12. The Court’s letter denial did not identify any competent evidence meeting Petitioner’s \nburden, and Petitioner’s counsel did not submit the ordered proposed denial, further underscoring the absence of record support. Accordingly, a take -nothing judgment on Petitioner’s contested \nclaims (family violence findings, existence of a protective order, indigence, alleged agreement to “Agreed Orders,” and best -interes t predicate for restrictive temporary orders) should now be \nrendered.  \nB. Trial confirmed a total failure of proof and included incurable admissions by Petitioner  \n13. At trial, Petitioner introduced no exhibits supporting her pleaded claims and admitted to \nmaterial falsehoods regarding indigence and family violence—facts that directly negate the essential elements she pleaded. Oral testimony consisting of unpleaded clai ms raised for the first \ntime is not a lawful substitute for the complete absence of competent proof on the live pleadings, particularly where Respondent objected and did not consent. See Tex. R. Civ. P. 67, 301. On this record, there is a complete absence of evidence on vital facts, requiring judgment as a matter of law. See King Ranch, 118 S.W.3d at 751.",
      "char_length": 1934
    },
    {
      "page_number": 5,
      "text": "5 \n C. Deemed admissions and unpleaded issues independently compel judgment  \n14. Petitioner failed to respond to Father’s written discovery, resulting in deemed admissions \nthat conclusively establish certain issues unless withdrawn by motion and order, which Petitioner \ndid not obtain. See Tex. R. Civ. P. 198.2(c), 198.3. The Court should render judgment consistent with the deemed admissions and disregard unpleaded, last‑minute claims to which Respondent did not consent. See Tex. R. Civ. P. 67.  \nD. The Court should now render final judgment consistent with the record  \n15. Given (i) Petitioner’s failure to defeat the no -evidence motion; (ii) Petitioner’s lack of \ntrial exhibits; (iii) Petitioner’s admissions discrediting essential elements; (iv) deemed admissions; and (v) the absence of trial by consent, the Court should render a take -nothing \njudgment on Petitioner’s contested claims and enter a final decree that:  \ni. Grants a divorce on no -fault grounds as pleaded;  \nii. Respondent respectfully requests that the Court implement his proposed parenting and property transition plan, which includes immediate restoration of his access to the marital residence located at [insert address], currently owned by Petitioner’s grandmot her. \nRespondent relied on this residence for his business operations and as his primary place of work and income. The abrupt and prolonged exclusion from the home —based solely \non allegations that Petitioner has now admitted were false—caused severe financi al and \nprofessional harm, as well as disruption to the children’s stability and the family’s status quo. Accordingly, Respondent requests that the Court order a reasonable transition \nperiod, during which he may re -establish his business activities and resume a normal \nparental role, including but not limited to:",
      "char_length": 1828
    },
    {
      "page_number": 6,
      "text": "6 \n  a.  Immediate access to the residence for a period of not less than eight  \n  months  to facilitate the transition and recovery of business    \n  assets ; \n b. Restoration of his ability to work from the home office ; \n c. Uninterrupted access to the children in accordance with the best interest  \n  standard, and  \n d. Any further relief necessary to restore the parties and children to the  \n  position they would have occupied but for the false allegations and  \n  resulting exclusion.  \n iii. Denies Petitioner’s request for family violence findings and any relief  dependent on  \n     those findings;  \n iv. Denies Petitioner’s request for sole managing conservatorship predicated on family    \n      violence or child abuse allegations;  \n v. Declines to confirm any protective order or family violence finding;  \n vi. Declares there is no evidence that Father agreed to the March 14, 2024 “Agreed”  \n     Orders and that any such characterization is not binding on Father; further, that child     \n     support arrears cannot be derived from an “Agreed Order” only agreed to by one party;  \n vii. Determines conservatorship, possession, and child support in accordance with the    \n       evidence actually admitted (and not on unpleaded claims), the best interest standard     \n       under Tex. Fam. Code § 153.002, and the statutory guidelines where applicable;  \n viii. Divides the community estate in a just and right manner based on admitted evidence, \n        denying any disproportionate division request predicated on unproven fault; and",
      "char_length": 1559
    },
    {
      "page_number": 7,
      "text": "7 \n  ix. Taxes costs and fees as set forth below.  \nV. SANCTIONS, COSTS, AND FEES  \n16. Petitioner’s sworn indigence and family -violence claims were admitted at trial to be false. \nFather requests that the Court:  \n i.  Strike Petitioner’s false statements from the record;  \n ii.  Impose sanctions under Tex. R. Civ. P. 13 and/or Tex. Civ. Prac. & Rem.  \n  Code ch. 10 for groundless pleadings brought in bad faith or for the  \n  purpose of harassment, after notice and opportunity to be heard;  \n iii.  Award Father his reasonable and necessary fees and expenses incurred in  \n  responding to Petitioner’s groundless allegations, including the   \n  no-evidence motion, hearing(s), and trial preparation necessitated by  \n  Petitioner’s conduct; and  retainment of prior counsel;  \n iv. Tax all court costs against Petitioner.  \nVI. ALTERNATIVE RELIEF  \n17. If the Court declines to render final judgment at this time, Father alternatively requests:  \n i.  Entry of written Findings of Fact and Conclusions of Law on Petitioner’s  \n  failure  of proof on each challenged element and on the legal effect of  \n  deemed admissions;  \n ii.  An order striking unpleaded claims and excluding any evidence not timely \n  disclosed;  \n iii.  An order inviting Father to submit a Proposed Final Decree consistent  \n  with this motion within 10 days; and",
      "char_length": 1345
    },
    {
      "page_number": 8,
      "text": "8 \n  iv.  Any other relief necessary to effectuate prompt rendition consistent with  \n  the record.  \nVII. JUD ICIAL NOTICE  \n18. Respondent requests the Court take judicial notice of the following facts that have \nsignificantly undermined the legitimacy of these proceedings . Petitioner ’s initial fabrications \ncombined with this Court ’s misapplication of the law has lead to a two -year long effort by the \nRespondent to correct the  following errors of law:  \nA. Tex. Fam. Code § 6.405(b) ’s Protections Were Ignored  \n19. Pursuant to Tex. Fam. Code § 6.405(b), when a Petitioner claims that an active order of \nprotection exists with a finding of family violence, which is what happened here, a “…copy of \nthe order is not available at the time of filing, the petition must state that a copy of the order will \nbe filed with the court before any hearing .” (emphasis added)  \n20. On January 16, 2024, these protections were disregarded, and the Respondent was \nordered to vacate his residence on four hours ’ notice. In essence, Petitioner now admits that this \nclaim was fal se, and is a prima facie showing of extrinsic fraud  as it prevented Respondent from \npresenting his case, leading to his unjust removal from his matrimonial residence.  \n21. Pursuant to the rule, the Court had no discretion to order his vacatur without the required \ncopy of the alleged active protective order .  \nB. Tex. Fam. Code § 85.001’ s Protections Were Ignored  \n22. Even if the court had the copy of the protective order  (which doesn’ t exist) , it still failed \nto enter into the record the required findings before making the initial , drastic custody",
      "char_length": 1648
    },
    {
      "page_number": 9,
      "text": "9 \n determination  that it made on January 16, 2024. “ [A]t the close of a hearing on an application for \na protective order, the court shall find whether family violence has occurred .” Here, that didn ’t \nhappen, and the deprivation of Respondent ’s rights was compounded.  \nC. Tex. Fam. Code § 105.001’ s Protections Were Ignored  \n23. Section 105.001 governs temporary orders in suits affecting the parent -child relationship \n(SAPCRs). It provides that, except in certain emergency situations, a court may not issue \ntemporary orders affecting possession or access to a child without notice an d a hearing.  \n24.  Specifically, the statute prohibits rendering an order excluding a parent from possession \nor access to a child unless there is a verified pleading or affidavit in accordance with the Texas Rules of Civil Procedure. The only exception to this requirement is  for emergency orders sought \nby a governmental entity under Chapter 262, which may be rendered without notice and an adversary hearing in certain circumstances. This provision is designed to ensure that parents are not summarily deprived of their rights to possession or access without due process, except in emergencies involving child protection by the state, proposition,  Tex. Fam. Code § 105.001. \n25. Here, the Court ’s actions were in direct  contrast to the protections the legislature afforded \nto litigants , and it awarded relief to the parent who, by  her own admissions, brought the suit in \nbad faith  and lied under oath.  \nD. Tex. Fam. Code  § 201.006 Was Disregarded  \n26. The Texas Family Code, specifically section 201.006, governs the referral of cases to \nassociate judges. This provision mandates that a district judge must  render either an individual  \norder of referral for a specific case or a general  order of referral specifying the types of cases that",
      "char_length": 1859
    },
    {
      "page_number": 10,
      "text": "10 \n may be heard by an associate judge. The statute is clear that such an order is a procedural  \nprerequisite for an associate judge to exercise authority over a matter.  \n27. On top of the due process violations above, the Court erred further when it reset the \nmatter before Honorable Associate Judge Jeffrey Kaitcer  on January 22, 2024, without an order \nof referral, and without a general standing order of referral in place.  \n28. However, t he authorities also make clear that, even if an associate judge acts without  \nauthority, the referring district judge may later adopt or sign the associate judge’s \nrecommendations, thereby curing the defect and rendering the  order effective from the date of \nadoption.  \n29. As of filing this document, no such adoption has taken place, meaning all settings \nfollowing January 16, 2024, are procedurally invalid, including the February 1, 2024, setting where a settlement  was drafted, the March 14, 2024, cha llenging t hat settlement, and the \ntemporary orders that followed which bears only the Petitioner ’s signature.  \n30. The only exception to this general rule is for emergency orders sought by a governmental \nentity under Chapter 262. Even in such cases, the statutes impose strict procedural safeguards. Section 262.102 allows for ex parte emergency removal only if there is immediate danger to the child and no time for a hearing.  \n31. The Court need look no further than this sequence of events to recognize that the \nRespondent ’s rights were initially deprived, and then only compounded through future \nproceedings . \n32. The Court now has an opportunity to correct this grave mis carriage of justice by granting \nhim the unopposed relief he has been seeking for nearly two years as a matter of law.",
      "char_length": 1768
    },
    {
      "page_number": 11,
      "text": "11 \n VIII. PRAYER  \n33. WHEREFORE, PREMISES CONSIDERED, Respondent, CHARLES DUSTIN \nMYERS, respectfully prays that the Court:  \n i. Grant this Motion and render judgment as a matter of law, entering a  \n  take-nothing judgment on Petitioner’s contested claims identified in  \n  Respondent’s no-evidence motion;  \n ii.  Render final judgment consistent with Respondent’s live pleadings and the \n  competent evidence admitted;  \n iii.  Disregard and strike unpleaded claims first raised at trial and any evidence \n  supporting them;  \n iv.  Enforce deemed admissions and enter judgment consistent therewith;  \n v. Impose appropriate sanctions and award Respondent his reasonable and  \n  necessary taxable costs and sanctions caused by Petitioner’s groundless  \n  and bad-faith pleadings ; and  \n vi. Award Respondent all such other and further relief, at law or in equity, to  \n  which he may be justly entitled.  \n \nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n Respondent, Pro Se  \n 6641 Anne Court  \n Watauga, Texas 76148  \n Telephone: (817) 546-3693  \n Email:  chuckdustin12@gmail.com  \n Date: 12/15/2025",
      "char_length": 1139
    },
    {
      "page_number": 12,
      "text": "12 \n CERTIFICATE OF CONFERENCE  \n I certify that on December 1 4, 2025, I attempted to confer with counsel for Petitioner and \nthe Office of the Attorney General  via EMAIL  regarding the relief requested herein. Counsel and \nthe OAG did not respond. \n/s/ Charles Dustin Myers  \nCharles Dustin Myers  \n \n \n \n \nCERTIFICATE OF SERVICE  \n I certify that a true and correct copy of the foregoing was served on all counsel and \nparties of record pursuant to Tex. R. Civ. P. 21a  on December 15 , 2025, including:  \ni. Cooper L. Carter, Marx Altman & Johnson, 2905 Lackland Road, Fort Worth, Texas \n76116, coopercarter@majadmin.com , through the EFM. \nii. Office of the Attorney General, Child Support Division, CSD -legal -914@oag.texas.gov \nthrough the EFM.  \n \n/s/ Charles Dustin Myers  \nCharles Dustin Myers",
      "char_length": 805
    }
  ]
}