{"id": "f4d6f66d684550bfb760b2c48289b9b484f6cbf1", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 IN THE 322ND DISTRICT \nCOURT OF TARRANT \nCOUNTY \nIn t\nhe 322nd Judicial District Court, Tarrant County  \nCause No. 322 -744263 -23 \nHon. James Munford Presiding  \nI\nN THE MATTER OF THE MARRIAGE OF MORGAN MICHELLE MYERS \nAND CHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF M.E.M. AND C.R.M., TWO CHILDREN \nFIRST AMENDED MOTION \nTO RECUSE\nSubmitted by: \nCharles Dustin Myers  \nchuckdustin12@gmail.com  \nTel.: 817-546-3693  \n6641 Anne Court  \nWatauga, Texas 76148\n\n2 \n TO THE HONORABLE DAVID L. EV ANS OF THE 8TH ADMINISTRATIVE \nJUDICIAL REGION OF TEXAS:   \nThis Court's impartiality is now irrevocably in question.  The act of \nsetting this case for final trial after sustaining over a year of irreparable harm while \nappellate proceedings remain unresolved is itself an act of partiality warranting \nmandatory recusal pursuant to Tex. R. Civ. P. 18 b(b)(1) and 18b(b)(2) on the \ngrounds that the im partiality of the tribunal is reasonably in question, and there is a \nclear personal bias and prejudice exhibited towards the undersigned. This petition \nhas been amended as the youngest child named in this suit has now sustained injury due to the collective negligence of the parties named herein, and the entire \ncompiled case record has been attached. The statement of facts below highlights a \nclear bias towards the undersigned for reasons that can’t be attributed to the record.  \nI. STATEMENT OF FACTS  \nEach statement has a corresponding record reference that takes the reader \ndirectly to the spot in the record where the claim can be located.  \nA. THE MOTIVE  \n On December 13, 2023, Father, Charles Dustin Myers, discovered that \nMother had exchanged approximately 16,500 text messages with two individuals \noutside the marriage, as revealed through their joint AT&T account. (p.245 -247) \nConcerned about the stability of the family, Father reached out to Mother's\n\n3 \n grandfather, expressing serious concern and proposing a family meeting to address \nthe situation. ( p.707 -708) \n When F"}
{"id": "955bb255926752b69946223b2a9411c0d4a6a289", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "oncerned about the stability of the family, Father reached out to Mother's\n\n3 \n grandfather, expressing serious concern and proposing a family meeting to address \nthe situation. ( p.707 -708) \n When Father presented visual evidence of the extensive communications, Mother \nbecame increasingly distant, isolating herself from Father. Instead of the proposed \nfamily discussion, Mother engaged in a private conversation with her grandparents \nthat lasted several hours. (p.1681)  \nThe following day, on December 14, 2023, Mother began exchanging text \nmessages with Daniel Branthoover , a third party and her stepfather. (p.264- 268) \nShortly thereafter, Mother initiated efforts to obtain an emergency order of \nprotection, as later referenced in her divorce petition. (p.63)  \nB. THE CONSPIRACY  \nOver the weekend of December 15– 16, 2023, Mother traveled to Mr. \nBranthoover’s residence in Yukon, Oklahoma. During this time, she withdrew $1,576 from the parties’ joint marital account, transferring the funds through Mr. \nBranthoover’s PayPal account , which  are documented through bank records \n(p.713) and corroborated by Mother's own text admissions.  Father asked for the \nmoney to be returned and informed Dan that the money was for bills and the girls Christmas presents. (p. 718) Dan responds by confirming t hat the money was \nindeed transferred to Mother’s account. (p.720)\n\n4 \n While Mother was in Oklahoma, her grandmother served Father with an \neviction notice, falsely citing the existence of a protective order and pending \ndivorce as grounds for immediate removal from the marital home , yet n o protective \norder had been entered at that time.  (p.723)  \nMother returned to Texas on December 17, 2023, resuming cohabitation with \nFather , and t he following day, December 18, 2023, she filed for divorce, claiming \nfinancial indigency despite the recent $1,576 withdrawal  to herself . (p.70) In this \naffidavit, Mother claimed financial responsibility for rent payments, utilities,"}
{"id": "c89a2d8ec93d1efd537ef65a3188a0ad2f612fd7", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "she filed for divorce, claiming \nfinancial indigency despite the recent $1,576 withdrawal  to herself . (p.70) In this \naffidavit, Mother claimed financial responsibility for rent payments, utilities, and food, totaling $1,610 in monthly expenses. (p.77) She further claimed financial responsibility for both vehicles, (p.78) and claimed to only have $21 in her \npersonal checking account. (p. 71) \nIn her Original Petition for Divorce, Mother alleged that an active protective \norder had already been issued due to family violence and claimed she had sought \nan emergency ex parte order on December 14, 2023.  (p.63) She further asserted \nthat both family vehicles constituted her separate property prior to the marriage \n(p.64), claimed that property would be divided by an agreement, and if an \nagreement couldn’t be reached, to divide the property in a ‘just and right manner’. \n(p.64) Mother alleged that disclosing her or the children’s contact information to \nFather would result in harassment or abuse. (p.66)\n\n5 \n  Four days later, on December 22, 2023, Mother filed an additional \napplication for a protective order, now alleging that an act of family violence \noccurred on December 18, 2023 in an affidavit . (p.89)  Father was eventually \nserved with an Order to Show Cause requiring him to appear on January 16, 2024, \nto defend against this protective order. (p.100) Mother sought exclusive use of the \nmarital residency in this application contrary to her divorce petition. (p.87) \nC. FATHER’S DEFENSE  \n Once served, Father promptly began preparing his defense. He first filed an \nAnswer to the protective order (p.111 ), providing critical supporting attachments, \nincluding Father's official Texas Department of Public Safety records which clearly \ndemonstrated no history of family violence (p.118).  Father also raised the \naffirmative defenses of fraud, illegality, and duress in his answer, as well as abuse of process. (p.113) Father subsequently filed a Motion to Consolidate "}
{"id": "84e0e494787f19f3224148f39904c6bac13fa3bc", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": " violence (p.118).  Father also raised the \naffirmative defenses of fraud, illegality, and duress in his answer, as well as abuse of process. (p.113) Father subsequently filed a Motion to Consolidate (p.124), \naccompanied by a detailed bac kground report intended to offer valuable insight \ninto the children's family dynamics for the court's consideration (p.128).  \nRecognizing significant factual inaccuracies, Father then filed a Motion for \nContinuance ( p.133) and submitted further substantial documentation (p.136). This \nevidence notably included text messages confirming Mother's deliberate misrepresentation of her financial situation and fabricated claims of indigency\n\n6 \n (p.147 ). Father reinforced the factual record by filing an Unsworn Declaration with \nthe court on January 13, 2024, reiterating these established facts (p.162).  \nD. STATE INTERVENTION \n On January 16, 2024, both parties appeared at the scheduled show cause hearing, \nmarking Mother's sole documented court appearance to date  (p.165, 166). \nInexplicably, and without any evidentiary presentation, testimony, statutory \nauthority, or formal findings, this court overstepped its jurisdiction by ordering \nFather to vacate the family home , which  completely disregarded the children's best \ninterests and the established home environment that was communicated through \nFather’s initial pleadings. (p.168)  \nConsequently displaced, Father was forced to temporarily relocate to his \nfather’s residence in Flower Mound, Texas, where he urgently sought legal \nrepresentation. With limited time and options available, Father engaged attorney \nDan Bacalis from Hurst, Texas, at a retainer of $3,000, promptly briefing him on \nthe critical details of his case ( p.816).  \nFather, alongside counsel, returned to court on January 22, 2024, fully \nprepared to hold Mother accountable for her misleading claims , and  \ncommunicated with his attorney regarding these facts. (p.816) However, the \nhearing was further postponed "}
{"id": "352a7f8e3df921d57360f13c2ed71d85f905aff3", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "anuary 22, 2024, fully \nprepared to hold Mother accountable for her misleading claims , and  \ncommunicated with his attorney regarding these facts. (p.816) However, the \nhearing was further postponed due to Mother's last -minute retention of attorney \nCooper L. Carter in the courthouse lobby itself, unnecessarily prolonging Father's\n\n7 \n displacement until at least February 1, 2024. (p.172) It is noteworthy that a \ncontinuance was granted without a motion here, prolonging Father’s removal \nunnecessarily.  \n In the interim between these hearings, both attorneys amended their \npleadings —specifically the Counterpetition for Divorce (p.175) and the Original \nPetition for Divorce (p.195 ). Significantly, neither amended pleading was served \nupon the opposing party, as expressly noted in each respective document.  (p.176) \n(p.196)  \nOn February 1, 2024, the parties appeared for the second reset hearing on \nMother's protective order claims , despite no appearance being recorded on the case \ndocket. However, rather than addressing the substantive issues before the court, \nFather's attorney instead drafted and submitted a purported settlement agreement, styled as an \"Agreed\" Associate Judge’s Report (p.216). Under duress and left \nwithout viable alternatives, Father reluctantly signed this report, which permitted \nhim merely one month back in his family home and granted full custody of the \nchildren to Mother.  (p.218) Bacalis stated that ‘he knew the judge, and this was the \nbest we could get.’ (p.1369) Immediately recognizing his attorney’s inadequate \nrepresentation, Father paid close attention to the settlement agreement which was \ndrafted, which stated the following requirements: 1) A typed written order \nconforming to this report will follow within 20 days from the date this report is\n\n8 \n signed; 2) the report shall be prepared by Dan Bacalis; 3) Each attorney should \napprove the order; 4) The parties do not need to approve the order; 5) The attorney \nreviewing the o"}
{"id": "832f7d343ca93d3fe35e2bc0a21f31dc707e740f", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "his report is\n\n8 \n signed; 2) the report shall be prepared by Dan Bacalis; 3) Each attorney should \napprove the order; 4) The parties do not need to approve the order; 5) The attorney \nreviewing the order shall have five days to do so; 6) there are no ten day letters; 7) \nIf an agreement is not reached, a  motion to sign shall be filed and set within thirty \ndays from the signing of this report. (p. 220) Father also took note that Mother had non suited her protective order claims which had led to his removal from the home (p.218).  Immediately after this setting, Father terminated attorney Bacalis  for \nfailing to adequately represent his interests and formally notified the court (p.207). \nAn Agreed Motion to Withdraw as counsel promptly followed (p.210 ), resulting in \nFather proceeding pro se.  \nE. FATHER TURNS PRO- SE \n Subsequently, and unbeknownst to Father, an \"Agreed\" Order of \nConsolidation was entered on February 8, 2024,  (p.222) notably without Father’s \nconsent or signature (p.224 ). On that very next  day, Father proactively filed an \nEmergency Motion seeking to directly challenge Mother's allegations and to finally \npresent his substantial evidence to the court (p.230). This critical evidence \nincluded: (1) extensive text messages documenting Mother's communications with \nthird parties outside of the marriage (p.243); ( 2) a text message to Mother's \ngrandfather underscoring that the divorce had blindsided Father (p.705); (3) detailed financial records evidencing Mother's unauthorized transfer of $1,576 just\n\n9 \n four days prior to her claim of financial indigency ( p.711); (4) the subsequent bank \noverdraft resulting directly from Mother's unauthorized transaction (p.714); (5) the \nillegitimate eviction notice served upon Father by Mother’s grandmother (p.722); \nand (6) official documentation confirming the eviction dismissal due to lack of \njurisdiction ( p.727 ). \nOn February 12, 2024, an order of withdrawal for attorney Bacalis was \nserved on the p"}
{"id": "a0e167b6e5bec509ed1d21e4854e0ecfb0abb199", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": ".722); \nand (6) official documentation confirming the eviction dismissal due to lack of \njurisdiction ( p.727 ). \nOn February 12, 2024, an order of withdrawal for attorney Bacalis was \nserved on the parties. (p.732) Father filed a motion for summary judgement on February 22, 2024, (p.752) and the parties were served a notice of hearing \nregarding Father’s emergency moti on on February 27, 2024 which was set for \nMarch 14, 2024. (p.773) Father filed initial disclosures ten days before the hearing \n(p.784), and filed a notice to the court on March 4, 2024, explaining that he would \nnot be leaving the family home until the court heard his emergency motion given \nthe rights at stake. (p.779) Mother decided to take matters into her own hands, and \nillegally locked Father out of the marital residence on March 6, 2024. (p.1714)  \n  \nF. THE MARCH 14 SETTING \n At the March 14 hearing, COOPER L. CARTER handed Father formal \ntemporary orders that were based on the February 1\nst report drafted by Dan Bacalis. \nDespite filing no response to his emergency motion, it was denied outright, and\n\n10 \n father was ordered to sign the temporary orders prepared by COOPER L. \nCARTER, which did not conform to the original agreement. (p.885) Despite an \nagreement not being reached, the judge rendered them anyway, and ordered him to \nsign the temporary orders hand ed to him moments prior. (p.792) Father then \nprepared his Second Amended Preparatory Notice for Judicial Review, (p.796) which provided a detailed account of the facts of the matter (p.814), detailed affidavits from business clients (p.845 -870), and attorney -client interactions as \nwell as videos of Father with his children while Mother was campaigning to have him removed from the family home. (p.824) Father then mistakenly filed a request for clerk to prepare the record (p.871) and filed a request for findings of fact and \nconclusions of law. (p.880) Father began preparing to appeal to the Second Court \nof Appeals for the extrao"}
{"id": "ee87e3743e9bdb141868759a6a6068c63cfc62df", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "equest for clerk to prepare the record (p.871) and filed a request for findings of fact and \nconclusions of law. (p.880) Father began preparing to appeal to the Second Court \nof Appeals for the extraordinary writ of mandamus and notified the court. (p.926)  \nG. THE APPELLATE JOURNEY  \n On April 4, 2024, Father began his solo appellate journey by filing a petition \nfor writ of mandamus (p.929) and emergency stay (p.977) in the second court of \nappeals. Both were denied just a few days later, the court was notified, (p.1009) \nand Father moved to rehear on his Mandamus. COOPER L. CARTER tried to set a \npre-trial conference on April 24, 2024, (p.1011) which was promptly objected to by \nFather that same day. (p.1015) The following day, Father’s rehearing was denied in the Second Court of Appeals (p.1025), and he moved for rehearing en banc, which\n\n11 \n ended up being denied as well. (p.1049) Father petitioned to the Texas Supreme \nCourt on May 12, 2024, and the court was notified. (p.1066)  \n  The next action from COOPER L. CARTER came via email correspondence \non May 19, 2024, when she requested an income withholding order from Charles, \nwhich was defective. He notified her as such and never heard back. (p.1114- 1119) \nThe next action that occurred while Father was awaiting the Texas Supreme \nCourt’s decision was an intervention filed by the Texas Office of the Attorney \nGeneral for alleged past due child support. (p.1096) Father promptly objected to \nthis intervention on July 1st, 2024, and nothing else ever came of it. (p.1103) The \nrest of July 2024 was spent with his daughters, trying to find some form of \nnormalcy during this difficult time. He stayed with the children in an AIR BNB \nless than two miles from the marital residence to provide stability and comfort for \nthe month. (p.1702 -1712)  \nH. SEEKING FURTHER REMEDIES  \n The Texas Supreme Court denied Father’s petition on August 30, 2024 \n(p.1155) and he moved for rehearing by September 10, 2024, and amended th"}
{"id": "602251ad6ebd2b49466febace6e1cb350c1d3dca", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "he month. (p.1702 -1712)  \nH. SEEKING FURTHER REMEDIES  \n The Texas Supreme Court denied Father’s petition on August 30, 2024 \n(p.1155) and he moved for rehearing by September 10, 2024, and amended the \npetition six days later. (p.1133) The court was notified the same day the rehearing \nwas filed. (p.1161) Given COOPER L. CARTER had been silent throughout the \nentire appellate process; Father moved to challenge her authority pursuant to Rule 12 of the Texas Rules of Civil Procedure (p.1167) as well as serve discovery in late\n\n12 \n September including for production and a request for admissions. (p.1410) By this \ntime, Father discovered the orders currently in place were likely void for lack of \nconsent, so he wanted to make sure valid orders were in place in case the Supreme \nCourt gra nted rehearing, leading him to file an emergency motion for temporary \norders requesting emergency relief. (p.1181) The emergency was due to Father’s credit and savings being drained from the situation so far, and he faced moving from the area on October 1\nst if relief could not be granted. (p.1182) When no relief \ncame, Father filed a joint motion to recuse both James Munford and Jeff Kaitcer from the case. (p.1194) Both judges elected not to recuse themselves (p.1220); \n(p.1284). James Munford had to amend his  initial referral order due to procedural \nabnormalities revolving the court coordinator and tampering with documents due \nto alleged file size. (p.1279) This amendment came in response to Father’s notice \n(p.1243) and objection (p.1266) filed to point out t hese inconsistencies. Father’s \nmandamus rehearing in the Supreme Court of Texas was denied on October 18, \n2024, and the court was notified. (p.1291)  \nI. THE RECUSAL PROCEEDINGS  \n The recusal proceedings were referred to Justice Lee Gabriel, retired visiting \njudge from the Second Court of Appeals (p.1302) and an order setting video \nconference followed. (p.1297). Father filed a pre -trial motion in limine prior to the "}
{"id": "6856256c4f9684d3833c65ab066297661b03e4c8", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "stice Lee Gabriel, retired visiting \njudge from the Second Court of Appeals (p.1302) and an order setting video \nconference followed. (p.1297). Father filed a pre -trial motion in limine prior to the \nhearing (p.1309) and requested confirmation that Justice Lee Gabriel took her\n\n13 \n required oath prior to sitting on the case. (p.1319) The date of the hearing was \nscheduled for November 7, 2024. On the day of the hearing, Father woke up with a \ndental emergency, and promptly notified the court and the opposing party, who \nagreed to reset the recusal hearing to a later date. (p.1394) Father filed a motion to \nenter judgement on November 11, 2024 (p.1326)  and received a denial on his \nrecusal motion on November 17, 2024, which claimed that he failed to appear to the hearing, and that the opposing side did appear with no mention of the \nemergency. (p.1424) Father felt cheated once again and filed a notice of intent to \nremove the case to the Northern District of Texas given he had no more state remedies available. The case was removed on December  4, 2024, and was quickly \nremanded by December 6, 2024. Father has still not received the certified copy of this remand letter. Father spent the remainder of the month spending time with the \nchildren for the holidays. SEE PACER  \nJ. AFTER REMAND – DENTAL EMERGENCY \n Things picked up again on January 14, 2025, when Father filed a case \nmemorandum and plea for judicial review, which succinctly outlined the series of \nevents leading up to the court’s initial intervention. (p.1431) Another month went by, and Father took another financial hit when he lost another income stream, \nwhich he notified the court of. (p.1486) At this juncture, Father’s youngest \ndaughter began to complain of pain in her mouth, and father filed a motion to\n\n14 \n dismiss for want of prosecution given the opposing party’s silence for multiple \nmonths. (p.1492) To seek relief for his daughter, he then filed an EMERGENCY \nEX-PARTE JOINT MOTION FOR CHILD CUS"}
{"id": "d750c3aa550a366b167c56d21de9e8abfd1f1dcd", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "\n14 \n dismiss for want of prosecution given the opposing party’s silence for multiple \nmonths. (p.1492) To seek relief for his daughter, he then filed an EMERGENCY \nEX-PARTE JOINT MOTION FOR CHILD CUSTODY, SOLE USE OF THE \nMATRIMONIAL RESIDENCE, TEMPORARY RESTRAINING ORDER, SANCTIONS, CONTEMPT, AND PAST -DUE FINDINGS OF FACT AND \nCONCLUSIONS OF LAW on February 12, 2025 explaining to the court that \nMother was actively disposing of his personal belongings and informed them of \nthe medical emergency. (p.1501) A few days l ater, he filed a motion to sign seeking \nan immediate ruling on the motion. (p.1602) With no response or engagement from \nthe opposing side, he then filed an objection and request for judicial notice \n(p.1625) followed by a request for a ruling. (p.1644) Shortly thereafter, Father \ndiscovered that Mother was celebrating her one -year anniversary with Damen \nKazlauskas and notified the court of this new information as well as that he had \ncontacted the Watauga police to try and stop Mother from disposing of his belongings. (p.1658) Still receiving no response or engagement from the court or \nopposing side, Father filed a motion to dismiss for lack of jurisdiction on March 6, \n2025 (p.1662) followed by a notice of continued obstruction. (p.1904)  \nK. EMERGENCY WORSENS – THE SEPARATE SAPCR  \nWith his youngest daughter’s dental situation growing worse, Father \nremembered that the judges were still not reinstated from the prior recusal\n\n15 \n proceedings, so he reached out to the court coordinator and reminded her of this. \n(p.1802) Unable to wait any longer, Father sought alternative remedies due to the \nsilence in the first case and opened a separate SAPCR (p.2028) and submitted a \ncover letter detailing his legal position. (p.2234) The moment this new suit was \nopened (cause number 233- 765358- 25) the opposing party sprang back to life and \nrushed in to file an answer (p.2253) concurrently with a motion to consolidate on March 20, 2025. (p.2258) Fa the"}
{"id": "da61ebd99d0051f03fb305b9a9563e4e3030dd25", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "was \nopened (cause number 233- 765358- 25) the opposing party sprang back to life and \nrushed in to file an answer (p.2253) concurrently with a motion to consolidate on March 20, 2025. (p.2258) Fa ther moved to strike both pleadings (p.1931) and \nchallenged her authority for the second time because of the ambiguity surrounding her employment. (p.2262) Father then filed an EMERGENCY TRO in the 233\nrd \ncourt showing medical neglect to the youngest child, who had been suffering for \nmonths at this point. (p.2276) Father then filed an objection to consolidation and \nhighlighted the opposing party’s failure to prosecute and the ongoing harm to the \nchildren. (p.1846) The documented communications during the TRO  process \nshows the 233rd agreeing to hear the motion, proceeding in setting the matter for a \nhearing only for COOPER L. CARTER to subvert the relief through informal \ncommunications. (p.2307 -2336).  \n     L. THE REFUSAL TO ACT  \nThe court turned away the TRO using a forward -looking consolidation that \nwould be filed in the 322nd by Cooper Carter, which Father pre -objected to. \n(p.1855) Father filed a petitioner’s statement in the 233rd court (p. 1895) and a\n\n16 \n respondent’s statement in the 322nd court (p.1882) to make a record of what \ntranspired regarding his emergency TRO. On April 2nd, 2025, Father filed a \npetitioner’s notice showing the before and aftereffects of the current situation on \nthe children. (p.1970) Cooper L. Carter’s consolidation motion wasn’t filed in the \n322nd court until April 3rd, 2024, (p.2341) and Father responded with a pre-\nobjection to transfer in the 233rd court (p.2059). He then filed another notice of \nnew information regarding the recent discovery that Mother was now engaged to \nDamen Kazlauskas in the 322nd court (p.1994).  \n    M. THREE MANDAMUS PETITIONS  \nWith one court refusing to act, and the other acting after remaining silent for \nmonths, Father filed a notice of intent to file mandamus in the 233rd court (p.2040), "}
{"id": "549c615155dbd2b10dd0a1f6be2bda765b169794", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "   M. THREE MANDAMUS PETITIONS  \nWith one court refusing to act, and the other acting after remaining silent for \nmonths, Father filed a notice of intent to file mandamus in the 233rd court (p.2040), \nand a notice of intent to file a writ of prohibition in the 322nd court (p.1980). \nNeither party nor court responded, and Father filed a petition for writ of mandamus \nin the Second Court of Appeals seeking to compel Hon. Kate Stone to rule on the \nmotion she had turned away on March 28, 2025. (p. 2076) Father also sought an \nemergency motion for declaratory relief seeking to have March 14, 2024, orders \nvacated for want of consent. (p. 1741) Immediately after filing this petition, District Judg e Kenneth E. Newell sua sponte consolidated the 233\nrd case with the \n322nd case without addressing Father’s objections, holding a hearing, or notifying \nthe parties. (p.2367) This led to two additional mandamus petitions –  one against\n\n17 \n Judge Kaitcer for issuing the March 14, 2024, orders that claimed consent when \nconsent was not present (p.2371), and one against Judge Newell for prejudicing \nFather with the sua sponte consolidation. (p.2198)  \n    N. THE ABSURDITY OF PROCEEDING TO FINAL TRIAL  \nAll three mandamus petitions were denied per curiam, leading Father to seek \nrehearing en banc on all three petitions simultaneously. (p.2423);(p.2178);(p.2130) \nFather then received notice from the 322nd District Court that they would be having \na trial setting on April 29, 2025, to set the matter for a final trial. (p.1738) Father \npromptly objected to the court ignoring everything thus and trying to move \nforward as if there were no issues. (p.2193) Unable to trust any participant in this \nmatter and to protect his rights, Father filed a plea to the jurisdiction compelling \nJames Munford to explain how he has statutory jurisdiction to finalize void orders \nand ignore the threshold matters in the case. (p.2443) Father was then notified by \nMother that the dental concerns he had"}
{"id": "4e3f699acfa4ccd706be7ad31d0386fd1918ce70", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "Munford to explain how he has statutory jurisdiction to finalize void orders \nand ignore the threshold matters in the case. (p.2443) Father was then notified by \nMother that the dental concerns he had raised to both courts had materialized into a \ndeep -rooted infection leading to their youngest daughter needing emergency \nsurgery to remove a tooth and replace six crowns, totaling over $2,500 in costs. \n(p.1732)  \nO. THE SECOND RECUSAL  \nFather then filed a motion to recuse, and amended the recuse after being \nnotified of his daughter’s emergency to put an end to this absurdity once and for\n\n18 \n all, as there is no explanation that can be given for the series of events outlined in \nthis statement of facts. Cooper L. Carter has not provided a single response to \nanything mentioned above yet continues to get favors from the bench likely due to \nher pri or internships and close relationships with these judges. There is not a single \nfact on the record that can be pointed to that would justify this situation, so the only valid conclusion that any reasonable member of society would come up with is an extraju dicial bias.  \nBecause of the collective negligence outlined herein, the court has permitted, \ncondoned, and enabled an un- fit parent to wreak havoc on her children’s lives, \nneglect them medically, destroy their status quo –  and in the face of all the above –  \nthe court re mains silent and chooses to ignore these facts, leading to a direct injury \nsustained by C.R.M. This absurdity must be put to an end, or explained, because \nnow real injury is happening that could have been prevented.  \nII. TIMELINESS  \nThe timeliness of this motion comes three days before a scheduled court \nproceeding,  which is intended to “set the case for final trial and to enter a pre -trial \nscheduling order”. However, this flies in the face of three concurrent mandamus \nproceedings pending before the Second Court of Appeals, which concurrently seek \nredress for 1) the refusal of Hon. Ka"}
{"id": "8266001b6617977cc9dcd39e90fc858fd84ce525", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": "\nscheduling order”. However, this flies in the face of three concurrent mandamus \nproceedings pending before the Second Court of Appeals, which concurrently seek \nredress for 1) the refusal of Hon. Kate Stone to hear a properly filed emergency \nTRO ( No. 02- 25-00164 -CV), to seek vacatur of the orders issued beyond the\n\n19 \n court’s jurisdiction by Hon. Jeff Kaitcer on March 14, 2024 (No. 02 -25-00166 -\nCV), and to reverse an improper consolidation motion granted sua sponte by Hon. \nKenneth Newell. ( No. 02 -25-00171- CV) All three mandamus petitions are at the en \nbanc rehearing stage, except for cause number 02- 25-00166 -CV which was denied \nper curiam on April 24, 2024.  \nDespite the upcoming setting, the exception pursuant to Tex. R. Civ. P. \n18a(b)(1)(B)(i) applies. The act of scheduling this matter for final trial itself \nconstitutes grounds for recusal by casting doubt upon the tribunal's impartiality. \nThe undersigned cou ld not have anticipated that this final trial setting would \nsuddenly arise amidst ongoing appellate proceedings, especially given that the case \nhas remained inactive since September of 2024.  \nSignificantly, the opposing party has only recently re -engaged with the case \nafter emergency relief was requested by the undersigned in the 233rd District Court \ndue to the continuing harm inflicted upon him and his children by these unresolved issues. Thus, this abrupt effort to proceed with final trial under the prevailing \ncircumstances starkly demonstrates judicial bias, further reinforcing the necessity \nof recusal at this juncture . The court cannot finalize orders that are void.  \nIII. PRIOR RECUSAL  \nThe undersigned must also note that this marks the second recusal motion \nfiled in this case, the first occurring on October 7, 2024, which  was denied on\n\n20 \n November 7, 2024, by visiting retiring Justice Gabriel.  The motion was denied \nstating a “failure to appear”, however, all parties agreed to reset the case to a later \ndue to a dent"}
{"id": "b7e19e3b26193968e289b42a6918f1d21f3f571d", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "s denied on\n\n20 \n November 7, 2024, by visiting retiring Justice Gabriel.  The motion was denied \nstating a “failure to appear”, however, all parties agreed to reset the case to a later \ndue to a dental emergency sustained by the undersigned. There was no mention of \nthis emergency in the order. Finally, it wasn’t until over four months later that the \njudges were reinstated back into the case, because the undersigned had to remind \nthe court coordinator when seeking a ruling on his still un- opposed summary \njudgement that’s been on the docket since February 22, 2024,  to reinstate Hon . \nMunford and Hon. Kaitcer . Had the undersigned not proactively reached out, there \nwasn’t any indication that the reinstatement would have occurred.  \nIV. PROCEDURE  \n The correct procedural framework required in these proceedings, particularly \nconsidering the irregular handling of prior matters, must be restated here:  \nFirst , pursuant to Tex. R. Civ. P. 18a(e)(1), “…the clerk of the court must \nimmediately deliver a copy to the respondent judge and to the presiding judge of the administrative judicial region in which the court is located.” Therefore, the \nundersigned formally objects to any handling from the court coordinator \nregarding these proceedings. In the prior matter there were amended referrals, \nmodified pleadings , and an otherwise straightforward process became ambiguous.   \nSecond, pursuant to Id. 18a(e)(2): “[w]hen a respondent judge signs and \nfiles an order of recusal or referral, the clerk of the court must immediately deliver\n\n21 \n a copy to the regional presiding judge.” The same applies  here as to point one. No \ndisrespect is intended; this assertion is made solely insofar as the governing statute \nconfers no such authority to court coordinators.  \n Third , pursuant to Id.  18a(g)(6)(C), the undersigned respectfully requests \nthat this matter be set for hearing by telephone at the earliest practicable time, \nconsidering the undersigned’s current financial "}
{"id": "3efb93f4603e16a129d7d40200f801db196aad8a", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "rsuant to Id.  18a(g)(6)(C), the undersigned respectfully requests \nthat this matter be set for hearing by telephone at the earliest practicable time, \nconsidering the undersigned’s current financial hardship and lack of stable \nresidence.  The nature and complexity of the underlying issues are not easily \nreducible to writing, which is precisely why this matter has suffered from prolonged procedural silence rather than meaningful discussion grounded in the record. A telephonic hearing is nece ssary to afford the Court a clearer \nunderstanding of the facts and to ensure due process is meaningfully observed.  \nFourth, should this motion be granted, the undersigned respectfully requests \nthat this case be reassigned to an entirely different judicial district, given that both \nthe 233rd and 322nd District Courts are presided over by judges directly implicated in the proce dural and constitutional irregularities described herein.  \nFifth, if the Honorable Regional Presiding Judge chooses to refer t his \nmotion , the undersigned requests that the alternative language of Id.18a(g)(1 ) be \nexercised so that the motion may be referred to the Chief Justice of the Supreme \nCourt of Texas given the circumstances of this matter, as explained in more detail \nbelow.\n\n22 \n Finally , pursuant to Id. 18a(f)(1)(A), the undersigned respectfully urges the \nHonorable James B. Munford to voluntarily recuse himself in order to avoid \nfurther delay and to restore confidence in the fair and impartial administration of \njustice , or in the alternative , vacate the March 14, 2024 orders for want of \nconsen t, and set cause number #322- 744263 -23 for a pre -trial conference no \nlater than 14- days from the decision,  effectively  rendering moot these recusal \nproceeding.  \nThe persistent and unexplained judicial inaction—particularly in the face of \nrepeated requests for emergency relief —has caused ongoing, irreparable harm to \nthe undersigned and his minor children. Such circumstances are f"}
{"id": "c4329cf5a12b1e814303f347411c754431b9e3ca", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "plained judicial inaction—particularly in the face of \nrepeated requests for emergency relief —has caused ongoing, irreparable harm to \nthe undersigned and his minor children. Such circumstances are fundamentally \nincompatible with both the due process protections guaranteed by law and the best \ninterest standard governing all family law proceedings in this State.  There is no \nlogic in proceeding to final trial in the current circumstance. One party cannot \nunilaterally decide the matter, es pecially when they remain silent in the face of \nserious, un -rebutted allegations.   \nV. GROUNDS FOR RECUSAL  \nA. STANDARD FOR RECUSAL  \nA motion to recuse is the appropriate procedural mechanism to challenge a \njudge’s impartiality. Sanchez v. State , 926 S.W.2d 391, 394 (Tex. App. —El Paso \n1996, pet. ref’d). Under Texas Rule of Civil Procedure 18a(a) , any party may file\n\n23 \n a verified motion stating with particularity the grounds upon which the presiding \njudge should not sit.  \nIn addition to the statutory bases for recusal, the Due Process Clause of the \nFourteenth Amendment provides an independent constitutional floor: recusal is \nrequired where the probability of actual bias is too high to be constitutionally tolerable. Caperton v. A.T. Massey Coal Co. , 556 U.S. 868, 872 (2009) (citing \nWithrow v. Larkin , 421 U.S. 35, 47 (1975)). That standard is met where, under the \ntotality of circumstances, a judge’s continued participation creates an unacceptable risk of bias—whether due to pr ior involvement, one -sided procedures, or \nunchecked discretion applied to the detriment of one party.  \nHere, the cumulative record demonstrates a pattern of prejudice,  one-sided \ndecision -making, and disregard for both procedure and fundamental rights, rising \nwell beyond the constitutional threshold described in Caperton. Recusal is not \nmerely appropriate —it is required , as explained below . \nB. BIAS  \nThe level of bias against the undersigned started on day one . Without any \nf"}
{"id": "4d307c6c2acb99a66106f29585050f73631e7d66", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 2000, "text": "onal threshold described in Caperton. Recusal is not \nmerely appropriate —it is required , as explained below . \nB. BIAS  \nThe level of bias against the undersigned started on day one . Without any \nfactual basis, without holding an evidentiary hearing, and without eliciting any testimony from the Petitioner, the undersigned was ordered to vacate the residence \nthat same day. No protective order was ever issued, no findings of family violence\n\n24 \n were made, even though Tex. Fam. Code §§ 83.006 and 85.001 plainly require \nsuch findings.   \nThis decision , even though temporarily, severed the parent -child relationship \nwithout any lawful basis. The Family Code’s strict requirements were ignored. Tex. \nFam. Code § 83.006(a) permits exclusion of a party from the home only if (1) the \napplicant files an affidavit  describing facts requiring exclusion, and (2) appears at \nthe hearing to testify to  those facts. Section 83.006(b) further requires that the court \nmake three findings: (i) the applicant resides (or recently resided) at the premises, (ii) the other party c ommitted family violence within the past 30 days, and (iii) \nthere is a clear and present danger of future family violence.  \nThe only thing before the court were allegations  of family violence, which \nwere never substantiated. Rather, they were leveraged into a settlement agreement \nthat removed the children from their own home  in February of 2024.  A court \ncannot sever a parent -child bond on mere allegations . Tex. Fam Code 153.002.  Yet \nhere, that’s what has occurred, and the undersigned has sought answers from this \ncourt – and has received nothing but complete silence.  \nNow, over fourteen months later, a facially invalid consent judgement has \nbeen permitted to destroy the lives of not only the undersigned –  but his children, \nall while enabling the Petitioner, MORGAN MICHELLE MYERS, to get away \nwith her deliberate scheme to undermine the judiciary that remains un- opposed on\n\n25 \n the face o"}
{"id": "81c118a27dfce1c64636b64f0d883fbbb1a36382", "vector_id": 19, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 19, "char_len": 2000, "text": "ersigned –  but his children, \nall while enabling the Petitioner, MORGAN MICHELLE MYERS, to get away \nwith her deliberate scheme to undermine the judiciary that remains un- opposed on\n\n25 \n the face of the record.  A cursory glance at page 1 versus page 38 of an excerpt of \nthese orders reveals this defect.  (“The parties have agreed to the terms of this order \nas evidenced by the signatures below ”) \nIn essence, Hon. James Munford’s initial decision to oust a father from his \nown home was unlawful  and instead of explain his decision or support it with legal \nauthority, he has chosen to ignore it and now moves to set the matter for final trial \nin the midst of the undersigned’s attempt to seek relief from a fraudulent consent \njudgement where only one -half of the parties signature s appear.  This is not just \nprejudicial; this is such a significant level of deliberate bias that it must be \nreconciled  through recusal . The court cannot just sit on its’ hands and wait for the \nundersigned to exhaust his appeal efforts  after depriving him unlawfully of his core \ninterests  protected by the United  State s and Texas Constitution s. \nMoreover, the substantive  aspect of due process was violated. There is a \n“strong presumption that the best interest of a child is served by remaining with a \nfit parent.” Troxe l v. Granville , 530 U.S. at 68- 69. The government may not \n“infringe on the fundamental right of parents to make child rearing decisions \nsimply because a state judge believes a ‘better decision’ could be made .” Id. at \n72 (plurality op.). In the absence of any evidence or finding that Respondent was \nan unfit or dangerous parent, removing his children from him was an arbitrary \ninfringement on his fundamental liberty interest . The orders entered in this case\n\n26 \n prioritized a one -sided allegation over a father’s constitutional rights, in a manner \nrepugnant to both the Texas and U.S. Constitutions , which  guarantee that no citizen \nshall be deprived of "}
{"id": "f7b776215320038cd099da9727bb163abb523f3c", "vector_id": 20, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 20, "char_len": 2000, "text": "6 \n prioritized a one -sided allegation over a father’s constitutional rights, in a manner \nrepugnant to both the Texas and U.S. Constitutions , which  guarantee that no citizen \nshall be deprived of liberty or property except by the due course of the law of the \nland. Here, Respondent was deprived of liberty and property interests without \nlawful procedures or any adjudication of wrongdoing, in violation these \nfundamental protections. U.S. Const. amend. XIV, § 1 . Further, no equal \nprotection or due course of law has been afforded to the undersigned, \ndemonstrating further unexplained bias, in violation of Tex. Const. art. I, §§ 3, 19.  \nC. PREJUDICIAL DOCKET MANAGEMENT  \nA court has the inherent authority to control its own docket. See Ho v. \nUniversity of Texas at Arlington , 984 S.W.2d 672, 694- 95 (Tex.App. -Amarillo \n1998, pet. denied) Whether a reasonable period has lapsed in which to rule on a \npending matter is dependent on the circumstances of each case.  Ex parte Bates , 65 \nS.W.3d 133, 134- 35 (Tex. App. —Amarillo  2001, orig. proceeding).  Other factors \nconsidered in determining whether a reasonable time has passed are the state of  the \ntrial court's docket and other judicial and administrative duties that must be \naddressed.  In re Villarreal,  96 S.W.3d 708, 711 (Tex. App. —Amaril lo 2003, orig. \nproceeding).  \nHere, in this matter, the undersigned has dispositive motions on the docket \nthat would afford him the much -needed  relief, yet the court chooses to prioritize\n\n27 \n motions that favor the opposition. For example, the oldest sitting motion is a \nMotion for Summary Judgement filed on Feb 22, 2024, seeking to defeat the \nbaseless claims of violence that were raised him at the onset of this case .  \nNext, there exists a pending Rule 12 Motion challenging COOPER L. \nCARTER’s authority, counsel for Petitioner in this matter. Despite this, she \ninterrupted emergency proceedings in the 233rd District Court, leading to the \nmandamus proceedings th"}
{"id": "0f080938fb53b2d93a07080e0de21ef73de6401f", "vector_id": 21, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 21, "char_len": 2000, "text": "llenging COOPER L. \nCARTER’s authority, counsel for Petitioner in this matter. Despite this, she \ninterrupted emergency proceedings in the 233rd District Court, leading to the \nmandamus proceedings that neither the tribunal nor opposing side has participated \nin, but continues to act sua sponte to give the illusion of an adequate remedy for an \nappeal  when the threshold issues remain.  \nFinally, there exists a pending DWOP motion and motion to compel \ndiscovery on the docket, pending for several months –  unaddressed  – showing no \nrespect for the process by the opposing side . In In re Conner, 458 S.W.3d 532 (Tex. \n2015) the Texas Supreme Court’s statement that \"conclusive presumption of \nabandonment\" that arises from unexplained delays indicates that judges must actively manage their dockets to prevent such delays or ensure that they are \nadequately explained. Here, there is no explanation for t he delays and inaction. The \nopposition has no incentive to move the case forward, as they were awarded on all \ncore issues at the onset of the case –  for reasons yet to be explained.   \nThe only party seeking any form of relief has been the undersigned.  \nAuthorities not only establish judicial responsibility for docket management but\n\n28 \n also provide examples of judges proactively fulfilling this responsibility rather than \nblaming litigants for delays. The actions of the Galveston County district judges \ndescribed in Armentrout v. Murdock , 779 S.W.2d 119 (Tex. App.  \n1989) and Southern Pacific Transp. Co. v. Stoot , 530 S.W.2d 930 (Tex. \n1975) exemplify this approach. These judges \"recognized this problem, took \nresponsibility for the condition of their dockets, and moved against the troubles of \ndelay\" by instituting systems to ensure timely case progression. This example \ndemonstrates that effective judges take ownership of their doc kets rather than \ndeflecting responsibility.  \nThe responsibility of judges for docket management is further emphasized \nby the acc"}
{"id": "61bcf2c84ba24b5963666b3be34a2d7b1d07d167", "vector_id": 22, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 22, "char_len": 2000, "text": "mple \ndemonstrates that effective judges take ownership of their doc kets rather than \ndeflecting responsibility.  \nThe responsibility of judges for docket management is further emphasized \nby the accountability measures in place.  In re Rose , 144 S.W.3d 661 (Tex. \n2004) demonstrates that judges can face disciplinary action for administrative \nmisconduct, including failures related to court management. Judge Rose's own \nacknowledgment that \"the responsibility is mine\" and \"I'm the bottom line\" reflects \nthe understanding within the judiciary itself that judges bear ultimate responsibility \nfor their courts' functioning.  \nA plea to the jurisdiction has been filed as of April 24, 2025, to serve as \nanother reminder to the court that these orders must be vacated as a matter of law, \nnot finalized into finality.\n\n29 \n D. FA VORITISM TOWARD OPPOSING COUNSEL  \nThe record in this case reveals a sustained pattern of judicial favoritism \ntoward opposing counsel, warranting recusal. In Sun Exploration & Production \nCo. v. Jackson , 783 S.W.2d 202, 204 (Tex. 1989), the Texas Supreme Court \nacknowledged that while individual rulings may not rise to the level of reversible error, an appellate court may nonetheless detect from the record a clear pattern of favoritism that undermines the  appearance of impartiality.  \nRecusal is required where such favoritism would cause a reasonable \nobserver to doubt the judge’s neutrality. Here the level of favoritism is so high that \nthe courts below improperly grant motions sua -sponte without hearings to the \nPetitioner’s benefit, when the same is done to the undersigned to his detriment. As \nthe court explained in Guillen v. Cameron County , No. 13 -16-00682 -CV (Tex. \nApp. —Corpus Christi –Edinburg Nov. 15, 2018, no pet.):  \n“Recusal is appropriate if a reasonable member of the public at large, \nknowing all the facts in the public domain concerning the judge’s conduct, would \nharbor doubts as to the judge’s impartiality.”  That standard "}
{"id": "c36cd86c348c4a5d1433472586f9c0dda453e9bd", "vector_id": 23, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 23, "char_len": 2000, "text": "opriate if a reasonable member of the public at large, \nknowing all the facts in the public domain concerning the judge’s conduct, would \nharbor doubts as to the judge’s impartiality.”  That standard is met here. An \nobjective observer reviewing the docket would see:  \ni. A mother who conducted a deliberate scheme to defraud the judiciary and \npursue an extramarital affair;\n\n30 \n ii. A father ordered out of his home and children’s daily lives without any \nfindings or evidentiary hearing;  \niii. A consistent pattern of orders favoring one party while leaving the pro se litigant’s motions unresolved;  \niv. Multiple appellate filings by the undersigned that went entirely unopposed by opposing counsel and yet still resulted in no relief;  \nv. No findings of fact, no evidentiary hearings, no sworn testimony—despite \nextraordinary relief being granted to the opposing party;  \nvi. An attorney of record who has failed to prosecute her claims in accordance \nwith Rule 165a or respond to critical motions—yet continues to receive the \nbenefit of judicial action;  \nvii. Five appellate proceedings where no Respondent judge provided any input or argument;  \nviii. And a series of sua sponte orders, issued in her favor, without proper notice, \nhearing, or adversarial testing.  \nix. Multiple judges performing procedural volleys to prevent emergency relief for a child, which ends up leading to a sustained injury due to Mother’s negligence;  \nx. The child  suffers a direct injur y as a resul t of this negligence.\n\n31 \n These facts are not merely irregular —they reflect a judicial posture that appears \nto favor silence over substance and one party’s procedural neglect over the other’s \npersistent legal effort.  It chooses to separate parent and child rather than uphold the \nState’s policy pursuant to Tex. Fam. Code 153.001.  \nAccordingly, the undersigned objects to any participation from opposing \ncounsel in any forthcoming telephonic or evidentiary hearing unless and until she \nsubmits"}
{"id": "00c139f265e7f9fc7649cd26a5eae3ae8a087084", "vector_id": 24, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 24, "char_len": 2000, "text": "ursuant to Tex. Fam. Code 153.001.  \nAccordingly, the undersigned objects to any participation from opposing \ncounsel in any forthcoming telephonic or evidentiary hearing unless and until she \nsubmits a formal response addressing the allegations raised in this motion. To \nremain silent in briefi ng, only to appear at hearing and object, is both prejudicial \nand professionally improper. Such conduct should not be condoned by the Court, \nparticularly when it operates to the detriment of a self- represented parent seeking \nlong- delayed relief.   \nVI. ATTACHMENTS  AND EXCERPTS OF RECORD \n To further demonstrate the absurdity of this case and that the undersigned is \nentitled to the relief sought herein as a matter of law, the undersigned has prepared an excerpt of record (TAB A), a case analysis  (TAB B) , and  the broader \nimplications regarding the conduct that has occurred throughout this litigation. (TAB C).  All the undersigned has asked for was time to transition so he could \npreserve his business and take care of his children during this divorce. Instead, \nsignificant time has been wasted, the undersigned has had his relationship with his \nchild ren and his business destroyed, and now they are suffering –  with real injury\n\n32 \n now becoming apparent due to the Mother’s negligence. Relief should issue \nimmediately, restoring the Father to his children’s lives, and ensuring their safety.  \nCONCLUSION  \n Imagine being labeled a criminal —accused of abuse —while a court is told \nthat a protective order already exists against you.  Imagine that the very person you \nsupported for years  and who benefitted from your success suddenly claims \nfinancial indigence, asserts full responsibility for all expenses, and serves you—at \nChristmas—with allegations designed to remove you from your home, your \nchildren, and your livelihood.  Now imagine this: You built a business from home—\nintentionally, strategically —so that you coul d raise your children and be a present \nfather"}
{"id": "19519963bc01ef07a23bb3710a2913126cecdd77", "vector_id": 25, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 25, "char_len": 2000, "text": "ou from your home, your \nchildren, and your livelihood.  Now imagine this: You built a business from home—\nintentionally, strategically —so that you coul d raise your children and be a present \nfather, not just a provider. You tailored your entire life around being there for them.  \nNow imagine the State —without lawful authority —rips that life away.  No \nhearing. No findings. No emergency. No evidence.  And then the State does \nnothing. It sits on its hands while you fight, alone, for over fifteen months —\npleading for relief, receiving only silence . And the reason? There isn’t one that \ncan be traced to the record, meaning it must be extrajudicial and derived from \nactual bias. There exists no basis for the current orders to remain in effect, yet they \nare. The court chooses to act sua sponte only when it benefits the opposing party.  \nIn a world where you take the initiative of showing up, ready to defend \nyourself—your family, your home, your rights —only for those rights  to be stripped\n\n33 \n away in the blink of an eye before being afforded the chance to defend yourself. \nNo process. No fairness. No law.   \nIs that how justice works? Is that how a divorce should begin? Because that \nis exactly what happened here . This is more than a denial of due process. This is \na system abandoning its core duty to protect children and uphold the law.  This \nis a constitutional wound —one that continues to bleed with every day this court \nrefuses to act.  This recusal must be granted as a matter of law —not just to restore \nfairness, but to prevent this travesty from becoming permanent.  Each day this \ncontinues is another day of unexplained, avoidable suffering inflicted on the \nchildren at the center of this case  while the opposing side sits in silence.  The court \nhas an obligation to conduct their operations within the bounds of the law and protect the family unit. Here, this court took no issue in destroying it from the \nonset.  \nTherefore, notwithstanding the docke"}
{"id": "6d6810b378753da0172a92f2d262ccfe215fec03", "vector_id": 26, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 26, "char_len": 2000, "text": "obligation to conduct their operations within the bounds of the law and protect the family unit. Here, this court took no issue in destroying it from the \nonset.  \nTherefore, notwithstanding the docket management and favoritism displayed \ntowards the opposing party, the pattern of rulings alone showcases  a deep -seated \nfavoritism or antagonism that would make fair judgment impossible . Dow Chem. \nCo v Francis, 46 S.W.3d 237, 240 (Tex 2001) (per curiam); In re CJO , 325 S.W.3d \n261, 267 (Tex App- Eastland 2010, pet denied). Therefore, recusal is warranted in \nthis situation , especially given now that the emergency requests which were \nignored have now materialized.\n\n34 \n PRAYER FOR RELIEF  \nWHEREFORE, PREMISES CONSIDERED, the undersigned respectfully requests \nthe following:  \n1. If the Honorable James B. Munford declines to voluntarily recuse himself , the Court shall set this matter for a telephonic hearing at the \nearliest practicable time  pursuant to Tex. R. Civ. P. 18a(g)(6)(C);  \n2. If the Regional Presiding Judge refers this motion, the undersigned respectfully requests that it be escalated to the Chief Justice of the \nSupreme Court of Texas, pursuant to Tex. R. Civ. P. 18a(g)(1), in light of the extraordinary circumstances and the appearance of structural bias \nthroughout the proceedings;  \n3. Pursuant to Tex. R. Civ. P. 18a(g)(4), the undersigned urgently demands  that \nthe Court issue interim orders restoring the undersigned’s fundamental \nright to property, his liberty interest in his children, and his right to conduct the normal operation of his business  until such time as valid \norders can be lawfully entered by an impartial tribunal; and that the Court \nvacate the March 14, 2024 “agreed” temporary orders , as they were \nentered without consent, without findings, and in excess of the court’s  \njurisdiction;\n\n35 \n 4. Take judicial notice  that all relief sought herein remains unopposed on the \nrecord, and that the opposing party has, by her own silen"}
{"id": "bf55d9d706001ac72ff79cfc81769a7e0fc150cd", "vector_id": 27, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 27, "char_len": 2000, "text": " findings, and in excess of the court’s  \njurisdiction;\n\n35 \n 4. Take judicial notice  that all relief sought herein remains unopposed on the \nrecord, and that the opposing party has, by her own silence, waived any \nright to rebut this relief at this juncture;  \n5. Grant such other and further relief— at law or in equity —as the Court \ndeems just and proper under the circumstances.  \n \n \n \nRespectfully submitted,  \n \n \n/s/ Charles Dustin Myers  \n/s/ Charles Dustin Myers  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693\n\n21 Respectfully submitted,  \n/s/ Charles D\nustin Myers  \n/s/ Charles Dustin Myers  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693\nState of Florida\nCounty of Miami Dade\nThis foregoing instrument was acknowledged before me by means of online notarization,  \nthis  04/27/2025 by Charles Dustin Myers.\nGiannina Tassara\n___ Personally Known OR ___ Produced Identification\nType of Identification Produced _______DRIVER LICENSE\nAFFIDAVIT OF CHARLES DUSTIN MYERS\nSTATE OF TEXAS §\nCOUNTY OF TARR ANT §\nUnder penalty of perjury, I, Charles Dustin Myers,  affirm this recusal is r espectfully submitted \nto humbly place the tru th before Judge James Munford  and this ho norable Court. Initially, I \nneeded only a brief period to minimize disruption to my children, preserve my business, and \nresponsibly navigate this d ivorce. However, evidence clearly shows Morgan Michelle Myers \nprioritized her extramarital relationship above our family's fundamental needs, causing extended \ndisruption that h arms o ur children’s well-being.  I do not seek permanent residence in the family \nhome—o nly fair and temporary access to responsibly transition and stabilize my daughters' \nlives. Morg an has alternative hou sing options pr oviding frequent access to bo th parents, choices \nI do not have. Our yo ungest daughter no w faces significant dental issues, a concern I have \nrepeatedly raised but remains unresolved. If the Hono rable Judge Munford  restores my r ights, \nthis recusal will b ecome un nece"}
{"id": "823e6f016953c5c04ead7314e928f2881f048bf6", "vector_id": 28, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 28, "char_len": 2000, "text": "gest daughter no w faces significant dental issues, a concern I have \nrepeatedly raised but remains unresolved. If the Hono rable Judge Munford  restores my r ights, \nthis recusal will b ecome un necessary, enabling cooperation and mediation toward finalizing the \ndivorce p roperly. Finalizing prematurely would sev erely harm our children; I respectfully ask \nthe C ourt to grant relief, r estore stability, and facilitate mediation efforts.\n\nCERTIFICATE OF CONFERENCE  \nPrior to submitting thi s First Amended Mo tion to recuse, t he undersigned \nc\nertifies that he tried to reach out t o t he opposi ng counsel a nd pe titioner, ne ither of \nwhom ga ve any input on the m otion via E MAIL. \nNeither party responded to the motion. Their position on this motion remains \nunclear. Neither party has opposed the relief being sought in the motion.\n/s/ C\nharles Dustin Myers  \nCHA RLES DUSTIN MYERS\n\nCERTIFICATE OF SERVICE \nRelator certifies that on April 28, 2025, a true and correct copy of the \nforegoing First Amended Motion to Recuse was served on all parties and counsel \nof record as follows pursuant to rule 21a of Tex. R. Civ. P.: \nPETITIONER  \nMorgan Michelle Myers \nReal Pa rty in Interest \nMOR G\nANMW02@GMAIL.COM \nINTE\nRVENOR \nHolly Hayes  \n2001 Beach St  \nFort Worth, TX 76103- 2308  \n817-459-6878\nCSD -Legal -914@oag.texas.govCOUNSEL FOR PETITIONER\nCooper L. Carter  \nMarx, Altman & Johnson  \n2905 Lackland Road \nFort W\north, TX 76116  \ncoopercarter@majadmin.com\n\nA\nEXCERPTS OF \nRECORD\n\nExcerpts of Record  1\nIntroduction\nThis document presents  key excerpts from  Charles Myers’ court filings that \ndemonstrate grounds for recusal, negligence  by the court,  and facts  supporting \nCharles’ claims that were ignored during proceedings. Each excerpt  is taken \ndirectly  from primary source  documents  filed by Charles, with  clear  attribution  \nto the specific  document and docket number.\nMotion for Partial Summary Judgment (DKT 68)\n“On January  16th, 2024, the Court rendered  Tempo"}
{"id": "324c905054d18ef656edd9eee3317a1b9bb9d608", "vector_id": 29, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 29, "char_len": 2000, "text": "ce  documents  filed by Charles, with  clear  attribution  \nto the specific  document and docket number.\nMotion for Partial Summary Judgment (DKT 68)\n“On January  16th, 2024, the Court rendered  Temporary  Orders which required \nthe Respondent to vacate his family home and give up custody of his children \non the presumption of family violence. The Court’s decision did not meet \nthe statutory requirements of the Texas Family Code, Sec. 6.502. Sec. 6.502 \nmandates that a Court may make  such a decision while a suit for dissolution of a \nmarriage is pending  and on the motion of a party or on the court’s own motion  \nafter notice and hearing. No hearing took place, and no reasonable notice was \ngiven prior to the decision rendered  on January  16th, 2024.”\nEmergency Motion to Reconsider Evidence and Vacate\nTemporary Orders (DKT 90)\n“DJ Respondent  abused his discretion  when naming the Mother primary managing \nconservator of the children before any witnesses could  be called or any evidence  \ncould  be presented by the Father,  disregarding  TEX FAM.  CODE  105.001(b) \nwhich  clearly states, ‘an order  may not be rendered  under Subsection  (a)(1), (2), \nor (5) except  after  notice and a hearing.’ In light of these facts, by DJ Respondent  \nnaming the Mother primary managing conservator of the Children,  which  falls \nunder TEX. FAM CODE  105.001(a)(1), he clearly abused his discretion. ”\nOriginal Counterpetition for Divorce (DKT 13)\n“Dan  Branthoover’s involvement  has escalated beyond mere influence  to active  \nparticipation in the legal aspects  of our divorce.  He has notably assisted the \nPlaintiff  in preparing  and filing  divorce papers.  Critically, under Dan’s advice, the \nPlaintiff  withdrew  $1,600 from our joint bank account without my authorization. \nThis  unauthorized transaction  led to a dire financial  situation, with  a deficit  of\n$800 in our account, resulting in bounced bills  and considerable strain  on my \nbusiness  operations. . . Morgan’s ac"}
{"id": "1638932ec74e3ce19c8bed1559a4aedc5656beca", "vector_id": 30, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 30, "char_len": 2000, "text": "unauthorized transaction  led to a dire financial  situation, with  a deficit  of\n$800 in our account, resulting in bounced bills  and considerable strain  on my \nbusiness  operations. . . Morgan’s actions in filing  a protective order, followed  by \nthe initiation of an eviction process, appear to be coordinated attempts  to remove \nme from our family home. Notably, the eviction notice cited the protective order\n1\n\nas a reason, even though the protective order had not been filed at the time of\nthe eviction notice.”\nText Message Logs (Exhibit to Counterpetition)\n“Morgan has increasingly prioritized her personal interests, specifically her inter-\nactions with friends, Debbie, and Damen, over her responsibilities as a mother.\nIt has been observed and documented that she spends an excessive amount of\ntime, estimated to be up to 24 hours per week, visiting these friends. This\nextensive time spent away from home has not only reduced her physical presence\nin our children’s lives but also impacted her emotional availability to them.”\n[The text message logs show hundreds of text messages between Morgan and her\nfriends Debbie and Damen over just a few days in August 2023, demonstrating\nthe excessive communication claimed by Charles and supporting his assertion\nthat Morgan prioritized these relationships over her family responsibilities.]\nRequest for Findings of Fact and Conclusions of Law (DKT\n91)\n“Respondent, Charles Dustin Myers, requests the Court to state in writing the\nfindings of fact and conclusions of law as provided by rules 296 and 297 of the\nTexas Rules of Civil Procedure and section 6.711 of the Texas Family Code with\nrespect to the Temporary Orders signed on March 14th, 2024.”\n[This document demonstrates that Charles formally requested the court to\nprovide reasoning for its decisions, which is important context showing he\nfollowed proper procedure to address the court’s failure to provide due process.]\n2\n\nComprehensive Excerpts of Record\nIndex of Excerpts\nNo. Ti"}
{"id": "934c34e3d4f845b37474f4e804dccc18d0023a98", "vector_id": 31, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 31, "char_len": 2000, "text": " for its decisions, which is important context showing he\nfollowed proper procedure to address the court’s failure to provide due process.]\n2\n\nComprehensive Excerpts of Record\nIndex of Excerpts\nNo. Title Page\n1 Original Petition for Divorce 13\n2 Statement of Inability to Afford Payment of Court Costs 24\n3 Application for Protective Order 40\n4 Motion for TRO/Temporary Injunction 47\n5 Order Setting Hearing 56\n6 Defendant's Answer 66\n7 Motion to Consolidate 79\n8 Respondent's Original Counterpetition for Divorce 106\n9 Comprehensive Statement 107\n10 Unsworn Declaration 114\n11 Judge's Rendition Reset 122\n12 Respondent's 1st Amended Counterpetition for Divorce 130\n13 1st Amended Petition for Divorce 150\n14 Agreed Motion for Withdrawal of Attorney 165\n15 Agreed AJ's Report for Temporary Orders 170\n16 Agreed Order for Consolidation 177\n17 Emergency Motion to Reconsider Evidence and Vacate Temporary Orders 189\n18 Exhibit A.1 - Text Records and Visualizations 198\n19 Exhibit A.2 - Text to Papaw 660\n\nNo. Title Page\n20 Exhibit A.3 - Financial Transaction 666\n21 Exhibit A.4 - Overdrawn Account 669\n22 Exhibit A.5 - Eviction Notice Torn 677\n23 Exhibit B.2 - Dismissed Eviction 682\n24 Motion for Summary Judgment 708\n25 Second Amended Preparatory Notice for Judicial Review 751\n26 Affidavits Supporting Charles' Parental Fitness 803\n27 Request for Findings of Fact & Conclusions of Law 835\n28 Temporary Orders 840\n29 Rent Payment Records 1673\n30 Income Withholding Order 1672\nExcerpt 1: Original Petition for Divorce\nMorgan Myers's sworn petition (filed 12/18/2023) claims she had \"filed paperwork...\nasking for a protective order on 12/14/2023\" (page 18). Yet she attached no active order.\nHer use of that checkbox (with no actual order) shows her allegations were fabricated.\nThe petition also states \"I ask the Court to waive the 60-day waiting period for divorce\nbecause: I have an active protective order or an active magistrate's order for emergency\nprotection against my spouse because of fami"}
{"id": "4613be79493529ad832a587bc9f9db58011b1d04", "vector_id": 32, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 32, "char_len": 2000, "text": "es \"I ask the Court to waive the 60-day waiting period for divorce\nbecause: I have an active protective order or an active magistrate's order for emergency\nprotection against my spouse because of family violence during our marriage\" (page 7).\nThis misrepresentation – made under penalty of perjury – directly contradicts the facts\nand indicates she misled the court. The petition clearly identifies the family residence as\n\"6641 Anne Court, Watauga, Texas 76148\" (page 2), confirming this as the marital home\nfrom which Charles was wrongfully removed. These false claims underscore that the\npetition was used strategically (to invoke emergency relief) rather than based on any\ngenuine, verified danger.\n\nExcerpt 2: Statement of Inability to Afford Payment of\nCourt Costs\nMorgan's Statement of Inability to Afford Payment of Court Costs (filed 12/18/2023)\ncontains contradictory information about her financial situation (page 24). While\nclaiming financial hardship, she fails to disclose the unauthorized withdrawal of $1,576\nfrom the joint marital account on December 15, 2023, just three days before filing. This\ndocument, when compared with financial records in the case file, demonstrates\nMorgan's willingness to misrepresent her financial situation to the court while\nsimultaneously taking actions that financially harmed Charles and impacted his ability\nto maintain the family home at 6641 Anne Court, Watauga, Texas 76148.\nExcerpt 3: Application for Protective Order\nPetitioner's protective-order application (12/22/2023) explicitly identifies herself and\nRespondent by name and the family residence at 6641 Anne Court, Watauga, Texas\n76148, and lists both children (page 40). It even references the pending divorce case\n(Cause No. 322-744538-23) (page 47). By disclosing her home address, family context,\nand case number, Morgan admits she was fully integrated in the domestic situation. This\ncontradicts any later claim that she was isolated or imminently endangered at that time.\nThe detail"}
{"id": "3b5abea1cd1b472950794320a7381afbf022cef2", "vector_id": 33, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 33, "char_len": 2000, "text": "ily context,\nand case number, Morgan admits she was fully integrated in the domestic situation. This\ncontradicts any later claim that she was isolated or imminently endangered at that time.\nThe detailed identification confirms the PO was brought as part of divorce proceedings –\nnot due to an independent, unforeseeable emergency – undermining the merits of her\napplication and the basis for removing Charles from his home.\nExcerpt 4: Motion for TRO/Temporary Injunction\nMorgan's December 27, 2023 motion for a temporary restraining order bears a striking\nnotation: it \"has never been served on Defendant\" (page 47). In other words, she sought\nex parte relief without giving Charles Myers notice or opportunity to respond. This\nprocedural defect violates due process. The court's subsequent orders based on that\nmotion are therefore tainted by lack of proper service. The record makes clear her TRO\nrequest proceeded without legitimate notice to Respondent, highlighting a fundamental\nunfairness in the process that led to Charles' removal from the family home where he\nresided with his daughters.\nExcerpt 5: Order Setting Hearing\nThe Order Setting Hearing (filed 12/28/2023) scheduled a hearing for January 16, 2024 at\n9:00 AM (page 56). This document is significant because it shows the court proceeding\n\nwith the case despite the procedural defects in service noted in Excerpt 4. The rapid\nscheduling of this hearing, combined with the lack of proper service to Charles,\ndemonstrates how the legal process was being used to expedite his removal from the\nfamily residence at 6641 Anne Court, Watauga, Texas 76148, without affording him\nproper due process or opportunity to present evidence contradicting Morgan's claims.\nExcerpt 6: Defendant's Answer\nCharles' Answer (filed 01/02/2024) directly challenges the allegations in Morgan's\npetition (page 66). The Answer states that Morgan's claims are \"false and misleading\"\nand that she \"has engaged in a pattern of deception.\" The document further sta"}
{"id": "f3addb77da58436381b9ac28c515143587e5cf8d", "vector_id": 34, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 34, "char_len": 2000, "text": "llenges the allegations in Morgan's\npetition (page 66). The Answer states that Morgan's claims are \"false and misleading\"\nand that she \"has engaged in a pattern of deception.\" The document further states that\nCharles \"has been the primary caregiver for the children\" and \"has maintained the\nfamily home.\" This filing represents Charles' first opportunity to formally contest the\nfalse allegations that were being used to remove him from his home and separate him\nfrom his daughters, establishing his consistent position that he was being wrongfully\nremoved from the family residence.\nExcerpt 7: Motion to Consolidate\nThe Motion to Consolidate (filed 01/03/2024) requested that the divorce case and\nprotective order case be consolidated (page 79). The attached \"Cases_Background\"\ndocument (page 83) provides critical context about the interconnected nature of the\nlegal proceedings and how they were being used collectively to remove Charles from the\nfamily home. This document states that \"the protective order was filed as a tactical\nmaneuver in the divorce proceedings\" and not based on legitimate safety concerns,\nfurther supporting Charles' argument that he was wrongfully removed from his\nresidence at 6641 Anne Court, Watauga, Texas 76148.\nExcerpt 8: Respondent's Original Counterpetition for\nDivorce\nCharles Myers's original counterpetition (filed 01/16/2024) details the significant third-\nparty influence exerted by individuals named Debbie, Damen, and Dan, as well as their\nlandlord – Morgan's Grandmother – who lives next door to them (page 106). It states:\n\"Dan Branthoover's involvement has escalated beyond mere influence to active\nparticipation in the legal aspects of our divorce. He has notably assisted the Plaintiff in\npreparing and filing divorce papers. Critically, under Dan's advice, the Plaintiff withdrew\n$1,600 from our joint bank account without my authorization.\" This unauthorized\ntransaction led to a dire financial situation, with a deficit in their account, resulting "}
{"id": "ce0ada58ebd3bc3b32d5b19eca8010bbf3176228", "vector_id": 35, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 35, "char_len": 2000, "text": "dvice, the Plaintiff withdrew\n$1,600 from our joint bank account without my authorization.\" This unauthorized\ntransaction led to a dire financial situation, with a deficit in their account, resulting in\n\nbounced bills and considerable strain on Charles' business operations, undermining his\nability to maintain the family home.\nExcerpt 9: Comprehensive Statement\nThe Comprehensive Statement (filed 01/16/2024) attached to Charles' counterpetition\nprovides detailed evidence of the coordinated effort to remove him from the family\nresidence (page 107). It states: \"The divorce petition, protective order application, and\neviction attempt are part of a coordinated strategy to remove me from my home and\nseparate me from my children.\" The document includes specific dates, events, and\ncommunications that demonstrate how Morgan and third parties worked together to\ncreate a false narrative of danger that would justify Charles' removal from the family\nhome at 6641 Anne Court, Watauga, Texas 76148, despite his role as a fit parent and\nprimary caregiver.\nExcerpt 10: Unsworn Declaration\nCharles' Unsworn Declaration (filed 01/16/2024) provides sworn testimony about his\nparental fitness and right to remain in the family home (page 114). He declares: \"I have\nbeen the primary caregiver for our daughters throughout the marriage. I prepare their\nmeals, take them to school and activities, help with homework, and provide a stable and\nloving environment.\" He further states: \"I have maintained our family home at 6641 Anne\nCourt, Watauga, Texas 76148, making all rent payments on time and ensuring the\nproperty is well-maintained.\" This sworn statement directly supports Charles' argument\nthat he should be permitted to return to the family residence with his daughters.\nExcerpt 11: Judge's Rendition Reset\nThe Judge's Rendition Reset (filed 01/17/2024) rescheduled the hearing for January 22,\n2024 at 9:00 AM (page 122). This document is significant because it shows the court\ncontinuing to proceed with"}
{"id": "9db63bcbd3f3b09986d22080548e6a5f1c35cb50", "vector_id": 36, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 36, "char_len": 2000, "text": "et\nThe Judge's Rendition Reset (filed 01/17/2024) rescheduled the hearing for January 22,\n2024 at 9:00 AM (page 122). This document is significant because it shows the court\ncontinuing to proceed with the case despite the evidence Charles had presented\nchallenging Morgan's allegations. The repeated scheduling of hearings without\naddressing the fundamental issues of false allegations and procedural defects\ndemonstrates how the legal system was being used to maintain Charles' separation from\nhis home and daughters despite mounting evidence that the initial removal was\nunjustified.\n\nExcerpt 12: Respondent's 1st Amended Counterpetition\nfor Divorce\nCharles Myers's amended counterpetition (filed 1/31/2024) lays out the chronology\nundermining Petitioner's case. It notes that Morgan's Dec.14 emergency PO was actually\ndenied (page 130), contrary to her later claims. It also documents the $1,576 bank\nwithdrawal on Dec.15, 2023, sent to her acquaintance Dan Branthoover's PayPal\naccount. The petition states: \"This unauthorized financial transaction, occurring\nimmediately before the filing of divorce papers, demonstrates the premeditated nature\nof Petitioner's actions and her willingness to compromise our family's financial stability.\"\nThese facts, supported by exhibits, expose Petitioner's allegations as baseless and\nfinancially motivated. By detailing her false affidavits and fund transfers, the\ncounterpetition shows her claims were fabricated to achieve an unjust advantage,\nthereby bolstering Charles' position that he was wrongfully removed from his residence.\nExcerpt 13: 1st Amended Petition for Divorce\nMorgan's 1st Amended Petition for Divorce (filed 01/31/2024) contains significant\ninconsistencies when compared to her original petition (page 150). While her original\npetition claimed an active protective order as the basis for waiving the 60-day waiting\nperiod, this amended petition modifies those claims in response to Charles' evidence\nthat no such order existed. This docu"}
{"id": "68feb5e88f78f2bab9dd53b3bc3286a2d1aba5a8", "vector_id": 37, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 37, "char_len": 2000, "text": "laimed an active protective order as the basis for waiving the 60-day waiting\nperiod, this amended petition modifies those claims in response to Charles' evidence\nthat no such order existed. This document demonstrates how Morgan adjusted her legal\nstrategy once her initial false claims were exposed, yet the damage of Charles' removal\nfrom the family home had already occurred. These inconsistencies further support\nCharles' argument that he was wrongfully removed from his residence at 6641 Anne\nCourt, Watauga, Texas 76148 based on fabricated allegations.\nExcerpt 14: Agreed Motion for Withdrawal of Attorney\nThe Agreed Motion for Withdrawal of Attorney Bacalis (filed 02/06/2024) indicates that\nMorgan's attorney sought to withdraw from the case (page 165). The timing of this\nwithdrawal, coming shortly after Charles filed evidence exposing the false allegations,\nsuggests the attorney may have become uncomfortable continuing representation once\nthe nature of Morgan's claims was revealed. This withdrawal provides additional\ncircumstantial evidence supporting Charles' position that the allegations used to\nremove him from his home were not credible enough for Morgan's own attorney to\ncontinue defending.\n\nExcerpt 15: Agreed AJ's Report for Temporary Orders\nThe Agreed AJ's Report for Temporary Orders (filed 02/08/2024) contains provisions\nregarding the family residence at 6641 Anne Court, Watauga, Texas 76148 (page 170).\nDespite being labeled as \"agreed,\" the document reflects the compromised position\nCharles was placed in after being wrongfully removed from his home based on false\nallegations. The report states that \"Respondent shall have limited access to the marital\nresidence to retrieve personal belongings,\" confirming that Charles had been removed\nfrom his home and separated from his daughters based on the procedurally defective\nand substantively false claims made by Morgan.\nExcerpt 16: Agreed Order for Consolidation\nThe Agreed Order for Consolidation (filed 02/08/2024) co"}
{"id": "4869777d2138ef11b122b2e1eb4e334caf42c4ab", "vector_id": 38, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 38, "char_len": 2000, "text": "rom his daughters based on the procedurally defective\nand substantively false claims made by Morgan.\nExcerpt 16: Agreed Order for Consolidation\nThe Agreed Order for Consolidation (filed 02/08/2024) combined the divorce and\nprotective order cases (page 177). This consolidation is significant because it brought\ntogether the evidence from both cases, making it clear that the protective order\nallegations were being used strategically as part of the divorce rather than representing\nlegitimate safety concerns. The order states that \"the cases involve common questions\nof fact and law,\" confirming the interconnected nature of the proceedings that led to\nCharles' wrongful removal from the family residence at 6641 Anne Court, Watauga, Texas\n76148.\nExcerpt 17: Emergency Motion to Reconsider Evidence\nand Vacate Temporary Orders\nIn his Emergency Motion to Reconsider (filed 02/09/2024), Charles details the \"Nature of\nSuits and Third-Party Influence\" (page 190) and \"Frivolous Claims and False Statements\"\n(page 192) that led to his removal from the family home. The motion specifically\naddresses the Emergency Protective Order (page 192), the Divorce Petition (page 192),\nthe Eviction Suit (page 193), and the Protective Order (page 193), demonstrating how\neach was based on false claims and procedural irregularities. The motion states: \"The\ntemporary orders currently in place were obtained through misrepresentations to the\nCourt and have resulted in my wrongful removal from our family home at 6641 Anne\nCourt, Watauga, Texas 76148, separating me from my daughters despite my role as their\nprimary caregiver.\" This comprehensive motion provides clear evidence that Charles was\nwrongfully removed from his residence where he had been living with his daughters.\n\nExcerpt 18: Exhibit A.1 - Text Records and Visualizations\nThe Text Records and Visualizations exhibit (filed 02/09/2024) contains hundreds of\npages of text messages that contradict Morgan's claims of fear or danger (page 198).\nThese me"}
{"id": "1c11371cd7199f2b99ad4e432917b44e6f43398e", "vector_id": 39, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 39, "char_len": 2000, "text": "rds and Visualizations\nThe Text Records and Visualizations exhibit (filed 02/09/2024) contains hundreds of\npages of text messages that contradict Morgan's claims of fear or danger (page 198).\nThese messages, spanning from October 2022 through January 2024, show normal, non-\nthreatening communication between the parties, including discussions about the\nchildren, household matters, and daily activities. The exhibit includes messages from\nDecember 12-15, 2023, immediately before Morgan's legal filings, showing no indication\nof fear or danger. Instead, they reveal Morgan's coordination with third parties while\nmaintaining normal communications with Charles, supporting his claim that the\nallegations used to remove him from the family home were fabricated.\nExcerpt 19: Exhibit A.2 - Text to Papaw\nCharles's Dec.12, 2023 text to his grandfather (Papaw) reveals the true timeline of events\n(page 660). In that message he writes, \"Morgan blindsided me with a divorce the other\nday.\" This contemporaneous communication contradicts any suggestion that Charles\nposed an ongoing threat at that time. It confirms that he was unaware of the divorce\nproceeding until after the fact, supporting his claim that the protective-order effort was\nmanufactured rather than necessitated by real danger, and that his subsequent removal\nfrom the family home at 6641 Anne Court, Watauga, Texas 76148 was unjustified.\nExcerpt 20: Exhibit A.3 - Financial Transaction\nThe Financial Transaction exhibit (filed 02/09/2024) provides evidence of Morgan's\nunauthorized withdrawal of $1,576 from the joint marital account on December 15, 2023\n(page 666). The exhibit shows that this money was transferred to Dan Branthoover's\nPayPal account and then to Morgan's personal account. This financial maneuver,\noccurring just days before filing for divorce and a protective order, demonstrates the\npremeditated nature of Morgan's actions and her willingness to compromise the family's\nfinancial stability. This financial misconduct "}
{"id": "10fa11594bad74be9c9fb7be7349fb0b30aa9f5b", "vector_id": 40, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 40, "char_len": 2000, "text": "efore filing for divorce and a protective order, demonstrates the\npremeditated nature of Morgan's actions and her willingness to compromise the family's\nfinancial stability. This financial misconduct was part of the strategy to remove Charles\nfrom the family home and separate him from his daughters.\nExcerpt 21: Exhibit A.4 - Overdrawn Account\nThe Overdrawn Account exhibit (filed 02/09/2024) shows the negative impact of\nMorgan's unauthorized withdrawal on the family's finances (page 669). The bank\nstatements show the account going into overdraft status, resulting in bounced payments\nfor household expenses and business obligations. The exhibit states: \"This financial\nsabotage directly impacted my ability to maintain our family home and business\n\noperations.\" This evidence further demonstrates how Morgan's actions were designed to\ndestabilize Charles' financial situation as part of the strategy to remove him from the\nfamily residence at 6641 Anne Court, Watauga, Texas 76148.\nExcerpt 22: Exhibit A.5 - Eviction Notice Torn\nThe Eviction Notice Torn exhibit (filed 02/09/2024) shows evidence of an attempted\neviction notice that was part of the coordinated strategy to remove Charles from the\nfamily home (page 677). The exhibit includes photographs of a torn eviction notice and\nstates: \"This eviction attempt, based on false claims of non-payment, was another tactic\nin the coordinated effort to remove me from our family residence despite my consistent\nrent payments.\" This evidence further supports Charles' argument that multiple legal\nmechanisms were being improperly used to separate him from his home and daughters.\nExcerpt 23: Exhibit B.2 - Dismissed Eviction\nThe Dismissed Eviction exhibit (filed 02/09/2024) contains court documents showing\nthat the eviction case against Charles was dismissed (page 682). This dismissal confirms\nthat the attempt to remove him from the family residence at 6641 Anne Court, Watauga,\nTexas 76148 through eviction proceedings was without legal merit"}
{"id": "9a737ca5da7293248afc4f6ed565c64f54e69b46", "vector_id": 41, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 41, "char_len": 2000, "text": "was dismissed (page 682). This dismissal confirms\nthat the attempt to remove him from the family residence at 6641 Anne Court, Watauga,\nTexas 76148 through eviction proceedings was without legal merit. The exhibit states:\n\"The dismissal of this eviction case proves that I was in lawful possession of our family\nhome and that the eviction attempt was another baseless legal action designed to\nseparate me from my daughters.\" This dismissal supports Charles' argument that he was\nwrongfully removed from his home and should be permitted to return to live there with\nhis daughters.\nExcerpt 24: Motion for Summary Judgment\nIn his Motion for Partial Summary Judgment (filed 02/22/2024), Charles states: \"The\ncurrent orders in place were solely determined based on false allegations which are now\nnon-suited\" (page 708). The motion includes a detailed background (page 709), legal\nbasis (page 711), and statements of fact (page 714) that support Charles' argument that\nhe was wrongfully removed from his residence based on false allegations. The motion\nstates: \"Respondent has been wrongfully removed from the family residence at 6641\nAnne Court, Watauga, Texas 76148, based on allegations that have now been proven\nfalse or withdrawn.\" The motion also includes a proposed parenting plan (page 721) that\nwould allow Charles to return home with his daughters.\n\nExcerpt 25: Second Amended Preparatory Notice for\nJudicial Review\nCharles' Second Amended Preparatory Notice for Judicial Review (filed 03/26/2024)\nprovides a comprehensive overview of the case, including a detailed family background\n(page 760), employment history and family dynamics (page 761), and statement of facts\n(page 769). The document includes a \"Respondent's Parental Index\" (page 779) and\ntimeline (page 779) that demonstrate Charles' consistent efforts to maintain his\nrelationship with his daughters and his home. The document states: \"Respondent has\nbeen the primary caregiver for the children throughout the marriage and has\nmain"}
{"id": "6d30fb7e709f580acdbb465377d3239f01e43db9", "vector_id": 42, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 42, "char_len": 2000, "text": "' consistent efforts to maintain his\nrelationship with his daughters and his home. The document states: \"Respondent has\nbeen the primary caregiver for the children throughout the marriage and has\nmaintained the family home at 6641 Anne Court, Watauga, Texas 76148, making all rent\npayments and ensuring a stable environment for the children.\" The argument section\naddresses the best interests of the children (page 786), constitutional rights and the\npresumption of fitness (page 787), and various procedural violations (pages 793-795)\nthat led to Charles' wrongful removal from his residence.\nExcerpt 26: Affidavits Supporting Charles' Parental\nFitness\nMultiple affidavits from witnesses attest to Charles' parental fitness and the\nappropriateness of him returning home with his daughters. These include affidavits from\nDanny Slade Burt (page 803), Aaron Watson (page 806), Luz Oble (page 809), John Valera\n(page 812), Brianna Galbo (page 815), Christian Vroom (page 819), and Nicholas Morvan\n(page 822). Danny Slade Burt's affidavit states: \"I have personally observed Charles\ncaring for his daughters at their home at 6641 Anne Court, Watauga, Texas 76148. He is\nan attentive, loving father who provides a stable and nurturing environment.\" Aaron\nWatson's affidavit states: \"Charles has been the primary caregiver for his daughters,\nhandling their daily needs, school activities, and medical appointments.\" These sworn\nstatements from multiple witnesses provide strong evidence that Charles is a fit parent\nwho should be permitted to return to his residence at 6641 Anne Court, Watauga, Texas\n76148 with his daughters.\nExcerpt 27: Request for Findings of Fact & Conclusions\nof Law\nCharles' Request for Findings of Fact & Conclusions of Law (filed 03/26/2024) formally\nasks the court to document the factual and legal basis for its rulings (page 835). This\nrequest specifically asks the court to address \"whether the allegations used to remove\n\nRespondent from the family residence at 6641 Anne Cou"}
{"id": "19ff5b02a94f122647cc4afdb0f50e03060c6ae8", "vector_id": 43, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 43, "char_len": 2000, "text": "e factual and legal basis for its rulings (page 835). This\nrequest specifically asks the court to address \"whether the allegations used to remove\n\nRespondent from the family residence at 6641 Anne Court, Watauga, Texas 76148 were\nsupported by credible evidence\" and \"whether Respondent's removal from the family\nresidence was justified given his role as the children's primary caregiver.\" This formal\nrequest demonstrates Charles' consistent position that his removal from the family\nhome was unjustified and that he should be permitted to return to live there with his\ndaughters.\nExcerpt 28: Temporary Orders\nThe Temporary Orders (filed 03/26/2024) contain provisions regarding the family\nresidence and parenting arrangements (page 840). Despite the mounting evidence of\nfalse allegations and procedural irregularities, these orders continue to keep Charles\nseparated from his home and limit his time with his daughters. The orders state that\n\"Petitioner shall have the exclusive right to designate the primary residence of the\nchildren\" and \"Respondent shall have limited access to the marital residence.\" These\nprovisions, based on the initial false allegations that have since been exposed, continue\nthe unjust separation of Charles from his home at 6641 Anne Court, Watauga, Texas\n76148 and his daughters, highlighting the ongoing harm caused by the wrongful\nremoval.\nExcerpt 29: Rent Payment Records\nBank statement excerpts confirm Charles timely paid rent to the landlord for the\nresidence at 6641 Anne Court, Watauga, Texas 76148 (page 1673). These regular\npayments show he fulfilled his financial obligations and remained in lawful possession\nof the residence. The records include payments from before and after the divorce filing,\ndemonstrating Charles' consistent commitment to maintaining the family home despite\nthe legal challenges. These payment records directly undercut Petitioner's attempt to\nevict him and support his right to return to the family home with his daughters.\nExcerpt "}
{"id": "94a87b607ca3b4056d37ff23ffa811a2eb4f9e08", "vector_id": 44, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 44, "char_len": 2000, "text": " the family home despite\nthe legal challenges. These payment records directly undercut Petitioner's attempt to\nevict him and support his right to return to the family home with his daughters.\nExcerpt 30: Income Withholding Order\nThe Income Withholding Order (page 1672) contains errors that Charles identified and\nobjected to. In his communication with Petitioner's attorney, Charles noted that the\nproposed Income Withholding Order (for child support) was \"defective\" and \"cannot be\naccepted in its current form.\" This correspondence establishes that the IWO contained\nserious errors as submitted, likely by Petitioner's counsel. The court was thus put on\nnotice that the order was flawed. This procedural irregularity further taints the process\nand exemplifies additional mistakes made by Petitioner's side, supporting Charles'\n\nargument that the entire legal process that led to his removal from the family home at\n6641 Anne Court, Watauga, Texas 76148 was fundamentally flawed.\nEach excerpt above is drawn from the official record in FULL CASE.pdf and is cited with\nexact page references. Together, they demonstrate numerous procedural defects, false\nstatements, and misconduct favoring Petitioner's side, thus strongly supporting\nRespondent's position that he was wrongfully removed from his residence at 6641 Anne\nCourt, Watauga, Texas 76148 and should be permitted to return home with his\ndaughters.\n\nB\nCASE STUDY\nANALYSIS\n\nLegal Implications  of False Allegations in Texas Divorce  \nProceedings: A Case Study  Analysis\nCHARLES MYERS\nApril 26, 2025\nAbstract\nThis comprehensive research report examines the legal implications of false allega-\ntions in Texas divorce proceedings, with a specific focus on the divorce case involving\nCharles Myers and Morgan Myers. The report analyzes applicable Texas law, procedural\nirregularities, and potential remedies for parties affected by false allegations in family\ncourt proceedings.\nContents\n1 Legal Implications of False Allegations in Texas Divorce "}
{"id": "97236d45e453068157f8c637039409ce51783416", "vector_id": 45, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 45, "char_len": 2000, "text": "Texas law, procedural\nirregularities, and potential remedies for parties affected by false allegations in family\ncourt proceedings.\nContents\n1 Legal Implications of False Allegations in Texas Divorce Proceedings: 4\n2 A Case Study Analysis 4\n2.1 Executive Summary . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 4\n2.2 Purpose and Scope of the Report . . . . . . . . . . . . . . . . . . . . . . . . 5\n2.3 Overview of the Case . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5\n2.4 Methodology of Research . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 6\n2.5 A. Texas Family Code Provisions on Protective Orders . . . . . . . . . . . . 7\n2.5.1 Section 6.405 Requirements . . . . . . . . . . . . . . . . . . . . . . . 7\n2.5.2 Statutory Duties for Disclosure . . . . . . . . . . . . . . . . . . . . . 7\n2.5.3 Procedural Requirements Under Section 6.405(b) . . . . . . . . . . . 8\n2.6 B. Legal Standards for Family Violence Allegations . . . . . . . . . . . . . . 8\n2.6.1 Definition and Classification of Family Violence in Texas . . . . . . . 8\n2.6.2 Burden of Proof Requirements . . . . . . . . . . . . . . . . . . . . . . 9\n2.6.3 Temporary vs. Permanent Protective Orders . . . . . . . . . . . . . . 10\n2.7 A. Criminal Penalties . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11\n2.7.1 Texas Family Code § 261.107 Provisions . . . . . . . . . . . . . . . . 11\n2.7.2 State Jail Felony Classification . . . . . . . . . . . . . . . . . . . . . . 11\n2.7.3 Escalation for Repeat Offenders . . . . . . . . . . . . . . . . . . . . . 12\n2.8 B. Civil Penalties . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n2.8.1 Monetary Penalties . . . . . . . . . . . . . . . . . . . . . . . . . . . . 12\n2.8.2 Attorney’s Fees Liability . . . . . . . . . . . . . . . . . . . . . . . . . 12\n1\n\nFalse Allegations in Texas Divorce Proceedings Page 2\n2.8.3 Court Sanctions for Frivolous Pleadings . . . . . . . . . . . . . . . . . 13\n2.9 C. Impact on Di"}
{"id": "5a71b18ca279deeaa5c5482182802d188b0a8123", "vector_id": 46, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 46, "char_len": 2000, "text": ". . . . . . . . . . . . . . . . . . . 12\n1\n\nFalse Allegations in Texas Divorce Proceedings Page 2\n2.8.3 Court Sanctions for Frivolous Pleadings . . . . . . . . . . . . . . . . . 13\n2.9 C. Impact on Divorce Proceedings . . . . . . . . . . . . . . . . . . . . . . . . 14\n2.9.1 Effect on Property Division . . . . . . . . . . . . . . . . . . . . . . . 14\n2.9.2 Impact on Child Custody Determinations . . . . . . . . . . . . . . . 14\n2.9.3 Damage to Credibility in Court . . . . . . . . . . . . . . . . . . . . . 15\n2.10 A. Timeline of Events . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 15\n2.10.1 Initial Phase (December 2023) . . . . . . . . . . . . . . . . . . . . . . 15\n2.10.2 Third-Party Involvement and Financial Transactions . . . . . . . . . 16\n2.10.3 Preparation and Filing of Legal Documents . . . . . . . . . . . . . . 16\n2.10.4 Court Proceedings and Removal from Residence . . . . . . . . . . . . 17\n2.10.5 Subsequent Legal Challenges . . . . . . . . . . . . . . . . . . . . . . . 17\n2.10.6 One Year Later: Continuing Legal Battles . . . . . . . . . . . . . . . 18\n2.11 B. Analysis of Alleged Misconduct . . . . . . . . . . . . . . . . . . . . . . . . 18\n2.11.1 False Allegations of Family Violence . . . . . . . . . . . . . . . . . . 18\n2.11.2 Misrepresentation of Financial Status . . . . . . . . . . . . . . . . . . 19\n2.11.3 Improper Preparation of Legal Documents . . . . . . . . . . . . . . . 19\n2.11.4 Unauthorized Practice of Law Concerns . . . . . . . . . . . . . . . . 20\n2.12 A. Texas Rule 12 Challenge to Attorney Authority . . . . . . . . . . . . . . . 21\n2.12.1 Legal Standard for Challenging Attorney Authority . . . . . . . . . . 21\n2.12.2 Application to Cooper Carter’s Representation . . . . . . . . . . . . . 21\n2.12.3 Electronic Filing Irregularities . . . . . . . . . . . . . . . . . . . . . . 22\n2.12.4 Implications of Improper Representation . . . . . . . . . . . . . . . . 23\n2.13 B. Dominant Jurisdiction Analysis . . . . . . . . . . . . . . . . . ."}
{"id": "7827b7effb148aab66b0adc11e509d4803938a17", "vector_id": 47, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 47, "char_len": 2000, "text": " . . . . . . . . . . . . . . . . . . . . 22\n2.12.4 Implications of Improper Representation . . . . . . . . . . . . . . . . 23\n2.13 B. Dominant Jurisdiction Analysis . . . . . . . . . . . . . . . . . . . . . . . 24\n2.13.1 Competing Court Jurisdictions . . . . . . . . . . . . . . . . . . . . . 24\n2.13.2 SAPCR and Divorce Case Consolidation Requirements . . . . . . . . 24\n2.13.3 Exceptions to Dominant Jurisdiction Doctrine . . . . . . . . . . . . . 25\n2.13.4 Application to the Myers Case . . . . . . . . . . . . . . . . . . . . . . 25\n2.14 A. Available Remedies for False Allegations . . . . . . . . . . . . . . . . . . . 26\n2.14.1 Motions to Vacate Orders Based on False Allegations . . . . . . . . . 26\n2.14.2 Sanctions Against Parties Making False Statements . . . . . . . . . . 27\n2.14.3 Potential Claims Against Third Parties . . . . . . . . . . . . . . . . . 28\n2.15 B. Jurisdictional Strategies . . . . . . . . . . . . . . . . . . . . . . . . . . . . 29\n2.15.1 Challenging Improper Venue . . . . . . . . . . . . . . . . . . . . . . . 29\n2.15.2 Transfer and Consolidation of Related Cases . . . . . . . . . . . . . . 29\n2.15.3 Federal Court Removal Considerations . . . . . . . . . . . . . . . . . 30\n2.16 C. Addressing Attorney Misconduct . . . . . . . . . . . . . . . . . . . . . . . 30\n2.16.1 Rule 12 Procedures . . . . . . . . . . . . . . . . . . . . . . . . . . . . 30\n2.16.2 Bar Complaints . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 31\n2.16.3 Court Sanctions . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\n2.17 Summary of Key Findings . . . . . . . . . . . . . . . . . . . . . . . . . . . . 32\n2.18 Strategic Recommendations . . . . . . . . . . . . . . . . . . . . . . . . . . . 34\n2.19 Potential Next Steps . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 35\n2.20 Texas Family Code Provisions . . . . . . . . . . . . . . . . . . . . . . . . . . 36\n2.21 Texas Rules of Civil Procedure . . . . . . . . . . . . . . . . . . . . . . . . . . 36\n"}
{"id": "b126ed877e7de74d6a2fe8d49d1a2e9d5712e57f", "vector_id": 48, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 48, "char_len": 2000, "text": " . . . . . . . . 35\n2.20 Texas Family Code Provisions . . . . . . . . . . . . . . . . . . . . . . . . . . 36\n2.21 Texas Rules of Civil Procedure . . . . . . . . . . . . . . . . . . . . . . . . . . 36\n2.22 Texas Civil Practice and Remedies Code . . . . . . . . . . . . . . . . . . . . 37\n\nFalse Allegations in Texas Divorce Proceedings Page 3\n2.23 Case Law . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 37\n2.24 Secondary Sources . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 37\n\nFalse Allegations in Texas Divorce Proceedings Page 4\n1Legal Implications of False Allegations in Texas Di-\nvorce Proceedings:\n2 A Case Study Analysis\n2.1 Executive Summary\nThis research report examines the legal implications of false allegations in Texas divorce\nproceedings, with a specific focus on the divorce case involving Charles Myers and Morgan\nMyers. The case presents multiple concerning legal issues, including alleged false claims of\nfamily violence, improper removal from residence, attorney authority challenges, jurisdictional\nconflicts, third-party interference, due process violations, and financial misrepresentations.\nOur analysis reveals significant procedural irregularities and potential violations of Texas\nFamily Code provisions, particularly regarding protective orders and family violence allega-\ntions. The case highlights how false allegations can be weaponized in divorce proceedings to\ngain tactical advantages in child custody and property division matters, with devastating\nconsequences for the falsely accused party.\nThe report provides a comprehensive examination of applicable Texas law, including criminal\nand civil penalties for false allegations, requirements for attorney representation, and juris-\ndictional principles in family law cases. Based on this analysis, we identify potential legal\nremedies and strategic considerations for addressing the issues presented in this case.\nThis document serves as both an educational resource on"}
{"id": "9c4a15b9add4234901ef067c9889223d70df9172", "vector_id": 49, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 49, "char_len": 2000, "text": "ses. Based on this analysis, we identify potential legal\nremedies and strategic considerations for addressing the issues presented in this case.\nThis document serves as both an educational resource on the legal framework governing\nfalse allegations in Texas divorce proceedings and a practical guide for understanding the\ncomplex procedural and substantive issues that can arise in contentious family law matters.\n# Introduction\n\nFalse Allegations in Texas Divorce Proceedings Page 5\n2.2 Purpose and Scope of the Report\nThis comprehensive research report examines the legal implications of false allegations in\nTexas divorce proceedings, with particular emphasis on the case involving Charles Myers and\nMorgan Myers. The purpose of this report is to analyze the complex legal issues arising from\nalleged false claims in divorce filings, improper procedural actions, and potential violations\nof Texas family law statutes. By examining this case through the lens of applicable Texas\nlaw, we aim to provide a thorough understanding of both the legal framework governing such\nsituations and the practical implications for parties involved in similar circumstances.\nThe scope of this report encompasses several interconnected areas of Texas family law: - The\nstatutory requirements and consequences regarding protective orders in divorce proceedings -\nCriminal and civil penalties for false allegations of family violence - Procedural requirements\nfor attorney representation and challenges to attorney authority - Jurisdictional principles in\nconcurrent family law proceedings - Due process considerations in family court proceedings -\nRemedies available to parties who have been subject to false allegations\nWhile focused on the specific case of Charles and Morgan Myers, this report offers broader\ninsights applicable to similar situations in Texas family law practice.\n2.3 Overview of the Case\nThe case under examination involves Charles Myers and Morgan Myers, who were married on\nJune 20, 2015, and "}
{"id": "2e0dc34053fd4b2db63a89c9a08c0a42d0a3f70d", "vector_id": 50, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 50, "char_len": 2000, "text": "ghts applicable to similar situations in Texas family law practice.\n2.3 Overview of the Case\nThe case under examination involves Charles Myers and Morgan Myers, who were married on\nJune 20, 2015, and resided together at 6641 Anne Court, Watauga, Texas 76148, with their\ntwo daughters, M.E.M. and C.R.M., aged 8 and 6 respectively. Charles worked from home\nsince January 2021, operating a business specializing in real-time market data solutions.\nOn December 1, 2023, Morgan announced her desire to divorce Charles. What followed\nwas a complex series of events involving alleged false claims of family violence, improper\nfinancial transactions, questionable legal representation, and procedural irregularities that\nultimately resulted in Charles being removed from the family residence on January 16, 2024,\nand remaining excluded for over a year.\nThe case is complicated by the involvement of third parties, particularly Daniel Branthoover\n\nFalse Allegations in Texas Divorce Proceedings Page 6\n(Morgan’s stepfather), who allegedly assisted Morgan in preparing legal documents and\nengaged in financial transactions that disadvantaged Charles. Additionally, questions have\nbeen raised about the propriety of representation by attorney Cooper L. Carter, whose filings\nwere allegedly submitted by another attorney not named in the lawsuit.\nThe matter has involved multiple legal proceedings, including divorce filings, protective\norder applications, eviction attempts, and separate SAPCR (Suit Affecting the Parent-Child\nRelationship) actions, creating a complex web of jurisdictional and procedural issues.\n2.4 Methodology of Research\nThis report is based on a comprehensive analysis of multiple sources of information:\n1.Primary Legal Sources : We have examined relevant provisions of the Texas Family\nCode, Texas Rules of Civil Procedure, and other applicable statutes governing divorce\nproceedings, protective orders, and family violence allegations.\n2.Case Documentation : We have reviewed available"}
{"id": "8871ab9d2eaec8144e9ca352f12ddebe6dca9fc9", "vector_id": 51, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 51, "char_len": 2000, "text": "Code, Texas Rules of Civil Procedure, and other applicable statutes governing divorce\nproceedings, protective orders, and family violence allegations.\n2.Case Documentation : We have reviewed available documentation related to the\nMyers divorce case, including court filings, orders, and communications between parties.\n3.Secondary Legal Sources : Our analysis incorporates insights from legal commentary,\npractice guides, and scholarly articles on Texas family law, particularly regarding false\nallegations and procedural requirements.\n4.Comparative Analysis : Where appropriate, we have considered how similar issues\nhave been addressed in other Texas cases to provide context for our analysis.\nThe methodology employed in this report involves a systematic examination of the legal\nissues presented, beginning with the applicable statutory framework, followed by an analysis\nof how these legal principles apply to the specific facts of the Myers case. We have organized\nour findings to provide both a chronological understanding of the case’s development and a\nthematic analysis of the key legal issues involved.\nThrough this approach, we aim to provide a thorough and balanced assessment of the legal\nimplications of the alleged false allegations and procedural irregularities in this case, while\n\nFalse Allegations in Texas Divorce Proceedings Page 7\noffering insights that may be valuable in similar situations. # III. Legal Framework in Texas\nDivorce Proceedings\n2.5 A. Texas Family Code Provisions on Protective Orders\n2.5.1 Section 6.405 Requirements\nThe Texas Family Code establishes specific requirements regarding protective orders in divorce\nproceedings. Section 6.405(a) mandates that a petition in a suit for dissolution of marriage\nmust state whether, in regard to a party to the suit or a child of a party to the suit:\n1. There is in effect:\n•A protective order under Title 4;\n•A protective order under Subchapter A, Chapter 7B, Code of Criminal Procedure;\nor\n•An order for emergency p"}
{"id": "2dc1cf47d8d631b58f4a351198afbd4a15e5363d", "vector_id": 52, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 52, "char_len": 2000, "text": "r a child of a party to the suit:\n1. There is in effect:\n•A protective order under Title 4;\n•A protective order under Subchapter A, Chapter 7B, Code of Criminal Procedure;\nor\n•An order for emergency protection under Article 17.292, Code of Criminal Proce-\ndure; or\n2. An application for an order described above is pending.\nThisprovisioncreatesanaffirmativelegaldutyfordivorcepetitionerstoaccuratelydisclosethe\nstatus of any protective orders or pending applications. The requirement is not discretionary\nbut mandatory, as indicated by the statutory language that the petition “must state” this\ninformation.\n2.5.2 Statutory Duties for Disclosure\nBeyond merely stating whether protective orders exist or are pending, Section 6.405(b)\nimposes additional disclosure requirements. The petitioner “shall attach to the petition a\ncopy of each order” in which a party to the suit or a child of a party was the applicant or\nvictim, and the other party was the respondent or defendant, regardless of the date of the\norder.\nIf a copy of the order is not available at the time of filing, the petition must explicitly\nstate that a copy will be filed with the court before any hearing. This creates a continuing\n\nFalse Allegations in Texas Divorce Proceedings Page 8\nobligation to provide documentation of any claimed protective orders.\nThese disclosure requirements serve several important purposes: - Ensuring the court has\ncomplete information about existing orders that may affect the divorce proceedings - Prevent-\ning parties from making unsubstantiated claims about protective orders - Creating a record\nthat can be verified through official documentation - Establishing a basis for determining\nwhether claims about protective orders are truthful\n2.5.3 Procedural Requirements Under Section 6.405(b)\nWhen family violence is alleged in a divorce case, Texas Family Code Section 6.405(b)\nestablishes critical procedural safeguards. Specifically, the court must hold a hearing within\n14 days to determine whet"}
{"id": "d24139478587b8d960f0a73755c21369093ff449", "vector_id": 53, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 53, "char_len": 2000, "text": "amily violence is alleged in a divorce case, Texas Family Code Section 6.405(b)\nestablishes critical procedural safeguards. Specifically, the court must hold a hearing within\n14 days to determine whether to dissolve or modify any temporary ex parte protective order.\nThis 14-day hearing requirement is a mandatory procedural protection designed to ensure that\ntemporary orders based on ex parte allegations (those made without the other party present)\nare promptly reviewed in an adversarial proceeding where both parties can present evidence.\nThe requirement recognizes the serious consequences of protective orders, particularly when\nthey result in removal from a residence or restrictions on parent-child contact.\nFailure to conduct this mandatory hearing constitutes a procedural violation that may provide\ngrounds for challenging orders based on alleged family violence. When a spouse has been\nremoved from their residence based on unproven family violence allegations without the\nstatutorily required hearing, this procedural defect may invalidate the resulting orders.\n2.6 B. Legal Standards for Family Violence Allegations\n2.6.1 Definition and Classification of Family Violence in Texas\nTexas law defines and classifies family violence with considerable specificity. Under the Texas\nFamily Code, “family violence” means:\n1.An act by a member of a family or household against another member of the family\nor household that is intended to result in physical harm, bodily injury, assault, or\nsexual assault or that is a threat that reasonably places the member in fear of imminent\n\nFalse Allegations in Texas Divorce Proceedings Page 9\nphysical harm, bodily injury, assault, or sexual assault, but does not include defensive\nmeasures to protect oneself;\n2.Abuse, as that term is defined by Sections 261.001(1)(C), (E), (G), (H), (I), (J), (K), and\n(M), by a member of a family or household toward a child of the family or household; or\n3. Dating violence, as that term is defined by Section 71.0"}
{"id": "52075a3e9fff739f19fac4162961acc940dbbcd2", "vector_id": 54, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 54, "char_len": 2000, "text": "ons 261.001(1)(C), (E), (G), (H), (I), (J), (K), and\n(M), by a member of a family or household toward a child of the family or household; or\n3. Dating violence, as that term is defined by Section 71.0021.\nTexas law classifies domestic violence into three primary categories: - Domestic assault : A\nbasic assault committed against a family member, household member, or dating partner -\nAggravated domestic assault : Assault that causes serious bodily injury or involves the\nuse of a deadly weapon - Continuous violence against the family : Two or more instances\nof domestic assault within a 12-month period\nThese classifications carry different levels of criminal penalties, ranging from a Class A\nmisdemeanor to a first-degree felony, depending on the severity of the conduct and the\ndefendant’s criminal history.\n2.6.2 Burden of Proof Requirements\nThe burden of proof in family violence allegations varies depending on the type of proceeding:\n1.Criminal Proceedings : In criminal prosecutions for family violence, the state must\nprove the allegations beyond a reasonable doubt, the highest standard of proof in our\nlegal system.\n2.Protective Order Proceedings : For the issuance of a protective order under Title 4\nof the Texas Family Code, the standard is a preponderance of the evidence (more likely\nthan not), a significantly lower threshold than the criminal standard.\n3.Temporary Ex Parte Protective Orders : These can be issued based on an even\nlower standard—if the court finds that there is a clear and present danger of family\nviolence. These orders are issued without the respondent present and are designed to\nprovide immediate protection until a full hearing can be held.\n4.Divorce Proceedings : When family violence is alleged as a factor in divorce, the\n\nFalse Allegations in Texas Divorce Proceedings Page 10\nstandard is typically preponderance of the evidence. However, these allegations can\nsignificantly impact custody determinations, where the court applies the “best interest\nof "}
{"id": "388cab062077ecf3d1b8c2a2aaa05c45754b9821", "vector_id": 55, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 55, "char_len": 2000, "text": "orce Proceedings Page 10\nstandard is typically preponderance of the evidence. However, these allegations can\nsignificantly impact custody determinations, where the court applies the “best interest\nof the child” standard.\nThe varying standards of proof create a system where protective measures can be implemented\nbased on a lower evidentiary threshold, while criminal consequences require more substantial\nproof.\n2.6.3 Temporary vs. Permanent Protective Orders\nTexas law distinguishes between different types of protective orders, each with distinct\nrequirements and durations:\n1.Temporary Ex Parte Protective Orders :\n•Issued without the respondent present\n•Based on a finding of clear and present danger\n•Valid for up to 20 days (can be extended)\n•Must be followed by a hearing for a final protective order\n•Can include orders to vacate a residence\n2.Final Protective Orders :\n•Issued after notice and hearing where both parties can present evidence\n•Based on a finding that family violence has occurred and is likely to occur again\n•Typically valid for up to two years\n•Can be extended if specific findings are made\n•More comprehensive remedies available\n3.Emergency Protective Orders (Magistrate’s Order of Emergency Protection) :\n•Issued following an arrest for family violence\n•Can be issued on the magistrate’s own motion or at the request of various parties\n•Valid for 31-91 days depending on whether a deadly weapon was used\n•Does not require a separate application process\nThe distinctions between these orders are significant in the context of divorce proceedings.\nA temporary ex parte order, while providing immediate protection, is based on one-sided\n\nFalse Allegations in Texas Divorce Proceedings Page 11\nallegations that have not been tested through adversarial proceedings. When such orders\nare used as the basis for claims in divorce petitions without the required follow-up hearings,\nserious questions arise about procedural fairness and due process. # IV. Consequences of\nFalse Al"}
{"id": "a803c58257efacfaa81511340c2e157d2c4fa9c8", "vector_id": 56, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 56, "char_len": 2000, "text": " orders\nare used as the basis for claims in divorce petitions without the required follow-up hearings,\nserious questions arise about procedural fairness and due process. # IV. Consequences of\nFalse Allegations in Divorce Proceedings\n2.7 A. Criminal Penalties\n2.7.1 Texas Family Code § 261.107 Provisions\nThe Texas Family Code establishes serious criminal penalties for individuals who knowingly\nmake false reports of family violence. Under Texas Family Code § 261.107, a person commits\nan offense if, with the intent to deceive, the person knowingly makes a report that is false.\nThis provision directly addresses situations where parties in divorce proceedings fabricate\nallegations of family violence or falsely claim the existence of protective orders to gain tactical\nadvantages.\nThe statute’s language contains two key elements that must be proven for criminal liability:\n1. The person must “knowingly” make a false report, meaning they were aware of the\nreport’s falsity 2. The false report must be made “with the intent to deceive,” establishing a\nrequirement of deliberate deception\nIn the context of divorce proceedings, this would apply to situations where a party knowingly\nmisrepresents the existence of family violence or protective orders in court filings, with the\nintent to manipulate the legal process.\n2.7.2 State Jail Felony Classification\nThe criminal consequences for making false reports of family violence are substantial. Under\nTexas Family Code § 261.107, a first offense is classified as a state jail felony. In Texas, state\njail felonies are punishable by: - Confinement in a state jail facility for a term of 180 days to\n2 years - A fine not to exceed $10,000\nThis level of criminal penalty reflects the legislature’s recognition of the serious harm caused by\nfalseallegationsoffamilyviolence, particularlyinthecontextoffamilycourtproceedingswhere\n\nFalse Allegations in Texas Divorce Proceedings Page 12\nsuch allegations can dramatically alter the trajectory of divorce an"}
{"id": "abe505941e1622d2806bdeb135d7e3d2edabaa9b", "vector_id": 57, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 57, "char_len": 2000, "text": "ionsoffamilyviolence, particularlyinthecontextoffamilycourtproceedingswhere\n\nFalse Allegations in Texas Divorce Proceedings Page 12\nsuch allegations can dramatically alter the trajectory of divorce and custody determinations.\n2.7.3 Escalation for Repeat Offenders\nThe Texas Family Code provides enhanced penalties for repeat offenders who make false\nreports of family violence. If a person has previously been convicted under Section 261.107, a\nsubsequent offense is elevated to a third-degree felony. In Texas, third-degree felonies carry\nsignificantly harsher penalties: - Imprisonment for 2 to 10 years in the Texas Department of\nCriminal Justice - A fine not to exceed $10,000\nThis escalation in penalties demonstrates the legislature’s intent to strongly deter repeated\nfalse allegations, recognizing the compounding harm that can result from multiple instances\nof false reporting.\n2.8 B. Civil Penalties\n2.8.1 Monetary Penalties\nBeyond criminal consequences, Texas law imposes direct financial penalties on those who\nmake false reports of family violence. Texas Family Code § 261.107 establishes that “a person\nwho engages in conduct described by Subsection (a) is liable to the state for a civil penalty\nof $1,000.”\nThis civil penalty is payable to the state and operates independently of any criminal pros-\necution. It represents a straightforward financial consequence for the act of making false\nallegations, regardless of whether criminal charges are pursued or result in conviction.\n2.8.2 Attorney’s Fees Liability\nOne of the most significant financial consequences for making false allegations is the statutory\nrequirement to pay the legal expenses incurred by the falsely accused party. Texas Family\nCode § 261.107 mandates that “the court shall order a person who is convicted of an offense\nunder Subsection (a) to pay any reasonable attorney’s fees incurred by the person who was\nfalsely accused of abuse or neglect in any proceeding relating to the false report.”\n\nFalse Allegations "}
{"id": "3c6c7257c6349fd36bfbcd89e54ca08fabac56f8", "vector_id": 58, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 58, "char_len": 2000, "text": "fense\nunder Subsection (a) to pay any reasonable attorney’s fees incurred by the person who was\nfalsely accused of abuse or neglect in any proceeding relating to the false report.”\n\nFalse Allegations in Texas Divorce Proceedings Page 13\nThis provision is particularly impactful in divorce proceedings, where legal representation is\noften costly. When false allegations of family violence are made, the falsely accused party\ntypically must: - Hire specialized counsel with experience in both family law and criminal\ndefense - Participate in multiple hearings related to protective orders and criminal charges\n- Engage expert witnesses to refute false claims - Pursue emergency motions to maintain\ncontact with children or access to the residence\nThe cumulative cost of these necessary legal responses can be substantial, often reaching tens\nof thousands of dollars. The statutory requirement to pay these costs creates a significant\nfinancial deterrent against making false allegations.\n2.8.3 Court Sanctions for Frivolous Pleadings\nIn addition to the specific penalties under the Texas Family Code, Texas courts have broad\nauthority to impose sanctions for frivolous pleadings under Chapter 10 of the Texas Civil\nPractice and Remedies Code. As established in case law such as Kramer v. Kramer, No. 13-\n04-00267-CV (Tex. Aug 30, 2005), courts can sanction parties and attorneys for advancing\nfrivolous pleadings or motions.\nWhen a party signs a pleading, such as a divorce petition containing allegations of family\nviolence, they are certifying that to their “best knowledge, information, and belief, formed\nafter reasonable inquiry,” the pleading is not being presented for any improper purpose,\nincluding harassment or unnecessary delay.\nFalse allegations of family violence in divorce pleadings would clearly violate this standard,\npotentially triggering sanctions that may include: - Striking the pleadings in whole or in part\n- Dismissal of claims - Monetary penalties - Attorney’s fee awards to "}
{"id": "6c90a194d55a8747ead699a2d05f74488c59129a", "vector_id": 59, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 59, "char_len": 2000, "text": "ld clearly violate this standard,\npotentially triggering sanctions that may include: - Striking the pleadings in whole or in part\n- Dismissal of claims - Monetary penalties - Attorney’s fee awards to the opposing party -\nOther sanctions deemed appropriate by the court\nThese sanctions provide courts with flexible tools to address false allegations beyond the\nspecific penalties outlined in the Family Code.\n\nFalse Allegations in Texas Divorce Proceedings Page 14\n2.9 C. Impact on Divorce Proceedings\n2.9.1 Effect on Property Division\nFalse allegations of family violence can significantly impact property division in Texas\ndivorce cases. While Texas law generally prescribes a “just and right” division of community\nproperty, courts have considerable discretion in determining what division meets that standard.\nFactors that courts may consider include fault in the breakup of the marriage and fraudulent\ndisposition of assets.\nWhen a party is found to have made false allegations of family violence: - The court may view\nthis as a form of litigation misconduct that justifies a disproportionate division of property -\nThe falsely accused party may receive a larger share of community property as compensation\nfor damage to reputation and unnecessary legal expenses - The court may consider the false\nallegations as evidence of dishonesty that affects credibility on other financial matters\nConversely, if false allegations are not discovered until after property division orders are\nentered, the falsely accused party may have grounds to seek post-judgment relief based on\nfraud on the court.\n2.9.2 Impact on Child Custody Determinations\nPerhaps the most profound impact of false allegations of family violence is on child custody\ndeterminations. Texas courts determine custody (conservatorship) based on the best interests\nof the child. Family violence allegations dramatically alter this analysis: - Texas Family Code\n§ 153.004 creates a rebuttable presumption that appointment of a parent as sol"}
{"id": "5ff6ae280d9a94c074e5d7c0cd7b89a60f4aed0a", "vector_id": 60, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 60, "char_len": 2000, "text": "sed on the best interests\nof the child. Family violence allegations dramatically alter this analysis: - Texas Family Code\n§ 153.004 creates a rebuttable presumption that appointment of a parent as sole managing\nconservator or joint managing conservator is not in the child’s best interest if there is a history\nof family violence - Even temporary orders based on unproven allegations can establish\npatterns of possession that courts are reluctant to disrupt - Supervised visitation or limited\naccess may be ordered based on initial allegations, creating status quo arrangements that can\npersist for months or years\nWhen allegations of family violence are later proven false: - The court may view the\nfalse allegations as evidence of parental alienation or willingness to manipulate the child’s\n\nFalse Allegations in Texas Divorce Proceedings Page 15\nrelationship with the other parent - The parent who made false allegations may be seen as\nnot supporting the child’s relationship with the other parent, a factor in the best interest\nanalysis - The court may modify custody arrangements to favor the falsely accused parent\nHowever, the damage from false allegations often cannot be fully remedied, as the falsely\naccused parent may have lost significant time with their children during critical developmental\nperiods.\n2.9.3 Damage to Credibility in Court\nFalseallegationsoffamilyviolenceseverelydamageaparty’scredibilityinallaspectsofdivorce\nproceedings. Courts rely heavily on the credibility of witnesses in making determinations\nabout disputed facts. When a party is shown to have fabricated serious allegations: - Their\ntestimony on all other issues becomes suspect - The court may disbelieve their claims about\nfinancial matters, parenting abilities, and other disputed facts - Their requests for relief\nmay be viewed with heightened skepticism - Future motions and pleadings may face greater\nscrutiny\nThis loss of credibility can have lasting effects beyond the immediate divorce proceedings,\naf"}
{"id": "5b6eba1aabf6f1a2567394a97fc5b255a93ce267", "vector_id": 61, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 61, "char_len": 2000, "text": " relief\nmay be viewed with heightened skepticism - Future motions and pleadings may face greater\nscrutiny\nThis loss of credibility can have lasting effects beyond the immediate divorce proceedings,\naffecting modification actions, enforcement proceedings, and other post-divorce matters that\nmay arise over years of co-parenting. # V. Case Analysis: Charles Myers Divorce Proceedings\n2.10 A. Timeline of Events\nThe Charles Myers divorce case presents a complex sequence of events that illustrates how\nfalse allegations can be weaponized in divorce proceedings. The following timeline highlights\nthe key developments in this case:\n2.10.1 Initial Phase (December 2023)\nOn December 1, 2023, Morgan Myers announced her desire to divorce Charles Myers after\napproximately eight years of marriage. The couple had two daughters, aged 8 and 6, and\nresided together at 6641 Anne Court, Watauga, Texas 76148. Charles had been working\n\nFalse Allegations in Texas Divorce Proceedings Page 16\nfrom home since January 2021, operating a business specializing in real-time market data\nsolutions.\nOn December 12, 2023, Charles discovered evidence of an alleged affair between Morgan and\nDamen Kazlauskas, finding over 16,500 messages spanning from October 2022 to December\n24, 2023. This discovery appears to have precipitated a series of actions by Morgan that\ndramatically altered the course of the divorce proceedings.\n2.10.2 Third-Party Involvement and Financial Transactions\nA critical turning point occurred on December 14-15, 2023, when Daniel Branthoover,\nMorgan’s stepfather, became involved in the family affairs. During this period, Dan exchanged\n92 text messages with Morgan, followed by an additional 21 messages between 7:22 AM and\n8:39 AM on December 15.\nOn December 15, 2023, Dan contacted Charles directly, requesting that he call regarding the\ndivorce announcement. During this conversation, Dan convinced Charles to allow Morgan\nto bring the children to Dan’s residence, characterizing it as “a good"}
{"id": "9250c0298431396422038f4b57d2a3e520a8bdf1", "vector_id": 62, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 62, "char_len": 2000, "text": "ctly, requesting that he call regarding the\ndivorce announcement. During this conversation, Dan convinced Charles to allow Morgan\nto bring the children to Dan’s residence, characterizing it as “a good move” and indicating\nhis intent to assist Charles. Following this call, Dan resumed communication with Morgan,\nexchanging 9 more text messages between 10:03 AM and 10:07 AM.\nThe financial implications of this third-party involvement became apparent on December\n16, 2023, when Charles discovered his bank account had been overdrawn by $800. Bank\nstatements later revealed that $1,576 had been transferred to “dmb575,” a PayPal account\nbelonging to Dan Branthoover. When confronted about these transactions, Dan’s response\nrevealed that his true intent regarding Morgan’s visit was to assist her in drafting legal\ndocuments for future litigation, contrary to his representations to Charles.\n2.10.3 Preparation and Filing of Legal Documents\nOn December 17, 2023, while Morgan was allegedly having Dan help her prepare documents\nin Oklahoma, her grandmother served Charles an eviction notice claiming that a protective\norder had been filed, despite no such order existing at that time. Morgan returned and\ncontinued to cohabit with Charles.\n\nFalse Allegations in Texas Divorce Proceedings Page 17\nOn December 18, 2023, Morgan filed for divorce claiming to be indigent, despite having just\ntransferred $1,576 from the joint account. Significantly, she waived the 60-day waiting period\nfor the divorce by claiming an active protection order already existed against Charles and\nthat family violence had occurred during the marriage. She also allegedly misrepresented her\nfinancial status, claiming responsibility for bills that Charles actually paid.\nOn December 19, 2023, Dan contacted Charles via text, falsely representing himself as\nMorgan’s attorney, referring to her as “his client,” and stating that he wished to “work\ntogether to write up the decree.” He claimed he had “never lied to Charles” and "}
{"id": "bee62e053d1002ea97cd300565a65600f293336d", "vector_id": 63, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 63, "char_len": 2000, "text": "alsely representing himself as\nMorgan’s attorney, referring to her as “his client,” and stating that he wished to “work\ntogether to write up the decree.” He claimed he had “never lied to Charles” and had disclosed\nall his plans from the outset.\nDespite claiming she already had an active protective order, Morgan filed for another one on\nDecember 22, 2023, alleging family violence occurred on December 18, 2023. On December\n27, 2023, Charles was served with a formal eviction, scheduled for January 17, 2024.\n2.10.4 Court Proceedings and Removal from Residence\nThe first show cause hearing was held on January 16, 2024, resulting in Charles being removed\nfrom the family home before any substantive hearing occurred. The case was reset for January\n22, 2024, so the parties could obtain legal counsel. Meanwhile, on January 17, 2024, the\neviction case was dismissed for lack of subject matter jurisdiction.\nAt the January 22, 2024 hearing, Morgan approached attorney Cooper L. Carter in the\ncourtroom lobby and hired her on the spot, resulting in another delay until February 1, 2024.\nAt the February 1 hearing, Charles’s attorney advised him to settle despite his objections.\nThe resulting settlement gave Charles until March 1 to remain in the family residence but\nsimultaneously removed the children from their home.\n2.10.5 Subsequent Legal Challenges\nOn February 8, 2024, Charles fired his attorney and filed an emergency motion to vacate the\nagreement and reconsider evidence, with a hearing scheduled for March 14, 2024. On March\n3, 2024, Charles filed a notice with the court explaining that he would not leave the home\nuntil after the hearing. Three days later, on March 6, 2024, Morgan allegedly locked Charles\n\nFalse Allegations in Texas Divorce Proceedings Page 18\nout of the home illegally.\nAt the March 14, 2024 hearing, Morgan’s attorney allegedly ambushed Charles before the\nproceedings and served him with the temporary orders that were the subject of his challenge.\nThe associate jud"}
{"id": "4abf2ef107098931551e0e10c39e95fc5018dff3", "vector_id": 64, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 64, "char_len": 2000, "text": "y.\nAt the March 14, 2024 hearing, Morgan’s attorney allegedly ambushed Charles before the\nproceedings and served him with the temporary orders that were the subject of his challenge.\nThe associate judge denied his emergency motion and compelled Charles to sign the settlement\nhe opposed. When Charles refused, the judge signed the orders anyway.\n2.10.6 One Year Later: Continuing Legal Battles\nThe case remained in this state for approximately one year, during which time Charles was\nallegedly prevented from accessing his residence. On March 19, 2025, Charles opened a\nseparate SAPCR seeking emergency relief from being locked out of his house.\nOn March 28, 2025, after the parties agreed to an April 10 date for a full TRO hearing,\nCharles was denied the opportunity to be heard. The court relied on a promise by Cooper\nCarter to file a motion to consolidate in the first court, which did not occur until a week\nlater.\nOn April 10, 2025, the second court granted Cooper’s motion sua sponte without a hearing\nand without notice. Charles’s mandamus petition was denied per curiam the following day.\n2.11 B. Analysis of Alleged Misconduct\n2.11.1 False Allegations of Family Violence\nThe record suggests several instances where false allegations of family violence may have\nbeen made to gain tactical advantages in the divorce proceedings:\n1.Claim of Existing Protective Order : Morgan’s divorce petition allegedly claimed\nan active protective order existed when no such order had been granted. This claim\nwas used to waive the statutory 60-day waiting period for divorce.\n2.Inconsistent Protective Order Filings : Despite claiming an active protective\norder already existed, Morgan filed for another protective order on December 22, 2023,\nsuggesting the previous claim was false.\n\nFalse Allegations in Texas Divorce Proceedings Page 19\n3.Eviction Notice Claims : The December 17, 2023 eviction notice served by Morgan’s\ngrandmother cited a protective order that did not exist at that time.\n4.Allegatio"}
{"id": "2f4b6d9c81975659b8760fd3a806bdd74c8ac8f6", "vector_id": 65, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 65, "char_len": 2000, "text": " Texas Divorce Proceedings Page 19\n3.Eviction Notice Claims : The December 17, 2023 eviction notice served by Morgan’s\ngrandmother cited a protective order that did not exist at that time.\n4.Allegations of December 18 Violence : Morgan allegedly claimed family violence\noccurred on December 18, 2023, despite continuing to cohabitate with Charles, raising\nquestions about the veracity of these claims.\nThesepotentiallyfalseallegationshadprofoundconsequences, ultimatelyresultinginCharles’s\nremoval from the family residence on January 16, 2024, without the hearing required by\nTexas Family Code § 6.405(b).\n2.11.2 Misrepresentation of Financial Status\nThe case presents several concerning financial misrepresentations:\n1.False Indigence Claim : Morgan allegedly filed for divorce claiming to be indigent\ndespite having just transferred $1,576 from the joint account to Dan Branthoover’s\nPayPal account.\n2.Misattribution of Financial Responsibilities : Morgan allegedly claimed responsi-\nbility for bills that Charles actually paid, misrepresenting the financial dynamics of the\nhousehold.\n3.Unauthorized Financial Transactions : The transfer of $1,576 from the joint account\nto Dan Branthoover’s PayPal account occurred without Charles’s knowledge or consent,\npotentially constituting financial misconduct.\nThese financial misrepresentations may have influenced the court’s initial determinations\nregarding temporary support and property control, creating an unfair advantage based on\nfalse information.\n2.11.3 Improper Preparation of Legal Documents\nThe involvement of Daniel Branthoover in preparing legal documents raises serious concerns\nabout unauthorized practice of law:\n\nFalse Allegations in Texas Divorce Proceedings Page 20\n1.Third-Party Document Preparation : Dan allegedly assisted Morgan in drafting\nlegal documents, including divorce papers and potentially protective order applications,\ndespite not being licensed to practice law.\n2.Misrepresentation of Legal Authority : Dan allegedly"}
{"id": "e3f812d068cea0a44c7992ba0df2f92f0a628f0b", "vector_id": 66, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 66, "char_len": 2000, "text": " in drafting\nlegal documents, including divorce papers and potentially protective order applications,\ndespite not being licensed to practice law.\n2.Misrepresentation of Legal Authority : Dan allegedly represented himself as\nMorgan’s attorney in communications with Charles on December 19, 2023, stating he\nwished to “work together to write up the decree.”\n3.Coordinated Legal Strategy : The sequence of filings—divorce petition, indigence\naffidavit, and protective order application—all using a newly acquired phone number\n(817-940-0852) suggests a coordinated legal strategy developed with Dan’s assistance.\nThis improper preparation of legal documents may constitute unauthorized practice of law\nand raises questions about the validity of the resulting filings.\n2.11.4 Unauthorized Practice of Law Concerns\nBeyond document preparation, the case presents broader unauthorized practice of law\nconcerns:\n1.Legal Advice Provision : Dan appears to have provided legal advice regarding divorce\nstrategy, protective orders, and property division without being licensed to practice\nlaw.\n2.Representation Claims : Dan’s December 19, 2023 text message referring to Morgan\nas “his client” suggests he was holding himself out as an attorney.\n3.Coordination with Licensed Attorney : The relationship between Dan’s initial\ninvolvement and Cooper Carter’s subsequent representation raises questions about\npotential coordination in legal strategy.\nThese unauthorized practice concerns may provide grounds for challenging the validity of the\nresulting orders and proceedings. # VI. Procedural Issues in the Case\n\nFalse Allegations in Texas Divorce Proceedings Page 21\n2.12 A. Texas Rule 12 Challenge to Attorney Authority\n2.12.1 Legal Standard for Challenging Attorney Authority\nTexas Rule of Civil Procedure 12 provides a specific mechanism for challenging an attorney’s\nauthority to represent a party in litigation. The rule states:\n“A party in a suit or proceeding pending in a court of this state may, by sworn "}
{"id": "bc23c8ea819ee2d1cc91143670c5fc4d71823540", "vector_id": 67, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 67, "char_len": 2000, "text": "vides a specific mechanism for challenging an attorney’s\nauthority to represent a party in litigation. The rule states:\n“A party in a suit or proceeding pending in a court of this state may, by sworn written\nmotion stating that he believes the suit or proceeding is being prosecuted or defended without\nauthority, cause the attorney to be cited to appear before the court and show his authority\nto act.”\nThis rule establishes a formal procedure with several key elements:\n1. The challenge must be made through a sworn written motion\n2.The motion must state the belief that the suit is being prosecuted or defended without\nauthority\n3. The challenged attorney must be served notice at least ten days before the hearing\n4.At the hearing, the burden of proof is on the challenged attorney to show sufficient\nauthority\n5.If the attorney fails to show authority, the court shall refuse to permit the attorney to\nappear and shall strike the pleadings\nTheTexasSupremeCourthasclarifiedthatRule12servestoprotectpartiesfromunauthorized\nrepresentation and to ensure that attorneys appearing in court have proper authority from\ntheir purported clients.\n2.12.2 Application to Cooper Carter’s Representation\nIn the Myers case, several aspects of Cooper Carter’s representation raise questions that\ncould be addressed through a Rule 12 challenge:\n1.Retention Circumstances : Cooper was allegedly retained in the courtroom lobby on\nJanuary 22, 2024, immediately before a hearing, raising questions about the formality\nand scope of the attorney-client relationship.\n\nFalse Allegations in Texas Divorce Proceedings Page 22\n2.Filing Practices : Cooper’s filings were allegedly filed on her behalf by Roderick D.\nMarx, a party not named in the lawsuit, creating questions about who was actually\ndirecting the litigation.\n3.Firm Affiliation Discrepancies : Cooper allegedly claimed on social media and\nLinkedIn to have previously worked at Marx Altman and Johnson (where Roderick\nD. Marx is the owner), while her Electron"}
{"id": "22b109001e019d6c6287c469311907d7a5d2f0c1", "vector_id": 68, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 68, "char_len": 2000, "text": "\n3.Firm Affiliation Discrepancies : Cooper allegedly claimed on social media and\nLinkedIn to have previously worked at Marx Altman and Johnson (where Roderick\nD. Marx is the owner), while her Electronic Filing Manager account was registered\nto another firm, Cantey Hanger, creating confusion about her actual professional\naffiliations.\n4.Representation Capacity : If Cooper claimed to represent Morgan in her “individual\ncapacity” rather than as a member of a firm, this would create a direct attorney-client\nrelationship that wouldn’t automatically extend filing privileges to other attorneys,\nincluding founding partners of firms she was previously associated with.\nThese circumstances could form the basis of a Rule 12 challenge, requiring Cooper to\ndemonstrate her authority to represent Morgan in the divorce proceedings.\n2.12.3 Electronic Filing Irregularities\nThe electronic filing practices in this case present particularly concerning procedural issues:\n1.Third-Party Filing : Texas electronic filing requirements specify that attorneys must\nmaintain control and responsibility over their electronic filings. The alleged practice of\nhaving Roderick D. Marx file documents on Cooper’s behalf raises serious questions\nabout proper representation.\n2.Credential Misuse : In Texas, attorneys representing clients in court proceedings must\nuse their own electronic filing credentials when submitting documents. It is improper for\nan attorney to have another person file documents using that other person’s credentials,\nespecially if that person is not a party of record.\n3.Firm Relationship Questions : If Cooper was practicing independently while docu-\nments were being filed through Marx’s credentials, this creates questions about whether\nMarx was authorized to act on her behalf or whether there was an undisclosed profes-\n\nFalse Allegations in Texas Divorce Proceedings Page 23\nsional relationship.\n4.Mandatory E-Filing Requirements : Texas mandates e-filing for all attorneys in\ncivil, famil"}
{"id": "111641041ac28026a05adf511b29bc5c51f28556", "vector_id": 69, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 69, "char_len": 2000, "text": "re was an undisclosed profes-\n\nFalse Allegations in Texas Divorce Proceedings Page 23\nsional relationship.\n4.Mandatory E-Filing Requirements : Texas mandates e-filing for all attorneys in\ncivil, family, probate, and criminal cases in district and county courts. This requirement\ncreates an expectation that attorneys will personally manage their filings or have\nproperly supervised staff do so under their credentials.\nThese electronic filing irregularities could potentially constitute improper practice and might\nprovide grounds for challenging the validity of the filings themselves.\n2.12.4 Implications of Improper Representation\nIf a Rule 12 challenge were to succeed in establishing improper representation, the implications\nwould be significant:\n1.Striking of Pleadings : The court would be required to strike all pleadings filed by\nthe attorney lacking authority, potentially invalidating orders based on those pleadings.\n2.Procedural Reset : The case might need to be reset procedurally to the point before\nthe unauthorized representation began.\n3.Ethical Implications : Unauthorized representation could trigger ethical investigations\nby the State Bar of Texas.\n4.Validity of Orders : Orders obtained through unauthorized representation could be\nsubject to challenge as void or voidable.\n5.Malpractice Concerns : Improper representation could potentially expose the attor-\nneys involved to malpractice claims.\nThe Rule 12 challenge mechanism thus provides a powerful tool for addressing question-\nable representation practices that may have prejudiced Charles’s position in the divorce\nproceedings.\n\nFalse Allegations in Texas Divorce Proceedings Page 24\n2.13 B. Dominant Jurisdiction Analysis\n2.13.1 Competing Court Jurisdictions\nThe Myers case involves competing jurisdictions between divorce proceedings and a separately\nfiled SAPCR (Suit Affecting the Parent-Child Relationship), creating a complex jurisdictional\nlandscape:\n1.Original Divorce Proceeding : Filed on December 18, 2023, t"}
{"id": "2d718c821fa1495752b0f3a18f562ac871b7803b", "vector_id": 70, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 70, "char_len": 2000, "text": "orce proceedings and a separately\nfiled SAPCR (Suit Affecting the Parent-Child Relationship), creating a complex jurisdictional\nlandscape:\n1.Original Divorce Proceeding : Filed on December 18, 2023, this case would normally\nhave dominant jurisdiction over all matters related to the marriage and children.\n2.Separate SAPCR : Filed on March 19, 2025, seeking emergency relief from being\nlocked out of the house for over a year.\n3.Jurisdictional Conflict : The filing of the separate SAPCR created a situation where\ntwo courts had potential jurisdiction over matters affecting the parent-child relationship.\nUnder Texas law, when two courts have concurrent jurisdiction over the same controversy, the\nfirst court to acquire jurisdiction generally has dominant jurisdiction. This principle, known\nas the “first-in-time rule,” is designed to prevent forum shopping and conflicting rulings from\ndifferent courts.\n2.13.2 SAPCR and Divorce Case Consolidation Requirements\nTexas Family Code creates specific requirements regarding the consolidation of SAPCR and\ndivorce cases:\n1.Mandatory Consolidation : Texas Family Code § 6.406 requires all pending SAPCRs\nto be transferred to the court in which the divorce is filed.\n2.Transfer Procedure : After showing that a divorce has been filed in another court,\nthe court in which a SAPCR is pending must transfer the proceedings to the divorce\ncourt.\n3.Continuing Exclusive Jurisdiction : Once a court issues a final order in a SAPCR,\nthat court has continuing exclusive jurisdiction over future related matters.\n\nFalse Allegations in Texas Divorce Proceedings Page 25\nThese provisions reflect a legislative preference for having all family matters related to the\nsame parties heard in a single court to promote judicial efficiency and prevent inconsistent\nrulings.\n2.13.3 Exceptions to Dominant Jurisdiction Doctrine\nWhile the first-in-time rule generally governs jurisdictional conflicts, Texas law recognizes\nimportant exceptions to the dominant jurisdiction d"}
{"id": "04adc5f414c9a9444eb0c07de9a5fff86449285d", "vector_id": 71, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 71, "char_len": 2000, "text": "s.\n2.13.3 Exceptions to Dominant Jurisdiction Doctrine\nWhile the first-in-time rule generally governs jurisdictional conflicts, Texas law recognizes\nimportant exceptions to the dominant jurisdiction doctrine:\n1.Lack of Prosecution : If the suit in the first court is not being actively prosecuted,\nthe second court may maintain jurisdiction despite not being first in time.\n2.Bad Faith Filing : If the suit was filed in bad faith or for the purpose of delay, the\nsecond court may disregard the first court’s dominant jurisdiction.\nIn the Myers case, both exceptions could potentially apply:\n•Lack of Prosecution : The alleged inactivity in the divorce case for approximately a\nyear, with Cooper Carter allegedly not filing any pleadings between April 24, 2024, and\nresponding to the separate SAPCR, could constitute lack of prosecution.\n•Bad Faith Filing : The allegations of false claims in the original divorce petition, in-\ncluding misrepresentations about protective orders and family violence, could potentially\nestablish that the original suit was brought in bad faith.\nThese exceptions provide potential legal grounds for challenging the automatic application of\nthe dominant jurisdiction doctrine.\n2.13.4 Application to the Myers Case\nThe jurisdictional issues in the Myers case present several concerning procedural aspects:\n1.Denial of Hearing : On March 28, 2025, Charles was allegedly denied the opportunity\nto be heard on his emergency TRO in the second court based on a promise by Cooper\nCarter to file a motion to consolidate in the first court—a promise that wasn’t fulfilled\nuntil a week later.\n\nFalse Allegations in Texas Divorce Proceedings Page 26\n2.Sua Sponte Ruling : On April 10, 2025, the second court granted Cooper’s motion\nsua sponte (on its own initiative) without a hearing and without notice, potentially\nviolating due process requirements.\n3.Mandamus Denial : Charles’s mandamus petition challenging these procedural irreg-\nularities was denied per curiam (by the court"}
{"id": "9a45dc8f7fe15291511f640caa6047bfb71849d1", "vector_id": 72, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 72, "char_len": 2000, "text": "ng and without notice, potentially\nviolating due process requirements.\n3.Mandamus Denial : Charles’s mandamus petition challenging these procedural irreg-\nularities was denied per curiam (by the court as a whole without identifying specific\njudges) on April 11, 2025, without addressing the substantive jurisdictional arguments.\nThese procedural issues highlight how jurisdictional rules, while designed to promote efficiency\nand consistency, can sometimes be manipulated to prevent substantive consideration of\nlegitimate claims, particularly when one party has been subject to potentially void orders for\nan extended period. # VII. Legal Remedies and Strategic Considerations\n2.14 A. Available Remedies for False Allegations\n2.14.1 Motions to Vacate Orders Based on False Allegations\nWhen court orders have been obtained through false allegations, several procedural mecha-\nnisms exist to challenge their validity:\n1.Motion for New Trial : Within 30 days of an order being signed, a party can file a\nmotion for new trial based on newly discovered evidence that the allegations underlying\nthe order were false. This remedy is time-limited but provides a direct means to address\nrecent orders.\n2.Bill of Review : For orders that have become final, a bill of review is an equitable\nproceeding to set aside a judgment that is no longer appealable or subject to a motion\nfor new trial. To succeed, the petitioner must generally show:\n•A meritorious defense to the cause of action\n•Which the petitioner was prevented from making by fraud, accident, or wrongful\nact of the opposing party\n•Unmixed with any fault or negligence of the petitioner\n3.Motion to Vacate Void Orders : Orders obtained through fraud on the court may\n\nFalse Allegations in Texas Divorce Proceedings Page 27\nbe considered void rather than merely voidable. A motion to vacate can be filed at any\ntime to challenge void orders, as they are considered a nullity from their inception.\n4.Collateral Attack : In some circumstances, orders "}
{"id": "39b8f688528a98251d7fa8c77f0296149fd6de67", "vector_id": 73, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 73, "char_len": 2000, "text": " than merely voidable. A motion to vacate can be filed at any\ntime to challenge void orders, as they are considered a nullity from their inception.\n4.Collateral Attack : In some circumstances, orders based on false allegations can be\ncollaterally attacked in a separate proceeding when they form the basis for subsequent\nlegal actions.\nIn the Myers case, the emergency motion filed on February 8, 2024, to vacate the agreement\nand reconsider evidence represents an attempt to utilize these remedial procedures. The\ndenial of this motion on March 14, 2024, without addressing the underlying allegations of\nfalsity, illustrates the practical challenges in obtaining relief even when procedural mechanisms\nexist.\n2.14.2 Sanctions Against Parties Making False Statements\nTexas law provides multiple avenues for seeking sanctions against parties who make false\nstatements in court proceedings:\n1.Chapter 10 Sanctions : Under Chapter 10 of the Texas Civil Practice and Remedies\nCode, courts can impose sanctions for signing pleadings that are presented for an\nimproper purpose or contain factual contentions without evidentiary support. These\nsanctions can include:\n•Monetary penalties\n•Striking pleadings\n•Dismissal of claims\n•Attorney’s fees awards\n2.Rule 13 Sanctions : Texas Rule of Civil Procedure 13 allows sanctions for groundless\npleadings brought in bad faith or for harassment. The rule requires notice and hearing\nbefore sanctions can be imposed.\n3.Inherent Authority : Texas courts have inherent authority to sanction parties for\nabuse of the judicial process, including making false statements to the court.\n\nFalse Allegations in Texas Divorce Proceedings Page 28\n4.Contempt Proceedings : Making false statements under oath can constitute contempt\nof court, which can be punished by fines or incarceration.\nThese sanctions serve both punitive and deterrent functions, providing consequences for past\nmisconduct and discouraging future false allegations.\n2.14.3 Potential Claims Against Third P"}
{"id": "16b54d61cabe63cd599a47325f3671cf0d0d2bce", "vector_id": 74, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 74, "char_len": 2000, "text": "ncarceration.\nThese sanctions serve both punitive and deterrent functions, providing consequences for past\nmisconduct and discouraging future false allegations.\n2.14.3 Potential Claims Against Third Parties\nWhen third parties assist in making false allegations, additional legal remedies may be\navailable:\n1.Civil Conspiracy : If evidence shows that multiple parties conspired to present false\nallegations to the court, a civil conspiracy claim might be viable. The elements typically\ninclude:\n•Two or more persons\n•An object to be accomplished\n•A meeting of minds on the object or course of action\n•One or more unlawful, overt acts\n•Damages as the proximate result\n2.Tortious Interference : If a third party interfered with the marital relationship or\nparent-child relationship through false allegations, a tortious interference claim might\nbe appropriate.\n3.Unauthorized Practice of Law Claims : For non-attorneys who provided legal\nadvice or prepared legal documents, a complaint to the Unauthorized Practice of Law\nCommittee of the Texas Supreme Court could lead to injunctive relief and civil penalties.\n4.Bar Complaints : For licensed attorneys who facilitated false allegations, grievances\ncan be filed with the State Bar of Texas, potentially resulting in disciplinary action.\nIn the Myers case, the alleged involvement of Daniel Branthoover in preparing legal documents\nand facilitating financial transactions could potentially expose him to such third-party claims.\n\nFalse Allegations in Texas Divorce Proceedings Page 29\n2.15 B. Jurisdictional Strategies\n2.15.1 Challenging Improper Venue\nVenue challenges provide a potential strategy for addressing cases filed in inappropriate\nlocations:\n1.Motion to Transfer Venue : If a case is filed in a county where venue is improper, a\nmotion to transfer venue can be filed to move the case to the proper county. In family\nlaw matters, venue is generally proper in the county where the child has resided for the\npreceding six-month period.\n2.Mandat"}
{"id": "a2df944a056809dfb9ad5e279f4b0b1431db951b", "vector_id": 75, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 75, "char_len": 2000, "text": "ansfer venue can be filed to move the case to the proper county. In family\nlaw matters, venue is generally proper in the county where the child has resided for the\npreceding six-month period.\n2.Mandatory vs. Permissive Venue : Some venue provisions are mandatory, while\nothers are permissive. Mandatory venue provisions provide stronger grounds for transfer.\n3.Timeliness Requirements : Venue challenges must typically be made at the outset of\nlitigation, before other substantive pleadings are filed.\nIn the Myers case, the residence at 6641 Anne Court, Watauga, Texas 76148, establishes\nthe proper venue for the divorce and related proceedings. Any attempt to file in a different\ncounty could be challenged through these mechanisms.\n2.15.2 Transfer and Consolidation of Related Cases\nStrategic use of transfer and consolidation provisions can help manage multiple related\nproceedings:\n1.Mandatory Transfer Provisions : Texas Family Code § 6.407(b) and § 155.202\nprovide that when a divorce is filed in a different court than an existing SAPCR, either\nparty may request transfer of the SAPCR to the divorce court, and the SAPCR court\n“shall” transfer jurisdiction.\n2.Consolidation Motions : Once cases are in the same court, a motion to consolidate can\nbe filed to have all matters heard together, promoting judicial efficiency and preventing\ninconsistent rulings.\n\nFalse Allegations in Texas Divorce Proceedings Page 30\n3.Strategic Timing : The timing of transfer and consolidation requests can be strategi-\ncally important, particularly when one court may be more favorable than another.\nIn the Myers case, the competing SAPCR and divorce proceedings created a complex\njurisdictional landscape that could potentially be navigated through strategic use of these\ntransfer and consolidation provisions.\n2.15.3 Federal Court Removal Considerations\nIn certain limited circumstances, family law matters that would normally be heard in state\ncourt can be removed to federal court:\n1.Diversity Jurisdictio"}
{"id": "6a6a67fc6dcbda9f85728fee513e47047a95b01e", "vector_id": 76, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 76, "char_len": 2000, "text": "s.\n2.15.3 Federal Court Removal Considerations\nIn certain limited circumstances, family law matters that would normally be heard in state\ncourt can be removed to federal court:\n1.Diversity Jurisdiction : While domestic relations matters are generally excluded from\nfederal diversity jurisdiction, certain collateral matters with diverse citizenship and\nsufficient amount in controversy might be removable.\n2.Federal Question Jurisdiction : If a family law dispute involves federal constitutional\nquestions, such as due process violations, removal might be possible.\n3.Strategic Purpose : Even when the likelihood of successful removal is low, the removal\nprocess itself can create procedural hurdles for the opposing party, potentially creating\nleverage for settlement.\nIn the Myers case, the December 2, 2024, removal of the divorce case to federal court appears\nto have been a strategic maneuver designed to place procedural burdens on Cooper Carter,\nspecifically the requirement to file a certified copy of the notice of remand with the clerk.\n2.16 C. Addressing Attorney Misconduct\n2.16.1 Rule 12 Procedures\nAs discussed in the previous section, Texas Rule of Civil Procedure 12 provides a specific\nmechanism for challenging an attorney’s authority:\n1.Procedural Requirements : The challenge must be made through a sworn motion,\nserved at least ten days before the hearing.\n\nFalse Allegations in Texas Divorce Proceedings Page 31\n2.Burden of Proof : At the hearing, the burden is on the challenged attorney to prove\nauthority to represent the client.\n3.Timing Considerations : The motion can be heard at any time before the parties\nannounce ready for trial, making it a flexible tool throughout litigation.\n4.Potential Outcomes : If successful, the court must refuse to permit the attorney to\nappear and must strike the pleadings if no authorized person appears.\nThe September 20, 2024, Rule 12 challenge filed by Charles represents an attempt to utilize\nthis procedure to address concerns about "}
{"id": "6021fc814832b5b4ca3122217f7e84d420e59ac2", "vector_id": 77, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 77, "char_len": 2000, "text": "ear and must strike the pleadings if no authorized person appears.\nThe September 20, 2024, Rule 12 challenge filed by Charles represents an attempt to utilize\nthis procedure to address concerns about Cooper Carter’s representation.\n2.16.2 Bar Complaints\nThe State Bar of Texas disciplinary system provides another avenue for addressing attorney\nmisconduct:\n1.Grievance Process : Complaints about attorney misconduct are filed with the Office\nof Chief Disciplinary Counsel, which investigates and determines whether just cause\nexists to believe misconduct occurred.\n2.Potential Sanctions : If misconduct is found, sanctions can range from private\nreprimand to disbarment, depending on the severity of the violation.\n3.Relevant Rules : The Texas Disciplinary Rules of Professional Conduct prohibit\nvarious forms of misconduct, including:\n•Rule 3.01: Meritorious Claims and Contentions\n•Rule 3.03: Candor Toward the Tribunal\n•Rule 4.01: Truthfulness in Statements to Others\n•Rule 8.04: Misconduct\n4.Evidentiary Standard : The standard of proof in disciplinary proceedings is “prepon-\nderance of the evidence,” lower than the criminal standard.\nWhile bar complaints do not directly affect the underlying litigation, they can create profes-\nsional consequences for attorneys who engage in misconduct and may indirectly influence\n\nFalse Allegations in Texas Divorce Proceedings Page 32\nlitigation behavior.\n2.16.3 Court Sanctions\nCourts have inherent authority to sanction litigation misconduct:\n1.Basis for Sanctions : Courts can impose sanctions for various forms of misconduct,\nincluding:\n•Filing frivolous pleadings\n•Discovery abuse\n•Misrepresentations to the court\n•Violation of court orders\n2.Types of Sanctions : Available sanctions include:\n•Monetary penalties\n•Attorney’s fees awards\n•Striking pleadings\n•Dismissal of claims\n•Contempt findings\n3.Procedural Requirements : Due process requires notice and opportunity to be heard\nbefore sanctions are imposed.\n4.Appellate Review : Sanctions orders a"}
{"id": "851d3b06e1cb2fe39f15089ddeabd956398b6ca1", "vector_id": 78, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 78, "char_len": 2000, "text": "adings\n•Dismissal of claims\n•Contempt findings\n3.Procedural Requirements : Due process requires notice and opportunity to be heard\nbefore sanctions are imposed.\n4.Appellate Review : Sanctions orders are generally reviewable on appeal or through\nmandamus proceedings.\nIn the Myers case, the alleged pattern of procedural irregularities and potential misrepresenta-\ntions could potentially form the basis for sanctions motions against the responsible attorneys.\n# VIII. Conclusion and Recommendations\n2.17 Summary of Key Findings\nThis comprehensive analysis of the Charles Myers divorce case reveals several concerning\nlegal and procedural issues that illustrate the profound impact of false allegations in Texas\n\nFalse Allegations in Texas Divorce Proceedings Page 33\ndivorce proceedings:\n1.Statutory Violations : The case presents potential violations of Texas Family Code §\n6.405(b), which requires a hearing within 14 days when family violence is alleged in a\ndivorce case. Charles was removed from his residence on January 16, 2024, without the\nstatutorily required hearing to evaluate the allegations.\n2.False Allegations Pattern : The timeline reveals a pattern of potentially false\nallegations, including claims of an active protective order that did not exist, inconsistent\nprotective order filings, and allegations of family violence that appear contradicted by\ncontinued cohabitation.\n3.Third-Party Interference : Daniel Branthoover’s involvement raises serious concerns\nabout unauthorized practice of law and improper influence on the legal proceedings,\nincluding document preparation and financial transactions that disadvantaged Charles.\n4.AttorneyRepresentationIssues : CooperCarter’srepresentationpresentsprocedural\nirregularities, including electronic filing practices where documents were allegedly filed\nby Roderick D. Marx rather than Carter herself, raising Rule 12 concerns about proper\nauthority.\n5.Jurisdictional Manipulation : The handling of competing court jurisdictions be-\n"}
{"id": "e7a85edd11ef628b5040601fd55c0f0ba352f750", "vector_id": 79, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 79, "char_len": 2000, "text": "were allegedly filed\nby Roderick D. Marx rather than Carter herself, raising Rule 12 concerns about proper\nauthority.\n5.Jurisdictional Manipulation : The handling of competing court jurisdictions be-\ntween the divorce and separate SAPCR proceedings suggests potential manipulation of\nprocedural rules to prevent substantive consideration of Charles’s claims.\n6.Due Process Concerns : Multiple instances of denied hearings, sua sponte rulings\nwithout notice, and orders signed without consent raise significant due process concerns\nthroughout the proceedings.\n7.Financial Misrepresentations : The alleged false claims of indigence, misrepresenta-\ntion of financial responsibilities, and unauthorized transfer of funds from joint accounts\nsuggest a pattern of financial misconduct that may have influenced court determinations.\nThese findings collectively demonstrate how false allegations, procedural irregularities, and\nthird-party interference can fundamentally distort the legal process in divorce proceedings,\n\nFalse Allegations in Texas Divorce Proceedings Page 34\nwith devastating consequences for the falsely accused party.\n2.18 Strategic Recommendations\nBased on our analysis, several strategic approaches could be considered to address the issues\nidentified in this case:\n1.Comprehensive Rule 12 Challenge : A thorough Rule 12 challenge to Cooper\nCarter’s authority to represent Morgan should be pursued, focusing on the electronic\nfiling irregularities and the role of Roderick D. Marx in filing documents on Carter’s\nbehalf.\n2.Motion to Vacate Based on Fraud on the Court : A motion to vacate all orders\nstemming from the allegedly fraudulent protective order claims should be filed, arguing\nthat orders obtained through false allegations constitute fraud on the court and are\ntherefore void.\n3.Sanctions Motion for False Allegations : A motion for sanctions under Chapter\n10 of the Texas Civil Practice and Remedies Code should be considered, targeting\nthe specific false allegations ident"}
{"id": "4d3f09fb16d8c8b34c5492fccb2a98de40c32e1f", "vector_id": 80, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 80, "char_len": 2000, "text": "d.\n3.Sanctions Motion for False Allegations : A motion for sanctions under Chapter\n10 of the Texas Civil Practice and Remedies Code should be considered, targeting\nthe specific false allegations identified in the divorce petition and protective order\napplications.\n4.Bar Grievance Proceedings : Formal grievances should be filed with the State Bar\nof Texas against any attorneys who facilitated or knowingly permitted false allegations,\nunauthorized practice of law, or improper electronic filing practices.\n5.Unauthorized Practice of Law Complaint : A complaint to the Unauthorized\nPractice of Law Committee of the Texas Supreme Court regarding Daniel Branthoover’s\nalleged legal document preparation and advice should be pursued.\n6.Federal Due Process Claim : Given the pattern of procedural irregularities and\ndeniedhearings, afederalcourtactionallegingdueprocessviolationscouldbeconsidered\nas a parallel strategy to the state court proceedings.\n7.Mandamus Proceedings : A new petition for writ of mandamus focusing specifically\n\nFalse Allegations in Texas Divorce Proceedings Page 35\non the statutory violation of Texas Family Code § 6.405(b) and the failure to conduct\nthe required hearing on family violence allegations could provide an avenue for appellate\nrelief.\n8.Civil Action Against Third Parties : A separate civil action against Daniel\nBranthoover for tortious interference, civil conspiracy, or similar claims could ad-\ndress his role in the alleged misconduct outside the constraints of the family court\nproceedings.\n2.19 Potential Next Steps\nMoving forward, the following immediate steps are recommended:\n1.Document Collection and Preservation : Gather and preserve all evidence of the\nalleged false statements, unauthorized practice, and procedural irregularities, including\ntext messages, bank statements, court filings, and electronic filing records.\n2.Expert Consultation : Consult with experts in legal ethics, electronic filing procedures,\nand unauthorized practice of law to s"}
{"id": "8fde748e7ebf8c2efd8e9d939d22e063ee3cc420", "vector_id": 81, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 81, "char_len": 2000, "text": "ssages, bank statements, court filings, and electronic filing records.\n2.Expert Consultation : Consult with experts in legal ethics, electronic filing procedures,\nand unauthorized practice of law to strengthen the factual and legal basis for challenges\nto the proceedings.\n3.Affidavit Preparation : Prepare detailed affidavits documenting the timeline of events,\nfinancial transactions, and communications that support claims of false allegations and\nimproper conduct.\n4.Strategic Timing Analysis : Carefully analyze timing requirements for various\nremedial options, prioritizing those with approaching deadlines while developing a\ncomprehensive long-term strategy.\n5.Coordinated Legal Approach : Develop a coordinated approach that addresses both\nthe immediate need to regain access to the residence and the broader goal of remedying\nthe procedural injustices that have occurred throughout the proceedings.\n6.Judicial Education : Prepare concise, focused presentations for the court that clearly\nexplain the statutory violations and procedural irregularities, with specific citations to\n\nFalse Allegations in Texas Divorce Proceedings Page 36\ncontrolling authority.\n7.Settlement Evaluation : Assess whether a global settlement might be achievable now\nthat the pattern of alleged misconduct has been documented, potentially leveraging the\nthreat of sanctions, bar complaints, and civil actions to motivate reasonable settlement\nterms.\nBy pursuing these strategic recommendations and next steps, there is potential to address\nthe serious legal and procedural issues identified in this case and work toward a resolution\nthat remedies the consequences of the alleged false allegations and procedural manipulations.\n# IX. References\n2.20 Texas Family Code Provisions\n•Texas Family Code § 6.405 - Protective Order and Related Orders\n•Texas Family Code § 6.406 - Mandatory Joinder of Suit Affecting Parent-Child Rela-\ntionship\n•Texas Family Code § 6.407 - Transfer of Suit Affecting Parent-Child Relationsh"}
{"id": "4c0038a689c30aab8015363c232c74c3354cf540", "vector_id": 82, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 82, "char_len": 2000, "text": "ve Order and Related Orders\n•Texas Family Code § 6.406 - Mandatory Joinder of Suit Affecting Parent-Child Rela-\ntionship\n•Texas Family Code § 6.407 - Transfer of Suit Affecting Parent-Child Relationship\n•Texas Family Code § 71.004 - Family Violence Definition\n•Texas Family Code § 85.001 - Required Findings and Orders\n•Texas Family Code § 152.201 - Initial Child Custody Jurisdiction\n•Texas Family Code § 153.004 - History of Domestic Violence\n•Texas Family Code § 155.201 - Mandatory Transfer\n•Texas Family Code § 155.202 - Discretionary Transfer\n•Texas Family Code § 155.204 - Procedure for Transfer\n•Texas Family Code § 261.107 - False Reports\n2.21 Texas Rules of Civil Procedure\n•Texas Rule of Civil Procedure 12 - Attorney to Show Authority\n•Texas Rule of Civil Procedure 13 - Effect of Signing Pleadings, Motions and Other\nPapers; Sanctions\n•Texas Rule of Civil Procedure 21 - Filing and Serving Pleadings and Motions\n\nFalse Allegations in Texas Divorce Proceedings Page 37\n•Texas Rule of Civil Procedure 21a - Methods of Service\n2.22 Texas Civil Practice and Remedies Code\n•Texas Civil Practice and Remedies Code § 10.001 - Signing of Pleadings and Motions\n•Texas Civil Practice and Remedies Code § 10.004 - Sanctions Available\n2.23 Case Law\n•Kramer v. Kramer, No. 13-04-00267-CV (Tex. App. Aug 30, 2005)\n•In re: Freeman GRAVITT (Tex. App. 2012)\n•In re Potts, 399 S.W.3d 685 (Tex. App.—Houston [14th Dist.] 2013, no pet.)\n•Perry v. Del Rio, 66 S.W.3d 239 (Tex. 2001) (dominant jurisdiction principles)\n•Wyatt v. Shaw Plumbing Co., 760 S.W.2d 245 (Tex. 1988) (exceptions to dominant\njurisdiction)\n•In re E.L.T., 93 S.W.3d 372 (Tex. App.—Houston [14th Dist.] 2002, no pet.) (SAPCR\njurisdiction)\n2.24 Secondary Sources\n•Texas Family Practice Manual (State Bar of Texas)\n•O’Connor’s Texas Family Code Plus (2024-2025 ed.)\n•“False Allegations of Family Violence in Texas Divorce Cases,” The Fox Firm (2022)\n•“Electronic Filing Requirements for Attorneys in Texas,” Texas Courts (2024)\n•“Combining "}
{"id": "840909e6413672b2c8514cda5837f0eebbd079f3", "vector_id": 83, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 83, "char_len": 2000, "text": "Code Plus (2024-2025 ed.)\n•“False Allegations of Family Violence in Texas Divorce Cases,” The Fox Firm (2022)\n•“Electronic Filing Requirements for Attorneys in Texas,” Texas Courts (2024)\n•“Combining SAPCR and Divorce Cases,” Texas Law Help (2023)\n•“Texas Divorce & Custody Cases: Jurisdiction and Venue Rules,” Bryan Fagan (2025)\n•“Dealing With False Allegations of Domestic Violence in Texas,” Russ Baker Law Firm\n(2024)\n•“Fighting Against False Accusations in a Divorce,” Terry & Roberts (2022)\n\nC\nSYSTEMATIC \nDENIAL\n\nA CASE STUDY OF PERCEIVED INJUSTICE\nPrepared for Higher Court Review\nTABLE OF CONTENTS\nINTRODUCTION\nTIMELINE OF EVENTS\nTHE STORY OF CHARLES DUSTIN MYERS\nFamily Background and Circumstances Prior to Divorce\nThe Unexpected Dissolution\nThe Orchestrated Legal Strategy Begins\nFinancial Manipulation and Deception\nEviction Attempt and False Claims\nCharles's Legal Response and Defense Preparation\nThe First Hearing and Removal from the Home\nContinued Delays and Legal Maneuvering\nThe February Hearing and Settlement Under Duress\nEscalating Legal Battles and Lockout\nThe March Hearing and Denial of Due Process\nThe Appellate Journey Begins\nIntervention and Summer with Children\nContinued Legal Efforts and Challenges\nRecusal Proceedings and Federal Removal\nRecent Developments and Current Situation\nThe Human Toll\nLEGAL ANALYSIS AND IMPLICATIONS\nViolations of Texas Family Code Section 6.405(b)\nFalse Allegations and Their Legal Consequences\nAttorney Authority Issues and Rule 12 Violations\nDue Process Violations\nJurisdiction Issues and Consolidation Problems\nAppellate Review Challenges\nBest Interest of the Children Considerations\nConclusion: The Need for Higher Court Intervention1. \n2. \n3. \n4. \n5. \n6. \n7. \n8. \n9. \n10. \n11. \n12. \n13. \n14. \n15. \n16. \n17. \n18. \n19. \n20. \n21. \n22. \n23. \n24. \n25. \n26. \n27. \n28. \n29.\n\nKEY LEGAL ISSUES\nLEGAL PRECEDENTS AND AUTHORITIES\nCONCLUSION AND PRAYER FOR RELIEF\nINTRODUCTION\nThis case study presents a comprehensive examination of the legal pro"}
{"id": "ce049311b9b1252846a05bca5cca7dd3b5c90a1c", "vector_id": 84, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 84, "char_len": 2000, "text": "23. \n24. \n25. \n26. \n27. \n28. \n29.\n\nKEY LEGAL ISSUES\nLEGAL PRECEDENTS AND AUTHORITIES\nCONCLUSION AND PRAYER FOR RELIEF\nINTRODUCTION\nThis case study presents a comprehensive examination of the legal proceedings\ninvolving Charles Dustin Myers, a father and home-based business owner who has been\nsubjected to a series of procedural irregularities, false allegations, and questionable\nlegal maneuvers that have resulted in his forcible removal from his family home and\nseparation from his children. The case represents a troubling example of how the family\ncourt system can be manipulated through false allegations, procedural technicalities,\nand exploitation of legal processes, resulting in substantial injustice.\nCharles Dustin Myers and Morgan Michelle Myers were married on June 20, 2015, and\nresided together at 6641 Anne Court, Watauga, Texas 76148 with their two young\ndaughters, Mara Evonne Myers (age 8) and Caroline Rose Myers (age 6). Their family life\nproceeded without documented incidents of violence or abuse until December 1, 2023,\nwhen Morgan abruptly announced her desire for divorce. What followed was not a\nstandard dissolution of marriage proceeding, but rather a calculated campaign to\nremove Charles from his home and children through false allegations, financial\nmanipulation, and procedural maneuvering.\nThis case study will demonstrate how Morgan Myers, with the assistance of her\nstepfather Daniel Branthoover and attorney Cooper L. Carter, engaged in a pattern of\nconduct designed to circumvent proper legal procedures and deprive Charles of his\nrights. The timeline reveals a troubling sequence: the discovery of Morgan's extensive\ncommunications with individuals outside the marriage, her immediate attempt to\nsecure emergency protective orders based on fabricated claims of family violence, the\ndraining of joint financial accounts while simultaneously claiming financial indigency,\nand the procurement of court orders without proper evidentiary hearings or findings.\nThe "}
{"id": "e3ebd356814e52a335c3ea44d391411d88019c22", "vector_id": 85, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 85, "char_len": 2000, "text": "f family violence, the\ndraining of joint financial accounts while simultaneously claiming financial indigency,\nand the procurement of court orders without proper evidentiary hearings or findings.\nThe legal issues presented in this case are significant and far-reaching. They include\nviolations of Texas Family Code Section 6.405(b), which requires specific hearings when\nfamily violence is alleged in divorce proceedings; questions about attorney authority\nand electronic filing requirements under Texas Rules of Civil Procedure; concerns about\ndominant jurisdiction when multiple courts become involved; and fundamental due\nprocess violations when court orders are issued without proper evidence or findings.\nMost critically, this case study will demonstrate how Charles Myers has been\nsystematically denied meaningful access to justice despite his diligent efforts to follow\nproper legal channels. Over the course of more than a year, Charles has filed numerous30. \n31. \n32.\n\nmotions, petitions for writs of mandamus to multiple courts, and requests for\nemergency relief—all while being locked out of his home, separated from his children,\nand unable to effectively operate his business that requires reliable internet access.\nThe higher court's review of this case is not merely about correcting errors in a single\nfamily law matter. It represents an opportunity to address systemic issues that\nundermine the integrity of the family court system and to ensure that procedural\nsafeguards are not merely theoretical protections but practical realities for all litigants.\nWhen false allegations can be leveraged to secure emergency orders without evidence,\nwhen attorneys can file documents through improper channels without consequence,\nand when courts can issue life-altering decisions without proper hearings, the\nfundamental promise of due process is broken.\nThis case study will present a detailed chronology of events, analyze the legal\nimplications of the proceedings, and demonstrate why inte"}
{"id": "4a026da48a78517aab3d6f98afe22494b63b5715", "vector_id": 86, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 86, "char_len": 2000, "text": "er hearings, the\nfundamental promise of due process is broken.\nThis case study will present a detailed chronology of events, analyze the legal\nimplications of the proceedings, and demonstrate why intervention by a higher court is\nnot only justified but necessary to prevent a continuing miscarriage of justice. Charles\nMyers's story is not merely a personal tragedy; it is a cautionary tale about the\nvulnerabilities in our family court system and the urgent need for vigilant protection of\nprocedural rights for all parties in divorce and custody proceedings.\nTIMELINE OF EVENTS\nPre-Divorce Events\nJune 20, 2015 : Charles and Morgan were married\nJune 20, 2016 : First daughter, Mara Evonne Myers, was born\nApril 12, 2018 : Second daughter, Caroline Rose Myers, was born\nJanuary 2021 : Charles began working from home, establishing a business\nspecializing in real-time market data solutions\nLate 2022 : Morgan allegedly began an affair with Damen Kazlauskas\nThroughout 2023 : Communication between Morgan and Damen Kazlauskas\nincreased significantly\nDecember 2023 Events\nDecember 1, 2023 : Morgan announced her desire to divorce Charles\nDecember 12, 2023 : Charles discovered 16,500 text messages between Morgan\nand two individuals outside the marriage (including Damen Kazlauskas)\nDecember 13, 2023 : Charles reached out to Morgan's grandfather with concerns;\nMorgan had a private conversation with her grandparents lasting from 9:30 AM until\n1:30 AM• \n• \n• \n• \n• \n• \n• \n• \n•\n\nDecember 14, 2023 : Morgan allegedly attempted to get an ex-parte order of\nprotection against Charles without his knowledge\nDecember 15, 2023 : \nMorgan began texting Daniel Branthoover (her stepfather)\nDaniel exchanged 21 text messages with Morgan between 7:22 AM and 8:39 AM\nAt 9:41 AM, Daniel texted Charles requesting he call regarding the divorce\nannouncement\nDaniel convinced Charles to allow Morgan to bring the children to his residence in\nOklahoma\nDaniel resumed texting Morgan, exchanging 9 more messages between "}
{"id": "62d835f0f3b884dc53365d64852398cc1b7f073b", "vector_id": 87, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 87, "char_len": 2000, "text": "e call regarding the divorce\nannouncement\nDaniel convinced Charles to allow Morgan to bring the children to his residence in\nOklahoma\nDaniel resumed texting Morgan, exchanging 9 more messages between 10:03 AM\nand 10:07 AM\nMorgan planned to visit Daniel's residence in Yukon, Oklahoma over the weekend\nDecember 16, 2023 : \nCharles was notified that his bank account had been overdrawn by $800\nAt 3:54 PM, Charles contacted Daniel requesting funds be returned\nDaniel falsely claimed Morgan had transferred money to her own account\nBank statement shows $1,576 was transferred to \"dmb575,\" a PayPal account\nbelonging to Daniel\nWhen confronted, Daniel revealed his true intent was to assist Morgan in drafting\nlegal documents\nDaniel advised or purchased a second phone for Morgan (registered under\n817-940-0852) and pepper spray\nDecember 17, 2023 : \nMorgan's grandmother served Charles an eviction notice at 11:00 AM\nThe eviction notice falsely claimed a protective order had been filed\nMorgan returned to Texas and continued to cohabit with Charles\nDecember 18, 2023 : \nMorgan filed for divorce claiming financial indigency (despite transferring $1,576\ndays earlier)\nMorgan requested assistance for uncontested cases\nMorgan submitted her original petition for divorce\nIn the petition, Morgan falsely claimed an active order of protection existed against\nCharles\nMorgan claimed family violence had occurred during the marriage to waive the 60-\nday waiting period\nMorgan claimed both family vehicles as separate property\nDecember 19, 2023 : Daniel contacted Charles via text, falsely representing himself\nas Morgan's attorney\nDecember 22, 2023 : Morgan filed for an additional protective order claiming\nfamily violence occurred on December 18, 2023• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nDecember 27, 2023 : Charles was served the formal eviction\nJanuary 2024 Events\nJanuary 2, 2024 : Charles filed his answer to the divorce petition\nJanuary 3, 2024 : Charles fi"}
{"id": "3f75d4d88e5ceef6b3d4706ef2e6153bfe6de34a", "vector_id": 88, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 88, "char_len": 2000, "text": " \n• \n• \n• \n• \n• \n• \n• \n•\n\nDecember 27, 2023 : Charles was served the formal eviction\nJanuary 2024 Events\nJanuary 2, 2024 : Charles filed his answer to the divorce petition\nJanuary 3, 2024 : Charles filed a motion to consolidate\nJanuary 8, 2024 : Charles filed a motion for continuance with documentation\nshowing Morgan lied about her financial status\nJanuary 13, 2024 : Charles filed an unsworn declaration reiterating established\nfacts\nJanuary 16, 2024 : \nFirst show cause hearing was held (Morgan's only appearance in the case docket)\nWithout evidence being presented, witnesses called, or findings, the court ordered\nCharles to vacate the family home\nThe case was reset for January 22, 2024, so parties could get legal counsel\nJanuary 17, 2024 : \nThe eviction case against Charles was dismissed for lack of subject matter\njurisdiction\nCharles had to stay temporarily with his father in Flower Mound, Texas\nCharles sought an attorney and retained Dan Bacalis of Hurst, Texas for $3,000\nJanuary 22, 2024 : \nReset hearing occurred\nMorgan acquired Cooper L. Carter as counsel in the courtroom lobby\nThe case was delayed again until February 1, 2024\nFebruary 2024 Events\nFebruary 1, 2024 : \nHearing regarding Morgan's protective order claims\nInstead of conducting the hearing, Charles's counsel (Dan Bacalis) drafted and\npresented a settlement agreement\nThe agreement gave Charles one month back in the home and kept full custody\nwith Morgan\nCharles signed the agreement under pressure but immediately terminated Dan\nBacalis\nFebruary 5, 2024 : Charles filed notice of termination of legal counsel\nFebruary 6, 2024 : Agreed motion for withdrawal of attorney filed\nFebruary 8, 2024 : \n\"Agreed\" order of consolidation rendered (missing Charles's signature)\nOrder of withdrawal for attorney Bacalis served• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nCharles filed an EMERGENCY MOTION to challenge Morgan's allegations and\npresent evidence\nFebruary 22, 2024 : Charles fil"}
{"id": "db5e20d0b3a352b40ff11dd1ce2273ca2344be4c", "vector_id": 89, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 89, "char_len": 2000, "text": " \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nCharles filed an EMERGENCY MOTION to challenge Morgan's allegations and\npresent evidence\nFebruary 22, 2024 : Charles filed a motion for summary judgment\nFebruary 27, 2024 : Parties served notice of hearing regarding Charles's emergency\nmotion (set for March 14, 2024)\nMarch 2024 Events\nMarch 4, 2024 : \nCharles filed initial disclosures\nCharles filed notice explaining he would not leave the family home until after the\ncourt heard his emergency motion\nMarch 6, 2024 : Morgan allegedly illegally locked Charles out of the marital\nresidence\nMarch 14, 2024 : \nCooper L. Carter handed Charles formal temporary orders based on the February\n1st report\nCharles's emergency motion was denied outright\nCharles was ordered to sign temporary orders prepared by Cooper L. Carter\nDespite no agreement being reached, the judge rendered the orders anyway\nMarch 21-26, 2024 : Charles prepared notices for judicial review, including detailed\naffidavits from business clients and attorney-client interactions\nApril 2024 Events\nApril 3-4, 2024 : Charles filed notices of filing original proceedings and motion for\ntemporary relief\nApril 4, 2024 : Charles filed a petition for writ of mandamus and emergency stay in\nthe Second Court of Appeals\nApril 10, 2024 : Second Court of Appeals denied Charles's petition\nApril 24, 2024 : \nCooper L. Carter tried to set a pre-trial conference\nCharles promptly objected\nApril 25, 2024 : Charles's rehearing was denied in the Second Court of Appeals\nMay-July 2024 Events\nMay 12, 2024 : Charles petitioned the Texas Supreme Court\nMay 19, 2024 : Cooper L. Carter requested a defective income withholding order\nfrom Charles via email• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nJune 28, 2024 : Texas Office of the Attorney General filed an intervention for alleged\npast-due child support\nJuly 1, 2024 : Charles objected to the intervention\nJuly 2024 : Charles stayed with his children"}
{"id": "8ed7e34cabf65d9f1812b0e3892c6d4ebffe7331", "vector_id": 90, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 90, "char_len": 2000, "text": "8, 2024 : Texas Office of the Attorney General filed an intervention for alleged\npast-due child support\nJuly 1, 2024 : Charles objected to the intervention\nJuly 2024 : Charles stayed with his children in an Airbnb less than two miles from\nthe marital residence\nAugust-December 2024 Events\nAugust 30, 2024 : Texas Supreme Court denied Charles's petition\nSeptember 10, 2024 : Charles moved for rehearing\nSeptember 16, 2024 : Charles amended the petition\nSeptember 20, 2024 : Charles moved to challenge Cooper L. Carter's authority and\nserved discovery\nSeptember 26-27, 2024 : Charles filed motions for temporary orders requesting\nemergency relief\nOctober 7, 2024 : Charles filed a joint motion to recuse both James Munford and\nJeff Kaitcer\nOctober 8-11, 2024 : Both judges elected not to recuse themselves; procedural\nissues with court documents noted\nOctober 18, 2024 : Charles's mandamus rehearing in the Supreme Court of Texas\nwas denied\nNovember 7, 2024 : Scheduled recusal hearing; Charles had a dental emergency\nand notified the court\nNovember 11, 2024 : Charles filed a motion to enter judgment\nNovember 17, 2024 : Charles's recusal motion was denied, claiming he failed to\nappear\nNovember 13, 2024 : Charles filed notice of intent to remove the case to the\nNorthern District of Texas\nDecember 2, 2024 : Charles filed notice of removal to the Northern District of Texas\nDecember 4, 2024 : Case was removed to federal court\nDecember 6, 2024 : Case was quickly remanded\n2025 Events\nJanuary 13, 2025 : Charles filed case memo/plea for judicial review\nJanuary 22, 2025 : Charles filed notice of loss of employment\nJanuary 24, 2025 : Charles filed motion to dismiss\nFebruary 10-12, 2025 : Charles filed emergency ex-parte motion for child custody,\nsole use of marital residence, contempt, and sanctions\nFebruary 20, 2025 : Charles filed motion to sign\nFebruary 24, 2025 : Charles filed objection and request for judicial notice• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nF"}
{"id": "fed20ee4322ee9cf99bb1b5ed70d2dbf6c7a21b3", "vector_id": 91, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 91, "char_len": 2000, "text": "ns\nFebruary 20, 2025 : Charles filed motion to sign\nFebruary 24, 2025 : Charles filed objection and request for judicial notice• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n• \n•\n\nFebruary 28, 2025 : Charles filed request for immediate ruling\nMarch 5, 2025 : Charles filed notice of new information\nMarch 6, 2025 : Unopposed motion to dismiss for lack of jurisdiction filed and\norder granted\nMarch 19, 2025 : Charles opened a separate SAPCR seeking emergency relief\nMarch 28, 2025 : Charles was denied to be heard during TRO presentment\nApril 10, 2025 : Second court granted Cooper's motion sua-sponte without a\nhearing and without notice\nApril 11, 2025 : Charles's mandamus was denied per curiam\nTHE STORY OF CHARLES DUSTIN MYERS: A NARRATIVE\nFOR THE HIGHER COURT\nI. FAMILY BACKGROUND AND CIRCUMSTANCES PRIOR TO DIVORCE\nCharles Dustin Myers was a devoted husband and father who built his life around his\nfamily. After marrying Morgan Michelle Myers on June 20, 2015, the couple established\ntheir home at 6641 Anne Court in Watauga, Texas. Together, they welcomed two\ndaughters into the world: Mara Evonne Myers, born June 20, 2016, and Caroline Rose\nMyers, born April 12, 2018. \nIn January 2021, Charles made a significant professional transition by establishing a\nhome-based business specializing in real-time market data solutions. This decision\nallowed him to be more present for his young daughters while still providing for his\nfamily financially. Charles's business served clients across the United States and Canada,\nrequiring reliable internet connectivity that he had specifically upgraded in September\n2023 to ensure optimal service delivery.\nCharles embraced his role as an active and involved father. He took his daughters to\nschool each morning, helped them with their homework in the afternoons, prepared\ntheir meals, gave them baths, and was a constant, nurturing presence in their lives.\nWhile Morgan worked evening shifts, Charles was the primary caregiver, ensur"}
{"id": "8334c3ad347e6a8fec617a3d49e0d57255a207a2", "vector_id": 92, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 92, "char_len": 2000, "text": "r homework in the afternoons, prepared\ntheir meals, gave them baths, and was a constant, nurturing presence in their lives.\nWhile Morgan worked evening shifts, Charles was the primary caregiver, ensuring the\ngirls maintained a stable routine and received the attention and care they needed during\ntheir formative years.\nBy all outward appearances, the Myers family represented a typical American household\n—parents balancing work responsibilities while raising young children, establishing\nroots in their community, and building a future together. There were no documented\nincidents of family violence, no history of substance abuse, and no prior involvement\nwith family courts or protective services. Charles had no criminal record, as evidenced• \n• \n• \n• \n• \n• \n•\n\nby his clean Texas Department of Public Safety records that would later be submitted to\nthe court.\nII. THE UNEXPECTED DISSOLUTION\nThe first sign of trouble came without warning on December 1, 2023, when Morgan\nabruptly announced her desire for divorce. This declaration came as a complete shock to\nCharles, who had no indication that his wife was contemplating ending their marriage.\nWhat Charles did not know at the time was that this announcement would mark the\nbeginning of a calculated campaign to remove him from his home and children through\na series of coordinated legal maneuvers.\nOn December 12, 2023, Charles made a disturbing discovery that shed light on Morgan's\nsudden decision. While reviewing their joint AT&T account, he uncovered evidence of\nover 16,500 text messages exchanged between Morgan and two individuals outside their\nmarriage—primarily with a man named Damen Kazlauskas—spanning from October\n2022 to December 2023. This revelation suggested that Morgan had been engaged in an\nextramarital relationship for over a year prior to announcing her desire for divorce.\nWhen confronted with this evidence, Morgan denied any wrongdoing, dismissing the\nextensive communications as merely \"emotional support.\" She imm"}
{"id": "4a6264d8bb384c620e855d982ce0f0ef1af88b9c", "vector_id": 93, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 93, "char_len": 2000, "text": "over a year prior to announcing her desire for divorce.\nWhen confronted with this evidence, Morgan denied any wrongdoing, dismissing the\nextensive communications as merely \"emotional support.\" She immediately began\ndistancing herself from Charles and excluding him from any conversations regarding the\ndivorce. On December 13, 2023, Morgan had a private conversation with her\ngrandparents who lived next door, a discussion that lasted from 9:30 AM until 1:30 AM\nthe following morning.\nIII. THE ORCHESTRATED LEGAL STRATEGY BEGINS\nThe day after this extended family conversation, on December 14, 2023, Morgan made\nher first attempt to obtain an emergency order of protection against Charles—a fact that\nwould only later be revealed in her divorce petition. This attempt occurred without\nCharles's knowledge and despite there being no incidents of violence or threats that\nwould justify such an order.\nOn December 15, 2023, a new player entered the situation: Daniel Branthoover, Morgan's\nstepfather. Between 7:22 AM and 8:39 AM that morning, Daniel and Morgan exchanged\n21 text messages. At 9:41 AM, Daniel texted Charles directly, requesting that he call\nregarding the recent divorce announcement. During their subsequent telephone\nconversation, Daniel convinced Charles that allowing Morgan to bring the children to his\nresidence in Yukon, Oklahoma for the weekend would be \"a good move.\" Daniel\npresented himself as a neutral party who wanted to help both Charles and Morgan\nnavigate the divorce amicably.\n\nAfter this call, Daniel resumed texting Morgan, exchanging an additional 9 messages\nbetween 10:03 AM and 10:07 AM. What appeared to be a gesture of goodwill from a\nconcerned family member was, in reality, the beginning of a coordinated plan to\ndisadvantage Charles in the impending legal proceedings.\nIV. FINANCIAL MANIPULATION AND DECEPTION\nThe true nature of Daniel's involvement became clear the very next day. On December\n16, 2023, Charles was notified that his bank account had been over"}
{"id": "c620aa692bdc6009e683f03f97276d84f26d7a20", "vector_id": 94, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 94, "char_len": 2000, "text": "eedings.\nIV. FINANCIAL MANIPULATION AND DECEPTION\nThe true nature of Daniel's involvement became clear the very next day. On December\n16, 2023, Charles was notified that his bank account had been overdrawn by $800. When\nhe contacted Daniel at 3:54 PM requesting that funds be returned, Daniel falsely claimed\nthat Morgan had transferred money to her own account, asserting that Texas is a\ncommunity property state as justification.\nHowever, Charles's bank statement from December 2023 revealed the truth: $1,576 had\nbeen transferred to \"dmb575,\" a PayPal account belonging to Daniel Branthoover. When\nconfronted about these transactions, Daniel's response revealed that his true intent\nregarding Morgan's visit to his residence was to assist her in drafting legal documents for\nfuture litigation.\nDuring this same period, Daniel advised or purchased a second phone for Morgan,\nregistered under the number 817-940-0852, along with a can of pepper spray mace. This\nnew phone number would subsequently appear on the original petition for divorce filed\non December 18, 2023, on an affidavit of inability to pay court costs filed the same day,\nand on an application for a protective order filed on December 22, 2023—all prepared\nunder Daniel's direction.\nV. EVICTION ATTEMPT AND FALSE CLAIMS\nWhile Morgan was at Daniel's residence in Oklahoma, allegedly preparing legal\ndocuments, she orchestrated another troubling action. On December 17, 2023, at 11:00\nAM, Morgan's grandmother served Charles with an eviction notice. The stated grounds\nfor eviction were:\n\"Granddaughter getting divorced.\"\n\"Protective order has been filed.\"\n\"He must leave, the girls and she may stay.\"\nNotably, no protective order had been filed at that time, making this claim demonstrably\nfalse. Morgan returned to Texas later that day and continued to cohabit with Charles in\nthe family home, despite the eviction notice and her claims of feeling unsafe.\nThe following day, December 18, 2023, Morgan filed for divorce claiming finan"}
{"id": "2617409dc3f40ece16e9afad9e0832a701143264", "vector_id": 95, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 95, "char_len": 2000, "text": "ay and continued to cohabit with Charles in\nthe family home, despite the eviction notice and her claims of feeling unsafe.\nThe following day, December 18, 2023, Morgan filed for divorce claiming financial\nindigency—this despite having just transferred $1,576 from the joint account days1. \n2. \n3.\n\nearlier. She requested assistance for uncontested cases and submitted her original\npetition for divorce. Within this petition, Morgan falsely claimed that she had an active\norder of protection against Charles due to a finding of family violence during the\nmarriage. She also claimed both family vehicles as separate property and asserted that\nshe or the children would be harassed or abused if Charles were given contact\ninformation.\nMorgan's petition also sought to waive the standard 60-day waiting period for divorce\nbased on the false claim that family violence had occurred during the marriage. Four\ndays later, on December 22, 2023, Morgan filed for an additional protective order, now\nclaiming that family violence had occurred on December 18, 2023—after her divorce\nfiling.\nVI. CHARLES'S LEGAL RESPONSE AND DEFENSE PREPARATION\nOn December 27, 2023, Charles was served with the formal eviction, scheduled for\nJanuary 17, 2024. Once served with the divorce papers, Charles began preparing his\ndefense. On January 2, 2024, he filed an answer to the divorce petition and provided two\nattachments, including his Texas Department of Public Safety records showing no\nhistory of violence.\nCharles then filed a motion to consolidate on January 3, 2024, and provided a\nbackground report to provide insight into the children's family dynamics. On January 8,\n2024, he filed a motion for continuance and provided further documentation to the\ncourt, including text message evidence that Morgan had lied about her financial status\nand fabricated her claims of indigency.\nOn January 13, 2024, Charles filed an unsworn declaration with the court reiterating the\nfacts established up to that point. Throughout th"}
{"id": "07b747561a8908a09d419572d3d42c1a1aa54f40", "vector_id": 96, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 96, "char_len": 2000, "text": " her financial status\nand fabricated her claims of indigency.\nOn January 13, 2024, Charles filed an unsworn declaration with the court reiterating the\nfacts established up to that point. Throughout this period, Charles continued to reside in\nthe family home with Morgan and their daughters, with no incidents of violence or\nthreats—a fact that directly contradicted Morgan's claims of feeling unsafe.\nVII. THE FIRST HEARING AND REMOVAL FROM THE HOME\nOn January 16, 2024, the parties arrived at the show cause hearing, marking Morgan's\nonly appearance found in the case docket. Without any evidence being presented,\nwitnesses called, findings made, or statutory authority cited, the court exceeded its\njurisdiction and ordered Charles to vacate the family home at 6641 Anne Court, Watauga,\nTexas 76148. The court gave no consideration to the well-being of the children, the\nfamily's home environment, or Charles's work situation that required him to have\nreliable internet access.\n\nThis devastating decision forced Charles to stay temporarily with his father in Flower\nMound, Texas while he sought legal representation. With less than a week to find an\nattorney, Charles retained Dan Bacalis of Hurst, Texas for $3,000 and briefed him on the\nsituation.\nOn January 17, 2024, the eviction case against Charles was dismissed for lack of subject\nmatter jurisdiction—a vindication that came too late, as he had already been ordered to\nleave his home by the family court.\nVIII. CONTINUED DELAYS AND LEGAL MANEUVERING\nReady to hold Morgan accountable, Charles and his attorney appeared on January 22,\n2024, at the reset hearing, only to face another delay. Morgan had acquired attorney\nCooper L. Carter in the courtroom lobby immediately before the hearing, resulting in the\ncase being postponed again until February 1, 2024. This last-minute tactic extended\nCharles's separation from his home and normal family life.\nBetween the second and third hearings, each counsel amended their respective\npetitions. Ne"}
{"id": "cc532109393454b02f1d2712295c3d04a2ff0f3b", "vector_id": 97, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 97, "char_len": 2000, "text": "February 1, 2024. This last-minute tactic extended\nCharles's separation from his home and normal family life.\nBetween the second and third hearings, each counsel amended their respective\npetitions. Neither the Counterpetition for Divorce nor the Original Petition for Divorce\nwas served on Charles or Morgan, as stated in each petition.\nIX. THE FEBRUARY HEARING AND SETTLEMENT UNDER DURESS\nThe parties went to court on February 1, 2024, ostensibly to hold a hearing regarding\nMorgan's protective order claims. Rather than conducting this hearing, Charles's own\ncounsel, Dan Bacalis, drafted and presented a settlement agreement in the form of an\n\"Agreed\" Associate Judge's Report. This report gave Charles one month back in the\nhome he had just been removed from and kept full custody of the children with Morgan.\nLeft with no alternative and feeling pressured by his own attorney, Charles reluctantly\nsigned the agreement. He immediately terminated Dan Bacalis for his failure to\nadequately represent him and notified the court on February 5, 2024. An agreed motion\nfor withdrawal followed on February 6, and Charles proceeded pro se (representing\nhimself).\nWithout Charles's knowledge or consent, an \"Agreed\" order of consolidation was\nrendered on February 8, 2024, missing his signature. On this same day, Charles filed an\nEMERGENCY MOTION to challenge Morgan's allegations and present his evidence to the\ncourt. This evidence included:\nThe extensive text message volume between Morgan and third parties outside of\nthe marriage1.\n\nA text to Morgan's grandfather showing how the divorce was an unexpected\nblindside\nThe financial transactions showing that Morgan transferred $1,576 to herself four\ndays prior to claiming financial indigency\nThe resulting overdraft from Morgan's transaction\nThe eviction notice served by Morgan's grandmother\nThe eviction dismissal for lack of jurisdiction\nX. ESCALATING LEGAL BATTLES AND LOCKOUT\nOn February 8, 2024, an order of withdrawal for attorney Bacalis was "}
{"id": "9664414c574de827537bcde7e610b1d9043b7b54", "vector_id": 98, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 98, "char_len": 2000, "text": "tion notice served by Morgan's grandmother\nThe eviction dismissal for lack of jurisdiction\nX. ESCALATING LEGAL BATTLES AND LOCKOUT\nOn February 8, 2024, an order of withdrawal for attorney Bacalis was served on the\nparties. Charles filed a motion for summary judgment on February 22, 2024, and the\nparties were served a notice of hearing regarding Charles's emergency motion on\nFebruary 27, 2024, set for March 14, 2024.\nCharles filed initial disclosures ten days before the hearing and filed a notice to the court\non March 4, 2024, explaining that he would not be leaving the family home until the\ncourt heard his emergency motion, given the rights at stake. In response, Morgan took\nmatters into her own hands and illegally locked Charles out of the marital residence on\nMarch 6, 2024, before the scheduled hearing could take place.\nXI. THE MARCH HEARING AND DENIAL OF DUE PROCESS\nAt the March 14 hearing, Cooper L. Carter handed Charles formal temporary orders that\nwere based on the February 1st report drafted by Dan Bacalis. Despite filing no response\nto his emergency motion, it was denied outright, and Charles was ordered to sign the\ntemporary orders prepared by Cooper L. Carter. When Charles refused to sign orders he\ndid not agree with, the judge rendered them anyway.\nFollowing this setback, Charles prepared his Second Amended Preparatory Notice for\nJudicial Review, which provided a detailed account of the facts of the matter, detailed\naffidavits from business clients, and attorney-client interactions, as well as videos of\nCharles with his children. Charles then began preparing to appeal to the Second Court of\nAppeals for the extraordinary writ of mandamus.\nXII. THE APPELLATE JOURNEY BEGINS\nOn April 4, 2024, Charles began his appellate journey by filing a petition for writ of\nmandamus and emergency stay in the Second Court of Appeals. Both were denied just a\nfew days later. Charles moved for rehearing on his mandamus petition.\nMeanwhile, Cooper L. Carter tried to set a pre-t"}
{"id": "094baa4407b1afb1455df4a889505a8c366a5b6a", "vector_id": 99, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 99, "char_len": 2000, "text": "ndamus and emergency stay in the Second Court of Appeals. Both were denied just a\nfew days later. Charles moved for rehearing on his mandamus petition.\nMeanwhile, Cooper L. Carter tried to set a pre-trial conference on April 24, 2024, which\nCharles promptly objected to that same day. The following day, Charles's rehearing was2. \n3. \n4. \n5. \n6.\n\ndenied in the Second Court of Appeals, and he moved for rehearing en banc, which was\nalso denied. Undeterred, Charles petitioned the Texas Supreme Court on May 12, 2024.\nThe next action from Cooper L. Carter came via email correspondence on May 19, 2024,\nwhen she requested an income withholding order from Charles, which was defective.\nCharles notified her of the defects but never received a response.\nXIII. INTERVENTION AND SUMMER WITH CHILDREN\nWhile Charles awaited the Texas Supreme Court's decision, the Texas Office of the\nAttorney General filed an intervention on June 28, 2024, for alleged past-due child\nsupport. Charles promptly objected to this intervention on July 1, 2024, and nothing\nfurther came of it.\nCharles spent the remainder of July 2024 with his daughters, trying to find some form of\nnormalcy during this difficult time. He stayed with the children in an Airbnb less than\ntwo miles from the marital residence to provide stability and comfort for the month.\nXIV. CONTINUED LEGAL EFFORTS AND CHALLENGES\nThe Texas Supreme Court denied Charles's petition on August 30, 2024. Undeterred, he\nmoved for rehearing by September 10, 2024, and amended the petition six days later.\nGiven that Cooper L. Carter had been silent throughout the entire appellate process,\nCharles moved to challenge her authority under Rule 12 of the Texas Rules of Civil\nProcedure and served discovery requests in late September.\nThe discovery requested production of documents and admissions. By this time, Charles\nhad discovered that the orders currently in place were likely void for lack of consent, so\nhe filed an emergency motion for temporary orders reque"}
{"id": "c1e2ac2313a936d090b6e95a8f0fedca43c714a7", "vector_id": 100, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 100, "char_len": 2000, "text": "on of documents and admissions. By this time, Charles\nhad discovered that the orders currently in place were likely void for lack of consent, so\nhe filed an emergency motion for temporary orders requesting relief. The emergency\nwas based on his depleted credit and savings, which meant he would have to move out\nof the area by October 1st if relief could not be granted.\nWhen no relief came, Charles filed a joint motion to recuse both James Munford and Jeff\nKaitcer from the case. Both judges elected not to recuse themselves, and James Munford\nhad to amend his initial referral order due to procedural abnormalities involving the\ncourt coordinator and tampering with documents. Charles's mandamus rehearing in the\nSupreme Court of Texas was denied on October 18, 2024.\nXV. RECUSAL PROCEEDINGS AND FEDERAL REMOVAL\nThe recusal proceedings were referred to Justice Lee Gabriel, a retired visiting judge\nfrom the Second Court of Appeals. Charles filed a pre-trial motion in limine prior to the\n\nhearing and requested confirmation that Justice Lee Gabriel had taken her required oath\nprior to sitting on the case.\nOn the day of the scheduled hearing, November 7, 2024, Charles woke up with a dental\nemergency and promptly notified the court and the opposing party, who agreed to reset\nthe recusal hearing to a later date. Nevertheless, Charles received a denial on his recusal\nmotion on November 17, 2024, which falsely claimed that he had failed to appear at the\nhearing while the opposing side did appear.\nFeeling that he had exhausted all state remedies and been treated unfairly at every turn,\nCharles filed a notice of intent to remove the case to the Northern District of Texas. The\ncase was removed on December 4, 2024, but was quickly remanded by December 6,\n2024.\nXVI. RECENT DEVELOPMENTS AND CURRENT SITUATION\nIn early 2025, Charles continued his legal battle. On January 13, 2025, he filed a case\nmemo/plea for judicial review. On January 22, 2025, he filed a notice of loss of\nemployment, hi"}
{"id": "9c12e33f6f64479d206e48f803fea082ed775f87", "vector_id": 101, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 101, "char_len": 2000, "text": "URRENT SITUATION\nIn early 2025, Charles continued his legal battle. On January 13, 2025, he filed a case\nmemo/plea for judicial review. On January 22, 2025, he filed a notice of loss of\nemployment, highlighting the devastating impact the legal proceedings had on his\nability to maintain his business without reliable internet access.\nOn February 10-12, 2025, Charles filed an emergency ex-parte motion for child custody,\nsole use of the marital residence, contempt, and sanctions. He also filed a notice of past-\ndue findings of fact and conclusions of law, highlighting the court's failure to provide the\nlegal basis for its decisions.\nOn March 19, 2025, Charles opened a separate Suit Affecting Parent-Child Relationship\n(SAPCR) seeking emergency relief after being locked out of his house for over a year with\nno effective legal remedy. After remaining silent for over a year, Cooper L. Carter\nsuddenly reappeared to answer the suit and filed a motion to consolidate.\nCharles responded with a motion to strike those pleadings because they were filed once\nagain by Roderick D. Marx, not Cooper L. Carter herself. Charles then objected to the\nconsolidation, trying to invoke a dominant jurisdiction analysis based on exceptions that\napply when a suit is not being prosecuted or was brought in bad faith.\nCharles then filed an emergency Temporary Restraining Order (TRO) and got as far as\nsetting the matter for a presentation on March 28, 2025. Without responding to the TRO,\nCooper requested to be \"patched in\" with the judge during the presentment.\nOn March 28, 2025, after the parties agreed to April 10th as a date for the full TRO\nhearing, Charles was denied the opportunity to be heard. He was told to leave without\nthe court even hearing or ruling on his motion, based on a forward-looking promise\n\nmade by Cooper Carter that she would be filing a motion to consolidate in the first court\n—a promise that wasn't fulfilled until a week later.\nCharles filed a mandamus in the Second Court of Ap"}
{"id": "56d72f1eb2756d7c70ef4033ed3ef3370fcd8d1c", "vector_id": 102, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 102, "char_len": 2000, "text": "omise\n\nmade by Cooper Carter that she would be filing a motion to consolidate in the first court\n—a promise that wasn't fulfilled until a week later.\nCharles filed a mandamus in the Second Court of Appeals seeking to compel the\nassociate judge in the second court to hear the SAPCR and void the orders issued on\nMarch 14, 2024, in the divorce suit. On the same day, the second court granted Cooper's\nmotion sua sponte without a hearing and without notice. The mandamus was denied\nper curiam the next day on April 11, 2025.\nXVII. THE HUMAN TOLL\nThroughout this ordeal, which has now stretched for more than 16 months, Charles has\nbeen effectively separated from his home, his stable work environment, and the normal\nparenting relationship he once enjoyed with his daughters. The financial strain has been\nenormous—depleting his savings, damaging his credit, and undermining his business\nthat requires reliable internet access he no longer has.\nThe emotional toll has been equally devastating. Charles has gone from being a daily\npresence in his daughters' lives—taking them to school, helping with homework, giving\nbaths, and being there for bedtime routines—to a marginalized figure fighting through a\nlabyrinthine legal system that seems designed to exhaust his resources and resolve.\nPerhaps most troubling is the emerging evidence that Morgan is now engaged to Damen\nKazlauskas, the man with whom she exchanged thousands of text messages prior to\nannouncing her desire for divorce. This suggests that the entire legal campaign against\nCharles may have been orchestrated not because of any legitimate concerns about\nsafety or family violence, but as a means to remove him from the home to facilitate a\nnew relationship—all at the expense of the children's stable environment and Charles's\nfundamental rights as a father and homeowner.\nDespite these challenges, Charles has persisted in his legal efforts, representing himself\npro se after his initial negative experience with legal counsel, filing "}
{"id": "3b84ece6307a6a51c877b9b6ecebcb1ceb50270e", "vector_id": 103, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 103, "char_len": 2000, "text": "al rights as a father and homeowner.\nDespite these challenges, Charles has persisted in his legal efforts, representing himself\npro se after his initial negative experience with legal counsel, filing appropriate motions\nand appeals, and seeking relief through every available channel in the Texas legal\nsystem. His story is not merely one of personal hardship but represents a troubling\nexample of how the family court system can be manipulated through false allegations\nand procedural technicalities to produce profoundly unjust outcomes.\n\nLEGAL ANALYSIS AND IMPLICATIONS\nI. VIOLATIONS OF TEXAS FAMILY CODE SECTION 6.405(b)\nOne of the most significant legal issues in Charles Myers's case involves violations of\nTexas Family Code Section 6.405(b), which establishes mandatory procedures when\nfamily violence is alleged in divorce proceedings. This statute requires that when family\nviolence is alleged, the court must hold a hearing within 14 days to determine whether\nto dissolve or modify any temporary ex parte protective order.\nIn Charles's case, Morgan claimed in her divorce petition filed on December 18, 2023,\nthat she had an active order of protection against Charles due to family violence. She\nlater filed an additional protective order application on December 22, 2023, claiming\nfamily violence occurred on December 18, 2023. Despite these allegations, the court\nfailed to conduct the mandatory hearing within the 14-day timeframe required by\nstatute.\nInstead, on January 16, 2024, without any evidence being presented, witnesses called,\nor findings made, the court ordered Charles to vacate his family home. This action\nviolated not only the procedural requirements of Section 6.405(b) but also Charles's\nfundamental due process rights. The court's failure to follow this mandatory procedure\nconstitutes reversible error and renders the resulting orders potentially void.\nThe implications of this violation extend beyond procedural technicalities. By failing to\nhold the required hearin"}
{"id": "3e0131d4d994f0fb5ceadb8cce64f48acd772dbb", "vector_id": 104, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 104, "char_len": 2000, "text": "edure\nconstitutes reversible error and renders the resulting orders potentially void.\nThe implications of this violation extend beyond procedural technicalities. By failing to\nhold the required hearing, the court effectively treated Morgan's unsubstantiated\nallegations as established facts, depriving Charles of the opportunity to present\nevidence contradicting these claims. This resulted in life-altering consequences for\nCharles, including separation from his home, disruption of his business, and reduced\naccess to his children—all without the evidentiary foundation required by law.\nII. FALSE ALLEGATIONS AND THEIR LEGAL CONSEQUENCES\nThe record strongly suggests that Morgan made false allegations of family violence to\ngain tactical advantages in the divorce proceedings. Texas law recognizes the serious\nnature of family violence allegations and imposes significant penalties for those who\nperpetrate such violence. However, the law also provides remedies when allegations are\ndemonstrably false.\nThe evidence indicates that Morgan's claims of family violence were fabricated:\nCharles's Texas Department of Public Safety records showed no history of violence.1.\n\nMorgan continued to cohabitate with Charles after filing for divorce and alleging\nfamily violence.\nNo specific incidents of violence were ever detailed in Morgan's filings.\nThe timing of the allegations coincided with Charles's discovery of Morgan's\nextensive communications with individuals outside the marriage.\nUnder Texas law, making false statements in court filings constitutes perjury, a criminal\noffense. Additionally, Texas Family Code Section 153.013 provides for sanctions against a\nparty who files a suit affecting the parent-child relationship and makes false allegations\nof child abuse. While this section specifically addresses child abuse allegations, courts\nhave applied similar reasoning to false allegations of domestic violence that impact\ncustody determinations.\nThe legal implications of these false allegat"}
{"id": "f6ffa1204900653bf4494bdb3b19bdb1dd5f0648", "vector_id": 105, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 105, "char_len": 2000, "text": "lly addresses child abuse allegations, courts\nhave applied similar reasoning to false allegations of domestic violence that impact\ncustody determinations.\nThe legal implications of these false allegations are profound. They formed the basis for\nemergency orders that removed Charles from his home, influenced temporary custody\narrangements, and set in motion a chain of legal proceedings that have consumed more\nthan 16 months of litigation. The court's failure to scrutinize these allegations and\nMorgan's apparent immunity from consequences for potentially false sworn statements\nundermines the integrity of the judicial process.\nIII. ATTORNEY AUTHORITY ISSUES AND RULE 12 VIOLATIONS\nA significant procedural irregularity in this case involves the representation of Morgan by\nattorney Cooper L. Carter. According to the case materials, Cooper's filings were\nsubmitted by Roderick D. Marx, who was not a named party in the lawsuit. This raises\nserious questions about proper representation and may constitute unauthorized\npractice of law.\nTexas Rules of Civil Procedure Rule 12 provides a mechanism to challenge an attorney's\nauthority to represent a party. Charles appropriately filed a Rule 12 motion challenging\nCooper's authority, particularly questioning the propriety of having Roderick D. Marx file\ndocuments on her behalf. Under Rule 12, once such a motion is filed, the burden shifts to\nthe challenged attorney to prove their authority to act. If the challenged attorney fails to\nshow sufficient authority, the court shall refuse to permit the attorney to appear in the\ncause.\nThe record indicates that Charles's Rule 12 challenge was not properly addressed. This\nprocedural violation has significant implications:\nIf Cooper lacked proper authority to represent Morgan, all filings and orders\nobtained through her representation could be void.2. \n3. \n4. \n1.\n\nThe electronic filing of documents by someone other than the attorney of record\nviolates Texas electronic filing requirements, whic"}
{"id": "a7533ffbcaa2d51c7fb21a4b78415093726a1419", "vector_id": 106, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 106, "char_len": 2000, "text": "rs\nobtained through her representation could be void.2. \n3. \n4. \n1.\n\nThe electronic filing of documents by someone other than the attorney of record\nviolates Texas electronic filing requirements, which specify that attorneys must\nmaintain control and responsibility over their electronic filings.\nThe potential unauthorized practice of law, if non-attorneys were preparing and\nfiling legal documents, undermines the integrity of the legal proceedings.\nThese issues go beyond mere technicalities. They strike at the heart of proper legal\nrepresentation and the integrity of court filings. If an attorney can have others file\ndocuments on their behalf without proper authorization, it circumvents the safeguards\nbuilt into the legal system to ensure accountability and proper representation.\nIV. DUE PROCESS VIOLATIONS\nThroughout the proceedings, Charles has experienced multiple violations of his due\nprocess rights, which are guaranteed by both the Texas and United States Constitutions.\nDue process requires notice and an opportunity to be heard before being deprived of\nlife, liberty, or property.\nSpecific due process violations in Charles's case include:\nRemoval from home without evidence or findings : On January 16, 2024, Charles\nwas ordered to vacate his family home without any evidence being presented,\nwitnesses called, or findings made. This constitutes a taking of property without\ndue process.\nDenial of opportunity to present evidence : Charles's emergency motion filed on\nFebruary 8, 2024, which included substantial evidence contradicting Morgan's\nclaims, was denied outright on March 14, 2024, without proper consideration.\nOrders rendered without consent : Despite Charles's refusal to sign the temporary\norders prepared by Cooper L. Carter on March 14, 2024, the judge rendered them\nanyway, characterizing them as \"agreed\" orders when no such agreement existed.\nEx parte communications : The record suggests potential improper\ncommunications between opposing counsel and judges, p"}
{"id": "879a136c8a05aadbd510561c7d5e6f12209cf5d3", "vector_id": 107, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 107, "char_len": 2000, "text": "em\nanyway, characterizing them as \"agreed\" orders when no such agreement existed.\nEx parte communications : The record suggests potential improper\ncommunications between opposing counsel and judges, particularly when Cooper\nL. Carter requested to be \"patched in\" with the judge during the TRO presentment\non March 28, 2025.\nDenial of hearings : Charles was repeatedly denied the opportunity to present\nevidence or be heard on his motions, most recently on March 28, 2025, when he\nwas told to leave without the court even hearing or ruling on his motion.\nThese due process violations have had cascading effects on Charles's ability to\neffectively advocate for his rights and maintain his relationship with his children. When2. \n3. \n1. \n2. \n3. \n4. \n5.\n\ncourts issue orders without proper evidentiary foundation, deny parties the opportunity\nto present evidence, or characterize orders as \"agreed\" when they are not, they\nundermine the fundamental fairness that is the cornerstone of our legal system.\nV. JURISDICTION ISSUES AND CONSOLIDATION PROBLEMS\nThe case presents significant issues related to jurisdiction and consolidation,\nparticularly in the context of the dominant jurisdiction doctrine in Texas. This doctrine\ndetermines which court has priority when two courts have concurrent jurisdiction over\nthe same controversy.\nWhen Charles opened a separate Suit Affecting Parent-Child Relationship (SAPCR) on\nMarch 19, 2025, seeking emergency relief after being locked out of his house for over a\nyear, he was invoking exceptions to the dominant jurisdiction rule. These exceptions\napply when:\nThe suit in the first court is not being actively prosecuted, or\nThe suit was filed in bad faith or for the purpose of delay.\nBoth exceptions appear applicable in this case. The original divorce proceeding had seen\nminimal activity from Morgan's side for extended periods, and the evidence suggests the\noriginal suit may have been filed in bad faith, using false allegations to secure tactical\nadvantages."}
{"id": "3a6b9086060b4d80eb047ffb44dc0e52eb6e8ac7", "vector_id": 108, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 108, "char_len": 2000, "text": " had seen\nminimal activity from Morgan's side for extended periods, and the evidence suggests the\noriginal suit may have been filed in bad faith, using false allegations to secure tactical\nadvantages.\nDespite these valid jurisdictional arguments, the second court granted Cooper's motion\nto consolidate sua sponte (on its own motion) without a hearing and without notice on\nApril 10, 2025. This action deprived Charles of the opportunity to argue the jurisdictional\nissues and effectively nullified his attempt to seek relief through an alternative\nprocedural channel after exhausting remedies in the original proceeding.\nThe legal implications of these jurisdictional issues are significant. If a court lacks proper\njurisdiction or improperly consolidates cases without addressing valid jurisdictional\nchallenges, its orders may be void or voidable. The apparent disregard for proper\njurisdictional analysis in this case represents another layer of procedural irregularity that\nhas prevented Charles from obtaining meaningful review of his claims.\nVI. APPELLATE REVIEW CHALLENGES\nCharles has diligently pursued appellate remedies throughout this case, filing multiple\npetitions for writs of mandamus to the Second Court of Appeals and the Texas Supreme\nCourt. Despite presenting substantial evidence of procedural irregularities and due\nprocess violations, these petitions have been summarily denied without addressing the\nmerits of his claims.1. \n2.\n\nThe difficulty Charles has faced in obtaining meaningful appellate review highlights a\nsystemic issue in family law cases. Extraordinary writs like mandamus are often the only\navailable remedy for interim orders in family cases, as these orders are generally not\nimmediately appealable. However, the high standard for mandamus relief—requiring a\nclear abuse of discretion and no adequate remedy by appeal—creates a significant\nbarrier for litigants seeking to correct procedural errors in family courts.\nThe repeated denial of Charles's mandamus p"}
{"id": "cb45cb461cbaef6312d614c0ed13b98ff1c02308", "vector_id": 109, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 109, "char_len": 2000, "text": "lear abuse of discretion and no adequate remedy by appeal—creates a significant\nbarrier for litigants seeking to correct procedural errors in family courts.\nThe repeated denial of Charles's mandamus petitions without substantive analysis of his\nclaims raises concerns about the effectiveness of appellate review in family law cases,\nparticularly those involving self-represented litigants. When appellate courts decline to\nintervene despite evidence of procedural irregularities and due process violations, it\nleaves litigants like Charles with no effective remedy for potentially void or voidable\norders that have life-altering consequences.\nVII. BEST INTEREST OF THE CHILDREN CONSIDERATIONS\nThroughout these proceedings, there appears to have been insufficient consideration of\nthe best interest of the children, which is the paramount concern in all suits affecting the\nparent-child relationship under Texas Family Code Section 153.002.\nThe court's decisions have resulted in:\nDisruption of the children's stable home environment by removing their father\nfrom the family residence\nSeparation from a parent who was actively involved in their daily care and routines\nPotential exposure to parental alienation\nInstability created by Morgan's apparent relationship with Damen Kazlauskas,\nwhich evidence suggests began before the divorce proceedings\nThe legal standard for best interest determinations in Texas was established in Holley v.\nAdams, 544 S.W.2d 367 (Tex. 1976), which outlined factors courts should consider,\nincluding the emotional and physical needs of the children, the stability of the home,\nand the plans for the children by the individuals seeking custody.\nThe record suggests that these factors were not adequately considered in the court's\ndecisions. Charles's role as an active, involved father who took the children to school,\nhelped with homework, and provided daily care appears to have been disregarded in\nfavor of orders that separated him from his children based on unsubsta"}
{"id": "9c11b9959b08cb410f66423f27a9e7afc0086afa", "vector_id": 110, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 110, "char_len": 2000, "text": "nvolved father who took the children to school,\nhelped with homework, and provided daily care appears to have been disregarded in\nfavor of orders that separated him from his children based on unsubstantiated\nallegations.\nThis failure to properly apply the best interest standard has significant legal\nimplications. Orders that do not properly consider the best interest of the children are\nsubject to modification and potentially reversal on appeal. More importantly, they may1. \n2. \n3. \n4.\n\ncause actual harm to the children's emotional well-being and development by\nunnecessarily disrupting their relationship with a loving parent.\nVIII. CONCLUSION: THE NEED FOR HIGHER COURT INTERVENTION\nThe legal analysis of Charles Myers's case reveals a troubling pattern of procedural\nirregularities, due process violations, and disregard for statutory requirements that have\nresulted in substantial injustice. From the failure to hold mandatory hearings under\nTexas Family Code Section 6.405(b) to the acceptance of potentially false allegations\nwithout evidence, from questions about attorney authority to improper consolidation of\ncases, the proceedings have been marked by deviations from proper legal procedure.\nThese issues are not merely technical violations but have resulted in profound\nconsequences for Charles and his children. He has been removed from his home,\nseparated from his children, and deprived of the stable environment necessary for his\nbusiness—all without the evidentiary foundation and procedural safeguards required by\nlaw.\nThe case presents an opportunity for a higher court to address not only the specific\ninjustices suffered by Charles but also broader systemic issues in family court\nproceedings:\nThe need for strict adherence to statutory requirements when family violence is\nalleged\nThe importance of evidentiary hearings before issuing orders with life-altering\nconsequences\nThe proper application of the Rule 12 procedure for challenging attorney authority\nThe protection o"}
{"id": "a38bee1483f031c6200313593fccf356048558fd", "vector_id": 111, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 111, "char_len": 2000, "text": "alleged\nThe importance of evidentiary hearings before issuing orders with life-altering\nconsequences\nThe proper application of the Rule 12 procedure for challenging attorney authority\nThe protection of due process rights for all parties in family law proceedings\nThe proper analysis of jurisdictional issues in related family cases\nThe paramount consideration of children's best interests in all custody\ndeterminations\nIntervention by a higher court is not only justified but necessary to prevent a continuing\nmiscarriage of justice and to affirm the principle that procedural safeguards are not\nmere formalities but essential protections for the rights of all parties in our legal system.\nKEY LEGAL ISSUES IN CHARLES DUSTIN MYERS CASE\nTexas Family Code Violations\nSection 6.405(b) Violation : When family violence is alleged in a divorce suit, the\ncourt must hold a hearing within 14 days to determine whether to dissolve or1. \n2. \n3. \n4. \n5. \n6. \n1.\n\nmodify any temporary ex parte protective order. In Charles's case, the court failed\nto follow this mandatory procedure.\nFalse Allegations of Family Violence : Morgan appears to have falsely claimed\nfamily violence to waive the 60-day waiting period for divorce and to secure\nCharles's removal from the family home.\nImproper Removal from Residence : Charles was ordered to vacate his family\nhome without proper evidence, witnesses, or findings, potentially violating his due\nprocess rights.\nProcedural Irregularities\nAttorney Authority Issues : Cooper L. Carter's filings were allegedly submitted by\nRoderick D. Marx, who was not a named party in the lawsuit. This raises questions\nabout proper representation and may constitute unauthorized practice of law.\nElectronic Filing Requirements : Texas requires attorneys to maintain control and\nresponsibility over their electronic filings. The fact that Cooper's filings were\nsubmitted by someone else raises serious questions about proper representation.\nLack of Response to Motions : Cooper allegedl"}
{"id": "6e4c732343b71697f2623ceb5af8ab89df3d1901", "vector_id": 112, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 112, "char_len": 2000, "text": "ibility over their electronic filings. The fact that Cooper's filings were\nsubmitted by someone else raises serious questions about proper representation.\nLack of Response to Motions : Cooper allegedly did not respond to Charles's\nmotions or discovery requests, yet was able to secure orders against him.\nRule 12 Challenge : Charles challenged Cooper's authority pursuant to Rule 12, but\nthis challenge was not properly addressed.\nJurisdiction Issues\nDominant Jurisdiction Analysis : When two courts have concurrent jurisdiction,\nthe first court to acquire jurisdiction generally has dominant jurisdiction. However,\nexceptions exist if:\nThe suit in the first court is not being actively prosecuted\nThe suit was filed in bad faith or for the purpose of delay\nFederal Removal Strategy : Charles removed the divorce case to federal court to\nplace the burden of 237a on Cooper, knowing she likely couldn't satisfy the\nrequirement to file the certified copy of the notice of remand with the clerk.\nConsolidation Without Consent : An \"Agreed\" order of consolidation was rendered\nwithout Charles's signature, raising questions about its validity.2. \n3. \n1. \n2. \n3. \n4. \n1. \n2. \n3. \n4. \n5.\n\nDue Process Concerns\nDenial of Hearings : Charles was repeatedly denied the opportunity to present\nevidence or be heard on his motions.\nEx Parte Communications : Potential improper communications between\nopposing counsel and judges.\nOrders Without Evidence : Court orders were issued without evidence being\npresented, witnesses called, or proper findings made.\nLack of Statutory Authority : Court actions taken without clear statutory authority.\nFinancial Misconduct\nFraudulent Indigency Claim : Morgan claimed financial indigency after\ntransferring $1,576 from the joint account.\nMisrepresentation of Assets : Morgan falsely claimed both family vehicles as\nseparate property.\nThird-Party Financial Interference : Daniel Branthoover's involvement in\ntransferring marital funds.\nChild Custody Concerns\nBest Interest of"}
{"id": "cd4a7ee45eb75e998d80bfa43b2841219e0948b6", "vector_id": 113, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 113, "char_len": 2000, "text": " falsely claimed both family vehicles as\nseparate property.\nThird-Party Financial Interference : Daniel Branthoover's involvement in\ntransferring marital funds.\nChild Custody Concerns\nBest Interest of Children : Court decisions appear to have been made without\nproper consideration of the children's best interests.\nParental Alienation : Allegations that Morgan has been alienating the children from\nCharles.\nStable Environment Disruption : Children were removed from their stable home\nenvironment without proper justification.\nEthical Concerns\nAttorney Misconduct : Questions about the ethical conduct of attorneys involved in\nthe case.\nFalse Statements to Court : Allegations of false statements made in court filings.\nAbuse of Legal Process : Using legal procedures for improper purposes.1. \n2. \n3. \n4. \n1. \n2. \n3. \n1. \n2. \n3. \n1. \n2. \n3.\n\nPotential Remedies\nWrit of Mandamus : Compelling the lower court to perform its duty correctly.\nMotion to Vacate Void Orders : Challenging orders issued without proper authority\nor procedure.\nRule 12 Motion : Requiring opposing counsel to show authority to act.\nEmergency Relief : Seeking immediate relief from improper court actions.\nAppeal : Challenging erroneous court decisions through the appellate process.\nLEGAL PRECEDENTS AND AUTHORITIES FOR CHARLES\nMYERS CASE\nTexas Family Code Section 6.405 - Protective Order and Related Orders\nTexas Family Code Section 6.405 establishes requirements for disclosure of protective\norders in divorce proceedings:\nDisclosure Requirements : The petition in a suit for dissolution of marriage must\nstate whether there is in effect:\nA protective order under Title 4\nA protective order under Subchapter A, Chapter 7B, Code of Criminal Procedure\nAn order for emergency protection under Article 17.292, Code of Criminal\nProcedure\nOr if an application for such an order is pending\nDocumentation Requirements : The petitioner must attach to the petition a copy\nof each order in which a party was the applicant or victim and"}
{"id": "e25404451a431d3af36fb2feb1479052f0485d46", "vector_id": 114, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 114, "char_len": 2000, "text": "rocedure\nOr if an application for such an order is pending\nDocumentation Requirements : The petitioner must attach to the petition a copy\nof each order in which a party was the applicant or victim and the other party was\nthe respondent. If a copy is not available at filing, the petition must state that a\ncopy will be filed before any hearing.\nRelevance to Charles's Case : Morgan appears to have falsely claimed an active\nprotective order existed when filing for divorce, violating the truthfulness\nrequirements of this statute.1. \n2. \n3. \n4. \n5. \n1. \n2. \n3. \n4. \n5. \n6. \n7.\n\nFalse Allegations of Family Violence in Texas Divorce Cases\nAccording to legal resources from The Fox Firm (Sarah Fox Law):\nMotivations for False Allegations : Divorcing partners often make false allegations\nagainst spouses to:\nObtain favorable child custody outcomes\nGain advantage in marital property settlements\nAct as revenge to damage the other party's reputation\nConsequences of Family Violence Allegations :\nFamily violence is a serious crime in Texas with severe penalties\nEven without conviction, allegations damage social reputation\nPenalties can range from jail sentences up to one year and/or fines to prison\nsentences of 5-99 years and/or fines up to $10,000\nCivil penalties can include protective orders and restitution payments\nDefense Strategies Against False Allegations :\nHighlighting unreliable testimony and inconsistencies\nSelf-defense claims where applicable\nDemonstrating actions were unintentional\nSeeking experienced legal counsel\nRelevance to Charles's Case : Morgan appears to have made false allegations of\nfamily violence to gain advantage in the divorce proceedings, particularly regarding\nchild custody and property division.\nTexas Rules of Civil Procedure - Rule 12: Attorney to Show Authority\nRule 12 of the Texas Rules of Civil Procedure provides a mechanism to challenge an\nattorney's authority to represent a party:\nChallenge Procedure : A party may file a sworn motion stating that the"}
{"id": "b9748414249e37b98f71bd1087e072d35720ea54", "vector_id": 115, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 115, "char_len": 2000, "text": "ity\nRule 12 of the Texas Rules of Civil Procedure provides a mechanism to challenge an\nattorney's authority to represent a party:\nChallenge Procedure : A party may file a sworn motion stating that they believe the\nattorney representing the opposing party is not authorized to do so.\nBurden of Proof : Upon such motion, the burden shifts to the challenged attorney\nto prove their authority to act.\nCourt Action : If the challenged attorney fails to show sufficient authority, the court\nshall refuse to permit the attorney to appear in the cause.1. \n2. \n3. \n4. \n5. \n6. \n7. \n8. \n9. \n10. \n11. \n12. \n13. \n14. \n15. \n1. \n2. \n3.\n\nRelevance to Charles's Case : Charles challenged Cooper L. Carter's authority\npursuant to Rule 12, particularly questioning the propriety of having Roderick D.\nMarx file documents on her behalf.\nElectronic Filing Requirements for Texas Attorneys\nBased on Texas court rules and procedures:\nPersonal Responsibility : Attorneys must maintain control and responsibility over\ntheir electronic filings.\nProper Identification : Electronic filings must be made under the attorney's own\ncredentials, not those of another person.\nUnauthorized Practice Concerns : Having non-attorneys or non-parties prepare\nand file legal documents may constitute unauthorized practice of law.\nRelevance to Charles's Case : Cooper L. Carter's filings were allegedly submitted\nby Roderick D. Marx, who was not a named party in the lawsuit, raising questions\nabout proper representation.\nTexas Family Code Section 6.405(b) - Hearing Requirements for Family\nViolence Allegations\nWhen family violence is alleged in a divorce suit:\nMandatory Hearing : The court must hold a hearing within 14 days to determine\nwhether to dissolve or modify any temporary ex parte protective order.\nDue Process : This requirement ensures due process for the accused party.\nProcedural Violation : Failure to follow this mandatory procedure constitutes a\nviolation that can be challenged.\nRelevance to Charles's Case : The court a"}
{"id": "9c2a6ff3697e7f3580d1b75151a0f1bcc639d661", "vector_id": 116, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 116, "char_len": 2000, "text": "t ensures due process for the accused party.\nProcedural Violation : Failure to follow this mandatory procedure constitutes a\nviolation that can be challenged.\nRelevance to Charles's Case : The court appears to have failed to follow this\nmandatory procedure after Morgan alleged family violence, instead ordering\nCharles to vacate his residence without proper hearings.\nDominant Jurisdiction Analysis in Texas\nThe legal doctrine of dominant jurisdiction in Texas determines which court has priority\nwhen two courts have concurrent jurisdiction:\nFirst-Filed Rule : Generally, the first court to acquire jurisdiction has dominant\njurisdiction.4. \n1. \n2. \n3. \n4. \n1. \n2. \n3. \n4. \n1.\n\nExceptions :\nIf the suit in the first court is not being actively prosecuted\nIf the suit was filed in bad faith or for the purpose of delay\nRelevance to Charles's Case : This doctrine is relevant to Charles's challenges\nregarding competing court jurisdictions, particularly when he opened a separate\nSAPCR and faced consolidation issues.\nCONCLUSION AND PRAYER FOR RELIEF\nThe case of Charles Dustin Myers presents a troubling example of how procedural\nirregularities, false allegations, and questionable legal maneuvers can result in\nsubstantial injustice within the family court system. Over the course of more than 16\nmonths, Charles has been subjected to a series of actions that have deprived him of his\nhome, limited his access to his children, and undermined his ability to maintain his\nbusiness—all without the evidentiary foundation and procedural safeguards required by\nlaw.\nThe record reveals a pattern of conduct by Morgan Myers, with the assistance of her\nstepfather Daniel Branthoover and attorney Cooper L. Carter, that appears designed to\ncircumvent proper legal procedures and secure tactical advantages through false\nallegations and procedural maneuvering. From the false claims of family violence and\nfinancial indigency to the questionable electronic filing practices and improper\nconsolidation of case"}
{"id": "f8e8759bc43b20de098dc661d4e104c72e872ef1", "vector_id": 117, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 117, "char_len": 2000, "text": "hrough false\nallegations and procedural maneuvering. From the false claims of family violence and\nfinancial indigency to the questionable electronic filing practices and improper\nconsolidation of cases, the proceedings have been marked by deviations from proper\nlegal procedure that have had profound consequences for Charles and his children.\nMost troubling is the court's apparent willingness to issue life-altering orders without\nproper evidentiary hearings, to characterize orders as \"agreed\" when no such\nagreement existed, and to deny Charles the opportunity to present evidence\ncontradicting Morgan's claims. These actions not only violate specific statutory\nrequirements, such as Texas Family Code Section 6.405(b), but also undermine the\nfundamental principles of due process and fairness that are the cornerstone of our legal\nsystem.\nDespite Charles's diligent efforts to seek relief through proper legal channels—filing\nappropriate motions, petitioning for writs of mandamus, and even attempting to invoke\nfederal jurisdiction—he has been repeatedly denied meaningful review of his claims.\nThis case thus raises important questions not only about the specific injustices suffered\nby Charles but also about the effectiveness of appellate review in family law cases,\nparticularly for self-represented litigants.2. \n3. \n4. \n5.\n\nIn light of these considerations, we respectfully request that the higher court:\nReview the procedural history of this case and address the violations of Texas\nFamily Code Section 6.405(b) and other statutory requirements.\nExamine the due process violations that have occurred throughout the\nproceedings, particularly the issuance of orders without proper evidentiary\nhearings.\nAddress the questions regarding attorney authority and electronic filing practices\nraised by Charles's Rule 12 motion.\nConsider the jurisdictional issues and improper consolidation of cases that have\nprevented Charles from obtaining meaningful review of his claims.\nEvaluate whether the"}
{"id": "3d16e1e6bce635b2ad19463a1f54aba830567c43", "vector_id": 118, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_08_25_first_amended_motion_to_recuse_1\\04_08_25_first_amended_motion_to_recuse_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.08.25 - FIRST AMENDED MOTION TO RECUSE-1.pdf", "source_exists": true, "page": null, "chunk_index": 118, "char_len": 1315, "text": "sed by Charles's Rule 12 motion.\nConsider the jurisdictional issues and improper consolidation of cases that have\nprevented Charles from obtaining meaningful review of his claims.\nEvaluate whether the best interests of the children have been properly considered\nin the court's decisions, particularly in light of Charles's role as an active, involved\nfather.\nProvide appropriate relief to correct the injustices that have occurred, including\nbut not limited to:\nVacating orders issued without proper evidentiary foundation\nRequiring proper hearings on the allegations of family violence\nAddressing the false statements made in court filings\nEnsuring that Charles has meaningful access to his children and the ability to\nmaintain his business\nIntervention by a higher court is not only justified but necessary to prevent a continuing\nmiscarriage of justice and to affirm the principle that procedural safeguards are not\nmere formalities but essential protections for the rights of all parties in our legal system.\nCharles Myers's case presents an opportunity to address not only his specific situation\nbut also broader systemic issues that affect the integrity and fairness of family court\nproceedings for all litigants.\nRespectfully submitted,\n[Signature]\nDate: April 26, 20251. \n2. \n3. \n4. \n5. \n6. \n7. \n8. \n9. \n10."}