{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.35 - PRE-OBJ. TO CONSOL-1.pdf",
  "base_name": "03_31_35_pre_obj_to_consol_1",
  "page_count": 25,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n  NO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY, TEXAS \n \n \nTO \nTHE HONORABLE JUDGE OF THIS COURT:  \nCharles Dustin Myers (“Respondent”), acting pro se , files this Objection to the \nattempted consolidation of the newly filed Suit Affecting Parent-Child Relationship \n(SAPCR) (Cause No. 233-765358-25) with the above-numbered case, and moves for declaratory relief regarding the existing orders and for dismissal of the dormant divorce action for want of prosecution. In support, Respondent shows the Court the following unopposed facts and demonstrates that consolidation would perpetuate procedural abuses, violate the children’s best interests, and deny due process. Respondent further provides legal authority under the Texas Rules of Civil Procedure, Texas Family Code, and controlling case law  to support the relief requested. The detriment to the children that has \nbeen ongoing cannot continue to be disregarded simply because the Respondent is pro- se. \nThe following facts support this claim: ITMOMO  \n(AITIO M.E.M., C.R.M., two children) \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS , RESPONDENT’S PRE -OBJECTION TO \nCONSOLIDATION  \n  \nRespondent.   \n  \n2025 -03-31",
      "char_length": 1227
    },
    {
      "page_number": 2,
      "text": "2 \n I. STATEMENT OF FACTS  \nA. Ongoing Harm to the Children   \n1. The two children of the parties are suffering ongoing and severe harm due to \nPetitioner’s actions. They are being subjected to psychological manipulation and \nmedical neglect  by Petitioner, Morgan Michelle Myers, resulting in deteriorating mental \nhealth and emotional wellbeing. For instance, the children are being gaslighted by \nPetitioner into the false belief that the divorce case has already been finalized, causing confusion and distress. These allegations – including psychological harm, medical neglect, emotional alienation, and academic decline  – are well -documented in exhibits \npreviously provided to Petitioner’s counsel. To date, neither Petitioner nor her counsel has refu ted or even responded to these serious charges of ongoing harm to the children. \n  \n B.Children Left in Unsafe Conditions\n2.Petitioner has repeatedly left the young children home alone at night without  \nany adult supervision. This creates an obvious and unacceptable safety risk. Respondent has raised this issue, yet Petitioner and her counsel have offered no denial or explanation. At present, the children have been removed from Respondent’s daily care and placed with their elderly great -grandparents. This abrupt change in living situation occurred after \nRespondent – their father – was unlawfully locked out  of the family home on March 6, \n2024. Since that date, Respondent has been prevented from accessing his home and caring for the children, disrupting the only stable parenting they have known. \nC.\n Unlawful Lockout and Resulting Damages",
      "char_length": 1613
    },
    {
      "page_number": 3,
      "text": "3 \n 3. Respondent’s exclusion from the home and the children’s lives was done under \ncolor of “current orders” that Petitioner obtained in the divorce action. Those orders were \nprocured through facially inconsistent and procedurally improper pleadings , as \ndetailed further below. Petitioner’s unilateral actions have caused Respondent significant harm: he has suffered approximately $110,500 in verifiable financial damages  due to \nthe unlawful lockout, loss of use of the residence, and the interruption of his parent -child \nrelationship. This damage continues to accrue as the Respondent remains barred from his home and from normal contact with the children. Opposing counsel and Petitioner have \nbeen provided financial records and business earnings showing these damages, yet have provided no response or acknowledgement of these damages.  \nD. Facially Void and Inconsistent Orders  \n4. The “current orders” governing possession of the children were obtained by \nPetitioner through pleadings and procedures that are facially inconsistent and legally inadequate. On their face, the orders claim consent of all parties yet only bear the signatures of the Petitioner and her Counsel. These orders were entered despite clear consent being absent, which in effect  has dismantled the prior status quo  for the \nchildren under the guise of these questionable orders, even though Respondent contends – and w ill demonstrate – that these orders have no valid legal effect . Neither Petitioner \nnor her counsel has offered any substantive response or justification for the inconsistencies surrounding the creation of these orders, effectively conceding the issue by silence.  \nE. Children’s Best Interests Thwarted",
      "char_length": 1715
    },
    {
      "page_number": 4,
      "text": "4 \n 5. Since obtaining these dubious orders, Petitioner has actively alienated the \nchildren from Respondent  and deprived them of the stable, loving care he consistently \nprovided since birth. The eldest child’s academic performance has plummeted, and both \nchildren are emotionally estranged from both parents – a direct result of Petitioner’s interference with Res pondent’s access and her neglect of the children’s emotional needs. \nPetitioner ’s actions have upended the children’s best interests , which under Texas la w \nshould be the paramount consideration in any proceeding involving minors. Respondent has fought tirelessly for over a year to restore stability and to protect the children, but \nthose efforts have been stymied by procedural delays and Petitioner’s lack of cooperation. \nF. Procedural History and Counsel’s Inactivity  \n6. The underlying divorce case has languished without prosecution for over a \nyear. Petitioner’s attorney of record, Cooper L. Carter , effectively abandoned the case \nafter April 24, 2024. On that date, Ms. Carter filed a Motion for Pre -Trial Conference – \nthe last  action she took in this matter until very recently. In the eleven months  following \nthat filing, Ms. Carter filed no pleadings, made no court appearances, and utterly failed to \nadvance the case toward trial or resolution. During this period of dormancy, Respondent (pro se) repeatedly sought relief to address the children’s situation, yet Ms. Carter never filed a single objection, response, or argument  to counter Respondent’s motions  or \nrequests for relief . Serious and well -documented allegations – including child \nendangerment and de facto custody interference – went completely unanswered by \nPetitioner and her counsel for over a year.  \nG. Failure to Engage in Discovery – Deemed Admissions",
      "char_length": 1822
    },
    {
      "page_number": 5,
      "text": "5 \n 7. During the divorce litigation, Respondent properly served Petitioner with \nwritten discovery, including Requests for Admissions under Texas Rule of Civil \nProcedure 198. Petitioner’s counsel failed to respond or object to these Requests for Admissions within the time required by law , resulting in those matters being deemed \nadmitted by operation of law . Thus, critical facts are conclusively established against \nPetitioner – for example, facts regarding the children’s neglect and the lack of a final divorce decree may have been admitted , converting marital assets, and fabricating family \nviolence  – further prejudicing Petitioner’s position. Despite the grave effect of these \ndeemed admissions (which have been pointed out to Ms. Carter), she made no effort to withdraw or amend them and filed no responses whatsoever, effectively conceding their truth . \nH. Rule 11 and Rule 237a Violations  \n8. Throughout the litigation, there has been no valid Rule 11 agreement filed that \nwould excuse Petitioner’s obligations or justify the prolonged inaction. Any suggestion of an agreed status quo or private arrangement is refuted by the absence of a signed writing or on- record agreement (as required by Tex. R. Civ. P. 11). Moreover, Respondent \nremoved the case to federal court to seek protection of his rights. The case was later remanded to this Court, but Petitioner’s counsel failed to comply with Tex. R. C iv. P. \n237a upon remand. Specifically, counsel did not file the required certified copy of the federal remand order with the clerk and did not provide Respondent with the mandatory written notice of the remand . Ms. Carter’s neglect of this basic procedural duty prevents  \nthe case from moving forward to a final trial setting and further exemplifies her lack of diligence.",
      "char_length": 1803
    },
    {
      "page_number": 6,
      "text": "6 \n I. Challenge to Counsel’s Authority (Rule 12)  \n9. Given Ms. Carter’s persistent non- communication and inaction, and that all \npleadings filed in this matter have been on her behalf by a non- party,  Respondent file d a \nmotion under Tex. R. Civ. P. 12 challenging whether Ms. Carter truly has authority to \nrepresent Petitioner  and clear up the ambiguity surrounding her representation. Ms. \nCarter has not meaningfully corresponded with Respondent at all during the litigation – she is unreachable by phone or email , is not properly registered for e -filing \nnotifications on the re:SearchTX platform, and even lacks a current working phone \nnumber or email on file with the State Bar of Texas . Such a complete breakdown in \nparticipa tion raises the question of whether Petitioner has been informed or is even aware \nof the current status of the case given the children are being told the divorce is finalized. Respondent’s Rule 12 motion puts Ms. Carter to the burden of proving her authority to act; tellingly, in the 14 months of litigation Ms. Carter has yet to produce any client authority or engagement , and she ignored the Rule 12 challenge just as she ignored \nevery other filing. Under these circumstances, Respondent asserts Ms. Carter ma y no \nlonger be authorized to represent Petitioner’s interests – if she ever was – and that her \nfilings should be stricken if she cannot promptly show authority as required by law. Respondent is under no obligation to set any matter for hearing because doing so would waive her obligations to fulfill rule 237a of the Texas Rules of Civil Procedure.  \nJ. Sudden Appearance to Block Emergency Relief  \n10. After nearly a full year of silence and inactivity, Ms. Carter abruptly \nresurfaced only when Respondent sought emergency relief for the children in a new proceeding. In March of  2025, Respondent, desperate to address the children’s worsening",
      "char_length": 1910
    },
    {
      "page_number": 7,
      "text": "7 \n situation, filed a new SAPCR in the 233rd District Court  (Cause No. 233 -765358- 25) \nand obtained a hearing setting for an emergency Temporary Restraining Order to protect \nthe children. The very first involvement by Ms. Carter since April 2024 was to appear at the eleventh hour in the 233rd District Court and object to the TRO hearing  \nthrough a phone call without ever responding to the TRO or arguing against it . \nSimultaneously, she filed a Motion to Consolidate the new SAPCR case back into the old 322nd Distr ict Court divorce case – a case that has been dormant and effectively stalled \nunder void orders. In doing so, Ms. Carter offered no substantive rebuttal to any of \nRespondent’s factual allegations (1–9 above). She provided no explanation for her prolonged a bsence or her client’s failures  and inconsistencies , and no justification as to \nhow consolidation would serve the children’s best interests . Her sole aim appears to \nbe procedural: to drag the new child- focused case into the moribund divorce proceeding, \neffectively keeping the children in legal limbo and delaying any real relief. \nK. No Opposition on the Merits  \n11. Over the 14 months of litigation , Petitioner and Ms. Carter have never filed \na single pleading addressing the merits  of Respondent’s claims or the children’s needs. \nThey have not objected to evidence, not answered discovery (beyond the deemed admissions), not responded to motions, and not presented any competing evidence or legal argument. Their pattern is one of total silence on substance, interrupted only by a procedural maneuver to avoid a hearing. This stands in stark contrast to Respondent’s detail ed filings and evidence chronicling the children’s plight. Accordingly, the factual \nallegations enumerated above stand unopposed and uncontroverted in the record of both the 322nd and 233rd District Court matters. The Court “cannot continue to ignore”",
      "char_length": 1926
    },
    {
      "page_number": 8,
      "text": "8 \n these undisputed facts, as they demand urgent action for the sake of the children’s \nwelfare.  \nL. Urgency of Relief  \n12. As repeatedly stated - every day that passes without corrective action is a day \nin which the children remain in an unstable, harmful environment. Respondent has relentlessly pursued lawful avenues to restore the prior stable status quo for the children, only to be met with procedural stonewalling. It would be highly prejudicial  to reward \nPetitioner and her counsel’s negligence and gamesmanship by allowing further delay \nthrough consolidation. Indeed, to do so would blatantly disregard Respondent’s rights  \nand, more importantly, the children’s best interests . The time has come for the Court to \nrecognize that Petitioner’s counsel – despite holding a law license – has forfeited any entitlement to deference through her conduct. Respondent’s self -represented status should \nno longer serve as an excuse to deny or defer relief that the children so desperately need.  \nThese facts provide the factual foundation for Respondent’ s objections and requests for relief. With these unchallenged facts in mind, Respondent now turns to the legal reasons why consolidation must be denied, the prior orders declared void, and the dormant case dismissed, in order to protect due process and the best interests of the children.  \nII. VOIDNESS OF THE CURRENT ORDERS  \n13. The “Current Orders” Were Improperly Obtained and Are V oid for Lack of \nConsent and Inconsistent Pleadings. The orders under which Petitioner has been operating – specifically those used to exclude Respondent from the home and curtail his possession of the children – are fundamentally flawed and void. It appears these orders",
      "char_length": 1725
    },
    {
      "page_number": 9,
      "text": "9 \n were presented to the Court as agreed or uncontested, yet the record reflects that \nRespondent never gave knowing consent to any such final settlement. Under Texas law, any judgment based upon a purported agreement of the parties requires “unequivocal conse nt at the time of rendition”, and if a party withdraws consent before the judgment is \nrendered, the judgment is void. See Burnaman v. Heaton, 240 S.W.2d 288, 291 (Tex. 1951) (holding that when a trial court has knowledge that one party does not consent to a judgment, it is error to render a judgment purportedly by agreement; such a judgment is a nullity) . Likewise, Padilla v. LaFrance , 907 S.W.2d 454 (Tex. 1995) confirms that a trial \ncourt cannot render an agreed judgment after a party has withdrawn consent to a settlement . In short, if one party withheld or withdrew consent, the only method to \nresolve the dispute is a trial on the merits, not entry of an “agreed” order . \n14. Here, the facial inconsistencies in Petitioner’s pleadings and the circumstances \nof how the orders were procured leave no room for logic that he would agree to his children’s and his own detriment. Respondent has actively opposed the terms that locked him out of his home and separated him from the children. Petitioner misrepresented to the Court that an agreement existed  alongside her counsel and it was rendered without \nconsent. S uch an order is void ab initio under the Burnaman and Padilla  line of cases. \nAny decree or order dividing rights or restricting Respondent that was entered without a \nproper hearing or true agreement violates Respondent’s due process rights and cannot stand. Respondent seeks a declaratory judgment from this Court that any orders affecting conservatorship, possession, or property division that were not rendered after a valid hearing or with proper consent are void and of no legal effect . This \ndeclaration is necessary to clarify the parties’ legal position and to remove the cloud of",
      "char_length": 1983
    },
    {
      "page_number": 10,
      "text": "10 \n these improper orders from the case, and immediately restore his right to his residence \npending a hearing on the merits to satisfy the best interests of the children.  \nB. Lack of Judicial Adoption (Tex. Fam. Code § 201.013)  \n15. Even if Petitioner’s claim for consent somehow survives despite the absence \nof Respondent’s signature – they remain facially void  because they were issued by an \nAssociate Judge and never properly adopted or signed by the referring District Court. Under Texas Family Code § 201.013(b), if no timely request for a de novo hearing is filed after an associate judge’s proposed order, that proposed order “becomes the order of the referring court only on the referring court’s signing”  the order. In this case, \nthere is no record that the 322nd District Court Judge ever signed or entered a final order \nadopting the Associate Judge’s recommendations regarding custody or property. If the District Judge did not  sign an order, then no final order exists – the associate judge’s \nruling, while perhaps enforceable interim , never achieved the status of a final judgment \nof the court and has no legal effect.  \n16. This may explain why the Texas OAG attempted to intervene in June of 2024 \nand has since disappeared from pursuing relief. \n17. Therefore, t hey should be declared void or vacated due to the lack of proper \nadoption, lack of findings, and for the continuous and irreparable harm they continue to inflict on the children and Respondent. \n  \n C.No “Final Order” Rendered – N o CEJ in the 322nd C ourt\n18.Critically, because o f the above defects, no final order has ever been  \nrendered in the divorce case concerning the parent-child relationship (or the divorce",
      "char_length": 1713
    },
    {
      "page_number": 11,
      "text": "11 \n itself). Texas Family Code §  155.001(a) provides that a court acquires continuing, \nexclusive jurisdiction  (CEJ) over child matters “on the rendition of a final order” in a \nsuit affecting the parent -child relationship . Conversely, § 155.001(d) states: “Unless a \nfinal order has been rendered by a court of continuing, exclusive jurisdiction, a \nsubsequent suit shall be commenced as an original proceeding.”  \n19. In this case, the 322nd District Court never rendered a final order resolving \nthe SAPCR or divorce – the orders in place are interlocutory and void. Therefore, the 322nd never acquired continuing, exclusive jurisdiction over the children, and the new SAPCR  Respondent filed in 2025 was properly “commenced as an original \nproceeding”  under § 155.001(d) . This point cannot be overstated: there is currently no \nvalid final judgment in the divorce case . The divorce remains unadjudicated and the \nparent -child iss ues remain unresolved by any final decree. Petitioner’s counsel’s \ninsistence that the new SAPCR must be consolidated into the divorce case (as if that court had dominant jurisdiction) misstates the law. Because no final order exists, the 233rd District Court is not barred from proceeding with the SAPCR. In fact, the Family Code explicitly allows a new original suit in these circumstances .  \n20. Respondent ha d every right to file a new petition to protect his children when \nit became clear the old case was mired in procedural limbo. Accordingly, this Court should declare that the prior orders have no legal effect and confirm that the 322nd District Court lacks continuing jurisdiction  due to the absence of any final order. This \ndeclaratory relief will clarify that the new SAPCR case may proceed on its own merits, unencumbered by the baggage of the defunct divorce proceeding that remain a one- sided \ncase with no ability to reach final trial, as explained above.",
      "char_length": 1921
    },
    {
      "page_number": 12,
      "text": "12 \n III. OBJECTION TO CONSOLIDATION  \n21. Respondent unequivocally objects to the consolidation of the new child \ncustody case (SAPCR) with the dormant divorce case and asks this Court to deny any \nsuch motion to consolidate. Consolidation at this juncture would be illogical, prejudicial, and contra ry to Texas law and equity. The following legal grounds support sustaining \nRespondent’s objection:  \nA. The First -Filed Divorce Case Does Not Have “Dominant Jurisdiction”  \n22. Generally, when two suits involving the same subject matter are pending in \ndifferent courts of equal jurisdiction, the court in which the suit was first filed has dominant jurisdiction and the latter  is typically abated. See Wyatt v. Shaw Plumbing Co., \n760 S.W.2d 245, 247 (Tex. 1988) (citing Cleveland v. Ward, 116 Tex. 1, 285 S.W. 1063 (1926)). However, Texas law recognizes critical exceptions to the “first -filed” rule. The \nTexas Supreme Court in Wyatt  reiterated three well -established exceptions: “(1) conduct \nby a party that estops him from asserting prior active jurisdiction; (2) lack of persons to \nbe joined if feasible; and (3) lack of intent to prosecute the first lawsuit.”  (quoting V .D. \nAnderson Co. v. Young, 101 S.W.2d 798 (Tex. 1937); Curtis v. Gibbs , 511 S.W.2d 263 \n(Tex. 1974)). If any of these exceptio ns apply, the court with the first filing does not  have \ndominant jurisdiction, and the second court may proceed. Wyatt , 760 S.W.2d at 248. \n23. Here, at least two  of the exceptions squarely apply, both flowing from \nPetitioner’s and Ms. Carter’s conduct in the divorce case . \nB. Estoppel by Conduct",
      "char_length": 1621
    },
    {
      "page_number": 13,
      "text": "13 \n 24. Petitioner’s actions (through her counsel) should estop  her from claiming the \nbenefit of the first -filed divorce case. She allowed that case to become completely \ndormant and failed to notify the Court or Respondent of the case’s status after the federal \nremand. By failing to comply with Rule 237a’s notice requirements  and effectively \nconcealing the revival of the state case from proceeding on the merits, consolidation is inappropriate without some form of input from the opposing side. \n25. Petitioner’s counsel also did nothing to set hearings or trial, effectively \nrepresenting that she had abandoned the case. Petitioner cannot now, at the last minute, resurrect that case to block a new one – equity and fair play will not permit a party to \nsleep on her rights and then use the prior filing as a weapon. Petitioner’s conduct is \nprecisely the kind that warrants estoppel from asserting dominant jurisdiction. \nC. Lack of Intent to Prosecute the First Suit  \n 26. Perhaps the most glaring exception is the third exception . Petitioner \ndemonstrated a “lack of intent to prosecute the first lawsuit.”  Young, 128 Tex. at 636- 37, \n101 S.W.2d at 800- 01; see also Curtis , 511 S.W.2d at 267. For nearly a year, she took no \naction to advance the divorce. No discovery, no responses, no settings – nothing. Such \nextended inaction is tantamount to an intention not to pursue the case at all. Texas courts have found that when a first -filing party show s no real intent to prosecute their case, a \nsecond case can proceed notwithstanding the first -filed rule. See, e.g., Wyatt , 760 S.W.2d \nat 248 (recognizing lack of intent to prosecute as an exception) . \n 27. In the present situation, Petitioner only “revived” the divorce case as a \nstrategic ploy to derail Respondent’s emergency action in the second case. This",
      "char_length": 1841
    },
    {
      "page_number": 14,
      "text": "14 \n opportunistic and belated move underscores that Petitioner’s interest lies not in diligently \nprosecuting her first suit, but in obstructing Respondent’s efforts elsewhere. The first case was effectively dead on the docket; there was no genuine intent to prosecute it  until \nRespondent’s new filing prompted a defensive response. This swift action was done \nsolely to avoid accountability from the court that the Respondent has diligently exposed without argument. \n 28. Because of these exceptions, the 322nd District Court cannot be said to have \ndominant jurisdiction. Petitioner forfeited any priority through her own lack of diligence. \nTherefore, there is no legal basis to consolidate  the new case into the old one; the usual \npolicy of avoiding conflicting jurisdictions must yield to the reality that the first case was \nmoribund and is rife with procedural defects. Indeed, the 233rd District Court (new SAPCR) is the appropriate forum to hear the current disputes because that case was initiated specifically to address the children’s urgent needs, free from the entanglements of the stalled divorce.  \n 29. The only counter argument anticipated by the opposition is that the fingers \nwill point towards the undersigned, which is nothing more than an excuse for failure to participate in Respondent’s quest seeking relief at every available opportunity to advocate for his children. Surely a licensed attorney could put forth a legal argument against an unruly pro- se litigant – yet here – there exists only silence.  \nD. Consolidation Would Reward Procedural Abuse  \n30. Even apart from dominant jurisdiction principles, this Court has discretion to \ndeny consolidation when it would prejudice a party or not further the interests of justice.",
      "char_length": 1762
    },
    {
      "page_number": 15,
      "text": "15 \n Tex. R. Civ. P. 174(a) permits consolidation of actions involving common questions of \nlaw or fact, but only “to avoid unnecessary costs or delay.” Here, consolidation would do the opposite – it would inflict further delay and costs and gravely prejudice the children’s welfare. The new SAPCR was filed to obtain immediate relief (such as restraining orders or modified custody) to protect the children. That relief has already been delayed by Petitioner’s maneuver; consolidating into the divorce would likely ca use weeks or \nmonths of additional delay as the tangle of the divorce procedure is sorted out (especially if the Court must resolve questions about void orders, jurisdiction, or counsel’s status in that case).  \n31. The best interests of the children  is the “primary consideration” in any \nproceeding affecting them. Tex. Fam. Code § 153.002. It is patently not  in the children’s \nbest interest to postpone substantive relief on issues of their safety and wellbeing so that an old divorce action can be resurrected. The children should not be made to suffer further harm just because Petitioner’s counsel neglected her  duties for a year. \nConsolidation would effectively reward Petitioner for her neglect  – she would succeed \nin further delaying a reckoning on her harmful conduct, all while the children remain in a \ndetrimental situation. Such an outcome would be unjust.  \nIV . PETITIONER’S COUNSEL’S MISCONDUCT  \n 32. The Court should also take notice of the conduct of Petitioner’s counsel, \nCooper L. Carter, which has significantly contributed to the procedural morass and denial of due process in this matter. Ms. Carter’s behavior not only prejudices Respondent but also violates basic professional obligations . Respondent highlights the following and \nrequests appropriate relief:",
      "char_length": 1814
    },
    {
      "page_number": 16,
      "text": "16 \n A. Failure to Respond and Show Authority (Tex. R. Civ. P. 12)  \n33. As described, Respondent has challenged Ms. Carter’s authority to act on \nPetitioner’s behalf by motion under Rule 12 in September of 2024. To date, Ms. Carter \nhas not responded to this challenge. Texas Rule of Civil Procedure 12 requires an attorney, upon such a motion, to prove her authority to act for the client or else be barred from further participation. When an attorney fails to appea r or fails to carry this burden, \nthe court “shall” strike the attorney’s pleadings and bar her from representing the client in that case. In TransAmerica Corp. v. Braes Woods Condo Ass’n, for example, a verified motion to show authority was granted when a question arose about a corporation’s \ncapacity; the trial court dismissed the attorney and struck the pleadings filed without \nproper authority.  \n34. Here, Ms. Carter’s complete absence and unavailability strongly suggest she \nmay not have her client’s authorization or active direction. It is even conceivable that \nPetitioner herself has not been kept apprised by Ms. Carter, given the lack of communicatio n. Respondent requests that the Court require Ms. Carter to promptly \nprove her authority. If she fails, the Court should strike any consolidation motion or other pleadings she filed and preclude her from further advocacy in this matter. The practical effect would render Petitioner unrepresented – a status Petitioner is effectively in already, due to Ms. Carter’s dereliction. While Respondent takes no pleasure in Petitioner potentially losing counsel, the integrity of the proceedings demands that only duly authorized representatives be allowed to act.  \nB. Violations of Discovery Obligations (Tex. R. Civ. P. 193, 198)",
      "char_length": 1761
    },
    {
      "page_number": 17,
      "text": "17 \n 35. Ms. Carter’s neglect of discovery – particularly her failure to answer Requests \nfor Admissions – has materially harmed the truth -finding process. By operation of Rule \n198, Petitioner is deemed to have admitted every fact in the Request for Admissions that \nwas unanswered. These deemed admissions are dispositive of key issues. Ms. Carter’s failure to perform the most basic task of responding to discovery is a violation of her duties under Tex. R. Civ. P. 193.2 and 193.5 (to timely amend or respond) and ha s \nprejudiced her own client’s case. In fact, her inaction practically concedes Respondent’s claims and allegations. The Court should treat the deemed admissions as conclusively established in considering this Objection and the underlying merits – meaning t hat, for \npurposes of this objection, Petitioner has admitted the truth of the allegations in Section I , \nand can be admitted as summary judgement evidence, which remains un- opposed and sits \nas the oldest filed motion on this court’s docket. (Filed and Serve d February 22, 2024). \nFurthermore, the Court should impose sanctions under Tex. R. Civ. P. 215 for the discovery abuse, although Respondent’s primary goal is not monetary sanctions but to ensure the facts are recognized as admitted due to Ms. Carter’s failure.  \nC. Abuse of Process  \n36. Ms. Carter’s sudden filing of a Motion to Consolidate after a year of \ndormancy appears to be a textbook example of using legal process for delay and to burden an opponent, rather than for a legitimate purpose. Rule 13 of the Texas Rules of Civil Proced ure forbids filings that are groundless and brought in bad faith or to harass. \nLikewise, Rule 3.02 of the Texas Disciplinary Rules of Professional Conduct states that a lawyer “shall not take a position that unreasonably increases the costs or other burdens of the case or that unreasonably delays resolution of the matter.” By her own inaction, Ms.",
      "char_length": 1936
    },
    {
      "page_number": 18,
      "text": "18 \n Carter allowed an emergency to develop; by reappearing only to procedurally thwart \nRespondent’s TRO in the 233rd, she acted to unreasonably delay the adjudication of the emergency.  \n37. There was no substantive justification given for consolidation – no claim that \nresources would be saved or justice served – only a tactic to avoid an immediate hearing. This conduct comes perilously close to violating Rule 13’s prohibitions on bad- faith \npleadings and warrants the Court’s scrutiny. Respondent respectfully submits that the \nCourt should consider sanctioning Petitioner’s counsel  for this behavior, which has had \nthe effect of prolonging the children’s exposure to harm and multiplying litigat ion for no \ngood reason. Sanctions could include an award of fees and expenses to Respondent \n(though pro se, Respondent has expended considerable time and resources), or fines payable to the Court, or any order deemed just to deter such tactics. At the very least, the lack of any substantive merit in the consolidation request should prompt the Court to deny it summarily.  \n38. In fact, the consolidation motion will likely resemble something similar to \nExhibit 1, the only attached exhibit in this document, as all claims and exhibits supporting these allegations have been in the possession of the opposing party for several months without any objection, communication, or argument against them. The exhibit resembles a cookie -cutter motion that provides no substance into the core issues of the case.  \n39. Lastly, Respondent notes that because Petitioner’s counsel has not filed any \nsubstantive answer or response  to the merits of Respondent’s claims in over a year, the \nCourt is effectively presented with a one -sided record of harm to the children. If \nconsolidation is denied and the divorce case is dismissed or left idle, the Court overseeing",
      "char_length": 1868
    },
    {
      "page_number": 19,
      "text": "19 \n the SAPCR (whether this Court or the 233rd) should move with urgency to address \ncustody and safety. Respondent urges that any procedural disputes be resolved forthwith so that the focus can return to the children. Or better yet, end this nightmare immediately by declaring the current orders void, which resolves the entire suit in favor of the children, and causes no harm to the Petitioner.  \n40. Petitioner, having failed to rebut any allegations, should not be permitted \nfurther delay. This Court has the power to prevent further injustice and harm by swiftly granting the un- opposed relief sought by the Respondent which should have been granted \non March 28, 2025. Every additional day of inaction is a day of potential damage to the \nchildren’s psyche and development. Respondent respectfully asks the Court to remember \nthat the paramount concern is the children’s best interests and their right to a s afe, stable \nhome – a right which has been denied to them for too long during these procedural \nwranglings. \nV . PRAYER FOR RELIEF  \nWHEREFORE, PREMISES CONSIDERED,  Respondent Charles Dustin \nMyers  prays that the Court grant the following relief for the reasons set forth above:  \ni. Deny Petitioner’s Motion to Consolidate the new SAPCR case (No. 233-765358- 25) with the instant divorce case. Instead, allow the SAPCR to \nproceed separately in the interest of justice and the children’s welfare, or in the alternative, abate the SAPCR only until such time as this Court disposes of the divorce case (as requested below).",
      "char_length": 1543
    },
    {
      "page_number": 20,
      "text": "20 \n ii. Enter a declaratory judgment that any orders entered in this divorce action \nthat purported to resolve conservatorship, possession, or property issues are void and/or of no legal effect  due to lack of proper consent, notice, or \nfinal adoption by the Court. Specifically, declare that no final order was rendered in this cause, that the March 14, 2024 “ agreed orders” which \nclaim consent despite missing signatures  do not constitute a final \nadjudication, and that they cannot be enforced as a final judgment. \niii. Dismiss the divorce action (Cause No. 322- 744263- 23) in its entirety for \nwant of prosecution pursuant to Tex. R. Civ. P. 165a and the Court’s inherent authority.  \niv. Although a serious step, the Respondent prays that the Court consider referring Ms. Carter’s conduct to the appropriate disciplinary committee  of the State Bar of Texas for investigation. The Court’s \nfindings of fact or a simple referral letter could highlight the issues: prolonged neglect, failure to follow court rules (Rule 237a, etc.), failure to maintain current contact information, and usage of a dormant case to obstruct justice. Such a referral may be warranted to protect the integrity of the legal pr ocess, especially in sensitive family law matters , or in the \nalternative, require a response to this objection. \nv. Grant such other and further relief as the Court finds just and proper, whether at law or in equity. Respondent also asks that the Court take judicial notice  of the contents of the court’s file in this cause and (if",
      "char_length": 1549
    },
    {
      "page_number": 21,
      "text": "21 \n applicable) the new SAPCR cause, to the extent needed to corroborate the \nclaims herein.  \nRespectfully submitted,  \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE \n \n       \nCERTIFICATE OF SERVICE  \n \nRespondent, CHARLES DUSTIN MYERS, certifies that, pursuant to Rule 21a of the \nTexas Rules of Civil Procedure that: \n \nA copy of this objection has been served to MORGAN MICHELLE MYERS through her \nEFM registered under MORGANMW02@GMAIL.COM  \n \nA copy of this objection has been provided to COOPER L. CARTER through her email \nCOOPERCARTER@MAJADMIN.COM  \n \nA copy of this  obje ction has been served to HOLLY HAYES through her EFM \nregistered email address: C SD-FILER 914@TEXAS.OAG.GOV  \n  \n \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE",
      "char_length": 868
    },
    {
      "page_number": 22,
      "text": "EXHIBIT 1",
      "char_length": 9
    },
    {
      "page_number": 23,
      "text": "NO. 233-765358 -25 \n \nIN THE INTEREST OF  § IN THE DISTRICT COURT  \n §  \nMARA MYERS AND CAROLINE \nMYERS,  § 233RD JUDICIAL DISTRICT  \n §  \nCHILDREN  § TARRANT COUNTY, TEXAS  \n \nNO. 322-744263 -23 \n \nIN THE MATTER OF  \nTHE MARRIAGE  OF \n \nMORGAN MYERS  \nAND  \nCHARLES MYERS  \n \nAND IN THE INTEREST OF  \nMARA MYERS AND  \nCAROLINE MYERS  \n § IN THE DISTRICT COURT  \n§  \n§  \n§ 322ND JUDICIAL DISTRICT  \n§  \n§ \n§ \n§ \n§  \n \n \nTARRANT COUNTY, TEXAS  \n \n \nMOTION TO CONSOLIDATE \n \nThis Motion to Consolidate the above lawsuits is brought by MORGAN MYERS, who \nshows in support: \n1. These lawsuits involve common questions of law or of fact as the parties have a \ncurrent divorce case pending in the 322nd Judicial District Court, Cause No. 322 -744263-23.  \n2. It would serve the convenience of the Court, litigants, and counsel and would \navoid multiplicity of suits, duplication of testimony, and unnecessary expense and delay to have \nthese lawsuits consolidated for trial. \nMORGAN MYERS prays that the Court grant the Motion to Consolidate and consolidate \nthese lawsuits under the older and lower cause number. \nRespectfully submitted, 233-765358-25 FILED\nTARRANT COUNTY\n3/20/2025 8:38 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1217
    },
    {
      "page_number": 24,
      "text": "MARX ALTMAN & JOHNSON  \n2905 Lackland Rd.  \nFT. WORTH, Texas 76116  \nTel: (817) 926 -6211  \nFax:   (817) 926 -6188  \n \n \n \nBy: /s/ Cooper L . Carter   \nCooper L. Carter  \nState Bar No. 24121530  \ncoopercarter@majadmin.com  \nAttor ney for MORGAN MYERS  \n \n \n \n \nCertificate of Service  \n \n I certify that a true copy of this Motion to Consolidate was served in accordance with rule \n21a of the Texas Rules of Civil Procedure on the following on March 20, 2025:  \n CHARLES MYERS by electronic filing manager.  \n \n \n /s/ Cooper L. Carter   \nCooper L. Carter  \nAttorney for MORGAN MYERS",
      "char_length": 582
    },
    {
      "page_number": 25,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nRoderick Marx on behalf of Cooper Carter\nBar No. 24121530\nMAJFIRM@YAHOO.COM\nEnvelope ID: 98671723\nFiling Code Description: Motion (No Fee)\nFiling Description: MOTION TO CONSOLIDATE\nStatus as of 3/20/2025 4:52 PM CST\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n3/20/2025 8:38:49 AMStatus\nSENT\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERSBarNumber Email\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/20/2025 8:38:49 AMStatus\nSENT\nCase Contacts\nName\nMORGAN MICHELLEMYERS\nCHARLES DMYERSBarNumber Email\nMORGANMW02@GMAIL.COM\nCHUCKDUSTIN12@GMAIL.COMTimestampSubmitted\n3/20/2025 8:38:49 AM\n3/20/2025 8:38:49 AMStatus\nSENT\nSENT",
      "char_length": 1090
    }
  ]
}