{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\REGIONAL JUDGE\\09.26.25 - ORDER SUMMARILY DENYING MUNFORD-1.pdf",
  "base_name": "09_26_25_order_summarily_denying_munford_1",
  "page_count": 3,
  "pages": [
    {
      "page_number": 1,
      "text": "IN THE MATTER OF \nTHE MARRIAGE OF \nMORGAN MICHELLE MYERS \nAND \nCHARLES DUSTIN MYERS \nAND IN THE INTEREST OF \nMARA MYERS AND CAUSE NO. 322-744263-23 \nCAROLINE MYERS, CHILDREN § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ IN THE DISTRICT COURT \n322ND JUDICIAL DISTRICT \nTARRANT COUNTY, TEXAS \nORDER SUMMARILY DENYING MOTION TO RECUSE \nAND \nORDER DIRECTING THE CASE TO PROCEED TO TRIAL PURSUANT TO \nTEX. CIV. PRAC. & REM. CODE § 30.016 \nAND \nORDER RE MANDATORY SANCTIONS FOR THE FILING OF \nTERTIARY RECUSAL MOTION \nBefore me is a pleading entitled Motion to Recuse Judge Munford filed by Charles Dustin \nMyers. This motion was referred to me after Judge James Munford declined to recuse himself \nby order dated September 9, 2025. \nMr. Myers has filed three or more motions to recuse and/or disqualify judges in this case. \nWhen a party files his third motion to recuse in a case, the judge(s) must move the case to final \ndisposition as though a tertiary recusal motion had not been filed. Tex. Civ. Prac. & Rem. Code \n§ 30.016 (b) (3); Gonzalez v. Guilbot, 315 S.W.3d 533 (Tex. 2010). That is, once a tertiary \nmotion to recuse is filed, the judges assigned to the case are required to proceed and cannot delay \nthe case because of the filing of a motion to recuse. \nFurther, sanctions are mandatory if a tertiary recusal motion is denied. Tex. Civ. Prac. & \nRem. Code§ 30.016 (c), which provides as follows: \nA judge hearing a tertiary recusal motion against another judge who denies the motion \nshall award reasonable and necessary attorney's fees and costs to the party opposing the motion. \nThe party making the motion and the attorney for the party are jointly and severally liable for \nthe award of fees and costs. The fees and costs must be paid before the 31st day after the date the \norder denying the tertiary recusal motion is rendered, unless the order is properly superseded. 322-744263-23 FILED\nTARRANT COUNTY\n9/26/2025 2:44 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1954
    },
    {
      "page_number": 2,
      "text": "I have reviewed the motion as to Judge Munford and the motion fails to meet the \nrequirements of Texas Rules of Civil Procedure 18a(a) because it does not state with detail and \nparticularity admissible facts that would justify recusal or disqualification if proven. Tex. R. Civ. \nP. 18a(a)(4). \nIT IS THEREFORE ORDERED THAT: \n1. The motion to recuse is denied as to Judge Munford without hearing Tex. R. Civ. \nP l 8a(g)(3)(A), (i). \n2. All judges in this case will comply with Tex. Civ. Prac. & Rem. Code § 30.016 \n(b) (3) requiring judges to move the case to final disposition as though a tertiary \nrecusal motion had not been filed. \n3. The issue of the mandatory sanctions required by Tex. Civ. Prac. & Rem. Code§ \n30.016 (c) will be handled as follows: \na. The parties entitled to sanctions will file on or before October 3, 2025, a \nmotion for sanctions with exhibits showing reasonable and necessary \nattorney's fees and cost attached to the motion. \nb. Mr. Myers will file his response to the sanctions by October 10, 2025. \nc. The motion for sanctions will be taken up on written submission on \nOctober 17, 2025. \n4. This order only addresses the motion to recuse Judge Munford and the issues \nraised by the tertiary recusal motion. \nSigned this the :J.:ft/f. day of September, 2025. \n~ \nDAVID L. EV ANS, PRESIDING JUDGE \nEIGHTH ADMINISTRATIVE JUDICIAL REGION OF TEXAS",
      "char_length": 1377
    },
    {
      "page_number": 3,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 106141441\nFiling Code Description: No Fee Documents\nFiling Description:\nStatus as of 9/26/2025 4:22 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n9/26/2025 2:44:52 PM\n9/26/2025 2:44:52 PM\n9/26/2025 2:44:52 PM\n9/26/2025 2:44:52 PMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 833
    }
  ]
}