{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\REGIONAL JUDGE\\05.06.24 - ORDER OF ASSIGNMENT-1.pdf",
  "base_name": "05_06_24_order_of_assignment_1",
  "page_count": 1,
  "ocr": {
    "dpi": 300,
    "lang": "eng",
    "created_at": "2025-12-26 01:56:06"
  },
  "pages": [
    {
      "page_number": 1,
      "text": "THE STATE OF TEXAS\n8 ADMINISTRATIVE JUDICIAL REGION\n\nORDER OF ASSIGNMENT BY THE PRESIDING JUDGE\n\nPursuant to Rule 18a, Texas Rules of Civil Procedure and Section 74.056, Texas Government\nCode, the undersigned Presiding Judge assigns the Honorable John H. Cayce, Senior Chief Justice,\nSecond Court of Appeals, to the\n\n322®” DISTRICT COURT, TARRANT COUNTY, TEXAS.\n\nThe judge is assigned to preside in the Motion to Recuse the Honorable James Munford and\nthe Honorable Jeffrey Kaitcer filed by Charles Dustin Myers on April 25, 2025 and the First\nAmended Motion to Recuse the Honorable James Munford and the Honorable Jeffrey Kaitcer filed\non April 28, 2025 in Cause Number 322-744263-23, styled In the Matter of the Marriage of Morgan\nMichelle Myers and Charles Dustin Myers and In the Interest of Mara Myers and Caroline Myers,\nMinor Children, to rule on all pending motions, supplemental, amended and or subsequent motions\nto recuse and/or disqualify Judge Munford and Judge Kaitcer in the above-referenced matter. This\nassignment is effective immediately and will continue as necessary to rule on this and any pending,\nsupplemental, amended or subsequent motions to recuse and/or disqualify Judge Munford and Judge\nKaitcer filed by Charles Dustin Myers.\n\nIT IS ORDERED that the clerk of the court to which this assignment is made, if it is\nreasonable and practicable, and if time permits, give notice of this assignment to each attorney\nrepresenting a party to a case that is to be heard in whole or in part by the assigned judge.\n\nIT IS FURTHER ORDERED that the clerk, upon receipt hereof, shall post a copy of this\norder ina public area of the Clerk’s office or courthouse so that attorneys and parties may be advised\nof this assignment.\n\nSIGNED this 6\" day of May, 2025.\n\nhued L Eee.\n\nDAVID L. EVANS, PRESIDING JUDGE\nEIGHTH ADMINISTRATIVE JUDICIAL REGION OF TEXAS\n\nee: Honorable John H. Cayce\nHonorable James Munford\nDistrict Clerk, Tarrant County\nFile\n",
      "char_length": 1957
    }
  ]
}