{"id": "79382074ef8cb6cc7e97d738194aff1e5019245c", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 233-765358-25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY, TEXAS  \n \nTO THE HONORABLE COURT:  \nPetitioner, CHARLES DUSTIN MYERS (\"Father\"), urgently brings before this \ncourt an EMERGENCY MOTION FOR TEMPORARY RESTRAINING ORDER to be \nissued immediately and without prior notice to the Respondent, MORGAN MICHELLE \nMYERS (\"Mother\"), for the safety and welfare of their two minor children M.E.M. and \nC.R.M., the parties' biological children. The Respondent has been informed of this \nrequest for a TRO as well as her attorney, COOPER L. CARTER. Petitioner has received  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n EMERGENCY MOTION FOR TRO  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n2025 -03-24  233-765358-25FILED\nTARRANT COUNTY\n3/24/2025 4:42 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\nno response from either individual. Swift injunctive relief is needed to safeguard the well -\nbeing of the children – including immediate medical needs, schooling needs, financial \nneeds, and emotional needs that the Petitioner has the ability, desire, and duty to satisfy. \nThe Respondent has disrupted the stable living environment enjoyed by the \nchildren up until the Petitioner's unlawful exclusion on March 6, 2024. They have been left without a Father for over thirteen months without any legal justification and are now being raised by their elderly great -grandparents in place of their Father.  \nThe forthcoming and undisputed facts uncover the true intent behind the \nRespondent's actions and clearly demonstrate the need for the Petitioner's immediate re -\nentry into their lives.  \nI. STATEMENT OF JURISDICTION \nThis Court has jurisdiction, and the authority grants the requested relief because \nno valid existing orders bar such action. The only prior orders affecting the parties were issued in the 322nd District Court of Tarrant County, but those orders are void and of no legal effect. Under Texas Family Code § 201.013(b), an associate judge's order does "}
{"id": "37961f1a0f8ecdfacbcb550ee20c41e4f62aed80", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ffecting the parties were issued in the 322nd District Court of Tarrant County, but those orders are void and of no legal effect. Under Texas Family Code § 201.013(b), an associate judge's order does not become final unless and until the referring district court judge signs the order.  \nMoreover, the orders claim that all parties agree to the terms of the order despite \nthe Petitioner's signature being absent. In the prior proceedings (Cause Nos. 322- 744263-\n23 in the 322nd District Court), an associate judge signed a \"temporary\" order on March 14, 2024 that purported to be an agreement between the parties. Critically, no district judge of the 322nd District Court ever signed or adopted that order, as required by law. TEX. FAM. CODE Sec. 201.013. Given this fact, the orders have no legal eff ect and\n\nshould be declared void by this court, or in the alternative, voidable, and vacated without \ndelay. There is effectively no valid court order currently governing the parties' residence or conservatorship rights. This Court may therefore proceed to protect the children's welfare and the parties' rights as justice requires, unimpeded by the defective 322nd District Court order.  \nFurthermore, this court has jurisdiction because the Respondent cannot argue that \nthe related cause number retains dominated jurisdiction. Texas law does allow a court to lose dominant jurisdiction if the party with the first suit proceeded in bad faith or the suit is not actively pursued. Both apply here, as demonstrated below. The first suit was unquestionably brought in bad faith, and the case hasn't been actively pursued for over six months by the opposition, leaving the children in procedural limbo and their needs unaddressed.  \nII. STATEMENT OF FACTS  \n1. On December 12, 2023, Petitioner discovered over 6,500 text messages \nexchanged between the Respondent and an individual named DAMEN GAULT KAZLAUSKAS by checking the usage history on the joint AT&T account owned by the Respondent's grand"}
{"id": "5950fa2c6f927dcc9feddbc2c797dfbfd2b0bf80", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "overed over 6,500 text messages \nexchanged between the Respondent and an individual named DAMEN GAULT KAZLAUSKAS by checking the usage history on the joint AT&T account owned by the Respondent's grandmother and paid for by the Petitioner, who had access to the account. (these records are voluminous and will be provided at hearing)  \n2. On December 14, 2023, in response to this discovery, the Respondent made \nplans to visit the residence of an individual named DANIEL KENNETH BRANTHOOVER, her stepfather.\n\n3. During this trip, the Respondent withdrew the entirety of funds within the joint \nmarital bank account, totaling $1,576, and transferred the funds to Mr. Branthoover's \nPayPal account, which is reflected in the Petitioner's bank statements as \"dmb575\".  \n4. The Respondent and Mr. Branthoover both admitted this transaction occurred \nvia text message evidence.  \n5. The Petitioner requested the funds be returned on December 16, 2023, and \ninformed Mr. Branthoover of the fund's intent being for the Children's Christmas gifts and household bills related to Petitioner's business operations.  \n6. The intentions of the trip to Mr. Branthoover's residence located in Yukon, \nOklahoma were then made clear in his response when Mr. Branthoover informed the Respondent via text message that \"he would be getting divorced\" and that he \"hope[s] [he] can help with the paperwork.\"  \n7. On December 17, 2023, the Petitioner was served an eviction notice by the \nRespondent's grandmother, which cited a protective order and a divorce as the grounds for eviction. Exhibit 5 \n8. On December 18, 2023, the Petitioner filed for divorce in the 322nd District \nCourt of Tarrant County claiming financial indigency and waived the 60- day waiting \nperiod due to claiming an active protective order was in effect against Petitioner, as well as made the claim that she believed herself or the children would be abused or harassed if any contact info were given to Petitioner.\n\n9. On December 19, 2023, Mr. B"}
{"id": "a63500f33753993fc3839a328c88319625ca0f8d", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "effect against Petitioner, as well as made the claim that she believed herself or the children would be abused or harassed if any contact info were given to Petitioner.\n\n9. On December 19, 2023, Mr. Branthoover reached out via text message and \ninformed the Petitioner not to contact \"his client\" any further.  \n10. On December 22, 2023, the Respondent filed for another protective order claiming \nthat family violence had occurred on December 18, 2023, in the presence of the children. Exhibit 8  \n11. On the same evening that she filed for protection, the Respondent can be seen \nat home with the Petitioner in no emergency. Exhibit 9 \n12. Between December 23 and January 16, the Petitioner and Respondent \npeacefully cohabitated with the children continuing their normal routine where the Petitioner stayed home and worked during the day and would pick the children up from school and care for them in the evenings and on weekends.  \n13. The Petitioner was responsible for the children's daily meals, bathing, helped \nin getting them ready for school, taking them to school, and picking them up from school throughout their lives alongside the Respondent. \n14. On January 16, 2023, the 322nd District Court of Tarrant County ordered the \nPetitioner to vacate the matrimonial home at 6641 Anne Court Watauga Texas and the \ncase was reset for January 22, 2024. \n15. On January 19, 2024, Petitioner retained Dan Bacalis, a licensed attorney. \n16. On January 22, 2024, after the reset hearing was already supposed to have \nstarted, RESPONDENT retained COOPER L. CARTER in the lobby of the 322nd\n\nDistrict Court on the fly and then requested a continuance, which was granted, and the \ncase reset to February 1st, 2024. \n17. On February 1, 2024, the parties appeared by counsel and entered into a \nsettlement agreement via an Associate Judge's Report that had the following provisions ordered by the Associate Judge:  \ni. A typed written Order conforming to this Report will follow within 20 days \nfrom "}
{"id": "9e201baad4c542d2a7568ccda322187251e664fd", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ement agreement via an Associate Judge's Report that had the following provisions ordered by the Associate Judge:  \ni. A typed written Order conforming to this Report will follow within 20 days \nfrom the date this report is signed. \nii. The order shall be prepared by DAN BACALIS. iii. Each attorney should approve the Order.  \niiii. The parties do not need to approve the Order.  \niiiii. The attorney reviewing the Order will have (5) days to do so. \niiiiii. There are no 10 day letters.  \niiiiiii. If an agreement is not reached, a Motion to Sign shall be filed and set \nwithin thirty (30) days from the signing of this Report. \n18. On February 5, 2024, Petitioner terminated the services of Dan Bacalis. \n19. On February 8, 2024, Petitioner put the court on notice that he rescinded the \nagreement and filed an EMERGENCY MOTION TO RECONSIDER EVIDENCE AND \nVACATE TEMPORARY ORDERS containing the following exhibits:\n\nDKT.53 -  A.1 ‐ TEXT RECORDS AND VISUALIZATIONS  \nDKT.54 -  EXHIBIT A.2 ‐ TEXT TO PAPAW  \nDKT.55 -  EXHIBIT A.3 ‐ FINANCIAL TRANSACTION  \nDKT.56 -  EXHIBIT A.4 ‐ OVERDRAWN ACCOUNT  \nDKT.57 -  EXHIBIT A.5 ‐ EVICTION NOTICE TORN \nDKT.58 -  EXHIBIT B.1 ‐ DIVORCE PETITION  \nDKT.59 -  EXHIBIT B.2 ‐ DISMISSED EVICTION  \nDKT.60 -  EXHIBIT C.1 ‐ FILINGS REGARDING PROTECTIVE ORD  \nDKT.61 -  EXHIBIT C.2 ‐ 01.16.2024 RENDITION UNSIGNED  \nDKT.62 -  EXHIBIT C.3 ‐ RENDITION FOR JANUARY 22ND, 2024  \n21. On February 12, 2024, an order was rendered effectuating the termination of \nDan Bacalis by the court.  \n22. On February 22, 2024, Petitioner filed a MOTION FOR PARTIAL \nSUMMARY JUDGEMENT with an attached parenting plan. \n23. On February 27, 2024, a notice of hearing was filed with the clerk and \nscheduled the Petitioner's EMERGENCY MOTION TO RECONSIDER EVIDENCE \nAND VACATE TEMPORARY ORDERS for March 14, 2024.  \n24. On March 6, 2024, while walking his two children to school, the \nRESPONDENT ran inside the marital home and locked the Petitioner out of the home. \n25. On March 14, 20"}
{"id": "caa57f97b1a9a83085e7207b1e02b3d1bceb320b", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "ORDERS for March 14, 2024.  \n24. On March 6, 2024, while walking his two children to school, the \nRESPONDENT ran inside the marital home and locked the Petitioner out of the home. \n25. On March 14, 2024, RESPONDENT and her counsel, COOPER L. CARTER, \nwere seen in the conference room preparing Temporary Orders moment before the hearing was to begin.\n\n26. On March 14, 2024, Petitioner was handed a document titled \"Temporary \nOrders\" which had already been signed by the opposing party. \n27. On page 1 of the orders, the orders claimed \"All parties consent to the terms \nof these orders as evidenced by the signatures below.\"  \n28. On March 14, 2024, the Associate Judge denied the Petitioner's emergency \nmotion.  \n29. On March 14, 2024, the Associate Judge adopted the Associate Judge's Report \nsigned by the parties on February 1st and ordered the Petitioner to sign them by 1:30 \nP.M. that same day. \n30. On March 26, 2024, the Temporary Orders signed on March 14, 2024, were \nfiled with the clerk.  \n31. On March 26, 2024, the Petitioner filed a request for findings of fact and \nconclusions of law.  \n32. On April 8, 2024, the Petitioner filed a Petition for Writ of Mandamus in the \nSecond Court of Appeals. \n33. On April 10, 2024, the Petitioner's Petition for Writ of Mandamus was denied.  \n34. On April 22, 2024, the Petitioner filed a Motion for Rehearing in the Second \nCourt of Appeals.  \n35. On April 24, 2024, RODERICK D. MARX, a party not named in the suit, \nfiled a MOTION FOR PRETRIAL CONFERENCE on behalf of COOPER L. CARTER.\n\n36. On April 24, 2024, Petitioner filed an OBJECTION to the MOTION FOR \nPRETRIAL CONFERENCE.  \n37. On April 25, 2024, Petitioner's motion for rehearing was denied.  \n38. On April 27, 2024, Petitioner filed a Motion for Reconsideration En Banc \nwith the Second Court of Appeals.  \n39. On April 30, 2024, Petitioner filed a notice of completion regarding the \n'children in the middle' course.  \n40. On May 2, 2024, Petitioner's motion for reconsideration "}
{"id": "5f2be185213c7aeb3c15d2eb8dc89b07702d6d3c", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "Second Court of Appeals.  \n39. On April 30, 2024, Petitioner filed a notice of completion regarding the \n'children in the middle' course.  \n40. On May 2, 2024, Petitioner's motion for reconsideration en banc was denied.  \n41. On May 13, Petitioner filed a PETITION FOR WRIT OF MANDAMUS in \nthe Texas Supreme Court. \n42. On June 2, 2024, the RESPONDENT's grandmother called the Petitioner, \nraising several concerns regarding the children's well -being. \n43. On June 28, 2024, the Texas Attorney General's Office filed an \nINTERVENTION.  \n44. On July 1, 2024, the Petitioner filed an OBJECTION TO INTERVENTION \npleading. \n45. On August 30, 2024, the Petitioner's mandamus was denied in the Texas \nSupreme Court. \n46. On September 10, 2024, the Petitioner filed a MOTION FOR REHEARING \nin the Texas Supreme Court.\n\n47. On September 17, 2024, the Petitioner served a REQUEST FOR \nDISCOVERY, PRODUCTION, AND ADMISSIONS on the opposing party.  \n48. On September 20, 2024, the Petitioner filed a RULE 12 MOTION TO SHOW \nAUTHORITY against COOPER L. CARTER.  \n49. On September 26, 2024, the Petitioner filed a MOTION FOR TEMPORARY \nORDERS, later amended on September 27, 2024.  \n50. On October 7, 2024, the Petitioner filed a JOINT MOTION TO RECUSE the \ndistrict and associate judges from the case.  \n51. Petitioner's motion for rehearing was denied by the Texas Supreme Court on \nOctober 18, 2024.  \n52. On November 1, 2024, Justice E. Lee Gabriel was assigned to hear the recusal \nmotion.  \n53. On November 4, 2024, Petitioner filed a PRE -TRIAL MOTION IN LIMINE.  \n54. On November 6, 2024, the Petitioner requested confirmation from the clerk \nthat Justice E. Lee Gabriel took her required Oath of Office.  \n55. On November 15, 2024, Petitioner filed a MOTION TO COMPEL \nDISCOVERY regarding the discovery requests sent on September 17, 2024. \n56. On November 19, 2024, an order DENYING the recusal of the associate and \ndistrict judges was filed with the clerk.\n\n57. On December 12, 2024, the Petitioner f"}
{"id": "8b3c8173b1e19cffa1c6acc5b9bf8134a994f67b", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "requests sent on September 17, 2024. \n56. On November 19, 2024, an order DENYING the recusal of the associate and \ndistrict judges was filed with the clerk.\n\n57. On December 12, 2024, the Petitioner filed a NOTICE OF REMOVAL with \nthe 322nd District Court, and removed the case to the Northern District of Texas.  \n58. On December 14, 2024, the case was REMANDED by the Northern District \nof Texas for lack of subject matter jurisdiction.  \n59. On January 12, 2025, Petitioner filed a MOTION TO DISMISS FOR WANT \nOF PROSECUTION.  \n60. On March 18, 2025, Petitioner filed an original SAPCR and motion for \ninjunctive relief with this court.  \n61. On March 22, 2025, the Petitioner learned through a family member that \nRespondent's public Facebook profile states \"In a Relationship since February, 2024\".  \n62. On March 22, 2025, the Petitioner informed the opposing party of this motion.  \n63. On March 23, 2025, the Petitioner filed this suit with this court seeking \nimmediate and emergency relief given the extraordinary circumstances leading up to this \npoint. \nIII. IMMEDIATE NEED FOR RELIEF  \n64. Every day that Petitioner remains barred from his home and children inflicts \nirreparable injury on both Petitioner and the children. Irreparable harm means an injury that cannot be adequately compensated for money damages or corrected later. That is exactly the case here.\n\n65. Petitioner is being deprived of the irreplaceable experience of parenting his \nchildren during their formative years. No amount of monetary compensation or later \nvisitation can make up for the lost time, missed milestones, and emotional bonding that has been denied for over a year. Courts have recognized that interference with custodial or visitation rights constitutes irreparable harm, as time lost with one's child is gone forever. The children are likewise losing the benefit of a father's love, guidance, and daily care – a harm that is unquestionably irreparable. If this wrongful separation continues, the \nr"}
{"id": "d6ad3b63db1c7dd030e471687ce4b00a80e7ff58", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "ld is gone forever. The children are likewise losing the benefit of a father's love, guidance, and daily care – a harm that is unquestionably irreparable. If this wrongful separation continues, the \nrisk increases that the parent -child bond could be permanently damaged. Reunification \nbecomes harder as more time passes; thus the urgency is extreme.  \n66. The children have been suffering confusion, instability, and emotional distress \ndue to the sudden absence of Petitioner and the drastic changes imposed by Respondent. They went from having both parents in their daily life to seeing only one parent, with no satisfactory explanation. Respondents' insertion of a new father -figure (Mr. Kazlauskas) \nhas exacerbated their confusion and anxiety. This kind of emotional turmoil in young children can lead to long- term psychological issues – a classic irreparable injury, as the \ncourt cannot later repair the trauma inflicted on a child's sense of security. Restoring Petitioner's presence is needed now to begin healing the damage and to reassure the children that their father has not abandoned them. The more time that passes, the deeper the potential harm to the children's mental health.  \n67. Petitioner's fundamental right to maintain his familial relationship with his \nchildren (protected by the U.S. and Texas Constitutions) is being violated. Such a violation is inherently irreparable. Deprivation of one's home – being ousted without cause – is also a profound personal harm for which there is no adequate remedy at law.\n\nPetitioner has effectively been made a stranger to his own family and property based on \nfalse pretenses. If the Court does not act, the Petitioner  will continue to suffer intangible \nharms such as loss of income, anguish, and the erosion of his role as a father, none of which can be quantified or compensated later.  \nIV. THE RESPONDENT'S MISCONDUCT  \nPerjury and Aggravated Perjury (Tex. Penal Code §§ 37.02–.03)  \n68. Texas law makes it a crime to make f"}
{"id": "c07e4593ab83680c08724fdc7bd42b181209618a", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "ther, none of which can be quantified or compensated later.  \nIV. THE RESPONDENT'S MISCONDUCT  \nPerjury and Aggravated Perjury (Tex. Penal Code §§ 37.02–.03)  \n68. Texas law makes it a crime to make false statements under oath. Perjury \noccurs when a person, with intent to deceive, makes a false statement under oath in a proceeding where an oath is required.  \n69. If the false statement is made in connection with an \"official proceeding\" and \nis material, it becomes Aggravated Perjury, a third -degree felony. In civil cases, \nknowingly submitting false affidavits or testimony can also constitute perjury and be treated as a fraud upon the court. Courts have recognized that false sworn statements in family law matters are serious misconduct, undermining the judicial process and potentially warranting sanctions or even criminal referral (e.g., Skepnek v. Mynatt, 8 S.W.3d 377, 381 (Tex. App. – El Paso 1999) (attorney sanctioned $30,000 for filing false \naffidavit).  \n70. Here, Respondent swore to multiple false statements under oath, meeting all \nelements of perjury and aggravated perjury. For example:  \nFalse Affidavit of Indigency\n\n71. On December 18, 2023, Respondent filed a sworn \"Affidavit of Inability to \nPay\" court costs, claiming she had only $20 in her bank account. This statement was \nknowingly false. Just two days prior, Respondent had transferred $1,576.00 in marital funds to herself, as confirmed by text messages with her relative (Dan Branthoover) on December 16. She then appeared in court swearing she was penniless and could not afford the $400 filing fee. In that same affidavit, Respondent also lied that she alone paid certain expenses (two car loans and $800 rent plus utilities), when in fact Petitioner had been paying those bills; he continued to pay for the vehicles Respondent claimed to finance on her own. Bank statements and financial records will clearly establish this fact on the merits. Respondent's counsel has never refuted these facts. Thus, Re"}
{"id": "335a8dc7450f842863fc7b374ff11fcda3fd02df", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "he vehicles Respondent claimed to finance on her own. Bank statements and financial records will clearly establish this fact on the merits. Respondent's counsel has never refuted these facts. Thus, Respondent made multiple false statements under oath, meeting Penal Code § 37.02. Because these affidavits were filed in court proceedings and were material to the case (securing a fee waiver and influencing the court's actions), they also qualify as aggravated perjury under \n§ 37.03. Each false statement was material to issues before the court (Respondent's financial status and credibility), satisfying the materiality requirement.  \nFalse Statements in Protective Order Filings  \n72. Respondent submitted false sworn statements in her applications for \nprotective orders. Texas Family Code § 82.009 requires that an application for a temporary ex parte protective order \"contain a detailed description of the facts\" of alleged family violence and be sworn as true by the applicant. Respondent sought an ex parte protective order on or about Dec. 14, 2023, claiming abuse, yet on Dec. 22, 2023, she was photographed laughing and playing with the children alongside Petitioner – conduct wholly i nconsistent with someone in fear of imminent harm. In fact, that same day, she\n\nhad applied for a second protective order against the Petitioner with similar allegations. \nNo credible evidence of family violence was ever presented in thirteen months of litigation but has been used as a barrier from accessing the home where the Petitioner is needed.  \n73. The contextual evidence of falsity (her normal familial behavior with \nPetitioner the same day she sought Protection) defeated  her sworn claims of \"fear\" or \nviolence and display that they were indeed fabricated. At the very least, her contradictory sworn assertions – e.g. claiming on Dec. 18 to have an \"active\" protective order based on family violence (to justify a divorce waiver) when in truth none existed – demonstrate a reckless disrega"}
{"id": "caa25ca993ab7cef2cc1a99c77ad6aaec7747986", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "tory sworn assertions – e.g. claiming on Dec. 18 to have an \"active\" protective order based on family violence (to justify a divorce waiver) when in truth none existed – demonstrate a reckless disregard for the truth under oath.  \n74. These false protective order filings were not isolated incidents but part of a \ncalculated strategy to remove Petitioner from the family home and children's lives. The \ntiming of these filings —immediately after the discovery of Respondent's extramarital \nrelationship with Mr. Kazlauskas —reveals their true purpose: not to protect against \ngenuine violence, but to preemptively silence Petitioner and prevent him from exposing Respondent's infidelity and financial misconduct. By falsely claiming fear while simultaneously engaging in normal family activities with Petitioner, Respondent demonstrated the fabricated nature of her allegations.  \n75. The pattern of deception is unmistakable: Respondent drained the family bank \naccount on December 15 -16, filed false indigency claims on December 18, falsely \nclaimed an existing protective order in her divorce petition that same day, then filed yet another protective order application on December 22—all while continuing to interact\n\nnormally with Petitioner at home. This coordinated sequence of events shows a \npremeditated plan to use the legal system as a weapon against Petitioner rather than as the shield of protection it was designed to be.  \nControlling Law  \n76. False testimony or affidavits in a civil proceeding can warrant severe \nconsequences. While the proper remedy for \"intrinsic\" fraud (false statements on issues litigated at trial) is often a new trial or sanctions rather than voiding a judgment, courts do not hesitate to act on clear perjury. Texas courts have inherent authority to address fraud on the court, and criminal prosecution for aggravated perjury is a possibility for egregious \nlies under oath. Indeed, aggravated perjury in court proceedings is a felony punishable by \n2–10"}
{"id": "8ae933645635150ad74813d6d6b9cb96c2eca284", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "ess fraud on the court, and criminal prosecution for aggravated perjury is a possibility for egregious \nlies under oath. Indeed, aggravated perjury in court proceedings is a felony punishable by \n2–10 years' imprisonment (Tex. Penal Code § 37.03(b)).  \n77. That is precisely what has occurred in this case, and Respondent should face \nsome consequences for her actions, but Petitioner believes that prolonged incarceration would not be in the best interests of his children, but that some form of legal repercussion is necessary to deter similar behavior in the future. She has made no effort to defend these claims, no effort to prosecute her case, and the Petitioner prays that this court realize the severity of this situation on those effected most: the children.  \nV. BEST INTEREST OF THE CHILDREN  \n78. The Texas Family Code references \"the best interest of the child\" 109 times \nthroughout its text, and throughout the entirety of the code itself – the word \"always\" only appears once. TEX. FAM. CODE. Sec. 153.002. (The best interest of the child shall\n\nalways be the primary consideration of the court in determining the issues of \nconservatorship and possession of and access to the child.)  \n79. Here, this statutory mandate was grossly violated by the Respondent and her \npurported counsel, who have suddenly become active in the litigation here despite remaining silent for over eight months in the parallel case destined for dismissal.  \n80. Indeed, the instant case reveals a Mother with an agenda to erase the parent \nthe children relied on the most from their lives despite a valid legal reason, and has disregarded their livelihood in the process.  \n81. Respondent's conduct constitutes a blatant violation of the \"best interest\" \nstandard mandated by Texas Family Code §§ 153.001 and 153.002. Texas law declares it the public policy of this state to assure that children have frequent and continuing contact with parents who act in the child's best interest, to provide a safe and "}
{"id": "642143439d992c85d6c24e58c7487b0fa8d8ab1e", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "nd 153.002. Texas law declares it the public policy of this state to assure that children have frequent and continuing contact with parents who act in the child's best interest, to provide a safe and stable environment \nfor the child, and to encourage both parents to share in raising the child. Moreover, the best interest of the child must always be the court's primary consideration in matters of conservatorship and access. Respondent has flagrantly defied these principles by prioritizing her extramarital relationship with Mr. Damen Kazlauskas over the emotional, psychological, and familial stability of her own children. \nOrchestrated Campaign of Deception at the Family's Expense  \n82. The evidence reveals a disturbing pattern: Respondent orchestrated a \ncomprehensive campaign of deception that sacrificed her children's emotional well -being \nand family stability to pursue her extramarital relationship. This was not a series of isolated incidents but a calculated strategy that unfolded in precise sequence:\n\n83. First, Respondent engaged in an extramarital relationship with Mr. Kazlauskas \n(evidenced by over 6,500 text messages);  \n84. Second, upon discovery of this relationship, she immediately sought \nassistance from Mr. Branthoover to draft legal documents;  \n85. Third, she drained the family's financial resources ($1,576) that were intended \nfor the children's Christmas gifts;  \n86. Fourth, she filed false protective order applications and a fraudulent indigency \naffidavit;  \n87. Fifth, she misrepresented to the court that an active protective order existed \nwhen none did;  \n88. Finally, she used these fraudulent filings to remove Petitioner from the family \nhome and children's lives. \n89. Each step in this sequence was designed not to protect the children but to \nadvance Respondent's personal agenda at their expense. The children have been collateral \ndamage in Respondent's effort to reconstruct her life with Mr. Kazlauskas, who she now publicly acknowledges as "}
{"id": "7b1a91c9940888e72ea578888cb9302a3f99995c", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": "vance Respondent's personal agenda at their expense. The children have been collateral \ndamage in Respondent's effort to reconstruct her life with Mr. Kazlauskas, who she now publicly acknowledges as her partner \"since February 2024\" —a relationship that began \nwhile she was still actively living with Petitioner and the children.  \nDeception and Psychological Confusion of the Children  \n90. Respondent has knowingly misled the minor children about the status of their \nfamily by telling them that she and Petitioner are already divorced, even though the divorce is not final. This deliberate falsehood serves Respondent's personal narrative but\n\nwreaks emotional havoc on the children. They are left in a state of confusion—believing \ntheir family has been permanently fractured when in fact the legal marriage remains intact. By intentionally misrepresenting such a fundamental truth, Respondent has shown a willingness to confuse and emotionally harm her children to justify her own choices, in direct contravention of her duty to prioritize the children's emotional well -being. \nPrioritizing an Extramarital Relationship Over Family  \n91. Compounding the harm, Respondent is openly celebrating a relationship with \nMr. Kazlauskas – a man with whom she entered an extramarital relationship while still married to Petitioner. She has flaunted this relationship and positioned Mr. Kazlauskas as \na replacement father figure to the children, celebrating milestones with him that should be \nreserved for family. In doing so, Respondent elevates her personal relationship over her children's need for stability and continuity with their real father. This behavior sends the \nchildren a disturbing message: that their father's role in their lives is interchangeable or unimportant. Such a message is detrimental to the children's best interests, as it undermines their sense of security, identity, and trust in their family structure and the close relationship that they have shared with their father"}
{"id": "7282c4655678c07213fd5fb3ab98a3219f69ae9e", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "detrimental to the children's best interests, as it undermines their sense of security, identity, and trust in their family structure and the close relationship that they have shared with their father throughout their lives. \nActive Alienation and Erasure of the Father  \n92. Respondent has gone to alarming lengths to minimize and erase Petitioner's \npresence in the children's lives. She has introduced Mr. Kazlauskas to the children as if he were a new parent, while simultaneously telling the children that Petitioner (their father) is no longer in their lives. This calculated act of alienation strikes at the very heart\n\nof Texas public policy, which seeks to ensure children maintain frequent and continuing \ncontact with both parents. \n93. Instead of fostering the father –child relationship, Respondent has deliberately \nattempted to sever it. The children are being taught through Respondent's words and actions that their father has effectively disappeared and been substituted by a stranger, causing profound emotional damage and confusing the children about who their father is. This behavior is not only cruel; it is directly contrary to the children's best interests and Texas's clear directives that children benefit from the love and involvement of both parents.  \n93. The children's current living situation—being raised primarily by elderly \ngreat -grandparents rather than their capable and willing father —further demonstrates \nhow Respondent's personal agenda has superseded the children's needs. Rather than \nallowing Petitioner to fulfill his parental role and provide daily care and support to the children, Respondent has relegated this responsibility to extended family members, depriving the children of their father's presence, guidance, and care during crucial developmental years.  \n94. Respondent's systematic use of false protective orders, perjured testimony, \nand procedural manipulation has created a legal fiction that has kept Petitioner from his children for ov"}
{"id": "46cd827806cded27d0bd1f205a33f12389bf5a38", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "ntal years.  \n94. Respondent's systematic use of false protective orders, perjured testimony, \nand procedural manipulation has created a legal fiction that has kept Petitioner from his children for over thirteen months. This separation was not based on any legitimate safety concern or the children's best interests, but solely on Respondent's desire to reconstruct her family unit with Mr. Kazlauskas at the center —effectively erasing Petitioner from the \nchildren's lives to accommodate her new relationship.\n\n95. The harm to the children from this prolonged, unjustified separation from their \nfather cannot be overstated. Research consistently shows that children benefit from the \nactive involvement of both parents, and that unnecessary disruption of the parent -child \nbond can cause lasting psychological damage. By prioritizing her personal relationship over her children's need for both parents, Respondent has demonstrated a fundamental misalignment with the \"best interest\" standard that Texas law demands be the \"primary consideration\" in all matters affecting children.  \n96. Despite the Respondent’s egregious actions, the Petitioner wishes her no ill \nwill as she is the mother of his Children and only seeks an amicable path forward that suits their best interests. As of now, the Children need their father, and this situation engineered by the Respondent shows that her fitness as a parent has been called into question, and her priorities are not in the correct place. Petitioner vows his return to the family home will only bring much needed stability to his children and will be in their best \ninterests for their day -to-day livelihood. \nVI. PRAYER  \nWHEREFORE, PREMISES CONSIDERED, Petitioner respectfully prays that this Honorable Court:  \n(1). Issue an immediate Temporary Restraining Order for the safety and welfare \nof the children without notice to Respondent, restraining Respondent from:  \na. Denying Petitioner access to the children;\n\nb. Denying Petitioner access t"}
{"id": "f502bd8337b5ae43389fdbf453d20782bb2891b1", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "Restraining Order for the safety and welfare \nof the children without notice to Respondent, restraining Respondent from:  \na. Denying Petitioner access to the children;\n\nb. Denying Petitioner access to the family residence at 6641 Anne Court, \nWatauga, Texas 76148;  \nc. Disturbing the peace of the Children;  \nd. Disrupting the status quo of the children as it existed on March 6, 2024;  \nc. Removing the children from Tarrant County, Texas;  \nd. Making disparaging remarks about Petitioner to or in the presence of the children;  \ne. Interfering with Petitioner's possession of and access to the children;  \nf. Destroying, removing, concealing, encumbering, transferring, or otherwise harming or reducing the value of the property of the parties;  \ng. Falsifying any records relating to the children or property;  \nh. Misrepresenting any facts to the children regarding the marriage, divorce proceedings, or Petitioner's role in their lives;  \ni; Bringing the Children near DAMEN GAULT KAZLAUSKAS;  \n(5). Set a hearing on Petitioner's request for a Temporary Injunction at the earliest possible date not later than 14 days from the  electronic  delivery of this TRO to the \nRespondent;  \n(6). After hearing, issue a Temporary Injunction containing the same prohibitions as this Temporary Restraining Order;\n\n(7). After trial, if no agreement can be reached, grant Petitioner primary \nconservatorship of the children;  \n(8). After trial, if no agreement can be reached, grant Petitioner exclusive possession of the family residence until damages can be fully restored and alternative residency can be established  nearby the Children;  \n(10). Grant such other and further relief to which Petitioner may be justly entitled. \nIt’s been a long road. The Petitioner prays he may now return home to his children and prepare for this difficult time in a manner which comports with their fundamental needs.  \nThank you.  \nRespectfully submitted,  \n \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS, Pro Se  "}
{"id": "8f790eda26f00c38ae64d631595df496d10be986", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_24_25_emergency_ex_parte_tro_1\\03_24_25_emergency_ex_parte_tro_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.24.25 - EMERGENCY EX-PARTE TRO-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 1300, "text": "hildren and prepare for this difficult time in a manner which comports with their fundamental needs.  \nThank you.  \nRespectfully submitted,  \n \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS, Pro Se  \n6641 Anne Court  \nWatauga, Texas 76148  \nPhone: 817- 546-3693 \nEmail: CHUCKDUSTIN12@GMAIL.COM\n\nCERTIFICATION OF COMPLIANCE WITH LOCAL RULE 4.11(11)(e)\nPetitioner certifies that after diligent attempts to reach both the \nRespondent and her Counsel, all attempts were unsuccessful.\n/s/ Charles Dustin Myers\n6641 Anne Court\nWatauga, TX\n817-546-3693\nCHUCKDUSTIN12@GMAIL.COMCHARLES DUSTIN MYERS\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98863782\nFiling Code Description: Proposed Order\nFiling Description: PROPOSED ORDER\nStatus as of 3/26/2025 3:31 PM CST\nCase Contacts\nName\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/25/2025 2:10:47 PM\n3/25/2025 2:10:47 PMStatus\nNOT SENT\nNOT SENT"}