{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\05.16.25 - NOTICE OF INTENT TO FILE MANDAMUS-1.pdf",
  "base_name": "05_16_25_notice_of_intent_to_file_mandamus_1",
  "page_count": 10,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322- 744263- 23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTo the Honorable David L . Evans:  \n         Respondent in the above styled cause, CHARLES DUSTIN MYERS, \nrespectfully submits this notice of intent to file mandamus regarding the Order \nOverrul ing Respondent ’s Objection signed Ma y 15, 2025, and in support thereof, \nshows the following:  \nI. APPLICABLE LAW  \ni. Court Coordinators and Rec usal \n     Pursuant to Texas Government Code Sec. 74.101, the provision that a court \ncoordinator serves at the pleasure of the appointing judge implies that a \ncoordinator assigned by a district judge is distinct from the administrative  \nIN THE INTEREST OF M.E.M., C.R.M., two \nchildren)  \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS , Notice of Intent to File Mandamus  \n \n  \nRespondent.   \n  \n  \n2025 -05-16",
      "char_length": 865
    },
    {
      "page_number": 2,
      "text": "judge. The statute clearly differentiates between the local administrative judge \nand each district or statutory county court judge, granting them separate \nauthority to establish court coordinator systems and appoint court coordinators who serve at the pleasure of their respective appointing judges.  \n      The statute specifically states that \"the local administrative judge and each \ndistrict or statutory county court judge\" may establish a court coordinator \nsystem and appoint a court coordinator for their court. This language places the \nlocal administrative judge and other judges on equal footing with respect to \ncoordinator appointments, with each having independent authority to appoint \ncoordinators for their own courts. Furthermore, subsection (b) establishes that \"each court coordinator serves at the pleasure of the judge who appointed him,\" \ncreating a direct reporting relationship between the coordinator and their specific appointing judge.  \n      The distinction between a court coordinator assigned by a district judge and \nthe administrative judge is further supported by the broader statutory context. \nTexas Government Code Sec. 75.401, while addressing court administrator systems rather than court c oordinators specifically, reinforces the concept of \nseparate judicial roles in court administration. This complementary provision shows that Texas law establishes different administrative functions within the \ncourt system, with court administrators coopera ting with various judges,",
      "char_length": 1517
    },
    {
      "page_number": 3,
      "text": "including \"regional, presiding, and local administrative judges.\" This \ncooperative relationship would be unnecessary if the court coordinator positions \nwere not distinct from administrative judges.  While Section 75.401 addresses \ncourt administrators rather than court coordinators directly, it provides valuable context for understanding the relationships between different judicial roles and \ncourt administrative staff in the Texas court system.  \n        I n this instance, the Respondent objected to the court coordinator handling \nthe recusal proceedings who was appointed by the same District Judge  subject \nto the recusal  when the statute set for th in the Texas Rules of Civil Procedure \nspecifically designates duties to the clerk of th e court, not the coordinator . \nII. ANALYSIS  \n      In the order overruling the objection, it was stated that “ [t]he court \ncoordinators and clerks work together to assist the trial court judges and the \nadministrative judges. Only the judges, not the litigants, have the autho rity to \ndirect the activities of the cou rt coordinators and clerks. ” Here, the court \nmisapplied the rule. As stated above, 75.401(b) of the code expressly states that \n“[e]ach court coordinator serves at the pleasure of the judge who appointed \nhim.” Because the court coordinator in question was appointed by the \nHonorable Judge subject to recusal and based on the analysis of Texas",
      "char_length": 1420
    },
    {
      "page_number": 4,
      "text": "Government Code Sec. 74.101 and the supplementary context provided by \nSection 75.401, the provision that a court coordinator serves at the pleasure of \nthe appointing judge strongly implies that a coordinator assigned by a district \njudge is distinct from th e administrative judge. This conclusion is supported by \nmultiple aspects of the statutory language: \n1. The statute separately identifies \"the local administrative judge and each \ndistrict or statutory county court judge\" as authorities who may establish \ncourt coordinator systems and appoint court coordinators.  \n2. Each judge may appoint a coordinator specifically \"for his court,\" suggesting \na one -to-one relationship between judges and the coordinators for their \ncourts.  \n3. Each court coordinator \"serves at the pleasure of the judge who appointed him,\" creating a direct accountability relationship between the coordinator and the specific appointing judge.  \n4. The complementary provisions regarding court administrators explicitly \ndistinguish between administrative judges and the courts served by \nadministrators, requiring cooperation between them.  \n    If court coordinators were not distinct from administrative judges, it would \ncreate potential conflicts in prioritization and resource allocation. A coordinator",
      "char_length": 1295
    },
    {
      "page_number": 5,
      "text": "simultaneously answerable to both a district judge and an administrative judge \nmight face competing demands, undermining the efficiency the system is designed \nto promote.  \n    Furthermore, the Texas Rules of Civil Procedure governing recusal are \nunambiguous, and designate no responsibilities  regarding recusal proce edings to be \nhandled by the coordinator. See Id . 18a(e) (specifically designating duties to the \nclerk of the court) By permitting the involvement of the coordinator in the recusal \nproceedings when that coordinator was appointed by the district judge  subject to \nrecusal w ould be prejudicial . \n     Finally, regarding the reference to Judge Kaitcer in these proceedings, the order \nis also prejudicial –  because no such motion was ever filed implicating Honorable \nJeff Kaitcer in the current proceedings. To overrule th is objection but permit the \nassigned judge to consider that issue on a motion not before the court would cause \nfurther delay, waste judicial resources, and effectuate the exact opposite purpose of \nthe statute invoked and used to overrule the objection. (74.102(b)) By permitting \nthe coordinator to ‘work together ’ with the clerks would exceed the statutory \nauthority set forth in the Texas Rules of Civil Procedure.",
      "char_length": 1271
    },
    {
      "page_number": 6,
      "text": "III. CONCLUSION  \n      In conclusion, the legal framework governing recusal motions in Texas courts \nrequires the use of clerks, not coordinators, for handling these matters. \nAdministrative judges must comply with these requirements and cannot substitute \ncoordinators for clerks i n the recusal process.   To obtain relief through a writ of \nmandamus, the relator must establish that (1) the act he seeks to compel is ministerial, rather than discretionary, in nature and (2) no other adequate remedy at law is available. Engle v. Coker, 820 S.W.2d 247 (Tex. App. —Beaumont 1991, no \npet.). An act is ministerial if it constitutes a duty clearly fixed and required by law, without the exercise of discretion or judgment.  Here, the act of following the Texas \nRules of Civil Procedure regarding the re cusal process is ministerial, and \nmandamus is the app ropriate remedy to challenge the Ma y 15, 2025,  order \noverruling the Respondent ’s objection for the reasons state d. The use of a \ncoordinator instead o f the statutory required clerk is a failure to perform a \nministerial duty. As explained in  In re Norman, 191 S.W.3d 858 (Tex. App. 2006), \nmandamus relief may be available when a judge fails to follow mandatory \nprocedural requirements related to recusal moti ons.",
      "char_length": 1282
    },
    {
      "page_number": 7,
      "text": "Respectfully submitted,  \n             \n           /s/ Ch arles Dustin Myers  \n           CHARLES DUSTIN MYERS  \n           817- 546-3693  \n           CHUCKDUSTIN12@GMAIL.COM \n  \n \n \n \n \n \n \nCERTIFICAT E OF SERVICE  \n    Pursuant to Rule 21a of the Texas Rules of Civil Procedure, this Notice of Intent \nto File Mandamus has been served on al l parties of record on 05/16/2025.  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS",
      "char_length": 429
    },
    {
      "page_number": 8,
      "text": "A",
      "char_length": 1
    },
    {
      "page_number": 9,
      "text": "IN THE MATTER OF \nTHE MARRIAGE OF \nMORGAN MICHELLE MYERS \nAND \nCHARLES DUSTIN MYERS \nAND IN THE INTEREST OF \nMARA MYERS AND CAUSE NO. 322-744263-23 \nCAROLINE MYERS, CHILDREN § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ IN THE DISTRICT COURT \n322ND JUDICIAL DISTRICT \nTARRANT COUNTY, TEXAS \nORDER DENYING OBJECTION TO ORDER OF ASSIGNMENT DATED MAY 6, 2025 \nAND THE OBJECTION DATED APRIL 29, 2025 \nCame on to be considered the Objection to Order of Assignment Dated May 6, 2025, and \nthe Objection dated April 29, 2025 that were filed Charles Dustin Myers in the above-entitled \ncause. \nMr. Myers complains of the court coordinator's involvement in the recusal process. A \nCourt Coordinator's duties include assisting the administrative judges. See Tex. Gov't Code Ann. \n§ 74.102(b) which provides as follows: \nTo promote uniform and efficient administration of justice in this state, the court \ncoordinators shall cooperate with regional presiding and local administrative \njudges and state agencies having duties in the area of the operation of the courts. \nThe court coordinators and clerks work together to assist the trial judges and the \nadministrative judges. Only the judges, not the litigants, have the authority to direct the activities \nof the court coordinators and clerks. Mr. Myers' objections regarding the involvement are \noverruled. \nMr. Myers also objects to the referral by Judge Kaitcer of a motion to recuse (Kaitcer \nrecusal motion) to the undersigned. This objection is overruled. However, the judge who hears",
      "char_length": 1514
    },
    {
      "page_number": 10,
      "text": "",
      "char_length": 0
    }
  ]
}