{"id": "7a01dce9d27a92598a26292c4db16c7700211c03", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_01_2024_from_322_744538_23_att_exhibit_a_1\\01_01_2024_from_322_744538_23_att_exhibit_a_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.01.2024_FROM 322-744538-23  ATT EXHIBIT A-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "DKT (36)\n*** FROM 322-744538-23 *** (ATT) EXHIBIT A\nFILED ON: 01/02/2024\nFEE: $0.00\nFILER/REQUESTOR: CHARLES DUSTIN MYERSM.137 M.137\nM.137 M.137 M.137 M.137\n\nEXHIBIT A\nFALSE AND CONTRADICTORY \nSTATEMENTS\nIN PLAINTIFF'S PLEADINGS\n322-744538-2 3322-744538-23\nCopy from re:SearchTXM.138 M.138\nM.138 M.138 M.138 M.138\n\nCopy from re:SearchTXM.139 M.139\nM.139 M.139 M.139 M.13915 \n4b Presumption of Family Violence: Has the Respondent ever been convicted of or placed on deferred adjudication \ncommunity supervision for any crime under Tille 5 or T\\Ue 6 of the Texas Penal Code? (see list or crimes at the \nend of the kil) \n□Yesl!tNo \nIf \"Yes.\" say what kind of case: \nIf the Responde nt was convicted or placed on community supervision for a Tnle 5 crime, did the Court make a \nfinding. \\hat the crime involved family violence? \n□Yes □No \nWas the crime against a child listed in this petition under Number 2 'Children\"? \n□Yes □No \nHave the Respondent 's parental rights to this child been lenninated? \n□Yes □No \nIs the Respondent seeking or altempling to seek contact with lhis child? \n□Yes □No \n5 Grounds: Why is lhe Applicant asking for this Protective Order?.Check one or both: \nJil' The Respondent committed family violence. \nD The Responden t violated a prior Protective Order that expired, or will expire in 30 days or less. A copy of the \nOrder is (check one):· D Attached, or • \nO Not available now but will be filed before the hearing on this Application \nTho Applicant requests '.' PROTECTIVE -ORDER and asks the Court to make all Orders marked with a check i/ \n6 v Orders to Prevent Family Violence \nThe Applicant asks the Court to order the Respondent to (Check all that apply): \na. V, Not commit family violence against any person named on page 1 ol \\his form. \nb. d\" Not communicate in a threatening or harassing manner with any person named on page 1 of this form. \nc. Ef Not communicate a threat through any person to any person named on page 1 of this form. \nd. 0 Npl communicate or attem"}
{"id": "397bafb2f4843780001b9d74462f019f146966cb", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_01_2024_from_322_744538_23_att_exhibit_a_1\\01_01_2024_from_322_744538_23_att_exhibit_a_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.01.2024_FROM 322-744538-23  ATT EXHIBIT A-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "eatening or harassing manner with any person named on page 1 of this form. \nc. Ef Not communicate a threat through any person to any person named on page 1 of this form. \nd. 0 Npl communicate or attempt to communicate in any manner .with (Check al/ that apply): \nEl Applicant D Children O Other Adulls named on page 1 of this form. \nThe Respondent may communicate through: __________ _ or other person the Court \nappoints. Good cause exists for prohibiting the Responden t's direct communicat ions. \ne. ref NjJI go wnhin 200 yards of I.he (Check all rhat apply): • \n13 Applicant D Children D Other Adults named on page 1 of this form. \nf. i Not go within 200 yards of the residence, workplace, or school of the (Check all that apply): \nEf Applicant □ Other Adults named on page 1 of !his rorm. • \ng. r£ Not.go within 200 yards of the Children's residence, child-care facility, or school, except as specifically \n/ authonzed in a possession schedule entered by the Court. \nh. El Not stalk, follow, or engage in conduct directed specifically to anyone named on page 1 of this form that Is \nreasonably likely to harass, annoy, alarm, abuse, torment. or embarrass them, including tracking or \nmonitoring a car or other property. • \nThe Applicant asks the Court to: \ni. Q Suspend any license to carry a handgun issued to the Respondent by the State of Texas. • \nj, ~ Require the Respondent lo complete a battering intervention and prevention program; or ii no such program \nis available, counseling with a social worker, family service agency, physician, psychologist, licensed \ntherapist, or licensed professiona l counselor; and pay all costs for the counseling or treatment ordered. \nk. □ Prohibit the Respondent from taking, harming, threatening, or interfering with the care, custody, or control \nor the following pet, companion animal: or assistance animal: ________ (describe the \nanimal). \nI. 0 Require lhe Respondent lo follow these provisions to prevent or reduce \\he likelihood of family violen"}
{"id": "d5eb6907c9692c7c96b6e029644700ff1182df09", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_01_2024_from_322_744538_23_att_exhibit_a_1\\01_01_2024_from_322_744538_23_att_exhibit_a_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.01.2024_FROM 322-744538-23  ATT EXHIBIT A-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "the following pet, companion animal: or assistance animal: ________ (describe the \nanimal). \nI. 0 Require lhe Respondent lo follow these provisions to prevent or reduce \\he likelihood of family violence: \nThe )aw requires a trial court issuing a protective order to prohibit the Respondent from possessing a firearm or \nammunition, unless the Respondent Is a peace officer actively engaged in employment as.a sworn, full-time paid \nemployee of a state agency or political subdivision. \nAppftCC!ior. fer P:ol~t;t!'\\I~ O~r \nForm AQprovP.d by tr-.e Supreme Court of Te,rn~ Page2ol 5\n\nCopy from re:SearchTXM.140 M.140\nM.140 M.140 M.140 M.1406F. Possess ion of and Access to the Chlld(ren) (Visitation) \nI ask the court to make possession and access (visitation) orders as follows: (Check a, b, c, or d) \na. @' Father should have •standard vis;..aoon_ • {See Texas Family Code Chapter 153, Subchapter F.) \nb. 0 Mother should have \"standard vlsl'Jobon • 'See Texas Family Code Chapter 153, Subchapter F.J \nc. 0 \"Standard visitation• would be unwo!kal);e or inappropriaie Possession and access to the \nchild(ren)should be as follows. \nd. O I am concerned about the safety of the children with the other parent I ask that: \n(If you checked d, check all that apply below.) \nd-1. 0 exchanges of the child(ren) be supervised, or m the atternative, be in a public place. \nd-2. D the other parent's possession of the child(ren) be limited to day visits. \nd-3. O the other parent's possession of the child(ren) be supervised . \nd-4. 0 the other parent have no right to possessio n or access to the child(ren). \nd--5. 0 the other parent be ordered noi to use alcohol or illegal drugs 24 hours prior to or during \npossession of the chiJd(ren). \nd-6. 0 the other parent's possession and access to the children be restricted as follows: \n(Check only If you are asklng that a different possession order be n place while a chlld Is under 3 years old.j \nD One or more of the children is under 3. Until the child turns 3. "}
{"id": "ec68a7307219757d0f3014cc1464ecf02ac747d3", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_01_2024_from_322_744538_23_att_exhibit_a_1\\01_01_2024_from_322_744538_23_att_exhibit_a_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.01.2024_FROM 322-744538-23  ATT EXHIBIT A-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "ricted as follows: \n(Check only If you are asklng that a different possession order be n place while a chlld Is under 3 years old.j \nD One or more of the children is under 3. Until the child turns 3. possession should be as follows: \nAfter the child turns 3, possession should be as checked above. \n(Check only If applicable. ) \n0 I am concerned that the other parent may take the child(ran) to another counily and refuse to return \nthem. I ask the Court to determine if there is a ris~ of international kidnapping by the other parent and \nto take such measures as are necessary to protect the child(ren). \n6G. Child Support, Medical Support, and Dental Support for the Child(ren) \nI ask the court to make appropriate orders for the f.nancial support of the child(ren), Including regular child \nsupport, medical support, dental support and, if supported by the evidence, retroactive child support \nPOOP.5nf11\n\nCopy from re:SearchTXM.141 M.141\nM.141 M.141 M.141 M.1419. Protective Order Statement (Check the appropriate boxes. Fill in the requested information.I \n8A. No Protective Order \nD I do not have a protective order against my spouse and I have not asked for one. \nD My spouse does not have a protective order against me and has not asked for one. \n8B. Pending Protective Order \nGr I have filed paperwork at the courthouse asking for a protective order against my spouse, but a \njudge has not decided if I should get it. I asked for a protective order on _._12,.1\"'1.:.41..,2,.,.0.,2.,.3~---­\noate Fiied \nIn Tarrant County, Texas . The cause number Is __________ _ \nCounty State Cause Number \nIf I get a protective order, I will file a copy of it before any hearings in this divorce. \nD My spouse hH filed paperwork asking for a protective order against me, but a judge has not \ndecided if my spouse will get It. My spouse asked for a protective order on --=-c-c=-,----­\nDate Filed \nln._~ _____ County, _____ .. The cause number is __________ _ \nC<>unty SUtit Cause Number \nIf my spouse gets a"}
{"id": "e9fb3f5d9d7e5d820f5acf923be1845bd3f52937", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_01_2024_from_322_744538_23_att_exhibit_a_1\\01_01_2024_from_322_744538_23_att_exhibit_a_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.01.2024_FROM 322-744538-23  ATT EXHIBIT A-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 1678, "text": "spouse will get It. My spouse asked for a protective order on --=-c-c=-,----­\nDate Filed \nln._~ _____ County, _____ .. The cause number is __________ _ \nC<>unty SUtit Cause Number \nIf my spouse gets a protective order, I will file a copy of it before any hearings in this divorce. \n9C. Protective Order in Place \nD I do have a protective order against my spouse. I got the protective order in ____________ County~ _________ on. _______ _ \nCounty State OamOrdernd \nThe cause number for the protective order is. ___ _,,_--,,---,------ ------\nCause Number \nEither I have attached a copy of the protective order to this petition or I will file a copy of It with the \ncourt before any hearings in this divorce. \nD My spouse does have a protective order against me. The protective order was made in _____________ County., __________ on, ________ . \nCounty Stale Date Ordered \nThe cause number for the protective order is __________________ _ \nCause Number \nEither I have attached a copy of the protective order to this petition or I will file a copy of it with the \ncourt before any hearings In this divorce. \n10. Waiver of Waiting Period Based on Family Violence (Check only itapplicable.1 \nis::f I ask the Court to waive the 60-<Jay waiting period for divorce because· (Check one bo,c.} \nD My spouse has been convicted of or received deferred adjudication for a crime involving family \nviolence against me or a member of my household. \nEJ' I have an active protective order or an active magistrate 's order for emergency protection against \nmy spouse because of family violence dunng our marriage. The order includes a finding that my \nspouse committed family violence, \nPage7 of 11"}