{"id": "abdab840cf0b4a8ce8250308c73d0b38260044fb", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322-744263-23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \n \nTO THE HONORABLE  JAMES MUNFORD:  \n Respondent , CHARLES DUSTIN MYERS, submits his NOTICE OF INTENT TO  \nSEEK AN EXTRAORDINARY WRIT OF PROHIBITION, and in support thereof, sho ws the \nfollowing: \nI. INTRODUCTION \nAfter over a year of one-side d litigation, this court has permitted a purported settlement \nagreement to destroy the lives of two children, their father’s  livelihood, and have rewarded both \nthe Petitioner  and her attorney by refusing to prosecute the case. There  is no excuse f or allowing \nthe Petitioner to blatantly deceive this court into acquiring  agreed temporary orders without the \nconsent of all parties through her attorney of record only to then fail to prosecute the case. This \nsituation has resulted  in unenforceable orders that remain facially void  and now this court, after ITMOMO  \n(AITIO M.E.M., C.R.M., two children) \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS , RESPONDENT’S NOTICE OF INTENT TO \nSEEK  AN EXTRAORDINARY WRIT OF \nPROHIBITION  \n  \nRespondent.   \n  \n2025 -04-07  322-744263-23 FILED\nTARRANT COUNTY\n4/7/2025 1:57 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n2 \n months of inaction, is seeking to set an improperly filed consolidation motion used as a tactic  to \nstall emergency relief . \nNotably, t he participation from P etitioner  resurfaces again only in the face of an \nemergency TRO . It doesn ’t come with good faith or arguments;  it only comes with a false sense \nof urgency by the opposing counsel in this matter. This court has sat on its ’ hands for months, \nand then despite the failure to prosecute from the other side, it chooses to act on the wrong \nmotion . Such a display is legally improper, unjustified, and showcases the complete disregard for \nwhat would otherwise be a prima facie case wa rranting dismissal for want of prosecution.  \nNow, rather than acting sua sponte  to set the DWOP for hearing, t he court inste"}
{"id": "ffdb7b3b3c3a7eca6c3d56d6501934653f1c5c1b", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "he complete disregard for \nwhat would otherwise be a prima facie case wa rranting dismissal for want of prosecution.  \nNow, rather than acting sua sponte  to set the DWOP for hearing, t he court instead \nchooses to entertain a prematurely  filed consolidation motion which it has no  jurisdiction to rule \non. As the  Texas  Supreme Court has held  previously: “ [a] plaintiff has a duty to “prosecut[e] the \nsuit to a conclusion with reasonable diligence,” failing which a trial court may dismiss for want of prosecution.”  In re Conner , 458 S.W.3d 532 (Tex. 2015)  (citing Callahan v. Staples , 139 Tex. \n8, 161 S.W.2d 489, 491 (1942) ). The court has wide discretion to manage its ’ docket, so it begs \nthe question as to why the court wants to act on its own accord on a motion to consolidate be fore \nthe cas e is properly transferred . \nAlthough the writ of prohibition is intended to prevent this Court from setting a matter \nfor hearing that is procedurally improper, the issue in this case mirrors that addressed by the Texas Supreme Court in In re Conner , 458 S.W.3d 532 (Tex. 2015). There, the Court considered \nwhether a trial court abuses its discretion by refusing to grant a motion to dismiss for want of prosecution in the face of unmitigated and unexplained delay—and held that it does. That is precisely  the circumstance presented here, and this intended writ of prohibition is to prevent this \ncourt from causing even further delays by setting a matter for a hearing which it ha s no\n\n3 \n jurisdiction to rule on, and give the court the ability to dismiss this case for want of prosecution  \ngiven that it has the discretion to do so, and no opposition to it from  the opposing party. \nII. LEGAL  FRAMEWORK  \nA. Writ of Prohibition  \nA writ of prohibition is an extraordinary legal remedy that serves specific, limited \npurposes in the Texas legal system. It is a judicial order issued by a higher court to prevent a \nlower court from exceeding its jurisdiction or interfering w"}
{"id": "3c836d5afda929b5af6f4704f80cf1d7064552aa", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "gal remedy that serves specific, limited \npurposes in the Texas legal system. It is a judicial order issued by a higher court to prevent a \nlower court from exceeding its jurisdiction or interfering with the higher  court's determination of \na case.  \nKey characteristics of a writ of prohibition include:  \n1. Limited Purpose Remedy : A writ of prohibition is used to protect the subject matter of \nan appeal or to prohibit unlawful interference with enforcement of a superior court's judgment ( Sivley v. Sivley, 972 S.W.2d 850, 863, Tex. App.—Tyler 1998).  \n2. Preventive Nature: The writ is designed to prevent future actions, not to remedy acts already completed. It can only be used to prevent what is about to be or could be done, not as a remedy for acts that are already completed (United States v. Hoffman, 71 U.S. \n158, 1866). Here, Respondent seeks to use this writ as a means to prevent the c ourt f rom \ncausing further delays by setting opposing counsel ’s improper motion to consolidate. \n3. Extraordinary Remedy : Courts have characterized a writ of prohibition as a \"drastic \nremedy\" and the legal equivalent of an equitable injunction ( In re Lewis , 223 S.W.3d 756, \n761, Tex. App.— Texarkana 2007). This is a drastic circumstance. The Respondent has\n\n4 \n been barred from his own residence for over a year without any explanation, and without \nany case prosecution in a  one-sided effort  to obtain relief  from facially void orders.  \n4. Last Resort : Prohibition is not appropriate if any other remedy, such as appeal, is \navailable and adequate ( In re Castle Tex. Prod. Ltd. P'ship, 189 S.W.3d 400, 404, Tex. \nApp.—Tyler 2006). Here, Respondent has no adequate remedy by appeal, because there is currently no court with continuous, exclusive juris diction over the children in this \nmatter.  \nIII. STATEMENT OF FACTS  \n5. On January 24, 2025, after more than 11 months of inaction, Petitioner  filed a Motion \nto Dismiss for Want of Prosecution in this court . The divorce ca"}
{"id": "56dac4f169e26423c2348447000a4bd9c834b4c3", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "n this \nmatter.  \nIII. STATEMENT OF FACTS  \n5. On January 24, 2025, after more than 11 months of inaction, Petitioner  filed a Motion \nto Dismiss for Want of Prosecution in this court . The divorce case has had  no substantive action \nfrom Petitioner  since April 2024, a legal ghost ship drifting without direction or purpose. That \nmotion wasn’t attempted to be set for hearing until September of 2024, only after the Respondent  exhausted all efforts seeking relief throughout the Texas Judiciary without any \nparticipation from the opposing side. \n6. On March 19, 2025, driven by mounting concerns about the  children’s welfare and \nlearning that the 322\nnd District Court did not have continuous, exclusive jurisdiction over the \nchildren in this matter , Petitioner  filed a new SAPCR in the 233rd District Court (Cause No. 233-\n765358- 25) seeking emergency relief for the children. The very next day, March 20, 2025, Ms. \nCarter suddenly reappeared like a character presumed missing  in the second act, filing an answer  \nto the SAPCR petition in this Court and thereby submitting to this Court’s  jurisdiction by filing a \nresponse rather than a motion to abate.\n\n5 \n 7. On March 21, 2025, Respondent  filed a verified Rule 12 motion challenging Ms. \nCarter’s  authority  in the 233rd to represent Petitioner  in the  matter —the second such challenge, \nmet with the same resounding silence as the first.  \n8. On March 25, 2025, Respondent  filed an Objection to Consolidation and an Ex- Parte \nEmergency Motion for TRO  in the 233rd. Two days later, on March 27, 2025, Respondent  \ncontacted the court coordinator, requested a date and time to present the motion, and served  the \ndocuments to the opposing party with the intent to present on March 28, 2025, at 9:00 A.M. \nbefore the Associate Judge of this Court. On that fateful morning of March 28, 2025, Respondent  \ndrove to the courthouse, paid for  parking, met with the coordinator, communicated with \nopposing counsel, and secured "}
{"id": "84eece5f1810b1a2e93d85a9c39cf6adf9f66991", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ate Judge of this Court. On that fateful morning of March 28, 2025, Respondent  \ndrove to the courthouse, paid for  parking, met with the coordinator, communicated with \nopposing counsel, and secured a hearing date of April 10, 2025 agreed by the parties . \nRespondent  then proceeded to the Associate  Judge’s courtroom to present the TRO. \n9. Before Respondent  could present his  case—before he  could speak a single word about  \nhis children’s welfare—he  was told that Ms. Carter would be filing a motion to consolidate in the \n322nd District Court, that his  motion was improperly before  the 233rd court, and the Associate \nJudge refused to hear the motion. It was a curious thing, this refusal. Ms. Carter wasn’t even present in the  courtroom, yet her words carried more weight than Respondent ’s physical \npresence,  his properly filed papers, and most importantly, the urgent needs of his  children. She \nstopped the proceedings  with nothing more than word of mouth for the incorrect motion. A true \nshowcasing of disregard for the process, and the children. \n10. On April 2, 2025, Respondent  filed a Pre- Objection to Motion to Consolidate in the \n322\nnd District Court. Ms. Carter’s motion to consolidate wasn’t filed with the 322nd District \nCourt until April 3, 2025, six days after she used its mere possibility to  prevent the 233rd Court\n\n6 \n from hearing Respondent ’s emergency motion. Her motion disregarded  Respondent ’s pre-\nobjection entirely, as if it were invisible ink on the page.  \n11. On April 4, 2025, unable to acquire a ruling due to Respondent ’s objection, Ms. \nCarter  attempted to set the motion for a hearing before the 322nd District Court. That  same day, \nRespondent  filed a Pre- Objection to Motion to Transfer in the 233rd Court, given that  a motion \nto transfer must come before any attempt at consolidation. Ms. Carter, who had been so urgently \nconcerned about consolidation when it  served to block Respondent ’s emergency hearing, \nsuddenly claime"}
{"id": "8f248023723a87b1d7699112fc33230e636cf38f", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "o transfer must come before any attempt at consolidation. Ms. Carter, who had been so urgently \nconcerned about consolidation when it  served to block Respondent ’s emergency hearing, \nsuddenly claimed to be unavailable until  late April —causing significant delays that could have \nbeen avoided had the 233rd Court simply heard the motion before it on March 28, 2025.  \n12. Throughout this period of procedural maneuvering, the  children have been  subjected \nto psychological manipulation and medical neglect. They have been removed from Petitioner’s  \ncare and placed with elderly great -grandparents  on a daily basis , and are being gaslighted into a \nfalse belief that the  divorce is finalized. Respondent ’s eldest child’s academic performance has \nplummeted,  and both children have become emotionally estranged from both parents. \nRespondent  has suffered approximately $110,500 in verifiable financial damages due to being \nlocked out of his  home  and business, and it grows each day. But the  financial toll pales in \ncomparison to the emotional cost of watching Respondent ’s children  suffer while the courts \nexchange procedural ly incorrect  volleys over his head.  \nIV. THE PROHIBITION PREDICAMENT  \n13. The writ of prohibition exists for precisely this sort of situation —where a court is \nabout to act in a way that exceeds its authority and threatens to compound an already untenable situation. The law on this matter is as clear as a bell on a still morning:\n\n7 \n A. The Procedural Parade Must Follow Its Proper Order \n14. The Texas Family Code establishes a clear sequence for the consolidation of cases \nfrom different courts. First, a motion to transfer must be filed and granted, bringing both cases \ninto the same court. Only then may a motion to consolidate be considered. Se e Tex. Fam. Code \n§§ 155.201 and 6.407. \n15. This isn't merely a matter of dotting i's and crossing t's —it's the fundamental roadmap \nthat ensures cases proceed in an orderly fashion. A court can"}
{"id": "efba453ed06eda6fd21fbe6f6fadd1ebcb49d614", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": " Se e Tex. Fam. Code \n§§ 155.201 and 6.407. \n15. This isn't merely a matter of dotting i's and crossing t's —it's the fundamental roadmap \nthat ensures cases proceed in an orderly fashion. A court cannot consolidate what it does not possess, any more than a chef can cook ingredients that haven't yet been d elivered to the kitchen.  \n16. The Texas Supreme Court has consistently held that courts must follow proper \nprocedural sequence. In re Southwestern Bell Tel. Co., 35 S.W.3d 602, 605 (Tex. 2000). When a court attempts to rule on a matter for which it lacks jurisdiction or authority, prohibition is the appropriate remedy . In re Lewis , 223 S.W.3d 756, 761 (Tex. App.—Texarkana 2007, orig. \nproceeding).  \n17. Respondent is  no legal scholar with a library of case law memorized, but even he  can \nsee that this principle is as plain as a full moon on a cloudless night. This Court's potential willingness to hear a motion to consolidate before a motion to transfer has been filed and granted would be like a judge sentencing a defendant before the trial has begun— a clear inversion of the \nproper order of legal proceedings.  \nB. The Discretion Dilemma  \n18. The writ of prohibition as used in Texas has three functions:  1) preventing \ninterference with higher courts in deciding a pending appeal, 2) preventing inferior courts from entertaining suits that will relitigate controversies which have already been settled by issuing\n\n8 \n courts, and 3) prohibiting a trial court's action when it affirmatively appears that the court lacks \njurisdiction.  Texas Capital Bank -Westwood v. Johnson, 864 S.W.2d 186, 187 (Tex.App.-\nTexarkana 1993, orig. proceeding) . Here, function three is directly relevant. A court cannot hear a \nmotion to consolidate a case it does not have before it.  \nC. Opposing  Counsel's Conduct  \n19. Ms. Carter's behavior throughout this saga deserves special attention, like a character \nin a novel whose actions consistently contradict their stated intentions . \n2"}
{"id": "ba43fe48a78528ca219328228b1f8f756e8fdb51", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "Opposing  Counsel's Conduct  \n19. Ms. Carter's behavior throughout this saga deserves special attention, like a character \nin a novel whose actions consistently contradict their stated intentions . \n20. She abandoned the divorce case for nearly a year, filing nothing since April 2024, \nonly to suddenly reappear when Respondent  sought emergency relief for the children —like a \nfirefighter who ignores a smoldering house for months, only to rush in when someone else calls \nfor help.  \n21. She filed an answer in the 233rd Court, thereby submitting to its jurisdiction, only to \nthen argue that the case belongs in this Court —a contradiction as glaring as claiming to be both \ninside and outside a room simultaneously.  \n22. She used the mere possibility of a future filing to block an emergency hearing, then \nwaited six days to file  the motion —a delay that speaks volumes about the true urgency of the \nmatter. \n23. She filed a motion to consolidate without first filing a motion to transfer, putting the \nprocedural cart before the horse in a manner that defies both logic and law.\n\n9 \n 24. She now claims to be unavailable until late April, creating further delay after using \nthe urgency of consolidation to block Respondent ’s emergency hearing —a scheduling \ncontradiction that would be comical if not for the children caught in its web. \n25. This pattern reveals a tactical attempt to manipulate both courts' dockets to prevent \nme from obtaining timely relief. It's a shell game played with Respondent ’s children's welfare as \nthe prize. This Court should not allow itself to be used as an instrument in such procedural \ngamesmanship, particularly when children's lives hang in the balance.  \nV.  MORAL  FIBER  \n26. If there's a lesson to be drawn from this procedural quagmire, it's that the law's \ncomplexity should never obscure its fundamental purpose: to provide justice, particularly for those most vulnerable. My children—innocent bystanders in this adult conflict —have become "}
{"id": "4a66b6c86144fbe316605bd8b5248327f05b8fe8", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "hat the law's \ncomplexity should never obscure its fundamental purpose: to provide justice, particularly for those most vulnerable. My children—innocent bystanders in this adult conflict —have become \ncollateral damage in a game of procedural chess where the rules seem to change with each move.  \n27. It has been stated that the true measure of a society is found in how it treats its most \nvulnerable members. By that measure, the procedural labyrinth that has prevented the 233rd Court from hearing Respondent ’s emergency motion, and now threatens to compound the error \nby having this Court act prematurely, speaks volumes about how far we have strayed from the ideal of justice.  \n28. Respondent  provide this notice not out of anger or vindictiveness, but out of that \nquiet, bewildered astonishment that settles in a person's bones when they've witnessed the law being twisted into shapes that would make a carnival contortionist blush with envy. Respondent followed the rules . He honored the procedures. He placed his  faith in a system that promised \njustice would flow like water, clear and unobstructed, to those who seek it properly.\n\n10 \n 29. Behind every case number, behind every filing, behind every procedural rule, there \nare real children with real lives that continue whether the courts act or not. Time doesn't stop for \nthem while adults sort out procedural disagreements. They grow, they hur t, they form memories \nand impressions that will shape them for a lifetime.  \n30. As Mark Twain might have observed, the difference between proper procedure and \nimproper procedure is not merely academic —it's the difference between justice served and \njustice denied, between children protected and children neglected, between a system that  works \nand one that merely pretends to. \nVI. CONCLUSION AND PRAYER  \n31. I respectfully request that this Court pause, reflect on the procedural peculiarity \nbefore it, and decline to hear a motion to consolidate until the proper preliminar"}
{"id": "06c65332f95280af3b789a7e361ec4cc18487f5f", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "\nVI. CONCLUSION AND PRAYER  \n31. I respectfully request that this Court pause, reflect on the procedural peculiarity \nbefore it, and decline to hear a motion to consolidate until the proper preliminary steps have been taken. Specifically, I ask that this Court:  \na. Recognize that it lacks jurisdiction to hear a motion to consolidate until a motion to transfer has been filed in the 233rd Court and granted;  \nb. Take judicial notice that Petitioner submitted to the 233rd Court's jurisdiction by answering the SAPCR petition;  \nc. Acknowledge the improper procedural sequence attempted by Petitioner's counsel in filing a motion to consolidate without first filing a motion to transfer; \nd. Consider that proceeding with a hearing on the consolidation motion would only \ncompound the procedural irregularities and further delay relief for the children;\n\n11 \n e. Recognize that the 233rd Court has the power and jurisdiction to address the \nemergency concerns raised in my TRO motion, which remains unopposed on the record.  \nf. Using the court ’s own inherent power, dismiss the divorce outright for failure to \nprose cute given the circumstances of this case.  \nRespondent  understands  that in most situations, courts give deference to licensed attorneys over \nself-represented litigants. But the procedural impropriety here is so glaring, so fundamental, that \nit transcends the usual presumptions. Even a layperson can see that you cannot consolidate what you do not possess, just as you cannot serve a meal with ingredients you haven't yet purchased.  \nThe children deserve better than to have their fate determined by procedural sleight of hand. They deserve courts that follow the law's clear sequence, that prioritize substance over form, and \nthat remember that behind every procedural rule are real lives hanging in the balance. The truth \nof this matter can  only be revealed once the injustices are duly corrected by this court. \n Respondent has fil ed a similar notice to the 233\nrd c"}
{"id": "dd34b9100f13ee9e485b290529e2a544ad7d7d57", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "le are real lives hanging in the balance. The truth \nof this matter can  only be revealed once the injustices are duly corrected by this court. \n Respondent has fil ed a similar notice to the 233\nrd court informing of the intent to file a \nwrit of mandamus to compel a ruling on the emergency TRO that w as un lawfully blocked from \nbeing heard by COOPER L. CARTER. \n \n Respectfully submitted,  \n \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE\n\n12 \n  \nCERTIFICATE OF SERVICE  \n \nRespondent, CHARLES DUSTIN MYERS, certifies that, pursuant to Rule 21a of the Texas \nRules of Civil Procedure that:  \n \nA copy of this NOTICE has been served to MORGAN MICHELLE MYERS through her EFM \nregistered under MORGANMW02@GMAIL.COM  \n \nA copy of this NOTICE has been provided to COOPER L. CARTER through her email \nCOOPERCARTER@MAJADMIN.COM  \n \nA copy of this NOTICE has been served to HOLLY HAYES through her EFM registered email \naddress: CSD -FILER914@TEXAS.OAG.GOV  \n \nServed on: 04/07/2025 \n \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99359862\nFiling Code Description: Notice\nFiling Description: Notice of Intent to Seek Writ of Prohibition\nStatus as of 4/7/2025 4:31 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PMStatus\nSEN"}
{"id": "26e8284214dbbbce982daf30fff7ab21db3a944b", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1\\04_07_25_notice_of_intent_to_file_writ_of_prohibition_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE OF INTENT TO FILE WRIT OF PROHIBITION-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 216, "text": "il.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PM\n4/7/2025 1:57:58 PMStatus\nSENT\nSENT\nSENT\nSENT"}