{"id": "1bf6377d516ad138e77ee1f6d9b8fb612e057df8", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 233- 765358- 25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE JUDGE OF SAID COURT:  \n \nI. INTRODUCTION \n \nThere comes a time in the journey of life when a man finds himself standing \nin the same muddy footprints he left as a child, gazing up at the same towering \ncourthouse steps, and feeling that same sinking sensation in his chest. It’s a peculiar \nthing, this cycle of disappointment —to have lived it once as a bewildered child and \nthen again as a rule- abiding adult. The faces change, the dates on the calendar \nadva nce, but the feeling remains as familiar as an old, worn book. \nPetitioner comes before this Court not with anger burning in his chest, nor \nwith vindictiveness poisoning his pen, but rather with that quiet, heavy disappointment that settles in a person’s bones when they’ve done everything by  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n PETITIONER’S NOTICE OF INTENT TO \nFILE MANDAMUS AND EMERGENCY \nSTAY  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -04-07\n\n2 \n the book only to find the book itself has been shelved away, forgotten by those \nsworn to read from it.  \nPetitioner followed the rules. He honored the procedures. He placed his faith \nin a system that promised justice would flow like water, clear and unobstructed, to those who seek it properly. He lived under the façade of facially void orders, and sustained e xtraordinary damages that were all caused intentionally by one person: \nthe Respondent , who has sat in complete silence as this breakdown has continued \nto occur.  \nYet here stands Petitioner, a father twice removed —once from his home \nand once from his children—knocking on the courthouse door with papers properly filed, only to be told that the door shall remain closed because someone else might, at some future date, file papers at another door entirely. If this strikes the Court as a curious interpretation of justice, then we find ourselves in rare a"}
{"id": "2061ca4e4af4ff512076a422c2db87273e3d2009", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " remain closed because someone else might, at some future date, file papers at another door entirely. If this strikes the Court as a curious interpretation of justice, then we find ourselves in rare agreement.  \nMark Twain once observed that “the difference between the almost right word and the right word is really a large matter —it’s the difference between the lightning bug \nand the lightning.” In matters of law and children’s welfare, the difference between almos t justice and actual justice is equally vast—it’s the difference between \nchildren thriving and children suffering, between a father’s presence and his absence, between following the law and merely gesturing toward it.  \nThe Petitioner is now in an extraordinary circumstance. On one hand, he \nmust seek mandamus relief respectfully compelling this Court to fulfill its\n\n3 \n ministerial duty to hear and rule on Petitioner’s properly file d emergency TRO , \nwhich this Court refused to hear on March 28, 2025. The refusal came not from any \ndefect in the filing itself, but solely from representations made by opposing counsel \nregarding a future filing in another  court which she abandoned—a procedural \nsleight of hand that has left children in distress and a father without an adequate \nremedy for an appeal.  \nOn the other hand, the Petitioner must prohibit the 322nd District Court from \nsetting a matter for a hearing that cannot bear a valid result through a concurrent \nWrit of Prohibition. The proper procedure wasn’t followed, and cannot be \noverlooked in the face of an emergency.  \n In essence, a procedurally improper forward- looking consolidation motion \nto be filed in a different court was used to block a properly filed emergency TRO \nbefore this court. The court cannot rule on a case not before it, and mandamus is \nthe proper remedy here if this court refuses to act. Given the extraordinary circumstances of this matter, and given there has been no response or opposition to \nthe relief being requested, th"}
{"id": "5bf328c069cee5fd092b3b09f1c08409a3f7a8ef", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "mus is \nthe proper remedy here if this court refuses to act. Given the extraordinary circumstances of this matter, and given there has been no response or opposition to \nthe relief being requested, the court should grant the emergency TRO \nimmediately through a written order delivered to all the parties via the \nelectronic filing manager, set the matter for a hearing 14 days from the signing of \nthe order, and require a written response from the opposing party no later than 7 \ndays prior to the hearing.\n\n4 \n  Despite the circumstances of this case, Petitioner feels that settlement will \nand could be a possibility in the future, but the priority remains to rebuild the status \nquo of the children that has been destroyed and regain the ability to provide for his children financially while damages are assessed and attended to. Petitioner is at the  very least entitled to this immediate relief .  He is not asking this court for anything \nmore than what it has the discretion to do and what the law demands  that it must do  \ngiven the circumstances . This intent to file mandamus is filed out of respect and \nserves as a notice to all parties of record of my position on this matter.  \nSuch absurdity should end with an order from this court in Petitioner’s \nfavor, and in support thereof, he shows the following unopposed facts:  \nII. STATEMENT OF FACTS  \n1. On January 24, 2025, after more than 11 months of inaction, Petitioner  \nfiled a Motion to  Dismiss for Want of Prosecution. The divorce case no \nsubstantive action from Respondent  since April 2024, a legal ghost ship drifting \nwithout direction or purpose. That motion wasn’t attempted to be set for hearing until September of 2024, only after the Petitioner exhausted all efforts seeking relief throughout the Texas Judiciary without any participation from the opposing side. \n2. On March 19, 2025, driven by mounting concerns about the  children’s \nwelfare and learning that the 322\nnd District Court did not have continuous, \n"}
{"id": "c1f178f9eb16256d84701a3feabbda464face8ce", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "thout any participation from the opposing side. \n2. On March 19, 2025, driven by mounting concerns about the  children’s \nwelfare and learning that the 322\nnd District Court did not have continuous, \nexclusive jurisdiction over the children in this matter , Petitioner  filed a new\n\n5 \n SAPCR in this Court (Cause No. 233- 765358- 25) seeking emergency  relief for \nthe children. The very next day, March 20, 2025, Ms. Carter suddenly reappeared \nlike a character presumed missing  in the second act, filing an answer  to the \nSAPCR petition in this Court and thereby submitting to this Court’s  jurisdiction \nby filing a response rather than a motion to abate.  \n3. On March 21, 2025, Petitioner  filed a verified Rule 12 motion \nchallenging Ms. Carter’s  authority to represent Respondent in this matter —the \nsecond such challenge,  met with the same resounding silence as the first.  \n4. On March 25, 2025, Petitioner  filed an Objection to Consolidation and \nan Ex -Parte Emergency Motion for TRO. Two days later, on March 27, 2025, \nPetitioner contacted the court coordinator, requested a date and time to present the \nmotion, and served the documents to the opposing party with the intent to present on March 28, 2025, at 9:00 A.M. before the Associate Judge of this Court.  On that \nfateful morning of March 28, 2025, Petitioner  drove to the courthouse, paid for  \nparking, met with the coordinator, communicated with opposing counsel, and secured a hearing date of April 10, 2025. Petitioner  then proceeded to the \nAssociate Judge’s courtroom to present the TRO.  \n5. Before Petitioner  could present his  case—before he  could speak a single \nword about  his children’s welfare—he  was told that Ms. Carter would be filing a \nmotion to  consolidate in the 322nd District Court, that his  motion was improperly \nbefore  the court, and that the Associate Judge refused to hear the motion. It was a\n\n6 \n curious thing, this refusal. Ms. Carter wasn’t even present in the  courtroom, yet \nher"}
{"id": "44e3808cb55c63db9dd72eca41457e18fa6f584d", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "motion was improperly \nbefore  the court, and that the Associate Judge refused to hear the motion. It was a\n\n6 \n curious thing, this refusal. Ms. Carter wasn’t even present in the  courtroom, yet \nher words carried more weight than Petitioner’s physical presence,  his properly \nfiled papers, and most importantly, the urgent needs of his  children. She stopped \nthe proceedings  with nothing more than word of mouth for the incorrect motion. \nA true showcasing of disregard for the process, and the children.  \n6. On April 2, 2025, Petitioner  filed a Pre -Objection to Motion to \nConsolidate in the 322nd District Court. Ms. Carter’s motion to consolidate wasn’t \nfiled with the 322nd District Court until April 3, 2025 —six days after she used its \nmere possibility to  prevent this Court from hearing Petitioner’s  emergency \nmotion. Her motion disregarded  Petitioner’s  pre-objection entirely, as if it were \ninvisible ink on the page. \n7. On April 4, 2025, unable to acquire a ruling due to Petitioner’s \nobjection, Ms. Carter  attempted to set the motion for a hearing before the 322nd \nDistrict Court. That same day, Petitioner  filed a Pre- Objection to Motion to \nTransfer in this Court, given that  a motion to transfer must come before any \nattempt at consolidation.  Ms. Carter, who had been so urgently concerned about \nconsolidation when it  served to block Petitioner’s  emergency hearing, suddenly \nclaimed to be unavailable until late April—causing significant delays that could \nhave been avoided had this  Court simply heard the motion before it on March 28, \n2025.\n\n7 \n 8. Throughout this period of procedural maneuvering, the  children have \nbeen  subjected to psychological manipulation and medical neglect. They have \nbeen  removed from Petitioner’s  care and placed with elderly great -grandparents  \non a daily basis , and are being gaslighted into a false belief that the  divorce is \nfinalized. Petitioner’s  eldest child’s academic performance has plummeted,  and \nboth "}
{"id": "8a8d8c2467f6a885cd2b6154b6330f216d477334", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "erly great -grandparents  \non a daily basis , and are being gaslighted into a false belief that the  divorce is \nfinalized. Petitioner’s  eldest child’s academic performance has plummeted,  and \nboth children have become emotionally estranged from both parents. Petitioner  \nhas suffered approximately $110,500 in verifiable financial damages due to being \nlocked out of his  home  and business, and it grows each day. But the  financial toll \npales in comparison to the emotional cost of watching Petitioner’s  children  suffer \nwhile the courts exchange procedural ly incorrect  volleys over his head.  \nIII. ARGUMENT  \nA. The Court's Ministerial Duty  \n9. It is well- established Texas law that a trial court has a ministerial \nduty—not a discretionary duty—to consider and rule upon motions properly filed \nand pending before it. In re Sheppard, 193 S.W.3d 181, 183 (Tex. App.—Houston [1st Dist.] 2006, orig. pr oceeding); In re Chavez, 62 S.W.3d 225, 228 (Tex. \nApp.—Amarillo 2001, orig. proceeding). The Texas Supreme Court has consistently held that while a court has discretion in how it rules on a motion, it has no discretion to refuse to rule at all. In re Blake ney, 254 S.W.3d 659, 661 \n(Tex. App.—Texarkana 2008, orig. proceeding) (\"When a motion is properly filed and pending before a trial court, the act of considering and ruling upon that\n\n8 \n motion is a ministerial act, and mandamus may issue to compel the trial judge to \nact.\").  \n10. This principle is not merely a procedural nicety but a fundamental \ncornerstone of our judicial system. When a court refuses to hear a properly filed motion, it effectively denies access to justice itself. As the Texas courts have repeatedly emphasized,  \"A trial court's refusal to rule on a pending motion within \na reasonable amount of time constitutes a clear abuse of discretion.\" In re Bonds, \n57 S.W.3d 456, 457 (Tex. App.—San Antonio 2001, orig. proceeding). This abuse is magnified exponentially when the motion concerns the welfare "}
{"id": "12678fad7686e971d889557a84ca8ae73a62fa22", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "e constitutes a clear abuse of discretion.\" In re Bonds, \n57 S.W.3d 456, 457 (Tex. App.—San Antonio 2001, orig. proceeding). This abuse is magnified exponentially when the motion concerns the welfare of children and seeks emergency relief.  \n11. The Court's refusal to hear Petitioner's properly filed emergency TRO \non March 28, 2025, constitutes a clear failure to perform a ministerial duty. This failure is particularly concerning  given that:  \na) The motion was properly filed and noticed for hearing and the parties agreed on a date and time set for April 10\nth, 2025;  \nb) Petitioner communicated with court staff, physically appeared at the courthouse ready to present the motion and was told he could present his motion ; \n    c) The motion concerned the immediate welfare of children; and  \n    d) The refusal was based solely on representations about a future filing in another court that had not yet occurred.\n\n9 \n B. Clear Abuse of Discretion  \n12. A writ of mandamus is appropriate when a trial court clearly abuses its \ndiscretion  and there is no adequate remedy by appeal . In re Prudential Ins. Co. of \nAm., 148 S.W.3d 124, 135- 36 (Tex. 2004); Walker v. Packer, 827 S.W.2d 833, \n840 (Tex. 1992) . An abuse if discretion is clearly established from point one \nbelow, and supported by points two through eight:  \ni. First, it refused to perform its ministerial duty to hear and \nrule on a properly filed motion based solely on representations \nabout a future filing in another court. It’s as if a doctor refused to \ntreat a bleeding patient because another doctor  might, at some \nfuture date, claim the patient should be treated at a different  \nhospital. \nii. Second, it failed to recognize that by answering the \nSAPCR petition in  this Court, Respondent submitted to this \nCourt’s jurisdiction and should have instead filed a motion to abate \nor should have moved to transfer the case. The law doesn’t allow \nfor half- measures of jurisdiction. \niii. Third, it failed to recogni"}
{"id": "cd737fa95c91df93bf4863e150ea863403f7e807", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "’s jurisdiction and should have instead filed a motion to abate \nor should have moved to transfer the case. The law doesn’t allow \nfor half- measures of jurisdiction. \niii. Third, it failed to recognize that this Court maintained \njurisdiction until any  transfer was completed pursuant to Texas \nFamily Code § 155.005( d) as no final order has been rendered in \nthe 322nd District Court. Jurisdiction  isn’t a hot potato to be\n\n10 \n dropped at the first mention of another court —it’s a  solemn \nresponsibility that remains until properly transferred.  \niv. Fourth, it failed to recognize that the proper procedure \nfor consolidation of cases  in different courts requires a motion to \ntransfer to be filed and granted before any motion to consolidate \ncan be considered, pursuant to Texas Family Code §§ 155.201 and \n6.407. The law provides a sequence, a proper order of operations, \nthat cannot be reversed or circumvented without creating \nprocedural delay, which is what the emergency TRO sought to \nprevent from occurring. \nv. Fifth, it allowed opposing counsel to circumvent proper \nlegal procedure by  influencing this Court’s decision without being \npresent and without having filed any response to the emergency \nTRO  properly before  this Court. It’s as if the referee in a football \ngame made a call  based on what someone in the parking lot said \nmight happen in the fourth quarter  when she had the rules of the \ngame mixed up.  \nvi. Sixth, it failed to consider that the purported “agreed” \norders in the divorce case  are void for lack of consent under \nBurnaman v. Heaton, 240 S.W.2d 288, 291 (Tex. 1951). A void \norder is no order at all —it’s a legal nullity, as insubstantial as a\n\n11 \n shadow on the wall. No court has continuous, exclusive \njurisdiction over the children in this matter.  \nvii. Seventh, it failed to recognize that the Associate \nJudge’s orders in the divorce  case were never properly adopted by \nthe referring District Court as required  by Texas Family Code "}
{"id": "60255c8fa5c94c4c3fcff1203b6911ca97b28e91", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "s matter.  \nvii. Seventh, it failed to recognize that the Associate \nJudge’s orders in the divorce  case were never properly adopted by \nthe referring District Court as required  by Texas Family Code § \n201.013(b). An unadopted order is like an unsigned check —it may \nlook official, but it carries no legal weight , yet it has been used to \nbar the Petitioner from his residence, business, and children, and \nimpose a disruptive and chaotic schedule upon the children.  \nviii. Eighth, and perhaps most troublingly, it disregarded \nthe children’s best interests  in favor of procedural considerations, \ncontrary to Texas Family Code § 153.002 and has languished for \nover a year due to the opposition’s failure to prosecute . \n \n12. The law is clear that in matters involving children, their welfare must \nbe the  court’s primary consideration—not procedural niceties, not docket \nmanagement,  and certainly not the convenience of opposing counsel. \nC. No Adequate Remedy by Appeal  \n13. When Justice Delayed Is Justice Denied  Petitioner has no adequate \nremedy by appeal for reasons that should stir the  conscience of any court:  The \nemergency nature of the injunctive relief sought requires immediate action, as\n\n12 \n Petitioner’s children are suffering immediate and ongoing harm while procedural \nissues remain unresolved . In re Texas Dep’t of Family & Protective Servs. , 255 \nS.W.3d 613, 615 (Tex. 2008) (granting emergency relief where children’s welfare was at immediate risk).  Petitioner’s children are being alienated from him,  \ncausing long-term psychological damage that cannot be undone by a favorable ruling months or years in the future. In re Scheller , 325 S.W.3d 640, 643 (Tex. \n2010) (recognizing that interference with the parent -child relationship can \nconstitute irreparable harm).  \n14. The improper procedural maneuvers by opposing counsel are causing \nsignificant delays that cannot be remedied through the normal appellate process. Each  day that passes is another da"}
{"id": "2bc15356b799e37553e6d672908cd2e39e4face0", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "ble harm).  \n14. The improper procedural maneuvers by opposing counsel are causing \nsignificant delays that cannot be remedied through the normal appellate process. Each  day that passes is another day the children suffer, another day their academic  \nperformance declines, another day they become more emotionally estranged  in a \nsituation that the law should’ve prevented from existing to begin with. \n15. Temporary orders in family law cases are generally not appealable, \nleaving  Petitioner in a procedural trap with no exit. Waiting for a final judgment \nto appeal would allow the improper procedural tactics to succeed, causing irreparable harm to Petitioner and his children. \n16. Void orders are being enforced against Petitioner, causing ongoing \nharm that cannot be adequately remedied by appeal. In re Sw. Bell Tel. Co., 35 \nS.W.3d 602, 605 (Tex. 2000). Petitioner is caught in a procedural echo \nchamber\n\n13 \n with no effective remedy, as both courts  have effectively denied him access to the \njudicial system. In re Team Rocket,  L.P. , 256 S.W.3d 257, 262 (Tex. 2008).  \nD. Opposing Counsel’s Contradictory Behavior  \n17. Cooper L. Carter’s contradictory behavior warrants particular \nattention, like a  character in a novel whose actions never quite align with their \nwords:  She zealously defended her client by filing an answer to the SAPCR in this \nCourt, thereby submitting to this Court’s jurisdiction, only to then influence this \nCourt  to refuse to hear Petitioner’s  properly filed motion by representing that she \nwould file a  motion to consolidate in the 322nd Court , which would be moot by \nstatute.  \n18. She had abandoned the divorce case for nearly a year, filing nothing \nsince April  24, 2024, only to suddenly reappear precisely when I sought \nemergency relief for  the children —like a firefighter who ignores a smoldering \nhouse for months, only to rush in when someone else calls for help. She failed to respond to a Rule 12 motion challenging her authority t"}
{"id": "3c43c367a4bdf8d16e4fb51513c37f28425bf384", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "or  the children —like a firefighter who ignores a smoldering \nhouse for months, only to rush in when someone else calls for help. She failed to respond to a Rule 12 motion challenging her authority to represent  \nthe Respondent, her silence speaking volumes about the nature of her  \nrepresentation.  She subsequently filed an improper motion to consolidate in the \n322nd Court  without first filing the required motion to transfer, putting the  \nprocedural cart  before the horse.  She is now claiming unavailability until late \nApril in the 322nd Court, creating unnecessary delay after using the urgency of consolidation to block Petitioner’s  emergency  hearing.\n\n14 \n 19. This pattern demonstrates a tactical attempt to manipulate both courts’ \ndockets  to prevent me from obtaining a timely hearing on Petitioner’s  properly \nfiled emergency  motion. It’s a shell game played with the  children’s welfare as \nthe prize.  This Court should not allow itself to be used as an instrument in such \nprocedural  gamesmanship, particularly when it involves a failure to perform a \nministerial duty required by law and when children’s welfare is at stake.  \nIV. CONCLUSION \n \nThis Court’s refusal to hear Petitioner’s properly filed motion constitutes a  \nfailure to perform a ministerial duty for which there is no adequate remedy  \nby appeal. The proper legal procedure requires a motion to transfer to be  \nfiled and granted before any motion to consolidate can be considered, and by \nanswering the SAPCR petition in this Court, Respondent submitted to this  \nCourt’s jurisdiction. \nThe children who are the subject of this proceeding are suffering \nimmediate and  ongoing harm while procedural issues remain unresolved. Each \nday that passes  without addressing the emergency concerns raised in Petitioner’s \nTRO is a day  of certain  damage to the children’s psychological well -being and \ndevelopment.  \nPetitioner once heard it said that the true measure of a society is found in \nhow it  treats"}
{"id": "60e79ec5c97f1199267142501456b4e8bf2d42a9", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "itioner’s \nTRO is a day  of certain  damage to the children’s psychological well -being and \ndevelopment.  \nPetitioner once heard it said that the true measure of a society is found in \nhow it  treats its most vulnerable members. By that measure, the procedural \nlabyrinth that has prevented this Court from hearing Petitioner’s emergency\n\n15 \n motion speaks  volumes about how far we have strayed from the ideal of justice. \nThe children — innocent, vulnerable, and deserving of the Court’s protection—\nhave instead  become collateral damage in a game of procedural chess.  \nPetitioner provides this petition not out of anger or vindictiveness, but out \nof that quiet, heavy disappointment that settles in a person’s bones when they’ve  \ndone everything by the book only to find the book itself has been shelved away.  \nPetitioner followed the rules. He reiterates that h e honored the procedures . He \nplaced his faith in  a system that promised justice would flow like water, clear a nd \nunobstructed, to those who seek it properly.  \nPetitioner asks this Court to remember that behind every case number, \nbehind every filing, behind every procedural rule, there are  often  real children \nwith real lives  that continue whether the courts act or not. Time doesn’t stop for \nthem while  adults sort out procedural disagreements. They grow, they hurt, they \nform  memories and impressions that will shape them for a lifetime.  \nAs Mark Twain might have observed, the difference between justice \nserved and  justice delayed is the difference between a father’s presence and his \nabsence,  between children thriving and children suffering, between following the \nlaw and  merely gesturing toward it.  \nV. PRAYER FOR RELIEF  \n \nWHEREFORE, PREMISES CONSIDERED , Petitioner respectfully \nrequests that this Court correct its error sua sponte, recognize the seriousness of\n\n16 \n this situation, and grant relief without delay given the extraordinary circumstances \nof this case. Petitioner specifically  "}
{"id": "e3069c4a03e9f34b068526401b548b746686bbfe", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "his Court correct its error sua sponte, recognize the seriousness of\n\n16 \n this situation, and grant relief without delay given the extraordinary circumstances \nof this case. Petitioner specifically  requests that this Court:  \ni. Immediately grant the  attached proposed order requesting an \nemergency TRO preventing the Respondent from barring Petitioner’s access to the matrimonial home located at 6641 Anne Court, Watauga, Texas 76148 pursuant to Texas Family Code § 105.001(b) and serve the order on all parties of record through the EFM pursuant to rule 21a of the Texas Rules of Civil Procedure ;  \nii. Have the parties confer with the court coordinator to set this matter \nfor a hearing within 14 days from the signing of the order, and require Respondent’s written response no later than 7 days before the hearing;  \niii. Take judicial notice that  this Court has personal jurisdiction over \nthe respondent  to issue a TRO  given her response to the original \nSAPCR;   \niv. Take judicial notice  that no opposition to the  requested  relief \nappears on record;  \nv. Grant such other and further relief as the Court deems just and necessary to protect the best interests of the children, under § 153.002 and aid the parties in satisfy ing Texas  State policy under § \n153.001.\n\n17 \n  Petitioner emphasizes that this request is urgent and narrowly \ntailored to avoid further procedural delay that places the children at risk.  \nRespectfully submitted,  \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE \n  \n \nCERTIFICATE OF SERVICE  \n \nRespondent, CHARLES DUSTIN MYERS, certifies that, pursuant to Rule 21a of \nthe Texas Rules of Civil Procedure that:  \n \nA copy of this NOTICE has been served to MORGAN MICHELLE MYERS \nthrough her EFM registered under MORGANMW02@GMAIL.COM  \n \nA copy of this NOTICE has been provided to COOPER L. CARTER through her \nemail COOPERCARTER@MAJADMIN.COM  \n \nA copy of this NOTICE has been served to HOLLY "}
{"id": "a40649e1afa9a6481b1d99795e21e81ebf02479c", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_07_25_notice_intent_to_file_mandamus_1\\04_07_25_notice_intent_to_file_mandamus_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.07.25 - NOTICE - INTENT TO FILE MANDAMUS-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 413, "text": "M registered under MORGANMW02@GMAIL.COM  \n \nA copy of this NOTICE has been provided to COOPER L. CARTER through her \nemail COOPERCARTER@MAJADMIN.COM  \n \nA copy of this NOTICE has been served to HOLLY HAYES through her EFM \nregistered email address: CSD -FILER914@TEXAS.OAG.GOV  \n \nServed on: 04/07/2025 \n \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE"}