{"id": "ffe651f5a9507bbf7ae9caba821ecf0993f6947e", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 233- 765358- 25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE  COURT:  \n Petitioner, CHARLES DUSTIN MYERS, brin gs for ward this no tice to the court, and  \nrespectfully shows the following:  \nI. STATEMENT OF FACTS  \n 1. On  March 19, 2025, Petitioner opened a separate SAPCR suit in this court to escape  \nprocedural abandonment from the 322nd district court and lack of prose cution from the opposing  \ncounsel  and a cover letter explaining why the suit was properly before the court.  \n 2. On March 20, 2025, Respondent answered this suit in a pleading file d by a non- party,  \nRODERICK D. MARX.  \n 3. Subsequently, Respondent , through RODERICK D. MARX, a non party, filed a  \nMOTION TO CONSOLIDATE  on March 20, 2025. \n 4. On March 20, 2025, Petitioner filed a MOTION TO STRIKE RESPONDEN T’S  \nANSWER AND MOTION TO CONSOLIDATE.  \n 5. On March 21, 2025, Petitioner filed a verified motion challenging COOPER L.  \nCARTER’ S authority to represent the Respondent in this matter.  \n 6. On Mar ch 24, 2025, COOPER L . CARTER reached out to the court coordinator for the   \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n NOTICE  AND LEGAL ANALYSIS  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -04-10\n\n233rd, and stated “ Could you please provide dates and times that the Court is available to hear my \nmotion? ”. \n 7. On March 2 4, 2025, the  court coordinator, a non- lawyer, provided responded with \n“[t]he Motion to Consolidate just needs to be filed in the 322nd Divorce case and sent to their \nJudge to sign; no hearing necessary, it’s a mandatory consolidation.  \n 8. On March 25, 2025, Petitioner f iled an EMERGENCY EX -PARTE TRO for the safety \nand we lfare of the minor children named in this suit.  \n 8. On March 27, 2025, Petitioner reached out to the coordinator and informed the court \nhe intended to present the TRO to the court on March 28, 2025, at 9:00 A.M. \n 9. Later that evening, without contacting the Petiti "}
{"id": "5aca3d76424b2a9375054268083ff7c5cd22bee1", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "5, Petitioner reached out to the coordinator and informed the court \nhe intended to present the TRO to the court on March 28, 2025, at 9:00 A.M. \n 9. Later that evening, without contacting the Petiti oner, the opposing counsel reached out \nand mentioned a forward consolidation motion that would be filed at a alter date, and requested \nto be “ patched in”  to the judge during the presentation of the TRO despite not providing any \nwritten response.  \n 10. On March 28, 2025, Petitioner got ready, drove to court, paid for parking, met with \nthe coordinator, contacted opposing counsel, and everyone agreed to set the TRO for a full \nhearing on April 10, 2025, and Petiti oner went before the Associate Judge to have his emergency \nmotion heard. \n 11. Prior to being called up to present, the Associate Judge left the room, and came back \nand decline d to hear the emergency TRO outright.\n\n12. The reason provided was that “the consolidation motion was filed in the wrong court ” \nand that a forward -looking consolidation motion warranted outright refus al of the emergency \nTRO before her.  \n 13. The referenced consolidation motion was not filed until April 3, 2025, in the 322nd \nDistrict Court of Tarrant County , and COOPER L. CARTER’ S availab ility suddenly dried up, as \nshe earliest possible date to hear the  motion filed in the 322nd was April 24th despite just telling \nthis court she could hear the TRO on April 10th, 2025. \n 14. This unnecessary delay in the face of an emergency is the exact reason why Petitioner \nopene d the SAPCR, and notif ied this court of his intention to file a PETITION FOR WRIT OF \nMANDAMUS in the second court of appeals.  \n 15. On April 8, 2025, prior to the submission of his MA NDAMUS, the Petitioner reached \nout to the court coordinator of this court, a nd explained that he would be filing Mandamus, and \nhe wanted to ensure that the District Judge of the 233rd was made aware of the situation out of \nprocedural fairness and transparency.  \n 16. The"}
{"id": "9f835502db8d20d1e916de7a0c189b4adb1d4dba", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": " a nd explained that he would be filing Mandamus, and \nhe wanted to ensure that the District Judge of the 233rd was made aware of the situation out of \nprocedural fairness and transparency.  \n 16. The coordinator replied with “ I’m sorry, I cannot help you.  Per Judge Stone this \nmatter is to be taken up with the 322nd.” \n 17. Two days later, without any notice to the parties, without any hearing set , without \naddressing the objection on file , and before transferring the case, the District Judge of this court \nsigned and filed an order titled ORDER ON MOTION TO CONSOLIDATE . \n 18. The court has shown it has the ability to act on its ’ own accord, but intentionally \nchose the path of most resistance.\n\n19. The court is misapplying the law in several areas and  is blatantly violating due \nprocess in the face of an emergency . \n 20. Furthermore, the court is causing undue delay and prejudice to the Petitioner a nd is \ndenying him equal protection under the U.S. Constitution by refusing to allow him to subm it \nexhibits, granting orders sua sponte without his input or without a scheduled hearing, and is now \nactively rubb er-stamping  boilerplate  orders wit hout any logical basis.  \n 21. This i nformation will be supplemented into the Petitioner ’s PETITION FOR WRIT \nOF MANDAMUS,  as th e court ’s collective actions with the opposing counsel and recent \nerroneous order showcase a  clear  attempt to thwart the Mandamus proceedings, deprive the \nPetitioner of a n ability to accurately make a record , and disregard Texas law at the most \nfundamental level.  \nLEGAL ANALYSIS  \nLack of Notice and Hearing  \n1. A Texas district court’s sua sponte consolidation of cases without notice or a hearing  \noffends fundamental due process and violates Texas procedure. Texas Rule of Civil Procedure 21(b) mandates that any motion and “notice of any court proceeding…must be served upon all \nother parties not less than three days before the time specified for the court proceeding ”. This "}
{"id": "54a2a9309556eb62a5149d2e6dfbeb2701313296", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "Procedure 21(b) mandates that any motion and “notice of any court proceeding…must be served upon all \nother parties not less than three days before the time specified for the court proceeding ”. This \nrule exists to ensure each party has an opportunity to be heard and to prepare objections . \n2. Consolidating two family law cases without giving the parties notice or a chance to be \nheard flouts this requirement and thus constitutes an abuse of discretion . The Texas Supreme \nCourt recognizes that “[f]ailure to give notice violates ‘the most rudimentary demands of due \nprocess”  Armstrong v. Manzo, 380 U.S. 545, 550, 85 S.Ct. 1187, 14 L.Ed.2d 62 (1965)) . While a\n\nlack of notice or hearing may not automatically render an order void, it does render it voidable as \na due process violation. In short, entering a consolidation order on its own motion, without any \nparty setting the matter for submission or hearing, deprives the objecting party of the fair process guaranteed by Rule 21 and the Fourteenth Amendment . \n3. The judge’s failure to hold a hearing here is especially egregious because Petitioner \nhad filed a written objection  in this court , and a pre -objection in the 322\nnd district court,  putting \nboth court s on notice that consolidation was contested.  \nB. Ignoring the Written Objection  \n 4. Consolidating in the face of a pending written objection – without addressing or \nformally overruling that objection – is contrary to Texas procedure and due process. Texas Rule \nof Civil Procedure 174 authorizes consolidation only “[w]hen actions involving a common \nquestion of law or fact are pending before the court”  and anticipates that the court will exercise \n“sound and legal discretion” to avoid prejudice  to the parties .  \n 5. Here, the objector squarely raised their opposition in writing, yet the court neither held \na hearing nor entered any ruling on the objection before ordering consolidation. In analogous contexts, the Texas Supreme Court has insisted tha"}
{"id": "dd81040fff6bae72a2f91edede3a156625c0eafa", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "heir opposition in writing, yet the court neither held \na hearing nor entered any ruling on the objection before ordering consolidation. In analogous contexts, the Texas Supreme Court has insisted that a trial court must not proceed to decide a matter while an objection or lack of consent is known and unresolved. For example, in Burnaman v. Heaton, the high court held it improper for a court to sign an agreed judgment when it knows a party has withdrawn consent; “ consent must exist at the very moment the court \nundertakes to make the agreement the judgment of the court ”.  \n6. When a trial judge is aware that one party does not consent or objects, the judge should \nrefuse to approve the proposed action without hearing the party’s challenge . By analogy, the \njudge here had notice that consolidation was contested yet proceeded regardless – effectively\n\ntreating the motion as if unopposed. This undermines the purpose of Rule 174, which is to \npromote convenience without unfairly prejudicing  a party’s rights . \n7. Ignoring a live objection also violates basic due process, as it denied the objecting \nparty any forum to argue why consolidation was improper (for example, due to dominant jurisdiction or prejudice). In sum, issuing the order without addressing the objecti on was a clear \nabuse of discretion . At minimum, the consolidation order is voidable for lack of due process and \nshould be vacated upon a proper challenge. If the objection went entirely unheard, the order’s validity is highly suspect under Burnaman’s mandate of a party’s right to be heard before an adverse order . Id. 240 S.W.2d 288, 291 (Tex. 1951) . Here, that is what happened.  \nC. No Transfer of Venue  8. The situation is compounded if the two suits were in different courts and the judge \nconsolidated “without first transferring venue from the newer court to the older case.”  \nUnder Texas law, when two courts have concurrent jurisdiction over related SAPCR or family \nlaw matters, the first -filed "}
{"id": "14b4c650d632cc7c714f130567ed98f27f6c771d", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": " “without first transferring venue from the newer court to the older case.”  \nUnder Texas law, when two courts have concurrent jurisdiction over related SAPCR or family \nlaw matters, the first -filed case enjoys “dominant jurisdiction” . The Texas Supreme Court’s \nseminal decision in Curtis v. Gibbs  instructs that “Any subsequent suit involving the same \nparties and the same controversy must be dismissed if a party to that suit calls it to the court’s attention.”  Id. 511 S.W.2d 263 (1974) . \n 9. Texas Family Code §155.201 (the continuing exclusive jurisdiction statute) requires \nthat when a SAPCR is pending in one court and a new proceeding concerning the child is filed in another court, the second action must be transferred  to the court with continuing jurisdiction. In \nfact, transfer is a necessary condition precedent to consolidation in such situations . See In the \nInterest of J.V .O. and J.R.O. III ., No. 04- 20-00346- CV (Tex. App. – San Antoni o, 2021). The \nFourth Court of Appeals recently emphasized that a motion to “consolidate” an earlier SAPCR\n\nwith a later divorce implied a mandatory transfer; while labeled a consolidation, it \n“accomplished the same purpose”  as a transfer, and the judge signing the order was effectively \nacting on behalf of the SAPCR court to effect the required transfer . Id.  \n 10. By contrast, in our case no such transfer order or exchange of benches occurred. The \nnewer case was never properly vested  in the court that assumed control. A judge cannot \nunilaterally reach out and seize a case from another court’s docket without a statutory transfer. Thus, to the extent the consolidation order was entered without a valid transfer of venue or jurisdiction , it is void (not merely voidable) for want of subject- matter jurisdiction over the \nsecond case. An order entered without jurisdiction “had no effect” and can be attacked at any \ntime.  \n11. Even when  the cases were in the same county , such as here, local practice requires a \n"}
{"id": "5376b31acae7646187699388610b0bed967edaf0", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "the \nsecond case. An order entered without jurisdiction “had no effect” and can be attacked at any \ntime.  \n11. Even when  the cases were in the same county , such as here, local practice requires a \nmotion to transfer and consolidate be filed in the earliest case and heard by that court . Here, the \njudge consolidated into the older case sua sponte  without the new case ever being properly \ntransferred. This end- run around the usual venue transfer process is inconsistent with Curtis v. \nGibbs  and Texas’s dominant -jurisdiction doctrine. It suggests the consolidation order is \nprocedurally invalid and should be treated as a nullity.  \nVoid or Voidable?  12. Given the above defects, one must determine whether the consolidation order is void \nab initio or merely voidable (subject to reversal upon direct attack). Under Texas law, an order is void if the court lacked jurisdiction or capacity to act, whereas an order issued in violation of procedural requirements (but within the court’s jurisdiction) is typically voidable . Travelers Ins. \nCo. v. Joachim , 315 S.W.3d 860, 863 (Tex.2010).\n\n13. In this case, the consolidation was accomplished through serious procedural \nirregularities: no notice, no hearing, ignoring a filed objection, and, critically,  no proper transfer \nof the case between courts. The strongest argument for treating the order as void  is the lack of \njurisdictional authority to consolidate without a transfer. Because the newer SAPCR was never \nformally transferred, the judge who consolidated may have had no power over that case or the subject matter – a jurisdictional flaw rendering the order void.  14. On the other hand, to the extent the court did  have subject -matter jurisdiction , such as \nhere, the consolidation order’s other defects o f no notice, hearing, or considering the objection, \nwould make it voidable for abuse of discretion, but not absolutely void. Even then, Texas courts have held that proceeding without the required notice or hearin"}
{"id": "27a66664b3f1db193342deeb8eeb621ce95daa21", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "hearing, or considering the objection, \nwould make it voidable for abuse of discretion, but not absolutely void. Even then, Texas courts have held that proceeding without the required notice or hearing is a due process violation  \nwarranting reversal .  \n 15. In either event, the order cannot stand. If void, it can be attacked anytime  (even \ncollaterally); if voidable, it must be set aside through direct appellate relief. Here, the Petitioner \nhas promptly sought relief, so whether labeled void or voidable, the improper consolidation \nshould be vacated. Notably, the order’s timing—issued while a mandamus was pending on the TRO—further indicates it was a mechanism of expediency rather than a valid judicial act , \nreinforcing that it should carry no legal force.  \nConflict with Texas Supreme Court Precedent  \n 16. By consolidating the newer action into the older one on its own motion – rather than \ndismissing or abating it –  the trial judge here achieved the opposite of Curtis : instead of \neliminating the conflict, the judge effectively absorbed the second suit without following the safeguards (notice, transfer order, etc.) that Curtis  and its sister cases require. The consolidation \norder thus violates the spirit of Curtis v. Gibbs , which is to uphold the orderly administration of\n\njustice and prevent “unseemly conflict” between courts. Most egregious, is the court continues to \nincorrectly apply the law in the face of an emergency.  \nEffect on the Pending Mandamus  \n 17. Finally, Petitioner  addresses whether the trial court’s consolidation gambit – executed \nwhile a mandamus proceeding is pending involving the very TRO the consolidation moots  \nsucceeded in depriving the appellate court of jurisdiction.  \n18. It did not. A party cannot, by procedural manipulation, divest the Court of Appeals of \nits power to review a serious abuse of discretion. Even if the  consolidation  order is merely \nvoidable, equity and public policy counsel against treating the mandamu"}
{"id": "edda3ba64628a48fe4ba9f2547ee5be69669fadc", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": " divest the Court of Appeals of \nits power to review a serious abuse of discretion. Even if the  consolidation  order is merely \nvoidable, equity and public policy counsel against treating the mandamus as moot. Texas \nappellate courts have recognized that they may proceed to decide an issue that is “technically” moot when the surrounding circumstances indicate manipulation or when the underlying problem is capable of repetition yet evading review. Here, the timing and method of the consolidation suggest it was done for the express purpose of “mooting” the mandamus complaint \nabout the TR O. Courts disfavor such tactics. As Chief Justice Hecht has observed, mandamus \nrelief acts on a judge’s conduct, not merely on the existence of an order: “Unlike remedies \ngranted by appeal, a mandamus writ is not an action on an order or judgment but is instead an order against the respondent to correct a clear abuse of discretion .” In other words, the appellate \ncourt’s mandamus jurisdiction is “original, not derivative of the trial court’s order” , and \ncannot be defeated by the trial court attempting to obscure jurisdiction.  \n19. Allowing the consolidation to moot the mandamus would reward the very procedural \ntrickery that the appellate process is designed to check. The Second Court of Appeals should therefore retain jurisdiction to review the TRO issue (and the consolidation order itself, if necessary) despite the trial court’s attempt to merge the cases. Texas law is clear that a trial court\n\ncannot evade appellate review  by unilateral actions. For example, in Curtis v. Gibbs  the \nSupreme Court granted mandamus to undo conflicting orders, ensuring the first court’s orders \n(like a TRO or injunction) were subject to proper review . \n20. Likewise here, the consolidation that “mooted” the TRO is itself fatally flawed, and \nthe appellate court may address that defect. The appellate court can either: (1) disregard the consolidation as void and decide the mandamus on its merit"}
{"id": "c341d4f65f7cd99db6130c24eb33d171b806ed8f", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "mooted” the TRO is itself fatally flawed, and \nthe appellate court may address that defect. The appellate court can either: (1) disregard the consolidation as void and decide the mandamus on its merits, or (2) treat th e mandamus petition \nas also encompassing a challenge to the consolidation (given that it occurred post -filing) and \ngrant relief restoring the cases to their prior posture. Either route prevents a miscarriage of justice. The key point is that the Court of A ppeals’ mandamus power persists  in the face of \nthese procedural anomalies. A party’s right to appellate review of a void/voidable order cannot be defeated by the trial judge’s self- help remedy of consolidation. If it were otherwise, a trial court \ncould always attempt to moot pending appeals or mandamus actions by hurriedly altering the status quo – a result no appellate court should countenance.  \nConclusion \nIn sum, a sua sponte consolidation under these circumstances is rife with legal error. It \nviolated the notice and hearing requirements of Rule 21, ignored a pending objection (in derogation of due process and Burnaman), defied the dominant -jurisdiction rule (Curtis v. Gibbs ) \nby bypassing a required transfer, and appears calculated to evade appellate oversight. Such an order is invalid  – void if viewed as a jurisdictional transgression, or at least voidable as an abuse \nof discretion – and it cannot extinguish the appellate court’s authority to review the underlying TRO and the consolidation itself. The Second Court of Appeals should gra nt relief to undo the \nimproper consolidation, refuse to dismiss the mandamus as moot, and ensure that Relator’s objections are heard in an orde rly, lawful proceeding. This not only vindicates Relator’s due\n\nprocess rights but also upholds the integrity of Texas’s procedural rules and precedent in family \nlaw cases.  \n When combined in concert with the actions of the opposing counsel in this matter, it is \nclear that the court and  counsel’s intent "}
{"id": "552fb45f7a507b940a7ececf274553275cfc49c0", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": " of Texas’s procedural rules and precedent in family \nlaw cases.  \n When combined in concert with the actions of the opposing counsel in this matter, it is \nclear that the court and  counsel’s intent was to stall the father’s case and continue denying \nhim access to his children  and res idence without a legal basis , which  is harassment via legal \nprocess. Courts have sanctioned attorneys for less egregious tactics when they primarily serve to impede an adversary’s lawful claims ( In re Bennett , 960 S.W.2d 35, 40 (Tex. 1997) (orig. \nproceeding) – recognizing that abuse of the judicial process can warrant sanctions). Here, \nopposing counsel’s consolidation gambit appears to cross into that territory , and the court not \nonly enabled it, but is ac tively supporting it.  \n Petitioner asks this court to re -think the manner in which it  is choosing to handle this \nmatter. His self -represented status does not authorize this court, or any other court, to ignore the \nbest interests of the children in the face of an un -disputed, un- opposed, and now un- adjudicated \nemergency.  This court is allowing legal advice to  be g iven from a court coordinator which is the \nfoundation for this mess that has been created given COOPER L. CARTER’ S incompetence and \nlack of skill necessary to handle such a case.  The court has a duty to administer justice, and here, \nthat has wholly failed in all aspects.  All information related to this pleading will be supplemented \ninto the Mandamus record  given the court ’s unjustified  refusal  to permit exhibits  to be filed.  \n  Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  6641 Anne Court  \n  Watauga, Texas 76148 \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693\n\nCERTIFICATE OF SERVICE  \n \nRelator certifies that on April 1 1, 2025, a true and correct copy of the \nforegoing Notice  was served on all parties and counsel of record as follows:  \n \nRESPONDENT  \nMorgan Michelle Myers  \n6641 Anne Court  \nWatauga, Te"}
{"id": "6a0b4fe21d4ffe3d164ce07930b91054ee987ddc", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_11_25_notice_and_legal_analysis_1\\04_11_25_notice_and_legal_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.11.25 - NOTICE AND LEGAL ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 504, "text": "on April 1 1, 2025, a true and correct copy of the \nforegoing Notice  was served on all parties and counsel of record as follows:  \n \nRESPONDENT  \nMorgan Michelle Myers  \n6641 Anne Court  \nWatauga, Texas 76148  \n817-235-5189  \nMORGANMW02 @GMAIL.COM  \n \nCounsel for RESPONDENT \nCooper L. Carter  \nMarx, Altman & Johnson  \n2905 Lackland Road  \nFort Worth, TX 76116  \nVia email: coopercarter@majadmin.com  \n \n/s/ Charles Dustin Myers  \nCharles Dustin Myers  \nPRO -SE PETITIONER/ RELATOR  \nSERVED: 04/10/2025"}