{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.05.2025 NOTICE - WATAUGA POLICE DEPT.-1.pdf",
  "base_name": "03_05_2025_notice_watauga_police_dept_1",
  "page_count": 8,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \n \n \nTO THE HONORABLE REVIEWING JUDGE:  \n \nRespondent, CHARLES DUSTIN MYERS, submits this notice to the court in good faith \nto inform the court of the following developments : \n1. Respondent has contacted the Watauga Police Department in an att empt to prevent  \nPetitioner , MORGAN MICHELLE MYERS, from committ ing any further illegal \nactivities  and to shed light on the criminal activity that occurred across state lines \nover the weekend of December 15, 2023, including disposing of the Respondent ’s \npersonal property. \n2. The cover letter provided to the police has been attached to this notice as Exhibit 1.  \n3. Respondent reminds the court via this notice that the following undis puted facts \noccurred over the weekend of December 15, 2023:  Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. NOTICE  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2025 -03-05",
      "char_length": 954
    },
    {
      "page_number": 2,
      "text": "i. Petitioner traveled to 3100 Copan Ct, Yukon Oklahoma to receive \nassistance in drafting a fraudulent O riginal Petition for Divorce  and \nStatement of Inability to Pay  Court Costs.  \nii. Petitioner committed wire fraud by transferring $1,576 from the marital estate u sing a third party’ s PayPal account in an effort to conceal marital \nfunds from the court. \niii. Petitioner then proceeded to file for divorce claiming indigency directly after this transfer occurred.  \niv. Petitioner claime d in her Original Petition for Divorce that a n active order \nof protection existed ag ainst Respondent, which was knowingly false.  \nv. Petitioner ’s motive wa s to conceal a marital affair that has been ongoing \nsince October of 2022.  \n4. Furthermore, regarding COOPER  L. CARTER, alleged counsel for petitioner, the \nfollow ing facts are reiterated to the court:  \ni. Cooper L. Carter has been under challenge via Rule 12 since September 20, \n2024. \nii. Cooper L. Carter  has not filed any pleadings in this matter, but has had them \nfiled on her behalf by RODERICK MARX, founder of MARX ALTMAN AND JOHNSON.  \niii. Cooper L. Carter ’s first pleading in this case states verbatim: \n“It was necessary for Petitioner to acquire the services of COOPER L. \nCARTER ” which can be found in the Amended Petition for Divorce filed on \nJanuary  31\nst, 2024.",
      "char_length": 1349
    },
    {
      "page_number": 3,
      "text": "iv. Cooper L. Carter has signed all pleadings under the law  firm MAR X, \nALTMAN, AND JOHNSON, yet no appearance has been filed in this matter \nby the individual filing on her behalf.  \nv. Cooper L. Carter  has no t responded to any pleadings file d in this matter, has \nnot answered any emails, phone calls, and is currently register ed under the \nre:Search Texas platform via her prior employer ’s email ad dress.  \nvi. Cooper L. Carter presented a fraudulent document to the court, the current orders, which were signed by Judge Kaitcer on March 14, 2024 despite consent not being present  and despite the orders being prepared by the wrong \nattorney . \nvii. The orders claim all parties consent to the terms despite only the Petitioner  \nand her Counsel ’s signature appearing on the document. \nviii. The orders are void -ab-initio as a matter of law and should be vacated \nimmediately.  \nix. A cease- and-desist  letter has been mailed to both COOPER L. CARTER  and \nthe law  firm MARX, ALTMAN, AND JOHNSON, requesting that they \nproperly regi ster via the EFM by March 7\nth, 2025, at 5:00 P.M. or file  a \nwithdrawa l on Cooper ’s behalf  or face further legal action , as her presence  in \nthis case has been prejudicial, and her withdrawal is appropriate given her inability to prosecute this matter.  \nx. The court, on its ’ own motion, should consider mandating her withdrawal \nimmediately given the circumstances of this case.  \nAny f urther developments will be communicated with th e court  in good faith.",
      "char_length": 1518
    },
    {
      "page_number": 4,
      "text": "Respectfully submitted,  \n /s/ Charles Dusti n Myers  \n CHARLES DUSTIN MYERS  \n 6641 ANNE COURT,  \n WATAUGA, TEXAS 76148 \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n Pro se \n \nCERTIFICATE OF SERVICE  \nRespondent, Charles Dustin Myers, hereby certifies that a true and correct copy of the foregoing \nrequest for ruling was served on Petitioner’s counsel of record, Cooper L. Carter , via the via \nemail to clcarter@example.com  (email address on file) on this 5th day of March , 2025, in \naccordance with the Texas Rules of Civil Procedure and to Petitioner, MORGAN MICHELLE MYERS, through the Electronic Filing Manger in accordance with Texas Rules of Civil Procedure 21.  \n \n /s/ Charles Dusti n Myers  \n CHARLES DUSTIN MYERS  \n 6641 ANNE COURT,  \n WATAUGA, TEXAS 76148 \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n Pro se",
      "char_length": 822
    },
    {
      "page_number": 5,
      "text": "EXHIBIT 1\nCOVER LETTER SUBMITTED TO WATAUGA \nPOLICE DEPARTMENT ON 03/04/2025",
      "char_length": 76
    },
    {
      "page_number": 6,
      "text": "COVER LETTER –  EVIDENCE FOR WATAUGA POLICE DEPARTMENT  \nTo the Reviewing Officer,  \nThank you for your time in this matter, as all other remedies have been exhausted prior to \nthis request from the department. Attached to this document are relevant materials related \nto the fraudulent documents that were prepared and presented to the 322nd District Court of Tarrant County on December 18, 2023, which led to my unjust removal from my \nresidence on January 16, 2024, prior to any notice or any hearing occu rring.  \nThese items were prepared in part by an individual not named in the case —Daniel Kenneth \nBranthoover —who resides in Yukon, Oklahoma. I have contacted the police department in \nthat jurisdiction to provide the same materials that have been provided here.  \nOver the weekend of December 15, 2023, Morgan Michelle Myers, the Petitioner in this \nmatter, traveled across state lines to Yukon, Oklahoma, where she received help from Daniel Kenneth Branthoover, her stepfather, in preparing attachments #1, #2, and #3, \nwhich are:  \n1. The Original Petition for Divorce  \n2. A Statement of Inability to Afford Court Costs  \n3. An Application for Protective Order  \nThis individual facilitated the transfer of $1,546 out of our joint marital bank account on \nDecember 15, 2023, and it appears as being sent to “dmb575”, which is Mr. Branthoover’s \nPayPal account. He facilitated this transaction to help conceal her bank acc ount \ninformation. Both Mr. Branthoover and Morgan have admitted via text messages that they transferred $1,546 to Morgan and then proceeded to ﬁle for divorce four days later \n(December 18, 2023), claiming indigency under penalty of perjury.  \nThe Statement of Inability to Afford Court Costs falsely claims that her monthly expenses \nexceed her monthly net pay and that she had no access to ﬁnancial resources. She also \nmisrepresented separate property that she owned, such as the car payments that I have been burdened with. Furthermore, in the Original Petition for Divorce, she knowingly \nclaimed to have an active order of protection against me, which was false . \nAfter these fraudulent ﬁlings resulted in my wrongful removal from my home on January 16, \n2024, it is important to note that this occurred on a day when the Tarrant County courts \nwere officially closed due to inclement weather (as publicly announced on th eir official \nFacebook page: https://www.facebook.com/people/Tarrant -County-District -\nCourts/100092554647052/ ).",
      "char_length": 2481
    },
    {
      "page_number": 7,
      "text": "Evidence Provided:  \nTo support my claims, I am submitting the following evidence:  \n1. Court Filings & Fraudulent Orders – Copies of the divorce petition, protective order \napplication, and Statement of Inability to Afford Court Costs, all of which contain \ndemonstrable falsehoods.  \n2. Financial Statements & Transaction Records – Bank records showing the December \n15, 2023 PayPal transfer of $1,546 from our joint account to Mr. Branthoover’s \naccount, contradicting Petitioner’s indigency claim.  \n3. Text Message Exchanges – Messages proving that both Morgan Michelle Myers and \nDaniel Kenneth Branthoover coordinated this ﬁnancial transfer and subsequent \nfraudulent ﬁlings.  \n4. The illegal lockout notice left on the door on March 6, 2024.  \n5. Evidence of my personal belongings from the home being disposed of despite the \norders in place (albeit fraudulent) preventing such actions.  \n6. The Associate Judge’s Report signed on February 1st, which had speciﬁc \nrequirements for formal temporary orders to be reduced – one of which was that \nthey had to have been prepared by my prior attorney, who was terminated, and whose signature is also missing , and the other was within a 20 -day time period – \nwhich was also not adhered to.  \n7. The current orders which differ signiﬁcantly from the associate judge’s report, claim I consent to them despite my signature not being present, and which reference a \nhearing that never occurred.  \nRequest for Assistance:  \nGiven the overwhelming evidence that my removal was based on fraudulent and \nprocedurally invalid orders, I respectfully request that the Watauga Police Department take \nthe following actions:  \n1. Acknowledge my legal right to return to my residence, as the court orders removing \nme were obtained through fraud and due process violations.  \n2. Investigate the fraudulent ﬁlings made by Petitioner and the involvement of Daniel \nKenneth Branthoover in facilitating perjury and ﬁnancial deception.  \n3. Prevent Petitioner from falsely claiming trespassing if I return to the residence, as \nshe obtained the house through fraudulent court orders.",
      "char_length": 2119
    },
    {
      "page_number": 8,
      "text": "4. File an official report documenting this matter to preserve evidence for potential \nfurther legal action.  \nClosing Statement:  \nI appreciate the department’s time and effort in reviewing this evidence. I am committed to following the legal process but given that my removal was unlawful and based on fraudulent court ﬁlings, I ask for the Watauga Police Department’s immediate intervention \nin ensuring that my rights are protected.  \nPlease feel free to contact me if you require any additional documentation or testimony. I \nam willing to cooperate fully with law enforcement to ensure that justice is served  and my \nchildren’s well -being are protected.  \nThe necessity of this request is more so  about the children, who are now being medically \nneglected, cared for by third parties,  the eldest is  struggling in school,  and due to the \nsigniﬁcant damages  that have occurred from being unable to work from out of the home  \nwhich has directly impacted their ﬁnancial livelihood.  \nThe motive for all of this was an attempt by my wife to cover -up an affair that took place \nbetween October 2022 and the present day.  \n \nSincerely,  \nCharles Dustin Myers  \n817-546-3693  \nChuckdustin12@gmail.com",
      "char_length": 1207
    }
  ]
}