{"id": "d3c93898df209b399bfa327780a5f96918b126bc", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "Date: March 18, 2025 \nVia E -File \nThomas A. Wilder, District Clerk  \nTarrant County District Courts 200 E. Weatherford St. \nFort Worth, Texas 76196  \nRe: Original Petition in Suit Affecting Parent -Child Relationship (“SAPCR”) – Request to \nFile as Separate Case and Set Immediate Hearing (In the Interest of [M.M.] and [C.M.], \nminor children; related to  Cause No. 322-744263- 23, In re Marriage of Myers)  \nDear Mr. Wilder and Honorable Court: \nPlease accept for filing the enclosed Original SAPCR  concerning the above- referenced \nchildren. This SAPCR is intentionally filed as a new, separate case , rather than under the \nexisting divorce cause, due to unique procedural defects in that divorce proceeding that have left \nthe children in legal and physical limbo. Immediate intervention  is required to protect the \nchildren’s best interests. Below, I outline the compelling reasons – supported by law and the record – why this SAPCR must proceed separately  and be set for an emergency hearing  at \nonce, instead of being merged into the stalled divorce case. \nA. Failure of Opposing Party to Prosecute\n1. The divorce Petitioner has wholly failed to prosecute the divorce, leaving it in\nprocedural limbo.  Over a year has passed with no meaningful activity toward a final resolution. \nNotably, after the divorce case was removed to federal court and later remanded, Petitioner \nnever filed the required certified Order of Remand or gave notice of remand  as mandated by \nTexas Rule of Civil Procedure 237a. Rule 237a obligates the removing party to promptly file the \nfederal remand order with the state clerk and notify all parties, after which any defendant has 15 \ndays to answer . Petitioner’s omission  of this required step has left the state court record \nincomplete and the case procedurally suspended. Indeed, due to Petitioner’s inaction (and her\n\ncounsel’s apparent inability to e -file; see Point 8 below), no remand notice was ever filed , so \nthe divorce court has not resumed "}
{"id": "dbd61010e3e797df7548e3ac471edd4655bcc844", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "edurally suspended. Indeed, due to Petitioner’s inaction (and her\n\ncounsel’s apparent inability to e -file; see Point 8 below), no remand notice was ever filed , so \nthe divorce court has not resumed jurisdiction in any practical sense . \n2. In addition, Petitioner has ignored the Texas Supreme Court’s time standards  for \ntimely disposition of cases . A divorce case is expected to be resolved within 12 months , yet \nPetitioner has made no effort to advance it. She has not set a trial or even a status conference; she \nhas allowed critical deadlines to lapse. This lack of diligence violates the duty to prosecute one’s claims and warrants dismissal for want of prose cution. In fact, Respondent has been forced to \nfile a Motion to Dismiss for Want of Prosecution (pending before the Court) detailing Petitioner’s complete failure to move the case forward. This also remains un- responded to. \nPetitioner’s inaction has left the family with no active forum  to address urgent child- related \nissues. Therefore, a separate SAPCR  is necessary to provide a functioning vehicle for relief. \nThe children cannot wait  for the Petitioner’s  indifference or strategic delay to abate.  \nB. Failure to Oppose Any Relief (Legal Concession)  \n3. Throughout the divorce case, Petitioner has not opposed or responded to any of \nRespondent’s filings , motions, or claims for relief. She and her counsel have remained silent in \nthe face of serious allegations and requests, effectively conceding the merits  of those issues \nunder Texas law. Respondent has raised grave claims of fraud, perjury, deception, and child neglect  against Petitioner in his pleadings, yet Petitioner’s counsel has filed no response or \ndefense to these claims . Respondent also served discovery and Requests for Admissions which \nwent completely unanswered , resulting in deemed admissions. He even filed a motion to \ncompel discovery, which Petitioner again did not oppose , though unfortunately no hearing has \nyet been held . "}
{"id": "0e4e8d3abe452717ee2994c775b09d7192cf4a41", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "\nwent completely unanswered , resulting in deemed admissions. He even filed a motion to \ncompel discovery, which Petitioner again did not oppose , though unfortunately no hearing has \nyet been held . Moreover, when Respondent moved for other interim relief (including return to \nthe family home and expanded access to the children), Petitioner filed no opposition. By her\n\ninaction, Petitioner has implicitly admitted the validity  of Respondent’s factual assertions and \nthe justness of his requests .  \n4. Texas law is clear that a party who fails to respond to motions or claims effectively \nwaives any objection and accepts the movant’s evidence as true . For example, in the \nsummary judgment context, if a nonmovant files no response, the court may accept the movant’s \nasserted facts as uncontroverted and render judgment if entitlement is shown; issues not timely raised in a written response are waived ; see Tex. R. Civ. P. 166a(c) . The same principle applies \nhere: Petitioner’s total failure to contest Respondent’s filings is tantamount to a legal concession  \nof those matters . In other words, f ailure to make timely and specific objections results in waiver \nof the objections. S ee Clark v. Trailways, Inc., 774 S.W.2d 644, 647 (Tex. 1989), cert. denied, \n493 U.S. 1074, 110 S.Ct. 1122, 107 L.Ed.2d 1028 (1990) ; Hartford Accident and Indem. Co. v. \nMcCardell , 369 S.W.2d 331, 335 (Tex. 1963); Srite v. Owens -Illinois, Inc., 870 S.W.2d 556, 565 \n(Tex.App. — Houston [1st Dist.] 1993), revise d on other grounds, 897 S.W.2d 765) . Courts have \nrecognized that a party’s failure to respond indicates a belief that the motion has merit .  \n5. Petitioner’s silence speaks volumes. She has never disputed that Respondent should be \nallowed to return home or see his children – in fact, she has not opposed any relief requested. This silence should be treated as acquiescence. Accordingly, there is no reason to keep the children waiting in the paralytic divorce case when no one is ev"}
{"id": "096da1bc0d8b1210a620a0618fee1a34f62bfb9e", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": ", she has not opposed any relief requested. This silence should be treated as acquiescence. Accordingly, there is no reason to keep the children waiting in the paralytic divorce case when no one is even arguing against  the relief \nRespondent seeks in this SAPCR. The SAPCR can and should proceed on the uncontroverted facts in Respondent’s filings. \nC. Best Interests of the Children Demand Immediate Action\n\n6. Every day that passes with the children separated from their father is a day of \nirreparable harm.  The undisputed evidence is that the children are suffering due to \nRespondent’s forced absence from the home. In the months since he was excluded, the children’s \nwell-being has precipitously declined: they have fallen behind in school, missed critical medi cal \nand dental appointments, and have been emotionally traumatized by the sudden and prolonged separation from their father. No party—not even Petitioner —has asserted that the children would \nbe anything but better off if their father could return to care f or them. No one has argued against \nRespondent’s return to the home or his involvement in the children’s daily life. It is axiomatic that the best interest of the children is the paramount concern in any case affecting the parent -\nchild relationship. See Tex. Fam. Code § 153.002 (mandating that “[t]he best interest of the \nchild shall always be the primary consideration of the court in determining the issues of conservatorship and possession of and access to the child”) ; Lenz v. Lenz , 79 S.W.3d 10, 14 \n(Tex. 2002) (emphasizing that courts must place “predominant emphasis” on what best serves the \nchildren's welfare, particularly focusing on stability, emotional and educational needs, and maintaining frequent contact with fit parents).  \n7. The Texas Legislature explicitly prioritized children’s best interests in all \nconservatorship and possession determinations: “The best interest of the child shall always be the primary consideration of the court in "}
{"id": "b3a32124e4d3857f297778558a503bed5144bcb7", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ature explicitly prioritized children’s best interests in all \nconservatorship and possession determinations: “The best interest of the child shall always be the primary consideration of the court in determining the issues of conservatorship and possession of and access to the child.” Tex. Fam. Code § 153.002. Texas Supreme Court \njurisprudence confirms and expands upon this legislative directive, instructing courts to consider stability, educational continuity, emotional health, and ongoing relationships with fit parents in their best -interest analysis. See Lenz , 79 S.W.3d at 14–15 (holding courts must evaluate what\n\nwill best serve the child’s overall welfare, ensuring a stable and emotionally supportive \nenvironment and maintaining meaningful and frequent parental contact).  \n8. Here, it is unquestionably in the children's best interests to have their loving father \nback in their daily lives without further delay. Texas public policy explicitly states that children should have frequent and continuing contact with parents who have demonstrated the ability to act in their best interest. See Tex. Fam. Code § 153.001(a)  (declaring the public policy of \nTexas to ensure frequent contact and shared duties between parents and children following separation); Lenz , 79 S.W.3d at 14–15 (affirming that Texas policy favors maintaining \nfrequent and meaningful parental involvement in a child's life).  \n9. Respondent has demonstrated throughout these proceedings that he is a caring, fit \nparent whose presence provides the children with stability, support for their education and health, and emotional security. By contrast, the children’s current situation—living apart from \nRespondent for no substantiated reason—is destabilizing and harmful. Texas courts recognize the urgency of child custody matters and have repeatedly underscored that “justice demands a speedy resolution of child custody and child support issues.”  In re Tex. Dep’t of Fam. & \nProtective Servs. , 210 S.W.3d "}
{"id": "9f9c6646da1230e095967cee341c3655bdf5a394", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "child custody matters and have repeatedly underscored that “justice demands a speedy resolution of child custody and child support issues.”  In re Tex. Dep’t of Fam. & \nProtective Servs. , 210 S.W.3d 609, 613 (Tex. 2006) (orig. proceeding) (quoting Proffer v. \nYates , 734 S.W.2d 673, 674 (Tex. 1987)). Simply put, the children’s needs cannot wait on \nprocedural formalities or a dormant divorce case. Their welfare requires this SAPCR to be heard immediately so that orders can be promptly put in place to reunite them with their father and address their academic, emotional, and medical needs. No statute or rule forbids initiating a separate SAPCR when it is necessary to protect children's best interests. Indeed, Tex. Fam. Code \n§ 153.002 and the overarching equitable duty of the Court compel swift action here . Respondent \nis ready, willing, and able to resume caring for his children, and no party has objected to him\n\ndoing so. Therefore, the Court must accept this SAPCR and schedule an immediate hearing to \nserve the children's best interests without further delay. See Lenz, 79 S.W.3d at 14–15 (holding courts must prioritize swift judicial actions in custody matters, protecting the best interests of children).  \nD. Fraud and Perjury Render the Prior Orders Void  \n10. The orders entered in the divorce case that currently keep Respondent out of the home \nand away from the children were obtained through fraud, misrepresentation, and even perjury . Because those orders were procured by wrongful means, they are void ab initio  and \ncannot be permitted to stand in the way of this SAPCR. Texas law does not tolerate court orders obtained by trickery or false pretenses. Notably, the temporary orders in the divorce (signed January 16, 2024 and later on March 14, 2024) were presented to the Court as “agreed” orders, yet Respondent never agreed to them  and never signed them. In fact, Respondent had \nexpressly opposed the relief in those orders. The “agreement” was a fiction creat"}
{"id": "8b7df2fc6d7425dd7d25ad5de85c2e7a60f4fc64", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": " to the Court as “agreed” orders, yet Respondent never agreed to them  and never signed them. In fact, Respondent had \nexpressly opposed the relief in those orders. The “agreement” was a fiction created by Petitioner’s counsel. The record reflects that Petitioner’s counsel drafted and submitted those orders without Respondent’s consent or signature , and which reference a hearing not found on \nthe docket . This is a textbook example of a fraud on the court . A judgment or order entered as \n“agreed” when one party actually objected is void. The Texas Supreme Court’s holding in Burnaman v. Heaton is directly on point: when a trial court knows a party does not consent to a purported agreed judgment, it must refuse to sign it; any judgment rendered under such circumstances “is void .” Burnaman v. Heaton, 240 S.W.2d 288, 291 (Tex. 1951) . \n 11. Here, the court was misled – it was never disclosed that Respondent vehemently \ndisagreed. Without such consent the judgment is void. The law will not give effect to a “party’s consent” that was never actually given. Moreover, the way  those orders were obtained\n\nwas rife with material falsehoods. In her filings, Petitioner knowingly made false statements  to \nthe Court to justify excluding Respondent from the home. For example, in her Application for \nProtective Order and supporting affidavit, Petitioner grossly misrepresented the facts, painting Respondent as a danger without evidence. She alleged incidents  that never occurred or twisted \nmundane events into false claims of “family violence.” These misrepresentations were later exposed, and Petitioner has never attempted to prove them in any evidentiary hearing. Petitioner’s intent was plainly to deceive the Court into granting her sole occupancy of the home and custody of the children. Indeed, Respondent’s pending Motion to Dismiss details how Petitioner “knowingly made and presented fraudulent claims to the Court regarding Respondent’s property, with the intent to deprive him"}
{"id": "cb801336960df66eaa8d9c022bd2324fb49cf777", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "dren. Indeed, Respondent’s pending Motion to Dismiss details how Petitioner “knowingly made and presented fraudulent claims to the Court regarding Respondent’s property, with the intent to deprive him of his interest in his home” , and how \nshe acted with intent that “these false claims be given the same legal effect as valid court orders, misleading the Court and causing Respondent to be wrongfully deprived of his home and livelihood.”  \n 12. These strong findings, which stand uncontroverted, show that the prior orders were \nprocured by fraud and deception. Under longstanding Texas precedent, any order obtained by \nextrinsic fraud  (fraud that effectively prevents a fair presentation of the case) is void and a \nnullity . See King Ranch, Inc. v. Chapman, 118 S.W.3d 742, 751–52 (Tex. 2003) (judgment \nobtained by fraud can be set aside; only extrinsic fraud – such as keeping a party away from court or concealing critical facts – justifies relief) .  \n13. Here, Petitioner’s fraud was extrinsic in that it kept Respondent from participating \nfully  (the “agreed” order ploy) and kept the Court from learning the true facts . A litigant who \nlies to gain advantage in a court order subverts the process ; the resulting order lacks integrity \nand is void.\n\n14. In sum, the prior temporary orders that ousted Respondent were built on a \nfoundation of fraud . They should carry no weight and pose no obstacle to granting relief in this \nnew SAPCR. This Court not only has the authority to declare such orders void, it has a duty to \ndo so in order to prevent manifest injustice c. See Burnaman, 240 S.W.2d at 291. By proceeding \nwith a fresh SAPCR, the Court can consider the issues regarding the children de novo, on truthful evidence, untainted by the false premises of the earlier orders. Equity regards as done that which ought to have been done – the Court should restore Respondent , CHARLES DUSTIN MYERS, \n(Petitioner in the new cause) to his rightful place in the home and children’s l"}
{"id": "98b9a17aeb832c87b38b947e7ff992393a1a8694", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "quity regards as done that which ought to have been done – the Court should restore Respondent , CHARLES DUSTIN MYERS, \n(Petitioner in the new cause) to his rightful place in the home and children’s lives, as if the fraudulent orders had never been entered.  \nE. Restoring the True Status Quo of the Family  \n15. Relief in this SAPCR is also warranted to restore the status quo  that existed before \nPetitioner’s improper actions. The “last actual, peaceable status quo” in this family was Respondent living in the home with the children, as a present and active father. That was the \nreality until late 2023, when Petitioner – through unilateral false allegations – removed Respondent from the household. Texas law holds that the purpose of temporary orders and injunctive relief is to maintain or restore the status quo pending trial. See In re Shifflet, 462 S.W.3d 528, 537 (Tex. App.—Houston [1st Dist.] 2015, orig. proceeding) (courts aim to restore the last peaceable status quo pending final trial) . \n16. Here, the true status quo ante  was the intact family unit with Respondent present. \nThe situation now – Respondent barred from the home and children – is a drastic deviation from that status quo, achieved only by contested court orders that, as shown, lack validity. Every day that Respo ndent is kept out is a day the family’s natural equilibrium is disturbed further.\n\nTexas courts have intervened in analogous situations to return to the rightful status quo. For \nexample, when one party’s unilateral conduct disrupts a long- standing living arrangement, courts \nrecognize that stability must be restored for the benefit of all , especially the children. See Smith \nv. McDaniel , 842 S.W.2d 7, 12 (Tex. App.—Dallas 1992, no writ) (courts should preserve or \nrestore the conditions that existed prior to the controversy to protect the children’s routine and sense of security). Here, restoring the status quo means allowing Respondent back into his home and parenting role immediately"}
{"id": "f4a79d4df1cb310c97ebda96d9d8307cbc310e9f", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "at existed prior to the controversy to protect the children’s routine and sense of security). Here, restoring the status quo means allowing Respondent back into his home and parenting role immediately . That was the “last peaceable” situation  before litigation \n– a state in which the children were thriving. Notably, the findings in the temporary orders hearing (held without Respondent) even indicate there were no findings of any imminent harm if Respondent were present; the exclusion was based solely on Petitioner’s requested relief, not on proven misconduct by Respondent.  \n17. Thus, there is no safety- based reason to maintain the current deviation from the norm. \nBy contrast, there are powerful reasons to return to normalcy: the children’s suffering would be \nalleviated, and the family’s balance and stability would be reestablished. \n18. In short, equity demands that we “undo”  the improper disruption caused by \nPetitioner’s actions. This SAPCR allows the Court to do exactly that – to realign temporary orders with reality and justice. In re Shifflet instructs that the last peaceable status quo should be restored pending trial . The last peaceable status was Respondent in the home; restoring that \nwill harm no one (again, even Petitioner did not claim any abuse or violence requiring exclusion – her application acknowledged no recent violence, only vague fears). Maintaining the current situation, by contrast, gravely harms the children and prejudices Respondent’s relationship with them. Therefore, the Court should use the SAPCR proceeding to immediately reinstate Respondent to the home and his parenting time, thereby restoring the status quo  that truly\n\nserves the children’s welfare. Every additional day away from that status quo is a deviation that \nthis Court can and should correct now. \nF. The Court’s Duty to Act Without Delay for the Children’s Welfare  \n19. By accepting this SAPCR as a separate case, the Court can fulfill its paramount duty \nto protect the c"}
{"id": "ed1987bb9e07170a29227f28457b2d80169bb5b8", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "nd should correct now. \nF. The Court’s Duty to Act Without Delay for the Children’s Welfare  \n19. By accepting this SAPCR as a separate case, the Court can fulfill its paramount duty \nto protect the children’s welfare without procedural delay . Courts have a sacred obligation  \nto put the interests of children above rigid procedural considerations, especially in emergencies. \nThe Texas Supreme Court has emphasized that trial courts must act immediately when children’s physical or emotional well- being is at stake , even if procedural complexities exist. \nIn In re Tex. Department of Family & Protective Services , for example, the Supreme Court \nadmonished that delays in custody matters are intolerable, quoting with approval the maxim: “Justice demands a speedy resolution of child custody and child support issues.”  210 S.W.3d \n609, 613 (Tex. 2006) . The high court in that case (a mandamus proceeding) required prompt \naction despite procedural entanglements, recognizing that a child’s need for a stable, safe environment cannot be made to wait on protracted litigation maneuvers. \n20. Similarly, in Elizondo v. Monteleone , an appellate court noted that when a parent \nattempted procedural gambits to delay a custody determination, the court system should not allow those tactics to trump the child’s immediate needs. Elizondo v. Monteleone , 96 S.W.3d 705, \n708 (Tex. App.—Corpus Christi 2002, no pet.) (courts will not permit jurisdictional technicalities to delay emergency relief in a parent -child case). [( If citation is verified)] In that case, one party \ntried to remove the case to federal court and argued that the state court lacked jurisdiction to issue temporary orders during the interim. The court flatly rejected that ploy, holding that the state court must  act to protect the child and could later sort out jurisdiction, because the child’s\n\nwelfare was paramount. The lesson is clear: procedural fencing cannot override the need for \nimmediate judicial action when ch"}
{"id": "19bb05b56a3443f62647f61f7c1239758c29b699", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "ect the child and could later sort out jurisdiction, because the child’s\n\nwelfare was paramount. The lesson is clear: procedural fencing cannot override the need for \nimmediate judicial action when children are suffering.  \n21. Here, Petitioner’s inaction and the snares of the divorce case have already delayed \nrelief for far too long. The children have been without their father for several critical months of their development . The Court has the power —and indeed the duty —to cut through the \nprocedural morass  by creating a new SAPCR docket and promptly addressing the merits of \nconservatorship, possession, and access. There is no jurisdictional barrier to doing so: this Court has continuing jurisdiction over the children (by virtue of the ongoing divorce) and t hus can hear \na SAPCR involving them. Any concern about duplicitous litigation is mitigated by the fact that \nthe divorce case is effectively moribund; furthermore, Respondent will move to consolidate or \ndismiss the divorce once the SAPCR is in place, if appropriate. What cannot be allowed is more delay that leaves the children in a fractured situation. Our Courts are courts of equity as well as law, especially in family matters. When equity demands immediate intervention, the Court \nshould not hesitate. As the Austin Court of Appeals observed, “when the jurisdiction of the court has been properly invoked in matters affecting minor children, the court’ s primary consideration is the best interest of the children, and the court may enter any order deemed necessary to protect and conserve the welfar e of the child.”  Elizondo, 96 S.W.3d at 708 (citing Tex. Fam. \nCode § 105.001 on temporary orders for a child). In other words, once the Court is aware of a child in need, it must act, and act swiftly .  \n22. That is precisely the situation here. By accepting this SAPCR filing and setting an \nimmediate hearing, the Court will be performing its highest duty: safeguarding the children’s wellbeing without further "}
{"id": "9d68a7ca89f695d87d02690ce48640b3e2cc240f", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "is precisely the situation here. By accepting this SAPCR filing and setting an \nimmediate hearing, the Court will be performing its highest duty: safeguarding the children’s wellbeing without further procedural impediment. Conversely, to refuse the SAP CR or to delay\n\naction because a defunct divorce petition lingers would elevate form over substance and place \nthe children at continued risk, which Texas law forbids . \n23. In sum, this Court is empowered and required to provide a forum for immediate \nrelief , and the SAPCR is the proper mechanism to do so. The Court should therefore promptly \ndocket this SAPCR as a new case and schedule an emergency hearing on temporary orders for the children.  \nG. Protective -Order Application Confirms Respondent’s Joint Ownership of the Home  \n24. Even Petitioner’s own filings acknowledge Respondent’s legal right to return to the \nresidence. In her sworn Application for Protective Order (filed in September 2023), Petitioner explicitly affirmed that the marital residence “ is jointly owned or leased by the Applicant and \nRespondent .” \n25. This judicial admission is significant. It means that at the time she sought exclusive \nuse of the home, Petitioner conceded that Respondent is co -owner (or co -leaseholder) of the \nproperty. There is no dispute, therefore, that Respondent has an equal property interest and legal right to occupy the home . Petitioner cannot now contradict her own sworn statement by \nsuggesting Respondent has no such right.  \n26. Why is this important? Because the prior orders granting Petitioner exclusive \npossession of the home (and excluding Respondent) stand in direct conflict with the parties’ property rights and the status quo. Those orders were based not on any finding that R espondent \nlacked ownership or rights to the home, but presumably on a temporary  need for protection \n(which, as shown, was falsely claimed). With the exposure of Petitioner’s allegations as false, there remains no lawful basis  to "}
{"id": "7126b40387596281e560ee9155ad0e7cc7024aea", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "ghts to the home, but presumably on a temporary  need for protection \n(which, as shown, was falsely claimed). With the exposure of Petitioner’s allegations as false, there remains no lawful basis  to keep Respondent out of a home that he owns jointly. Texas\n\nFamily Code § 153.003 states that the Court cannot condition a parent’s possession of a child on \nthe payment of support or other matters unrelated to the child – likewise, the Court should not condition Respondent’s access to his home (and thereby to his c hildren) on a procedurally flawed \nprior order, especially when Petitioner herself admits the home is community property . The \nprotective order application further underscores that Petitioner’s sole claim to the home was through a temporary court order, not any independent right. When the predicate for that temporary order (alleged family violence) is unproven and disputed, the underlying property rights must prevail.  \n27. In equity, where two parties have equal right to possession of a property, one cannot \nexclude the other absent a valid court order supported by good cause. Here, absent the now -\nquestionable temporary orders, Respondent as joint owner would be free to live in his home. The Court should thus give weight to Petitioner’s admission of joint ownership and recognize Respondent’s unabated property right . This is yet another reason to allow the SAPCR to go \nforward: so that the issue of residency and possession of the home can be revisited in light of the true facts and rights of the parties. The protective order was leveraged into a settlement which both partie s did not agree to (as the record will show, if needed), meaning no long- term \nrestrictions were found warranted. What remains is a fit father who co -owns his home seeking to \nreturn  to his necessity to work and provide financially for the children . Petitioner’s own \npleadings remove any doubt about his entitlement. Accordingly, the Clerk and Court should not hesitate to facilitate"}
{"id": "68e173a7be58d8929d3cc06ffc5149bd262e0166", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": " his necessity to work and provide financially for the children . Petitioner’s own \npleadings remove any doubt about his entitlement. Accordingly, the Clerk and Court should not hesitate to facilitate Respondent’s return via new temporary orders in this SAPCR, as even Petitioner’s sworn statements support Respondent’s position . \nH. Rule 12 Motion: Opposing Counsel Lacks Authority, Undermining the Divorce Case\n\nFinally, Respondent has filed a Rule 12 Motion  (Motion to Show Authority) in the divorce case, \nwhich is currently pending and further indicates why the existing case cannot properly proceed. \nIn that motion (filed September 20, 2024), Respondent challenged the authority of Petitioner’s attorney of reco rd to act on her behalf .  \n28. This challenge was not made lightly – it is supported by evidence that Petitioner’s \ncounsel never filed  the pleadings , is not authorized to practice in this matter under her current \nregistration, and may not even have a valid engagement with Petitioner. Notably, since that motion was filed, Petitioner’s counsel has failed to respond to it or otherwise prove her authority . Rule 12 of the Texas Rules of Civil Procedure provides that an attorney challenged by \nsuch a motion must appear and show authority to act  for the client, or else be struck from the \ncase. Petitioner’s counsel has not met this burden. Instead, irregularities have abounded: at a recent hearing (on Respondent’s motion to recuse), Petitioner’s counsel appeared without \nhaving answered the Rule 12 motion , and the Court allowed her to argue  on a motion she did \nnot respond to , but her authority remains in question.. Moreover, it came to light that Petitioner’s \ncounsel has been unable to e -file pleadings on her client’s behalf  because her electronic filing \naccount is in disarray (registered under a former employer’s email  at Cantey Hanger yet is \nsigning pleadings for Marx, Altman, & Johnson)  . In fact, the few documents “filed” in the \ndivorce case o"}
{"id": "7a572dbacd2d0cfc2ebea2e9951fcb1a996d979a", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "account is in disarray (registered under a former employer’s email  at Cantey Hanger yet is \nsigning pleadings for Marx, Altman, & Johnson)  . In fact, the few documents “filed” in the \ndivorce case on Petitioner’s side were filed  by Roderick Marx, not by the attorney herself . And \ntellingly, Petitioner’s counsel failed to file the Notice of Remand  after the federal court sent the \ncase back, leaving the case hanging indefinitely . All of this demonstrates that Petitioner’s counsel \nis effectively not acting with proper authority or competence  in the divorce matter.  \n29. This is critical because if Petitioner’s attorney lacks authority, then Petitioner is \nessentially unrepresented  in the divorce. Her pleadings (including the Original Petition for\n\nDivorce) are subject to being stricken as null if the Rule 12 motion is granted. The entire divorce \nproceeding would be a nullity without an authorized petitioner or counsel – which is another reason it has stagnated. It would be unjust to make the childre n wait for months while this issue \nis sorted out. By contrast, in a new SAPCR, Petitioner can secure proper counsel or proceed pro se, but the Rule 12 quagmire in the divorce case can be sidestepped for now to get the children relief. The pending Rule 12 m otion underscores that the divorce case is on unstable footing. It \nis procedurally snarled by questions of representation. On the other hand, Respondent is ready to proceed in the SAPCR immediately  – he, as the petitioner in the SAPCR, obviously has \nauthority to bring it, and he will serve Petitioner directly. If Petitioner’s prior counsel truly has no authority, Petitioner will have to either hire new counsel or represent herself in responding to t he \nSAPCR, but at least the case will move forward . The Rule 12 fiasco in the divorce should not be \nallowed to delay relief for the children. Equity again favors moving to a forum (the SAPCR) where all parties before the Court are indisputably authorized and t"}
{"id": "15c2a8d0b2296c4474a254d5e2f7128fe8f8bb01", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "12 fiasco in the divorce should not be \nallowed to delay relief for the children. Equity again favors moving to a forum (the SAPCR) where all parties before the Court are indisputably authorized and the merits can be reached \nwithout distraction.  \n30. In summary on this point, Respondent’s Rule 12 motion (which remains unanswered) \nindicates that the opposing attorney “has no authority to act for the party” – a situation which, by rule, would mandate striking her pleadings and possibly dismissing the divorce. Rather than let the case devolve into that chaos (to the children’s detriment), the Court should start fresh with this SAPCR. The integrity of the proceedings  will be ensured here, because all parties will be \nproperly before the Court. Respondent is confident that once this SAPCR is active, Petitioner will either appear on her own or with legitimate counsel and the issues can finally be adjudicated on the merit s. Until then, the divorce case cannot be trusted as a vehicle for relief due to the\n\ncloud over Petitioner’s representation. This factor strongly supports accepting the SAPCR as a \nstandalone action and granting the requested hearing and relief without delay. \nI. Conclusion  \n31. For all the foregoing reasons – lack of prosecution in the divorce, Petitioner’s waiver \nof opposition, the children’s urgent needs, the void nature of prior orders, the necessity of \nrestoring the status quo, and procedural snares in the divorce case – Respondent respectfully urges the Clerk to file the enclosed SAPCR as a new cause of action, and requests that the Court set an immediate EX -PARTE hearing on temporary orders  in this SAPCR  to issue \ninjunctive relief immediately allowing acc ess back in to the residency and children ’s lives. \nThe Court has abundant legal justification and equitable grounds to do so. Most importantly, the children’s welfare compels immediate action , and the Petitioner will not be adversely \naffected by this decision , and has immediate ho"}
{"id": "80b20741eaaba108efb652cdaba6ce91549265a4", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "ification and equitable grounds to do so. Most importantly, the children’s welfare compels immediate action , and the Petitioner will not be adversely \naffected by this decision , and has immediate housing options nearby available to her, \ncontrary to the undersigned.  Every factor discussed above converges on one truth: these \nchildren need their father back and need a stable, working court order to govern their custody and care – and they need it now, not months from now. By allowing this SAPCR to proceed separately, t he Court will cut the Gordian knot that the divorce case has become and will be able \nto issue orders truly serving the children’s best interests forthwith . \n32. Respondent is prepared to appear for an emergency hearing on any date and time  the \nCourt can accommodate  – preferably today . He is also prepared to file any additional supporting \ndocuments or evidence the Court may require. All necessary filing fees for this SAPCR are being paid, and service of process will be promptly effected on the opposing party. We ask only that the Clerk accept this filing  (rather than reject or re -route it to the old cause) and that the Court \nimmediately calendar the case for a hearing at the earliest possible date. If there are any\n\nquestions or if any further information is needed to facilitate this request, Respondent is at the \nCourt’s disposal to provide it. \n33. Thank you very much for your prompt attention to this urgent matter. By taking swift\naction, the Clerk and Court will literally be changing the lives of two children for the better. The law and justice are on the side of moving forward with this SAPCR. Respondent implores the Court to do so without delay. \nRespectfully submitted,  \nCharles Dustin Myers\n\nEXHIBIT 1\nTRO COMMUNICATIONS\n03/21/25\n\nFUDSTOP <chuckdustin12@gmail.com>\nNotice of Temporary EX-Parte TRO\n2 messages\nFUDSTOP <chuckdustin12@gmail.com> Fri, Mar 21, 2025 at 10:44 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nMs. Carter,\nPursua"}
{"id": "ad502e5ee20c1a0f66b61ebe176276daaf31036a", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 2000, "text": "P <chuckdustin12@gmail.com>\nNotice of Temporary EX-Parte TRO\n2 messages\nFUDSTOP <chuckdustin12@gmail.com> Fri, Mar 21, 2025 at 10:44 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nMs. Carter,\nPursuant to Tarrant County Local Rule 3.30(c)   , this letter provides notice that I intend to present an Emergency Ex\nParte Application for Temporary Restraining Order (TRO)  seeking immediate relief in the interest of my children’s well-\nbeing and to prevent irreparable harm to my property, family relationships, and ability to earn a living.\nThe TRO will NOT  request exclusive temporary use of the marital residence but that if your client has issue, she has\nalternative housing and has used possession of the residence to damage my livelihood and restrict my parenting time.\nThe application will include verified evidence supporting the necessity of immediate relief, including:\nVerified communications acknowledging my need for the home to work\nRecords of financial losses from displacement (Airbnb receipts, business losses, etc.)\nEvidence of your client disposing of or concealing my personal property\nProof that the children have been left unsupervised overnight by your client on multiple occasions.\nDocumentation from the school showing excessive absences and academic concerns regarding Mara.\nText evidence between myself and the multiple AIRBNB hosts showcasing the difficulty faced in setting up\noperations outside of the reliable setup of the house.Photographs and texts contradicting claims made in previous pleadings\nDental neglect of my youngest daughter (photos of untreated cavities)\nFinancial documents showing I paid all vehicle and rent obligations, contrary to your client’ s claims\nText messages between myself and the grandparents of your client showing we can be amicable during this\nsituation and put the children first.Photo evidence showing the only way I have to communicate with my daughters is via an online game, ROBLOX,\ndue to your client preventing communications.My cr"}
{"id": "ecf67be86b8585c0857c7d9ec27ff5820efc737c", "vector_id": 19, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 19, "char_len": 2000, "text": " this\nsituation and put the children first.Photo evidence showing the only way I have to communicate with my daughters is via an online game, ROBLOX,\ndue to your client preventing communications.My criminal record showing that I have never been convicted of a violent crime.\nThe current temporary orders which are facially void and can be collaterally attacked in any court at any time.\nAgain, there is absolutely zero reason to have me barred from the residence and strip the children of their parents. It\ncontradicts the lodestone of the Family Code which is in the best interests of the children. \nThis is the more logical solution. If we pursued this route in the beginning, we'd already be divorced and the children's\nfinancial stability wouldn't have been sacrificed. There is no risk of danger. There is no risk of harm to the children. There\nis only the possibility of recovery. That is in their best interests.\nThere is no legal reason your client has to want me out of the house other than just that. She cannot unilaterally decide\nthat I agree to everything and then do as she pleases with my personal belongings and neglect the children in multiple\nareas.\nYour argument that I agreed to the orders in place falls flat on its face for many reasons which will not be repeated here.\nI am providing this notice strictly to comply with Local Rule 11(e) . I will proceed to present the application to the Court\nwithout further delay  due to the nature of the harm and urgency involved.\nIf you wish to discuss these matters, I'm happy to do so - otherwise I will inform the court that you do not agree to the\norders upon submission.\nThis situation cannot continue, and the alternatives that are available must be pursued to uphold the best interests of the\nchildren before any further damage to their well-being is sustained.\nRespectfully,\nCharles Dustin Myers\n4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid="}
{"id": "5086ab394c5ad4f8a8372343e9e726d1f988325d", "vector_id": 20, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 20, "char_len": 2000, "text": "their well-being is sustained.\nRespectfully,\nCharles Dustin Myers\n4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 1/4\n\nFUDSTOP <chuckdustin12@gmail.com> Sat, Mar 22, 2025 at 3:17 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Wilson <morganmw02@gmail.com>\nCooper,\nPetitioner (your client) filed the original divorce petition in December 2023 in the 322nd District Court (Cause No. 322-\n744263-23). In that petition, she alleged false claims of family violence and sought a waiver of the 60-day waiting\nperiod for divorce, ostensibly to expedite temporary relief by labeling me as an abuser and claiming she had an active\norder of protection against me at the time of filing . \nOn February 1, 2024, a temporary orders hearing was held before an Associate Judge . The parties (through counsel)\nannounced an apparent agreement on temporary custody and other matters. The associate judge signed an “Associate\nJudge’s Report for Temporary Orders” , titled as “Agreed Temporary Orders.” Importantly, this report did not itself\nconstitute a signed court order; instead, it outlined the agreed terms and directed further action before any order would\nbe final. Specifically, the report stated that Respondent's attorney (Dan Bacalis) would prepare a formal temporary\norders document, which would be prepared from 20 days from the date of signing, which would have been February\n22nd, 2024. It also required that both attorneys were to approve it to form within 5 days (have 5 days to approve\nthe order), and that if no agreement on form was reached, a motion to sign would need to be filed within 30 days .\nThe report noted that the parties’ personal approval was not required for entry of the order, implying the attorneys’ sign-off\nor a court motion would suffice. No district judge signed an order at that time – the associate judge’s report was\ness"}
{"id": "9adade276124a99a2ddd88d48301c06ecc5b8e62", "vector_id": 21, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 21, "char_len": 2000, "text": "pproval was not required for entry of the order, implying the attorneys’ sign-off\nor a court motion would suffice. No district judge signed an order at that time – the associate judge’s report was\nessentially a recommendation to be formalized in a written order.  \nImmediately after the Feb 1 hearing, Respondent lost confidence in his attorney’ s actions and fired his attorney.\nBelieving that the “agreement” did not reflect the child’s best interests or was entered under false pretenses (due to\nPetitioner’s unfounded allegations), Respondent promptly withdrew his consent  to the announced terms. On February\n5, 2024, before any temporary order was signed by the court,  Respondent (now pro se) filed an Emergency Motion to\nReconsider and Vacate Temporary Orders . This motion put the court on notice that Respondent no longer consented to\nthe supposed agreed terms and that he objected to any temporary order being entered as announced.  \nDespite this, the reconsideration was denied and no findings were ever entered. In fact, the order explicitly ordered\nRespondent to sign the orders to which he did not agree in violation of his own directives.\nTexas law is clear that an associate judge’s report or proposed order is not a final, enforceable court order\nunless and until it is adopted and signed by the referring court.  Under the Family Code, an associate judge may\nconduct hearings and recommend orders, but those recommendations remain subject to approval by the district court\njudge.  Section 201.011 of the Texas Family Code provides that an associate judge’s report “may contain the associate\njudge’s findings, conclusions, or recommendations and may be in the form of a proposed order”. In other words, the\nassociate judge’s report (even if titled “Temporary Orders”) is essentially a draft or advisory decision; it does not itself\ncarry the force of a court order until the proper procedures are completed.  \nFamily Code § 201.013 unambiguously outlines how and when an associate j"}
{"id": "6865b8c04a2da523271557519fe5fd29a640c14f", "vector_id": 22, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 22, "char_len": 2000, "text": " a draft or advisory decision; it does not itself\ncarry the force of a court order until the proper procedures are completed.  \nFamily Code § 201.013 unambiguously outlines how and when an associate judge’s proposal becomes an order of the\ncourt. If a party timely requests a de novo hearing by the referring judge, the associate judge’ s proposed order may be\nenforced in the interim (except for certain matters) pending that hearing. However, if no timely request for a de novo\nhearing is filed, the statute states that “the proposed order or judgment of the associate judge becomes the\norder or judgment of the referring court only on the referring court’ s signing  the proposed order or judgment.”\nThus, absent a de novo appeal, an associate judge’s recommendation must be signed by the district judge  to have any\nlegal effect. Until the judge signs it, it is merely a proposed order, not an actual court order.  \nBecause the February 1, 2024 temporary orders were never signed or adopted by the court, Respondent was (and is)\nunder no legal obligation to follow them, and neither party could properly enforce those terms through contempt or other\nremedies. A party cannot be held in contempt for violating a non-existent court order. Here, the “Agreed Temporary\nOrders” are, at most, an agreement between the parties that was not entered as a judgment. When Respondent withdrew\nhis agreement (as discussed below), even that contractual underpinning fell apart.  The Family Code’s requirements were\nnot met, and thus the purported temporary orders are void ab initio  due to lack of rendition or entry by the referring\ncourt.  \nThe stage is thus set for this Court to intervene, because as of now , there is no operative temporary order governing\nthe child’s conservatorship or possession .  \nThe Purported Temporary Orders Are Void and Subject to Collateral Attack in This\nSAPCR  4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt"}
{"id": "76b511b6fda2f077e82f3738170fe93ead520218", "vector_id": 23, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 23, "char_len": 2000, "text": "he Purported Temporary Orders Are Void and Subject to Collateral Attack in This\nSAPCR  4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 2/4\n\nBecause the February 1, 2024 temporary orders were never properly entered as a court order (and would have been\ninvalid if entered without consent - which is clearly the case here), they are void and can be attacked in this proceeding.\nGenerally, once a court renders a final judgment, parties are constrained to challenge that judgment on direct appeal or in\nthe original case; collateral attacks  on final judgments are disfavored. However, only a void judgment is subject tocollateral attack in a separate proceeding. Browning v. Prostok, 165 S.W.3d 336, 346 (Tex. 2005)  (“Browning v.\nPlacke , 698 S.W.2d 362, 363  (Tex. 1985) ”)\nIn this SAPCR, Respondent is effectively collaterally attacking  the temporary orders from the divorce case by asserting\ntheir invalidity. Such a collateral challenge is permissible here because those orders are void. As the Texas Supreme\nCourt has explained, “Only a void judgment may be collaterally attacked.” Id.\nAccordingly, Respondent asks this Court to formally declare that the March 26, 2024 “Agreed Temporary Orders” (and\nany interlocutory rulings associated with them) in Cause No. 322-744263-23 are void, of no effect, and not binding  on\nthe parties. This declaration will remove any doubt or argument by Petitioner that those terms still govern the parties’\nrights. It will also foreclose any attempt to enforce or rely on those non-orders (for example, in claims of violation or in\narguing res judicata). The Court has the authority in equity and under the Uniform Declaratory Judgments Act (Tex. Civ.\nPrac. & Rem. Code chapter 37) to declare the rights and status of the parties vis-à-vis that prior proceeding – particularly\ngiven that the SAPCR directly concerns"}
{"id": "bf66aa95a1970788a536a361b498f7041f6f4cb9", "vector_id": 24, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 24, "char_len": 2000, "text": "Declaratory Judgments Act (Tex. Civ.\nPrac. & Rem. Code chapter 37) to declare the rights and status of the parties vis-à-vis that prior proceeding – particularly\ngiven that the SAPCR directly concerns the child who was also at issue in the divorce temporary orders. Granting such\nrelief is appropriate to prevent confusion and multiplicative litigation. Once the prior “orders” are declared void, this Court\ncan proceed to issue fresh temporary orders for the child without any conflict or cloud from the divorce case.  In sum, the prior temporary orders are a legal nullity and this Court should treat them as such. The Court’s order declaring\nthem void will simply recognize the reality that, due to the procedural faults and lack of consent, those orders never had\nlegal existence. This clarification is critical to move forward in protecting the child’s welfare, as discussed next.   \nImmediate Emergency Relief Is Necessary to Protect the Child’s Best Interest \nEvery day that passes without a valid temporary order is a day of potential harm or uncertainty for the child.  The\ncurrent situation – a divorce case stuck in limbo with no operative orders, and parents in dispute – is untenable for a\nchild’s well-being. The child has effectively been living under an informal or contested arrangement since February 2024.\nPetitioner has acted as though she has primary custody under the (void) temporary orders, while Respondent has been\nsidelined and denied the normal possession or decision-making that a proper order (or a true agreement) would have\nprovided him. This dynamic, fueled by Petitioner’s unproven allegations of family violence, has caused significant stress\nand instability for the child. Respondent fears that Petitioner is leveraging the appearance of an order to restrict his\ncontact with the child and to make unilateral decisions that are not in the child’ s best interest. Meanwhile, the divorce\nproceeding has not moved forward to a final resolution – over 12 months have e"}
{"id": "f705e71333a2dac25bcb19da9106883727b814d8", "vector_id": 25, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 25, "char_len": 2000, "text": "ontact with the child and to make unilateral decisions that are not in the child’ s best interest. Meanwhile, the divorce\nproceeding has not moved forward to a final resolution – over 12 months have elapsed since the March hearing, with no\ntrial setting in sight. This stalemate directly affects the child: there is no clear court-sanctioned framework for\nconservatorship, visitation, or support, and your client has only introduced chaos into their lives.\nThis Court, now handling the SAPCR, has both the authority and the duty to step in and provide stability . Under Tex. Fam.\nCode § 105.001, “the court may make a temporary order, including the modification of a prior temporary order, for\nthe safety and welfare of the child,” including orders for temporary conservatorship and possession.\nThe Family Code specifically empowers courts to act expeditiously to protect a child: if there is immediate danger to the\nchild’s physical or emotional health, the court can even issue temporary orders without notice  (such as a temporary\nrestraining order) to address the emergency. Here, Respondent asserts that the child’s emotional welfare is indeed in\njeopardy. The lack of a valid order has enabled Petitioner to marginalize Respondent’s role in the child’s life, purportedly\nunder the guise of the void temporary orders. Petitioner’s false accusations of violence – never tested or proven in court –\nhave created a pretext for her to limit Respondent’s access. Consequently, the child is being unjustly deprived of time and\na relationship with Respondent, who has been a loving father with no history of abuse. This scenario is precisely what\nemergency temporary orders are designed to prevent. The Court should not allow a procedural quagmire to result in a\nchild effectively losing a parent or receiving inferior care.   \nMost importantly, the “best interest of the child” is the paramount consideration  in any conservatorship or\npossession decision. See 153.002 TEX. FAM. CODE.\nAll Texas courts"}
{"id": "9860b5335e0e3cecdc292a5f14cb4c71f12b9daa", "vector_id": 26, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 26, "char_len": 2000, "text": "ceiving inferior care.   \nMost importantly, the “best interest of the child” is the paramount consideration  in any conservatorship or\npossession decision. See 153.002 TEX. FAM. CODE.\nAll Texas courts must ensure that their orders first and foremost serve the child’s best interest. By that standard,\ncontinuing under the shadow of void orders and parental discord is plainly not in this child’ s best interest. Instead, the\nchild’s best interest calls for fresh, valid temporary orders that set forth clear, fair, and safe arrangements for custody and\nvisitation while the parents’ disputes are resolved. The Court should craft these orders based on current evidence and the\nchild’s needs – not based on an outdated and unconsented plan from February. The Family Code’s public policy (Tex.\nFam. Code § 153.001) favors frequent, continuing contact with fit parents and stable environments free of violence or\nabuse. Here, Respondent is ready, willing, and able to care for the child and poses no danger, and he simply seeks a\nnormal custody schedule that allows the child to have both parents in his life. Petitioner ’s unsupported claims of family4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 3/4\n\nviolence (made to gain a litigation advantage) should not dictate the child’ s reality any longer, especially since those\nclaims have not been substantiated in any court hearing.  \nWhy your consolidation motion and response are insufficient, and will fail, or be\nmet with mandamus if granted (after reconsideration)\n Normally, even without continuing exclusive  jurisdiction, a prior pending  suit would require the new suit to be consolidated\nor abated (as discussed above with § 6.407 and dominant jurisdiction). The mother (divorce petitioner) could argue that\nthe original court “has jurisdiction” over the children by virtue of the pending divorce,"}
{"id": "7db23820cadaf4cef18456ed512e848470174b29", "vector_id": 27, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 27, "char_len": 2000, "text": " (as discussed above with § 6.407 and dominant jurisdiction). The mother (divorce petitioner) could argue that\nthe original court “has jurisdiction” over the children by virtue of the pending divorce, so the SAPCR should not proceed\nseparately.  However, the void nature of the prior temporary orders is a game-changer. If those orders are void, then\nthe original case has not effectively adjudicated anything regarding the children’s current custody or support. The SAPCR\npetitioner can contend that because the prior orders are null, there is no valid existing order or active management of the\nchildren’s case, and the new court is free to act in the children’s best interests. This is the EXACT argument made . In\neffect, the argument is that the divorce case’s jurisdiction over the children lapsed into dormancy or “dormant jurisdiction”\ndue to your failure to prosecute the case.\nIt’s important to distinguish jurisdiction  from orders . The continuing jurisdiction doctrine  would typically prevent a\ndifferent court from issuing orders if a final order existed or if another court was actively handling the case. But here the\nSAPCR is filed in the same county as the divorce. There is no risk of two different counties competing; it’s an internal\nissue. The SAPCR effectively asks the  court to take up a new cause number  and to recognize that the old cause has\nstalled and its orders are void.  \nEVEN IF the void argument fails, there is another nuance to this area of law. Despite the lack of a final order, the\npending divorce still technically invokes the court’s jurisdiction over the children. Typically, the proper course is to revive or\ndismiss  the dormant divorce, rather than maintain a wholly separate SAPCR on the side. Texas courts adhere to the\nprinciple that the first suit filed (here, the divorce) should dominate; a later-filed suit concerning the same subject (the\nchildren) can be abated to prevent conflicting rulings. In fact, in  In re Shifflet , for example, a part"}
{"id": "b5e5280f9ec49d2ad808f19947f2859e018dbba2", "vector_id": 28, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 28, "char_len": 2000, "text": "filed (here, the divorce) should dominate; a later-filed suit concerning the same subject (the\nchildren) can be abated to prevent conflicting rulings. In fact, in  In re Shifflet , for example, a party attempted parallel\nlitigation regarding child custody, and the court emphasized that modifications must be filed in the court with jurisdiction\nover the original case\nThe only exception to the one-court rule is narrow. Texas law does allow a court to lose dominant jurisdiction if the\nparty with the first suit proceeded in bad faith or the suit is not actively pursued. Both apply here. The first suit was\nunquestionably brought in bad faith, as the declaration of an active protective order being in ef fect against the\nRespondent was an intentional fabrication designed to provide your client with an advantage. Despite this, the\nTexas legislature should have prevented the first hearing from ever happening, because 6.405b of the Texas Family\nCode required your client to present the alleged order to the court BEFORE ANY HEARING. \nCONCLUSION \nThus, the SAPCR is appropriately before the court, and the only argument you made in your Response fails. The court\ndenied my attempt to open this separate suit, requiring me to file a 17 page argument as to why the case should be\naccepted, and then it was.\nSo your response effectively mirrors the first denial from the court, which amounts to no response being filed at all.\nIt is clear you are not representing your client in a manner to uphold the law or the best interests of the children, but to\nonly appear when needed to obstruct the much needed justice that the children need and deserve.\nThis is my position.\nCharles Dustin Myers4/12/25, 1:06 PM Gmail - Notice of Temporary EX-Parte TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 4/4\n\nFUDSTOP <chuckdustin12@gmail.com>\nCAUSE# 233-765358-25 EX-PARTE TRO\n5 messages\nFUDSTOP <chuckdustin12@gmail.com>"}
{"id": "f207b93d7862a4606508ae7d5f5a301f31c46c44", "vector_id": 29, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 29, "char_len": 2000, "text": "pt&search=all&permthid=thread-a:r5821386652075575501&simpl=msg-a:r579825187415709… 4/4\n\nFUDSTOP <chuckdustin12@gmail.com>\nCAUSE# 233-765358-25 EX-PARTE TRO\n5 messages\nFUDSTOP <chuckdustin12@gmail.com> Wed, Mar 26, 2025 at 5:48 PM\nTo: FLCCoordinator@tarrantcountytx.gov\nHello, \nThis is Charles Dustin Myers, Petitioner in the above captioned cause, and I received an automated reply deferring me to\nthis email when originally reaching out to the Honorable Coordinator .\nThe original email's purpose was to inform the Honorable Coordinator that I had just received notification through the EFM\nthat the emergency ex-parte TRO had been accepted by the court.\nI am following up to inquire about the status of the request.\nI thank you for your attention to this urgent matter, and I will wait for further directive from the court to proceed accordingly.\nAs mentioned in the motion, the Respondent in this matter and her counsel of record have been duly notified of the relief\nbeing sought and the motion itself, but have not responded to any attempts to communicate regarding this urgent matter .\nThank you and have a wonderful evening.\nRespectfully,\nCharles Dustin Myers\nchuckdustin12@gmail.com\n817-546-3693\nTegan B. Allison <TBAllison@tarrantcountytx.gov> Thu, Mar 27, 2025 at 8:45 AM\nTo: FUDSTOP <chuckdustin12@gmail.com>\nThis order needs to be presented in person. Likewise, you need to inform opposing counsel of the date and\ntime you intend to present this order to the court.\n \nThank you,\n \nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E Weatherford\nFort Worth, TX 76196\nTBAllison@tarrantcountytx.gov\n4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 1/5\n\nYou don't often get email from chuckdustin12@gmail.com . Learn why this is important \n \nF r o m : FUDSTOP <chuckdustin12@gmail.com>\nS e n t :"}
{"id": "0b43ab441aca91fc457be2eebbb16913d15c2f11", "vector_id": 30, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 30, "char_len": 2000, "text": "a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 1/5\n\nYou don't often get email from chuckdustin12@gmail.com . Learn why this is important \n \nF r o m : FUDSTOP <chuckdustin12@gmail.com>\nS e n t : Wednesday, March 26, 2025 5:49 PM\nT o : Courts - FLC Coordinator <FLCCoordinator@tarrantcountytx.gov>\nS u b j e c t : CAUSE# 233-765358-25 EX-PARTE TRO\n \nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nFUDST OP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 8:59 AM\nTo: \"Tegan B. Allison\" <TBAllison@tarrantcountytx.gov>\nMs. Allison,\nThank you for the update.\nIs there a time available tomorrow to come and present the order? Preferably between 9am and 2pm? \nI have informed the opposing party of the intent to present the order and will provide the time and date upon determination\nof the court's availability .\nThank you for your assistance.\nCharles Dustin Myers\nChuckdustin12@gmail.com  \n817-546-3693\n[Quoted text hidden]\nimage001.jpg\n6K\nTegan B. Allison <TBAllison@tarrantcountytx.gov> Thu, Mar 27, 2025 at 9:05 AM\nTo: FUDST OP <chuckdustin12@gmail.com>\nYou may present the order during that time. Please keep in mind that the court will be closed from 12pm-\n1:30pm for lunch and administrative tasks.\n \nThank you,4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 2/5\n\nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E W eatherford\nFort W orth, TX 76196\nTBAllison@tarrantcountytx. gov\n \n \nF r o m : FUDSTOP <chuckdustin12@gmail.com>\nS e n t : Thursday, March 27, 2025 9:00 AM\nT o : Tegan B. Allison <TBAllison@tarrantcountytx.gov>\nS u b j e c t : Re: CAUSE# 233-765358-25 EX-PARTE TRO\n \nEXTERNAL EMAIL ALERT! Think Before You Click!\nMs. Allison,\n \n \nThank you for the update.\n \nIs there a time available tomorrow to come and present the order? Preferably between 9am and 2pm? \n "}
{"id": "1bf7f385a0ddcf350914e7fe9f566018bd28b387", "vector_id": 31, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 31, "char_len": 2000, "text": "TE TRO\n \nEXTERNAL EMAIL ALERT! Think Before You Click!\nMs. Allison,\n \n \nThank you for the update.\n \nIs there a time available tomorrow to come and present the order? Preferably between 9am and 2pm? \n \nI have informed the opposing party of the intent to present the order and will provide the time and date upon determination\nof the court's availability .\n \nThank you for your assistance.\n \nCharles Dustin Myers\nChuckdustin12@gmail.com  4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 3/5\n\n817-546-3693\n \nOn Thu, Mar 27, 2025, 8:45  AM Tegan B. Allison < TBAllison@tarrantcountytx.gov > wrote:\nThis order needs to be presented in person. Likewise, you need to inform opposing counsel of the date\nand time you intend to present this order to the court.\n \nThank you,\n \nTegan Allison\nAuxiliary Court Coordinator\nTarrant County Family Law Center\nPhone: (817)884-1614\n200 E W eatherford\nFort W orth, TX 76196\nTBAllison@tarrantcountytx. gov\n \n[Quoted text hidden]\nFUDST OP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 9:19 AM\nTo: \"Tegan B. Allison\" <TBAllison@tarrantcountytx.gov>\nMs. Allison,\nThank you very much. \nI have informed opposing counsel that I intend to present the TRO tomorrow at 9:00 AM, the relief being sought, and if\nanything changes I will inform the court and likewise the opposing party .\nHave a wonderful day .\nRespectfully ,\nCharles Dustin Myers\nChuckdustin12@gmail.com\n817-546-3693\n[Quoted text hidden]\n4 attachments4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 4/5\n\n~WRD0000.jpg\n1K\nimage001.jpg\n6K\nimage001.jpg\n6K\n~WRD0000.jpg\n1K4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404"}
{"id": "7ada9f91e73ffd8f9d427ee7b3e27c8c3f1a4f85", "vector_id": 32, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 32, "char_len": 2000, "text": "image001.jpg\n6K\nimage001.jpg\n6K\n~WRD0000.jpg\n1K4/8/25, 11:43 AM Gmail - CAUSE# 233-765358-25 EX-PARTE TRO\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-8479404933152973584&simpl=msg-a:r-82678869869281… 5/5\n\nEXHIBIT 2\nTRO COMMUNICATIONS\n03/24/25\n\nFUDSTOP <chuckdustin12@gmail.com>\nRE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\n3 messages\nCooper Carter <coopercarter@majadmin.com> Mon, Mar 24, 2025 at 10:03 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood Morning,\nOpposing party is a pro se Petitioner in the above referenced case. He has filed a SAPCR petition regarding this matter .\nThere is a current pending divorce case that encompasses issues regarding children. Our of fice has filed an Answer as\nwell as a Motion to Consolidate and proposed order in this case to consolidate this SAPCR into the pending divorce\nproceeding in the 322nd.\nCould you please provide dates and times that the Court is available to hear my motion?\nOpposing party has been cc-ed to this e-mail for convenience.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search="}
{"id": "094f4c8b1ba69ec9e5bf97076cc7e9c54740a3dd", "vector_id": 33, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 33, "char_len": 2000, "text": " US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 1/3\n\nWILL NOT RESPOND.\nFr om:  Cooper Carter < coopercarter@majadmin.com>\nSen t: Monday, March 24, 2025 10:03 AM\nT o: Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov>\nCc: 'Charlie Vids' < chuckdustin12@gmail.com>\nSubject:  RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Mon, Mar 24, 2025 at 10:15 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nMs. Wierzbicki, Mr. Carter,\nThank you for the update. However, I must respectfully object to the assertion that this is a mandatory consolidation.\nUnder Texas Rule of Civil Procedure 174(a), consolidation is discretionary and not automatic where doing so would cause\ndelay, injustice, or prejudice to a party. Additionally, the Texas Supreme Court in Curtis v. Gibbs, 511 S.W.2d 263 (Tex.\n1974) expressly carved out exceptions to dominant jurisdiction where:\nThe original case was filed in bad faith,\nThe case isn't been prosecuted;\nEquity and justice require an independent forum.All three conditions are present here. The SAPCR was filed in good faith after the 322nd case became procedurally\nstalled and legally defective—with no Notice of Remand, no evidentiary rulings on the children, and pending dispositive\nmotions including unopposed requests for dismissal. \nIt would be prejudicial to the children to consolidate a case that had no ability to proceed.\nThank you.\nRespectfully,\nCharles Dustin Myers\nPro Se Petitioner\n[Quoted text hidden]4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthi"}
{"id": "ba92303513a39b26f1665526fe4e9320d1c342f5", "vector_id": 34, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 34, "char_len": 2000, "text": "Myers\nPro Se Petitioner\n[Quoted text hidden]4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 3/3\n\nEXHIBIT 3\nTRO COMMUNICATIONS\n03/26/25\n\nFUDSTOP <chuckdustin12@gmail.com>\nNotice\n1 message\nFUDSTOP <chuckdustin12@gmail.com> Wed, Mar 26, 2025 at 7:19 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Myers <morganmw02@gmail.com>\nFriends on other side,\nThe Emergency EX-PARTE TRO has been filed and accepted by the court and is awaiting the judge's review. \nIf a hearing is required, I will CC Cooper in the email correspondence.\nIf a hearing is not required, I will serve each of you with a copy of the TRO and proposed order in accordance with the\nrules no later than seven days prior to the hearing.\nThe TRO has the following provisions:\n*Respondent is PROHIBITED from preventing Petitioner from entering the matrimonial residence located at 6641\nAnne Ct, Watauga, TX 76148.\n* Respondent is PROHIBITED from disturbing the peace of the minor children named in this suit.\n* Petitioner and Respondent are PROHIBITED from acting without candor towards all members of the householdin the presence of the children.\n* Respondent is PROHIBITED from bringing the children in the presence of DAMEN GAUL T KAZLAUSKAS.\n* Respondent is PROHIBITED from taking the children outside of T arrant County, Texas.\nThese provisions, if granted, will be in effect until a full hearing is held no later than 14 days after the order is signed by\nthe judge.\nOnce the notice of hearing is served on all parties, I will be filing a motion for pre-trial conference to discuss the Rule 12\nmotion filed and served last week to ensure those issues are resolved prior to trial. \nAt the hearing, the relief I am seeking is to convert the provisions from the TRO into temporary injunctions which will be\nthe exact same but will ask for them to remain until "}
{"id": "6fa88b691cd8adfc9f4aa642b8ed13b68baf50f4", "vector_id": 35, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 35, "char_len": 2000, "text": "solved prior to trial. \nAt the hearing, the relief I am seeking is to convert the provisions from the TRO into temporary injunctions which will be\nthe exact same but will ask for them to remain until further order of the court and reset the status quo to March 6, 2024,\nwhich was the last peaceful time enjoyed by all parties prior to the Respondent's unlawful lockout.\nIf a continuance is needed in order to get your affairs in order for the Rule 12 conference, please reach out as I have no\nproblem signing an agreed continuance if more time is needed.\nI am not seeking sanctions at this time.\nIf granted, I believe the preceding details suit the best interests of Mara and Caroline, preserves their emotional and\nfinancial well-being, allows myself to repair the substantial damage caused from the prior thirteen months, promotes an\namicable co-parenting relationship, and most importantly upholds Texas Law in ensuring that children have continuous,\nfrequent access to both parents and that parents are encouraged to work together during and after divorce because\ndoing so is in their best interests.\nI'm not looking to punish, hurt, or ruin anyone. I'm simply looking to do what's best for the kids and start working together\nto finish this so we can all move on with our lives.\nIf you have any suggestions, modifications, or alternative solutions, please feel free to reach out and let me know , or\nschedule a time and place to meet in person that best meets your schedule.\nRespectfully,\n4/12/25, 1:04 PM Gmail - Notice\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&simpl=msg-a:r825366924926110… 1/2\n\nCharles Dustin Myers\nchuckdustin12@gmail.com\n817-546-36934/12/25, 1:04 PM Gmail - Notice\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&simpl=msg-a:r825366924926110… 2/2\n\nAngie D. W ierzbicki <ADWierzbicki@tarrantcountytx.gov> Mon, Mar 24, 2025 at 10:08 AM\nTo: Cooper Carter"}
{"id": "2ea20d98a2c59d875dfb1052e935535fd23875dc", "vector_id": 36, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 36, "char_len": 2000, "text": "1f7&view=pt&search=all&permthid=thread-a:r2750686800934231680&simpl=msg-a:r825366924926110… 2/2\n\nAngie D. W ierzbicki <ADWierzbicki@tarrantcountytx.gov> Mon, Mar 24, 2025 at 10:08 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie V ids <chuckdustin12@gmail.com>\nGood morning,\n \nThe Motion to Consolidate just needs to be filed in the 322nd Divorce case and sent to their Judge to sign; no hearing\nnecessary, it’s a mandatory consolidation.\n \nThank you,\n \nAngie D. Wierzbicki\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. Weatherford St., 5th Floor\nFt. Worth, TX 76196\n \n***PLEASE NOTE: YOU MUST PROVIDE LOCAL COURT RULE\nDOCUMENTS IF YOU ARE SET FOR A HEARING IN EITHER COURT. \nFAILURE TO PROVIDE LOCAL COURT RULE DOCUMENTS COULD\nRESULT IN THE RESET OF YOUR CASE***\n \n \nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRESENTED LITIGANTS, I4/8/25, 11:40 AM Gmail - RE ITIO MYERS CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827488253181598941&simpl=msg-f:182748825318159894… 2/3\n\nEXHIBIT 4\nTRO COMMUNICATIONS\n03/27/25\n\nFUDST OP <chuckdustin12@gmail.com>\nTRO + Exhibits + Proposed Order\n1 message\nFUDST OP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 5:54 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, Morgan Myers <morganmw02@gmail.com>\nAttached for your reference is the TRO, proposed order , and exhibits.\nRespectfully ,\nCharles Dustin Myers\n6641 Anne Ct, W atauga, TX 76148\n817-546-3693\nchuckdustin12@gmail.com\n3 attachments\nemergency_motion_formatted (3) (2).pdf\n273K\nPROPOSED ORDER (2).pdf\n185K\nEXHIBITS - TRO.pdf\n8784K\n4/9/25, 11:44 AM Gmail - TRO + Exhibits + Proposed Order\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-7307259866084711537&simpl=msg-a:r-72989974457063… 1/1\n\nFUDSTOP <chuckdustin12@gmail.com>\nITIO MORGAN CHILDREN, CAUSE"}
{"id": "d4a0302d45909a71854951ea33b93704124554db", "vector_id": 37, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 37, "char_len": 2000, "text": "ps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r-7307259866084711537&simpl=msg-a:r-72989974457063… 1/1\n\nFUDSTOP <chuckdustin12@gmail.com>\nITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\n6 messages\nCooper Carter <coopercarter@majadmin.com> Thu, Mar 27, 2025 at 6:20 PM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood Evening,\nI have received communication from opposing party who is pro se that he will be walking through an Emergency TRO.\nOur office has a hearing scheduled for tomorrow morning in Parker County and is unable to attend. However, I will be\navailable by cell phone regarding this matter if the Judge would like to speak to me regarding the Emergency TRO.\nPlease contact our office to patch me in for any calls that Judge would like to have.\nAdditionally, this case already is pending in the 322nd for a divorce proceeding regarding property and children matters.\nWe will be consolidating the case and walking it through the 322nd for signature next week.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332"}
{"id": "69d9de0a009b71efebaaef7e852ddcac3a612c1e", "vector_id": 38, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 38, "char_len": 2000, "text": "THANK YOU.       \n3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 1/7\n\nFUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 7:03 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCourt staff,\nMs. Carter’s recent correspondence is improper for several reasons, and appears to be an attempt to delay or interfere\nwith proceedings in which she has otherwise failed to meaningfully participate in. The following reasons support this\nstatement:\n1.An objection to consolidation is already on file and remains unopposed. It cites controlling Texas precedent. Any\nsuggestion that consolidation is agreed upon or inevitable is misleading. Instead, she should properly file with the court\nwhy the consolidation is improper or at the very least argue against Petitioner's position.\n2.Ms. Carter has not fulfilled her obligation under Texas Rule of Civil Procedure 237a to file a Notice of Remand. Until\nshe does, she is prohibited from proceeding or filing anything in the 322nd District Court as they currently do not have\njurisdiction over this matter until this obligation is fulfilled.\n3.Her authority to represent the Respondent remains under challenge pursuant to a Rule 12 motion filed September 20,\n2024. No hearing has been held, no written statement of authority has been filed, and no ruling has been made. Until\nresolved, Rule 12 bars her from participating in either proceeding.\n4.Ms. Carter has not prosecuted the case in the 322nd District Court in over eight months. This inaction has prejudiced\nthe Petitioner and delayed resolution of urgent matters affecting the children.\n5.She has failed to file any objections, responsive pleadings, or legal arguments opposing the relief requested—including\nthe Emergency TRO now pending.\n6.Rather than reaching out to Petitioner to resolve any scheduling conflict, Ms. Carter imprope"}
{"id": "2c85b5855b0fa788871227271a77e27be2b7d56c", "vector_id": 39, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 39, "char_len": 2000, "text": "ive pleadings, or legal arguments opposing the relief requested—including\nthe Emergency TRO now pending.\n6.Rather than reaching out to Petitioner to resolve any scheduling conflict, Ms. Carter improperly attempted to influence\nthe court by email. This violates the spirit of cooperation required by the rules, particularly where her participation is\nprocedurally barred.\n7.Ms. Carter ’s conduct appears designed to delay relief and subvert the best interest of the children, despite her failure to\noppose the requested relief in any meaningful way.\n8.She has been provided with full notice of the Emergency TRO, the proposed order, supporting exhibits, and the time\nand location of presentment. She has no legal basis to subvert Petitioner's due process rights.\nIn summary, Ms. Carter has not provided anything of substance in either Court, has not prosecuted the case, has not\nargued on behalf of her client, or followed proper procedure.\nSimply labeling the opposition as pro se and claiming that the consolidation will be filed without disclosing the above facts\nis dishonest and should not be permitted as it will only cause further unnecessary delays to the relief being sought without\nany substance being provided.\nAgain, all of these points have been argued in both courts, and it is her duty as counsel to handle these matters in\naccordance with Texas Law.\nThese matters should be handled between the parties - not attempt to influence court staf f after hours.\nThe reason we are here in the first place is due to the above unanswered facts. Ms. Carter has had ample time to file an\nobjection, response, or counter argument, but has chosen not to do so.\nIt would've been far more appropriate for Ms. Carter to have reached out to me directly to discuss scheduling conflicts.\nPrior to the latest email, there was no indication Ms. Carter intended to participate at all despite being provided with all\nrelevant materials.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 C"}
{"id": "09e86e29c41bbe4220fa1b6ba3cd91697c502198", "vector_id": 40, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 40, "char_len": 2000, "text": "st email, there was no indication Ms. Carter intended to participate at all despite being provided with all\nrelevant materials.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 2/7\n\nThe court should disregard this email correspondence in its entirety for the reasons stated herein as it is highly prejudicial\nto Petitioner and the children.\nPro se litigants are expected to follow the rules of procedure to the same extent licensed attorneys are.\nThis email chain should be disregarded in its entirety.\nHave a good evening.\nRespectfully,\nCharles Dustin Myers\nPetitioner, Pro Se\n[Quoted text hidden]FUDSTOP <chuckdustin12@gmail.com> Thu, Mar 27, 2025 at 7:07 PM\nTo: Cooper Carter <coopercarter@majadmin.com>, \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCourt staff,\nMs. Carter’s recent correspondence is improper for several reasons, and appears to be an attempt to delay or interfere\nwith proceedings in which she has otherwise failed to meaningfully participate in. The following reasons support this\nstatement:\n1.An objection to consolidation is already on file and remains unopposed. It cites controlling Texas precedent. Any\nsuggestion that consolidation is agreed upon or inevitable is misleading. Instead, she should properly file with the court\nwhy the consolidation is improper or at the very least argue against Petitioner's position.\n2.Ms. Carter has not fulfilled her obligation under Texas Rule of Civil Procedure 237a to file a Notice of Remand. Until\nshe does, she is prohibited from proceeding or filing anything in the 322nd District Court as they currently do not have\njurisdiction over this matter until this obligation is fulfilled.\n3.Her authority to represent the Respondent remains under challenge pursuant to a Rule 12 motion filed September 20,\n2024. No hearing has been held, no written stateme"}
{"id": "f7cfb85b1ef43ed7f84e5ca3713c907f46332515", "vector_id": 41, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 41, "char_len": 2000, "text": "il this obligation is fulfilled.\n3.Her authority to represent the Respondent remains under challenge pursuant to a Rule 12 motion filed September 20,\n2024. No hearing has been held, no written statement of authority has been filed, and no ruling has been made. Until\nresolved, Rule 12 bars her from participating in either proceeding.\n4.Ms. Carter has not prosecuted the case in the 322nd District Court in over eight months. This inaction has prejudiced\nthe Petitioner and delayed resolution of urgent matters affecting the children.\n5.She has failed to file any objections, responsive pleadings, or legal arguments opposing the relief requested—including\nthe Emergency TRO now pending.\n6.Rather than reaching out to Petitioner to resolve any scheduling conflict, Ms. Carter improperly attempted to influence\nthe court by email. This violates the spirit of cooperation required by the rules, particularly where her participation is\nprocedurally barred.\n7.Ms. Carter ’s conduct appears designed to delay relief and subvert the best interest of the children, despite her failure to\noppose the requested relief in any meaningful way.\n8.She has been provided with full notice of the Emergency TRO, the proposed order, supporting exhibits, and the time\nand location of presentment. She has no legal basis to subvert Petitioner's due process rights.\nIn summary, Ms. Carter has not provided anything of substance in either Court, has not prosecuted the case, has not\nargued on behalf of her client, or followed proper procedure.\nSimply labeling the opposition as pro se and claiming that the consolidation will be filed without disclosing the above facts\nis dishonest and should not be permitted as it will only cause further unnecessary delays to the relief being sought without\nany substance being provided.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f"}
{"id": "4470232b3ada2a7745a93af54b6a718f5fc3a9be", "vector_id": 42, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 42, "char_len": 2000, "text": "ed.3/29/25, 12:09 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 3/7\n\nEXHIBIT 5\nTRO COMMUNICATIONS\n03/28/25\n\nAgain, all of these points have been argued in both courts, and it is her duty as counsel to handle these matters in\naccordance with Texas Law.\nThese matters should be handled between the parties - not attempt to influence court staf f after hours.\nThe reason we are here in the first place is due to the above unanswered facts. Ms. Carter has had ample time to file an\nobjection, response, or counter argument, but has chosen not to do so.\nIt would've been far more appropriate for Ms. Carter to have reached out to me directly to discuss scheduling conflicts.\nPrior to the latest email, there was no indication Ms. Carter intended to participate at all despite being provided with all\nrelevant materials.\nThe court should disregard this email correspondence in its entirety for the reasons stated herein as it is highly prejudicial\nto Petitioner and the children.\nPro se litigants are expected to follow the rules of procedure to the same extent licensed attorneys are.\nThis email chain should be disregarded in its entirety.\nHave a good evening.\nRespectfully,\nCharles Dustin Myers\nPetitioner, Pro Se\n[Quoted text hidden]Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov> Fri, Mar 28, 2025 at 9:15 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie Vids <chuckdustin12@gmail.com>\nGood morning,\nMr. Myers appeared before me to schedule the hearing for the TRO; my apologies I did not realize this was that\nsame case.  We can go ahead and set the TRO with us, but most likely the case will be transferred prior to the\nhearing date and the case needs to be transferred prior to that date.\nMr. Myers will be emailing with dates available for the hearing.\nThank you,\nAngie D. Wierzbicki\nCourt Coordinator\n233rd Judicial Dist"}
{"id": "b5c6ed411a24d32fe3b4fad0fbf674410ce150a6", "vector_id": 43, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 43, "char_len": 2000, "text": "ring date and the case needs to be transferred prior to that date.\nMr. Myers will be emailing with dates available for the hearing.\nThank you,\nAngie D. Wierzbicki\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. Weatherford St ., 5th Floor\nFt. Worth, TX 761963/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 4/7\n\n***PLEASE NOTE: YOU MUST PROVIDE LOCAL COURT RULE\nDOCUMENTS IF YOU ARE SET FOR A HEARING IN EITHER COURT. \nFAILURE TO PROVIDE LOCAL COURT RULE DOCUMENTS COULD\nRESULT IN THE RESET OF YOUR CASE***\n \n \nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRESENTED LITIGANTS, I\nWILL NOT RESPOND.\n \nF r o m : Cooper Carter <coopercarter@majadmin.com>\nS e n t : Thursday, March 27, 2025 6:20 PM\nT o : Angie D. Wierzbicki <ADWierzbicki@tarrantcountytx.gov>\nC c : 'Charlie Vids' <chuckdustin12@gmail.com>\nS u b j e c t : ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\n \nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nAngie D. W ierzbicki <ADWierzbicki@tarrantcountytx.gov> Fri, Mar 28, 2025 at 9:19 AM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCc: Charlie V ids <chuckdustin12@gmail.com>\nAdditionally, since there is an objection to the consolidation, y’all will need to reach out to request how to proceed\nwith the 322nd as I am usure of their procedures.\n \nThank you,\n \nAngie D. Wierzbicki3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 5/7\n\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. Weatherford St ., 5th Floor\nFt. Worth, TX 76196\n***PLEASENOTE:YOUMUST P"}
{"id": "ab7bcf013b8529a01d1270272d23dea84c425f3d", "vector_id": 44, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 44, "char_len": 2000, "text": ":182779130240933262… 5/7\n\nCourt Coordinator\n233rd Judicial District Court\n(817) 884-2686\nTarrant County Family Law Center\n200 E. Weatherford St ., 5th Floor\nFt. Worth, TX 76196\n***PLEASENOTE:YOUMUST PROVIDE LOCALCOURT RULE\nDOCUMENTS IF YOUARE SET FORA HEARINGIN EITHER COURT. \nFAILURE TO PROVIDE LOCALCOURT RULE DOCUMENTS COULD\nRESULT IN THERESETOFYOUR CASE***\nYOU MUST INCLUDE EVERYONE ON YOUR EMAIL COMMUNICATION.  IF YOU\nFAIL TO INCLUDE OPPOSING COUNSEL OR SELF REPRESENTED LITIGANTS, I\nWILL NOT RESPOND.\n[Quoted text hidden]\nFUDSTOP <chuckdustin12@gmail.com> Fri, Mar 28, 2025 at 9:59 AM\nTo: \"Angie D. Wierzbicki\" <ADWierzbicki@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nHello all,\nSorry for the delay. I had to hunt down wifi.\nAvailable dates are:\n04/10/25 at 930 AM\n04/09/25 at 130 PM\n04/08/25 at 930 AM\n04/07/25 at 130 PM\nThank you.3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 6/7\n\nAny of these dates work for me.\nRespectfully,\nCharles Myers\n8175463693\n[Quoted text hidden]\nimage001.png\n120K3/30/25, 5:10 PM Gmail - ITIO MORGAN CHILDREN, CAUSE NO. 233-765358-25 CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1827791302409332626&simpl=msg-f:182779130240933262… 7/7\n\nEXHIBIT 6\n03/28/25\n\n\n\nEXHIBIT 7\nTRO COMMUNICATIONS\n04/03/2025\n\nFUDSTOP <chuckdustin12@gmail.com>\nRE MOTION FOR CONSOLIDATION CL-12105\n2 messages\nCooper Carter <coopercarter@majadmin.com> Thu, Apr 3, 2025 at 1:33 PM\nTo: Charlie Vids <chuckdustin12@gmail.com>\nGood Afternoon,\nThis is to inform you that I will be walking through the attached Motion for Consolidation and Proposed Order tomorrow\nmorning at 9:00 a.m. in the 322nd for signature.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 9"}
{"id": "c4639aa0b9969c236d7243f1440ac43a0453f875", "vector_id": 45, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 45, "char_len": 2000, "text": "tomorrow\nmorning at 9:00 a.m. in the 322nd for signature.\nThank you,\nCooper L. Carter\nAttorney at Law\nMarx, Altman & Johnson\n2905 Lackland Road\nFort Worth, Texas 76116\nTel: (817) 926-6211\nFax: (817) 926-6188\nTHIS MESSAGE IS INTENDED ONLY FOR THE USE OF THE INDIVIDUAL OR ENTITY TO WHOM IT IS\nADDRESSED AND MAY CONTAIN INFORMATION THAT IS CONFIDENTIAL AND PROTECTED FROM\nDISCLOSURE BY LAW. IF THE READER OF THIS MESSAGE IS NOT THE INTENDED RECIPIENT OR THE\nEMPLOYEE OR AGENT RESPONSIBLE FOR DELIVERING THE MESSAGE TO THE INTENDED RECIPIENT, YOU\nARE HEREBY NOTIFIED THAT ANY DISTRIBUTION OR COPYING IS PROHIBITED. IF YOU HAVE RECEIVED\nTHIS COMMUNICATION IN ERROR, PLEASE NOTIFY US IMMEDIATELY BY TELEPHONE (COLLECT) AND\nRETURN THE ORIGINAL MESSAGE TO US AT THE ABOVE ADDRESS VIA E-MAIL. THANK YOU.       \n2 attachments\nMotion to Consolidate V.1.pdf\n13K\n4/12/25, 1:03 PM Gmail - RE MOTION FOR CONSOLIDATION CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1828407429439264551&simpl=msg-f:182840742943926455… 1/2\n\nOrder on Motion to Consolidate V1.pdf\n10K\nFUDSTOP <chuckdustin12@gmail.com> Thu, Apr 3, 2025 at 1:55 PM\nTo: Cooper Carter <coopercarter@majadmin.com>\nCooper,\nI've already objected.\nYou have no legal authority to do so until you address my objection filed and served to you.\nFurthermore, you have not sent the Notice required by rule 237a of the Texas Rules of Civil Procedure and have not\nshown you authority to represent the Petitioner in this matter.\nFinally, you claimed to have been retained in your individual capacity yet are claiming Marx Altman and Johnson is filing\npleadings on your behalf, and Roderick D. Marx is not a party in this suit nor has he made a formal appearance.\nYou're well aware of these obligations, and any order resulting from this motion will be challenged via the proper legal\nproceedings.\nYou cannot continue to disregard the rules of procedure, fail to respond to motions or evidence served to you, and\ncontinue "}
{"id": "21b35ef9aa91795ac2aa780b59e7b5e409cfb222", "vector_id": 46, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_18_25_sapcr_cover_1\\03_18_25_sapcr_cover_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.18.25 - SAPCR  COVER-1.pdf", "source_exists": true, "page": null, "chunk_index": 46, "char_len": 1102, "text": "lting from this motion will be challenged via the proper legal\nproceedings.\nYou cannot continue to disregard the rules of procedure, fail to respond to motions or evidence served to you, and\ncontinue to expect favors from the bench in leu of you performing your duties as a licensed attorneys.\nYou are put on notice that if any such motion is presented to the court in the face of the above facts or the unanswered\nobjection already served to you, I will move for your disqualification immediately and will provide the Texas OAG with your\ninformation and detailed misconduct as well as the State Bar of Texas.\nFurther, you have not provided or served a copy of the proposed order which you intend to present, which is required.This conversation will be filed and made apart of the official court record. \nRespectfully submitted,\nCharles Myers\n817-546-3693\nChuckdustin12@gmail.com\n[Quoted text hidden]4/12/25, 1:03 PM Gmail - RE MOTION FOR CONSOLIDATION CL-12105\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-f:1828407429439264551&simpl=msg-f:182840742943926455… 2/2"}