{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\02.20.25 - MOTION TO SIGN-1.pdf",
  "base_name": "02_20_25_motion_to_sign_1",
  "page_count": 19,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \n \n \nTO THE HONORABLE JUDGE OF THIS COURT:  \n As of today, February 20th, 2025, there exists before the court an unopposed \nSummary Judgement Motion ﬁled on February 26, 2024, a request for discovery and \nadmissions alongside a motion to compel which have gone unanswered, an unopposed motion for temporary orders seeking emergen cy relief ﬁled in September of 2024 that \nremains unanswered , a rule 12 motion ﬁled to compel opposing counsel Cooper L. Carter  \nserved on September 20, 2024, an un -answered motion to dismiss ﬁled on January 13, \n2025, an emergency mot ion for custody, sole use of the marital residence, sanctions, and \ncontempt which remains unopposed, and the case is indeﬁnitely stalled due to the opposing counsel’s inability to ﬁle the certiﬁed copy of the notice of remand from the North ern District of Texas.  Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. MOTION TO SIGN  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2025 -02-20",
      "char_length": 1046
    },
    {
      "page_number": 2,
      "text": "2 \n  For the reasons outlined below, and in accordance with Texas laws, the Petitioner \nhas no legal avenue to prevail on the merits of this case, and the clerks of the court should \ndeliver this motion and the accompanying order for signature immediately upon r eceipt of \nthis motion to sign. Respondent’s efforts have been in accordance with Texas laws, his \nintent has been in the best interests of his children, and all efforts to communicate with the \ncourt have been in an attempt to bring the truth of the matter b efore it.  \n For the forthcoming reasons, the Respondent shows that, without question, the \nattached orders should be signed and served upon all parties:  \nI. INTRODUCTION  \nProcedural Posture  \n1. This case cannot proceed further on a lawful basis due to multiple procedural violations by Petitioner’s counsel, fraud on the court , and the total lack of \nopposition to Respondent’s key motions. Petitioner and her counsel have failed to respond to or contest critical ﬁlings, leaving the case in a legally untenable posture.  \nImmediate Relief Sought   \n2. Respondent urgently requests that the Court restore his parental rights and \nimmediately reinstate his exclusive possession of the marital residence. He further seeks an injunction to restrain Petitioner from any continued interference or \ndissipation of assets, and asks the Court to dismiss this action or, alternatively, to rule on all of Respondent’s pending motions that stand unopposed.  Only such",
      "char_length": 1484
    },
    {
      "page_number": 3,
      "text": "3 \n immediate relief will halt the ongoing harm caused by the improper orders now in \nplace  which claim consent where none was given.  \nCounsel Misconduct Invalidate Orders  \n3. The standing orders  in this case are tainted by misconduct  and should not be \nallowed to stand. Petitioner’s counsel has failed to comply with mandatory e-ﬁling and e -service rules , has been unable to ﬁle required procedural documents \n(such as the Notice of Remand that currently has this case grid -locked) to move the \ncase forward, and obtained prior “agreed” orders through misrepresentation of \nRespondent’s consent . These fundamental defects invalidate the temporary \norders  presently governing this case. Respondent respectfully moves the Court to \nvacate those order s immediately and grant the relief outlined herein , as supported \nby Texas Law  \nII. LEGAL ANALYSIS  \nA. MANDATORY E -FILING REQUIREMENTS VIOLATED  \nE-File and E -Service Required  \n4. Under Texas law, attorneys must utilize the electronic ﬁling system in jurisdictions where e -ﬁling is mandated. Texas Rule of Civil Procedure 21(f)(1) provides that, \nexcept for limited exceptions, “attorneys must electronically ﬁle documents in \ncourts where electronic ﬁling has been mandated.”  Likewise, Rule 21a(a)(1) \nrequires that any document electronically ﬁled “must be served electronically",
      "char_length": 1349
    },
    {
      "page_number": 4,
      "text": "4 \n through the electronic ﬁling manager if the email address of the party or \nattorney to be served is on ﬁle”  which is the case here.  These rules make e -ﬁling \nand e -service mandatory  in Tarrant County District Court proceedings.  \nCounsel’s Non -Compliance  \n5. Petitioner’s counsel has blatantly violated these requirements. She has failed to properly e-ﬁle pleadings in this case and has not e -served Respondent with ﬁlings \nas required. In fact, when counsel attempted to amend Petitioner’s pleadings on \nJanuary 30, 2024, the document was not ﬁled by counsel herself  at all – it had to \nbe ﬁled on her behalf by her self -reported formal employer – Marx, Altman, & \nJohnson.  \n6. This indicates that counsel’s Electronic Filing Manager (EFM) account or setup was not in order, and she was not in compliance  with the e -ﬁling mandate  .  \nB. OPPOSING COUNSEL CANNOT LEGALLY FILE OR PROSECUTE CASE \nCounsel’s Filing Disability  \n7. Petitioner’s counsel has demonstrated that she is procedurally incapable of \nprosecuting this case. As noted, her EFM account is apparently still tied to her prior \nlaw ﬁrm,  registered under the email of COOPERCARTER@CANTEYHANGAR.COM , \nas evidenced by Exhibit 1 below,  preventing her from independently e -ﬁling \ndocuments on this Court’s docket. The record reﬂects that counsel’s Amended \nPetition had to be ﬁled by a third -party attorney from her former ﬁrm, rather than by \ncounsel of record herself . (See the Amended Petition for Divorce filed 01/30/2024,",
      "char_length": 1509
    },
    {
      "page_number": 5,
      "text": "5 \n the Motion for Pre- Trial Conference filed in June of 2024, and take note that there \nwas never a reduced ‘agreed’ temporary orders served prior to their rendition.  \n8. This irregularity suggests that counsel lacks the ability to ﬁle pleadings in her own \nname in the e -ﬁling system. An attorney who cannot even ﬁle pleadings properly \ncannot litigate a case in compliance with Texas procedure.  \nNo Notice of Remand – Case Stalled  \n9. The case’s posture further illustrates counsel’s inability to move the matter forward. \nRespondent removed this case to federal court on December 12, 2024; the federal \ncourt remanded it back to state court on December 17, 2024. Upon remand, Texas law, speciﬁcally rule 237a of the Texas Rules of Civil Procedure, which states that \nthe “plaintiff shall  ﬁle a certiﬁed copy of the order of remand with the clerk of the \nstate court and shall forthwith give written notice of such ﬁling to the attorneys of record  for all adverse parties .”  \n10.  To date, no Notice of Remand has been ﬁled  by Petitioner or her counsel, meaning \nthis case has never been officially re -docketed post -remand. In Respondent’s \nwords, “the case is now procedurally check -mated because the opposing party \ncan’t ﬁle the mandatory notice of remand with the clerk ” – which was his exact \nstrategic intent in removing the case.  \n11. In other words, due to opposing counsel’s ﬁling incapacity, the case cannot progress on the state court’s docket. This procedural limbo has prejudiced Respondent and left the case in a state of suspension for over two months.",
      "char_length": 1584
    },
    {
      "page_number": 6,
      "text": "6 Incapable of F urther R epresentation \n12. G\niven these circumstances, Respondent submits that Petitioner’s counsel is\nprocedurally disqualiﬁed from further representation in this matter. She has not\nproperly appeared or ﬁled anything since the remand, and her earlier attempts were\nnon -compliant. Texas courts cannot countenance a case languishing because an\nattorney is unable to perform the basic act of ﬁling pleadings. Respondent requests\nan order recognizing that Petitioner’s counsel, by virtue of her inability to ﬁle and\nserve documents as req uired, cannot continue to represent Petitioner  in this\naction. At this juncture, the only appropriate remedies are to dismiss the caseoutright  or to immediately proceed to rule on Respondent’s unopposed dispositive\nmotions (which would effectively resolve the contested matters of the case ). In\neither event, the Court’s intervention is needed to break the procedural logjamcaused by counsel’s inaction  mixed with the Petitioner, MORGAN MICHELLE\nMYERS, deceptive actions.\nC. UNOPPOSED MOTIONS REQUIRE IMMEDIATE RULING\nFailure to Oppose = Consent to Grant  \n13. Under Texas law, when a party fails to respond to a motion, the court may considerthe motion unopposed and grant it as a matter of course. This principle is especially\ntrue for dispositive motions and those involving discovery sanctions. Petitioner andher counsel have wholly failed to respond or object  to multiple motions that\nRespondent ﬁled, thereby conceding the merits of those motions. The Court should",
      "char_length": 1531
    },
    {
      "page_number": 7,
      "text": "7 \n immediately grant each of the following motions , all of which have been on ﬁle \nfor months without any response from Petitioner . \nNo-Evidence Motion for Summary Judgment (ﬁled Feb. 26, 2024)  \n14. Respondent moved for summary judgment on the ground that Petitioner produced \nno evidence to support her claims (and notably, Petitioner also never answered Respondent’s earlier emergency motion). Petitioner ﬁled no response or summary \njudgment evidence whatsoever. Pursuant to  Texas Rule of Civil Procedure 166a :  \n \n“[t]he judgment sought shall be rendered forthwith if (i) the deposition transcripts, \ninterrogatory answers, and other discovery responses referenced or set forth in the \nmotion or response, and (ii) the pleadings, admissions, affidavits, stipulations of the \nparties, and authenticated or certiﬁed public records, if any, on ﬁle at the time of the hearing, or ﬁled thereafter and before judgment with permission of the court, show that, except as to the amount of damages, there is no genuine issue as to any material fact and the moving party is entitled to judgment as a matter of law on the issues expressly set out in the motion or in an answer or any other response. ” \n \n15. Because Petitioner (the non -movant) failed to produce any evidence or response, \nRespondent’s summary judgment motion must be granted as a matter of law. There \nare no fact issues preventing judgment in Respondent’s favor on the pending claims , \nand the only genuine issue that remains is the amount of damages. This ﬁts squarely \nwith Texas Law and entitles Respondent a judgement in his favor.  \nRule 12 Motion to Show Authority (ﬁled Sept. 20, 2024)  \n16. Respondent ﬁled a sworn Rule 12 motion challenging the authority of Petitioner’s \nattorney, as by that point counsel had not ﬁled a single substantive pleading on the record. Petitioner’s counsel never responded to the Rule 12 motion and never",
      "char_length": 1911
    },
    {
      "page_number": 8,
      "text": "8 \n appeared to prove her authority to act. Texas Rule of Civil Procedure 12 places the \nburden on the challenged attorney to “show sufficient authority to prosecute or defend the suit on behalf of”  her client, and if the attorney fails, “the court shall \nrefuse to permit the attorney to appear in the cause, and shall strike the pleadings if \nno person who is authorized to prosecute or defend appears.”  \n17. Here, counsel has not met her burden or even attempted to show authority. The \nRule 12 motion is unopposed and should be granted by default . \nRequest for Admissions and Production of Documents (ﬁled Sept. 17, 2024)  \n18. Respondent moved to  provide written admissions and production of certain \ndocuments, and later a motion  compel Petitioner’s responses to discovery after \nPetitioner failed to answer written discovery requests. Petitioner has never served any discovery responses  to Respondent’s admissions , requests for production, or \nother requests, nor did she respond to the motion to compel. By failing to answer discovery or oppose the motion, Petitioner has waived all objections and left Respondent with no recourse except c ourt intervention. The motion to compel is \nunopposed and should be granted immediately , ordering Petitioner to fully \nrespond to all outstanding discovery requests. Moreover, because Petitioner’s failure to respond is without justiﬁcation, the Court should impose sanctions for discovery abuse  under Tex. R. Civ. P. 215.2(b). The range of sanctions available \nincludes matters being deemed established, exclusion of evidence, or even striking Petitioner’s pleadings or dismissal of her claims .",
      "char_length": 1652
    },
    {
      "page_number": 9,
      "text": "9 \n 19.  Under Tex. R. Civ. P. 198.2(c), if a party fails to timely answer or object to requests \nfor admissions, the requests are automatically deemed admitted “without a court \norder.”  Because Petitioner’s responses were due in October 2024 and none were \nserved, each request is deemed admitted by operation of law . These deemed \nadmissions conclusively establish the truth of the matters asked, including (upon information and belief) admissions that support Respondent’s position (such as admissions that Petitioner ag reed to certain facts, that no family violence occurred \nas alleged,  that $1,576 was taken from the joint marital account, etc. ). Petitioner’s \nfailure to answer means she cannot dispute those facts . The Court should deem \nthe admissions conclusively established and take them as true for all purposes in \nthis case.  \nGrant All Unopposed Relief  \n20. In light of  Petitioner’s total failure to oppose the motions above, Respondent is \nentitled to rulings granting all the relief sought in each motion. Texas law favors granting unopposed motions, and there is no reason to delay. Each of these motions has been on ﬁle w ell beyond the response period (some for nearly a year) with no \nanswer or request for extension by Petitioner. By granting these motions, the Court \nwill effectively resolve the core issues of the case: the summary judgment and deemed admissions establish R espondent’s right to judgment; the Rule 12 motion \nremoves an unauthorized attorney; and the motion to compel will either be mooted by case dismissal or ensure that Respondent belatedly gets discovery if the case somehow proceeds. Respondent urges the Court to immediately rule on and grant",
      "char_length": 1699
    },
    {
      "page_number": 10,
      "text": "10 \n all pending unopposed motions at once, rather than allow further prejudice from \ncontinued delay.  \nD. FRAUDULENT ORDERS AND LACK OF CONSENT  \nOrders Procured by Fraud/Misrepresentation  \n21. Respondent further moves to vacate and hold for naught the Temporary Orders \ncurrently in place (signed on March 14, 2024), on the basis that those orders were procured by fraud, misrepresentation, and without Respondent’s actual consent. Texas law is clear  that any court order obtained through fraud upon the court or \nbased on false representations is invalid and unenforceable. In this case, the \nTemporary Orders were presented to the Associate Judge as an “Agreed” Order, when in fact Respondent never agreed to their terms. The record reﬂects that the \nTemporary Orders were drafted by Petitioner’s counsel and contained a recital that Respondent agreed – but Respondent objected and refused to sign them. At the \nMarch 14, 2024 hearing, Judge Kaitcer ordered Respo ndent to sign the proposed \ntemporary orders “that claimed he agreed to them” , which Respondent ﬂatly \nrefused to do . Despite Respondent’s lack of consent, the court proceeded to sign \nthe order, effectively adopting counsel’s false representation of an agr eement that \ndid not exist , and where the terms differed from the earlier signed agreement which \nwas clearly contested by Respondent.  \nViolation of Rule 11 – No Enforceable Agreement",
      "char_length": 1416
    },
    {
      "page_number": 11,
      "text": "11 22. The imposition of these so -called agreed orders violates Texas Rule of Civil\nProcedure 11. Rule 11 mandates that “no agreement between attorneys or\nparties touching any suit pending will be enforced unless it be in writing, signedand ﬁled with the papers as part of the record, or unless it be made in open\ncourt and entered of record.”\n23. Here, there was no written agreement ﬁled that was signed by Respondent, nor\nany agreement stated on the record in open court with Respondent’s consent.  In\nother words,  the only “agreement” was an outline read into the Associate Judge’s\nReport on February 1, 2024, which Respondent’s prior attorney pressured him to\nsign under duress (and which Respondent repudiated by ﬁring that attorney dayslater). Even that report set speciﬁc conditions (e.g. a written order to be drafted by\nRespondent’s prior counsel,  and within a certain timeframe, which were never\nfulﬁlled. Thus, by the time Petitioner’s counsel drafted the Temporary Orders in\nMarch 2024, there was no valid agreement in effect – and certainly not one that met\nRule 11’s requirements. The assertion that the orders were “agreed” is false.Enforcing an order th at recites a nonexistent agreement directly contravenes Rule\n11 and fundamental contract principles . The missing signature from the orders from\nboth the Respondent and his prior counsel drives home  this point.\nVoid and Must B e Set A side \n24. B\necause Respondent never truly agreed to the current Temporary Orders, those\norders were procured by misrepresentation  and should be considered void or\nvoidable. Respondent did not consent to the drastic terms that removed him from",
      "char_length": 1653
    },
    {
      "page_number": 12,
      "text": "12 \n his home and children, and any suggestion otherwise is a fraud upon the Court. \nTexas courts have long held that judgments and orders obtained by fraud have no force and should be set aside to prevent manifest injustice. Respondent respectfully asks this Co urt to vacate the Temporary Orders entered on March 14, 2024 , and \nany related orders, due to the lack of a valid Rule 11 agreement and the fraud inherent in presenting them as agreed. The Court should not reward or enforce Petitioner’s counsel’s deceptive tactics. Instead, the Court should restore the status \nquo that existed before those fraudulent orders — speciﬁcally, Respondent should \nbe immediately reinstated as a primary managing conservator with full rights and returned to his residence (as addressed in the Prayer below).  \n E. SEVERE FINANCIAL DAMAGES REQUIRE EMERGENCY RELIEF  \nI\nrreparable Financial Harm \n25. Respondent has suffered extreme ﬁnancial losses  as a direct result of being \nwrongfully excluded from his home, business, and children for over a year under the current orders. The damages exceed $100,000 and continue to climb. Respondent’s \nability to earn a living and manage his business interests has been severely impaired because he was removed from the marital residence (which also served as the base of his business operations). He has lost substantial  income and business \nopportunities that cannot be re covered  after the fact. Petitioner’s ongoing control \nof the residence and marital assets further threatens irreparable injury — for \nexample, Petitioner has had unfettered access to Respondent’s personal property,",
      "char_length": 1624
    },
    {
      "page_number": 13,
      "text": "13 \n ﬁnancial instruments, and business equipment, and she has shown a willingness to \ndissipate or misuse those assets. Every day that passes is causing Respondent irreparable ﬁnancial harm that money damages cannot adequately redress later.  \nLegal Basis for Injunctive Relief   \n26. Texas law expressly recognizes that injunctive relief is appropriate to prevent irreparable harm to property or ﬁnancial interests. Section 65.011 of the Texas Civil \nPractice and Remedies Code provides general grounds for injunctions. Notably, \n§65.011(5)  permits a writ of injunction when “irreparable injury to real or personal \nproperty is threatened irrespective of any remedy at law.”  Here, that standard is met. \nRespondent’s exclusion from the marital residence and business has placed real \nand personal pr operty at risk: the marital home (real property) is in jeopardy of \nwaste or  loss, and Respondent’s personal property (including business assets, \nconﬁdential records, and equipment located at the residence) is being controlled or and disposed of by Petitioner. This presents a threat of irreparable injury  because \nonce property is sold, lost, or the business is destroyed, Respondent cannot be made whole by monetary compensation alone.  \nNeed for Immediate Injunction  \n27. Given these circumstances, the Court should issue immediate injunctive relief to protect Respondent’s property and ﬁnancial interests. Respondent requests a Temporary Restraining Order and temporary injunction prohibiting Petitioner \nfrom: (a) selling, transferring, encumbering, or destroying any property belonging to",
      "char_length": 1602
    },
    {
      "page_number": 14,
      "text": "14 \n Respondent (including business assets, vehicles, bank accounts, and the marital \nresidence); (b) interfering with Respondent’s business operations or contacts; and (c) taking any action that would further deplete the marital estate or Respondent’s separate estate. Respondent also seeks an order immediately restoring him to the \nmarital residence so that he can secure his property and resume his business activities. The ongoing harm is urgent  and cannot wait for a ﬁnal trial setting. By \nstatute and equity, Re spondent is entitled to injunctive relief to prevent any further \nirreparable damage to his property rights and ﬁnancial stability . \nThe Court’s prompt intervention will preserve the status quo and ensure that Respondent’s livelihood is not destroyed before this case can be resolved on the merits.  \nIII. PRAYER FOR RELIEF  \nWHEREFORE, PREMISES CONSIDERED, Respondent Charles Dustin Myers prays that this \nCourt grant the following relief immediately:  \n1. Restoration of Parental Rights and Residence:  Issue an order reinstating \nRespondent’s parental rights and possession  effective immediately, including,  \nnaming Respondent as the primary conservator of the two minor children in this matter,  and grant Respondent exclusive use and possession of the marital \nresidence  at 6641 Anne Court, Watauga, Texas, forthwith  while the case is pending.  \n2. Vacate Fraudulently Obtained Orders:  Vacate and set aside the Temporary \nOrders signed on or about March 14, 2024 (and any other orders based on the purported “agreement” of February 1, 2024), on the grounds of lack of consent and",
      "char_length": 1611
    },
    {
      "page_number": 15,
      "text": "15 \n fraud. Those orders should be declared null, void, and of no effect, and the Court \nshould enter new temporary orders as needed to reﬂect Respondent’s restored rights  so that child support may be established for the sake of the children to be \npaid by the Petitioner.  \n3. Dismissal / Judgment on Unopposed Motions:  Dismiss this case in its entirety , \nwith prejudice, due to Petitioner’s failure to prosecute and the procedural incapacity \nof her counsel – or alternatively, enter immediate judgment  in favor of Respondent \non all pending claims by: (a) granting Respondent’s No -Evidence Motion for \nSummary Judgment, and (b) dismissing or striking Petitioner’s pleadings pursuant to \nRule 12 and/or as a discovery sanction. In either event, the outcome shou ld be that \nPetitioner’s claims a re terminated and Respondent is granted appropriate relief on \nhis counterclaims (if any were ﬁled) as unopposed.  \n4. Temporary Restraining Order and Injunction:  Issue a Temporary Restraining \nOrder (TRO) immediately (to be effective forthwith, without further notice) \nrestraining Petitioner from interfering with Respondent’s property, business, or parental rights. Speciﬁcally, Petitioner should be enjoined from: removing the \nchildren from Tarrant County o r from Respondent’s possession once returned to \nhim; disposing of, encumbering, or damaging any property owned wholly or in part \nby Respondent; withdrawing or spending funds from any accounts containing Respondent’s assets; and harassing or coming within a certain distance of Respondent. Set this matter for a Temporary Injunction hearing within 14 days as",
      "char_length": 1626
    },
    {
      "page_number": 16,
      "text": "16 \n required, and upon hearing, issue a temporary injunction maintaining these \nrestraints for the pendency of this case.  \n5. General Relief:  Grant such other and further relief, at law or in equity, to which \nRespondent is justly entitled. This includes but is not limited to court costs, \nreasonable attorney’s fees as sanctions or as may be allowed by law, and any other orders necessary to undo the harm caused to Respondent and his children by the \nimproper orders and to protect the best interests of the children  going forward.  \nRespondent respectfully requests that the Court act on an emergency basis  given the \nongoing irreparable harm described above. Time is of the essence to correct the course of \nthis case and to prevent any further injustice.  \nThough the original Judge presiding over this matter has been divested of jurisdiction, \nTexas Law permits intervention in circumstances such as these by said Judge, and likewise \nfor the Regional Presiding Judge, David L. Evans, “ may issue interim or ancillary orders in \nthe pending case as justice may require. ” \nIn the instant case, justice does require such immediate action.  \nRespectfully submitted, \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \nPRO -SE \n6641 Anne Court  \nWatauga, Texas 76148  \nEmail: ChuckDustin12@gmail.com  \nPhone: 817 -546-3693",
      "char_length": 1331
    },
    {
      "page_number": 17,
      "text": "17 \n  \n \nCERTIFICATE OF SERVICE  \nRespondent, Charles Dustin Myers, hereby certiﬁ es that a true and correct copy of the \nforegoing motion was served on Petitioner’s counsel of record, Cooper L. Carter , via the \nvia email to clcarter@example.com (email address on ﬁle) on this 20th day of February, \n2025, in accordance with the Texas Rules of Civil Procedure  and to Petitioner, MORGAN \nMICHELLE MYERS, through the Electronic Filing Manger in accordance with Texas Rules of \nCivil Procedure 21a.  \n /s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \nPRO -SE \n6641 Anne Court  \nWatauga, Texas 76148  \nEmail: ChuckDustin12@gmail.com  \nPhone: 817 -546-3693 \nPro Se Respondent",
      "char_length": 673
    },
    {
      "page_number": 18,
      "text": "EXHIBIT 1\nCOOPER L. CARTER'S \nEFM IMPROPERLY \nREGISTERED",
      "char_length": 56
    },
    {
      "page_number": 19,
      "text": "",
      "char_length": 0
    }
  ]
}