{"id": "1e3f01afb63df618b3d7a1dc8e0e8a3d6835b901", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_23_24_email_to_dan_modify_1\\01_23_24_email_to_dan_modify_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.23.24 - Email to Dan MODIFY-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "Charlie Vids <chuckdustin12@gmail.com>\nEMERGENCY MOTION - There Are Laws/Rights Being Violated\n1 message\nCharlie Vids <chuckdustin12@gmail.com> Tue, Jan 23, 2024 at 10:22 AM\nTo: Daniel Bacalis <dbacalis@dbacalis.com>\nMOTION TO MODIFY TEMPORARY ORDERS\nIntroduction\nCharles Dustin Myers, herein referred to as the Petitioner, respectfully submits this motion to modify the temporary orders\nissued in this case, concerning the custody of his children and his eviction from his residence. \nThis motion is filed under the relevant sections of the Texas Family Code, including but not limited to Sections 156.001,\n156.006, and 152.205.\nStatement of Facts\nThe Petitioner was served with divorce papers on December 27, 2023, which contained several false claims and\nallegations from Morgan Michelle Myers, who has abused the legal process, including but not limited to:\n1. Falsifying a Statement of Inability to Pay\n2. Lying on the divorce petition\n3. Lying on the protective order.\n4. Trying to have me unlawfully evicted.\nSubsequently, on January 16, 2024, without a fair opportunity for the Petitioner to be heard due to inclement weather\nleading to court closures, Judge Munford presided over the only open court and signed a temporary order removing the\nPetitioner from his home and granting full temporary custody to Morgan Michelle Myers, herein referred to as the\nRespondent.\nThis motion contends that these temporary orders were made without considering the Petitioner's rights to a fair hearing\nas stipulated in Texas Family Code Section 152.205 and without substantial evidence to justify such drastic measures.\nLegal Grounds for Modification\nViolation of Right to Be Heard: \nThe temporary orders were made without providing the Petitioner an adequate opportunity to be heard, in violation of\nTexas Family Code Section 152.205.b.\nEven after acquiring legal counsel, Morgan was granted another continuance after not holding up her end of the\nagreement.\nBest Interest of the Children: \nThe temporary"}
{"id": "b0180661a2717c4203873acb8cd43cb5bd93a8ee", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_23_24_email_to_dan_modify_1\\01_23_24_email_to_dan_modify_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.23.24 - Email to Dan MODIFY-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "s Family Code Section 152.205.b.\nEven after acquiring legal counsel, Morgan was granted another continuance after not holding up her end of the\nagreement.\nBest Interest of the Children: \nThe temporary orders do not serve the best interest of the children, which is the paramount consideration in custody\ndecisions, as per Texas Family Code Section 153.002.c. \nLack of Substantial Change in Circumstances: The orders were issued without any substantial change in circumstances\nthat would warrant such a significant modification in custody, as required under Texas Family Code Section 156.101.\nRequest for Relief:\n10/17/24, 10:32 AM Gmail - EMERGENCY MOTION - There Are Laws/Rights Being Violated\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1179507302798641811&simpl=msg-a:r-37169390082715… 1/2\n\nReversal of Temporary Custody and Eviction Orders:\na. The Petitioner respectfully requests the court to reverse the temporary orders regarding his eviction and the full custody\ngranted to the Respondent.\nb. Restoration of Previous Custody Arrangement:\n The Petitioner seeks the restoration of the custody arrangement that existed prior to the temporary orders, where he\nmaintained a significant role in his children's lives.\nc. Expedited Hearing: Given the urgency and significant impact on the Petitioner and his children, an expedited hearing is\nrequested.\nConclusion\nThe Petitioner respectfully urges the court to consider the detrimental impact of the current temporary orders on the\nchildren's well-being and the Petitioner's parental rights. \nThe Petitioner reaffirms his commitment to the best interest of his children and requests the court to modify the\ntemporary orders to restore the previous custody arrangement and allow him to return to his residence until a fair hearing\nimmediately, and without delay.\nRespectfully submitted,\nCharles\n______\nDan, this is absurd. I can't let this broken system take advantage of my rights and damage my parent child "}
{"id": "34c8e5ef0588fbefdbbf82cf7f590a5f732aea9c", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\01_23_24_email_to_dan_modify_1\\01_23_24_email_to_dan_modify_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\01.23.24 - Email to Dan MODIFY-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 684, "text": " until a fair hearing\nimmediately, and without delay.\nRespectfully submitted,\nCharles\n______\nDan, this is absurd. I can't let this broken system take advantage of my rights and damage my parent child relationship\nbased on NOTHING and allow Morgan to continuously fail to meet her obligations.\nAll I've done is diligently prepare. I know my rights. This is a clown show and I'm prepared to take matters into my own\nhands if nobody else will.\nRespectfully,\nCharles10/17/24, 10:32 AM Gmail - EMERGENCY MOTION - There Are Laws/Rights Being Violated\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1179507302798641811&simpl=msg-a:r-37169390082715… 2/2"}