{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\09.17.25 - OBJ TO LR 1.06B2-1.pdf",
  "base_name": "09_17_25_obj_to_lr_1_06b2_1",
  "page_count": 9,
  "pages": [
    {
      "page_number": 1,
      "text": "1 322-744263 -23\nIN THE 322ND DISTRICT COURT \nOF TARRANT COUNTY, TEXAS  \nMorgan Michelle Myers,  \n  Petitio\nner, \n  v. \nCharle\ns Dustin Myers,  \n        Res\npondent.  \nAnd In the interest of M.E.M. and \nC.R.M., two children.§ \n§ \n§ \n§ \n§ OBJECTION\n§ TO LOCAL RULE 1.06(b)\n§ AND FOR JUDI CI AL NOTICE\n§ OF FEDERAL ACTION\n§\n§ \nTO THE HONORABLE 322ND DISTRICT CO UR T O F TARRANT CO U NTY, TEXAS: \nCOMES NOW , Charles Dustin Myers, Respondent  in the \nabove captioned cause, \nwho respectfully submits this OBJECTION TO LOCAL RULE 1.06(b) (2) AND FOR JUDICIAL \nNOTICE to place on the record that he \nobjects to any future handling of this matter by Court \nCoordinator Lindsey Baker  and that Respondent has no choice but to pursue a federal claim . \nLindsey Baker, as court coordinator , exemplifies t he problem of  unequal t reatment  of pro \nse litigants w hen he r actions —such as altering or withholding parts of a pro se party’s court \nfiling —result in procedural disadvantages that are not faced by represented parties, thereby \nundermining the cons titutional guarantee of equal protection unde r Texas law. Her conduct, as \ndescribed,  high lights how  cour t s t aff c an perpetuate or  institutionalize preferential t reatment, \nwhich i s cons t itutionally s uspect and  contrary t o the principles of  fa irness and  access t o justice. \nI. SUMMARY\n1. The Texas Constitution  and established cas e law require that al l li tigants, whether \nrepresented by  counsel or  appearing  pro se, receive  equal treatment i n the judicial p rocess. When \na court coor dinator  like Lindsey B aker en gages i n conduc t that di sadvantages pr o se litigants —(2)322-744263-23 FILED\nTARRANT COUNTY\n9/16/2025 12:24 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1748
    },
    {
      "page_number": 2,
      "text": "2 \n such as modifying, splitting, or omitting parts of their filings —this not only creates procedural \nbarriers but also risks violating the constitutional mandate of equal protection and due process. \n 2. Lindsey Baker’s actions, as alleged, serve as a textbook example of how court staff \ncan, intentionally or not, create a two -tiered system that favors attorneys and their clients over \nunrepresented parties. Such conduct is particularly problematic because c ourt coordinators wield \nsignificant administrative power and discretion, and their preferential treatment of represented parties can have a direct and detrimental impact on the substantive and procedural rights of pro se litigants, undermining both the  appearance and reality of justice.  \nII. BACKGROUND AND RELEVANT LAW  \nA. Legislative Framework  \n 3. The Texas Constitution, specifically Article 1, Section 3, enshrines the principle that all \nindividuals are entitled to equal rights and protection under the law, and that no person or group is entitled to exclusive privileges except in consideration of pu blic service, see Tex. Const. art. 1 \n§ 3 Equal Rights. This constitutional guarantee is directly implicated when court officials, including coordinators, treat similarly situated litigants differently based solely on their representation status.  \n 4. Texas Penal Code § 32.46 criminalizes the act of causing another person, with intent to \ndefraud or harm, to sign or execute any document affecting property or pecuniary interest without effective consent. It also prohibits causing a public servant to file or record a document purporting to memorialize an act or order of a purported court or judicial officer not established by law .  This provision is relevant where court staff manipulate or alter court documents in a way \nthat affects a party’s property or legal interests.",
      "char_length": 1864
    },
    {
      "page_number": 3,
      "text": "3 \n  5. The Texas Government Code authorizes judges to appoint court coordinators to \nimprove justice and expedite case processing, and these coordinators serve at the pleasure of the \nappointing judge, see  Tex. Gov't. Code § 74.101. This structure gives coordinators significant \nadministrative discretion, but also places a duty on them to act impartially and in accordance with constitutional mandates.  \n 6. Additionally, court staff are required to maintain the confidentiality of non -public \njudicial work product, and improper handling or disclosure of such materials can constitute a \ncriminal offense, see Tex. Gov't. Code § 21.013. \nB. Jurisprudence  \n 7. Texas jurisprudence outlines  that the state’s equal protection clause provides the same \nguarantees as the federal Fourteenth Amendment, requiring that all individuals, including \nlitigants, be treated equally by the courts, see Ho v. University of Texas at Arlington , 984 S.W.2d \n672 (Tex. App. 1998). The court in Ho  emphasized that any practice or rule resulting in disparate \ntreatment of pro se litigants as compared to those represented by counsel could raise serious constitutional concerns.  \n 8. The importance of impartiality and the avoidance of personal interests interfering with \njudicial or quasi -judicial duties is further underscored in State v. Terrazas , 962 S.W.2d 38 (Tex. \nCrim. App. 1998), which, while addressing prosecutorial conduct, is instructive for the broader \nprinciple that court officials must avoid conduct that undermines procedural fairness and due \nprocess . \n 9. By applying these principles, the court can avoid any appearance of impropriety or a \nrisk of being seen as impartial .",
      "char_length": 1693
    },
    {
      "page_number": 4,
      "text": "4 \n III. Analysis  \nC. Application of Equal Protection Principles to Lindsey Baker’s Conduct  \n 10. The core constitutional issue is whether Lindsey Baker’s actions as court coordinator \nresulted in pro se litigants being treated less favorably than represented parties, thereby violating \nthe equal protection guarantees of the Texas Constitution and the Fo urteenth Amendment. The \nTexas Constitution’s equal rights provision is unequivocal: all individuals are entitled to equal treatment, and no one is entitled to special privileges absent a public service justification, see Tex. Const. art. 1 § 3 Equal Rights.  \n 11. In the instant matter  described, Lindsey Baker altered  Respondent ’s joint motion to \nrecuse by removing exhibits and affidavits, splitting the document, and removing hyperlinks after the motion was filed and served. These actions, which are facially supported by the record, directly impact the Respondent ’s ability to present their case fully and effectively, and may result \nin the presiding judge or reviewing authority not having access to the complete record. Such conduct creates a procedural disadvantage for the pro se litigant that is not faced by parties  \nrepresented by counsel, who may have the resources or relationships to ensure their filings are handled correctly.  \n 12. Furthermore, when questioned about these modifications, Baker’s explanations were \nillogical and contradictory to how filings are typically handled. Together, these actions create a \nscenario where her involvement in the case is prejudicial to the Respo ndent.  \n 13. This type of disparate treatment is precisely what the equal protection clause is \ndesigned to prevent. As the Texas Court of Appeals made clear in  Ho v. University of Texas at \nArlington , 984 S.W.2d 672 (Tex. App. 1998), the state’s equal protection clause is coextensive",
      "char_length": 1860
    },
    {
      "page_number": 5,
      "text": "5 \n with the federal standard, and any practice that results in pro se litigants being systematically \ndisadvantaged is constitutionally suspect.  \n 14. Moreover, the administrative discretion granted to court coordinators under Tex. \nGov't. Code § 74.101 does not override the constitutional requirement of equal treatment. While coordinators are tasked with expediting case processing and improving justice, these objectives \nmust be pursued in a manner that is neutral and non-discriminatory. Preferential treatment of \nattorneys or their clients, whether through informal relationships or deliberate manipulation of \nfilings, is inconsistent with both the lett er and spirit of the law.  \n 15. Here, Lindsey Baker’s involvement has only created ambiguities, delays, and \nunexplained conduct that is criminal in nature.  \nD. Procedural Unfairness and Access to Justice \n 16. The problem is not merely theoretical. Procedural disadvantages —such as missing \nexhibits, altered documents, or incomplete filings —can have real and substantial effects on a \nlitigant’s ability to obtain relief, respond to adverse actions, or appeal unfavorable decisions. \nThese barriers are particularly acute for pro se parties, who may lack the legal knowledge or resources to identify and correct such errors. \nE. Potential Criminal and Civil Liability  \n 17. Beyond constitutional concerns, Lindsey Baker’s conduct may also implicate criminal \nstatutes. Under  Tex. Pen. Code § 32.46, it is a criminal offense to cause another person, with \nintent to defraud or harm, to sign or execute any document affecting property or pecuniary \ninterest without effective consent. If a court coordinator alters or manipulates court documents in",
      "char_length": 1719
    },
    {
      "page_number": 6,
      "text": "6 \n a way that affects a party’s legal or property interests, and does so with the requisite intent, this \ncould constitute a violation of the statute.  \n 18. Additionally, the requirement for court staff to maintain the confidentiality and \nintegrity of judicial work product, as set out in Tex. Gov't. Code § 21.013, which underscores the seriousness of mishandling or altering court filings. Breaches of these duties can have both \ncriminal and professional consequences , which Respondent seeks to pursue if this Court \ncontinues to disregard the law.  \nF. The Role of Discretion and Institutional Practices  \n 19. The structure of the court coordinator system in Texas, as described in Tex. Gov't. \nCode § 74.101, gives coordinators significant administrative power, but also places them under \nthe direct supervision of the appointing judge. This arrangement can create a n environment \nwhere informal relationships or unwritten practices develop, potentially leading to preferential treatment of certain parties. When such practices result in pro se litigants being disadvantaged, they are constitutionally problematic.  \n 20. The secondary materials highlight the need for clear guidelines and training for court \nstaff to ensure that all litigants are treated fairly, regardless of representation status. Without such safeguards, the risk of institutionalizing unequal treatment is significant.  \n 21. The appearance of fairness is as important as its reality. When court staff are \nperceived to favor attorneys or their clients over pro se parties, public confidence in the judiciary is undermined. The due process rights of litigants are not limited to the outcome of their cases, but extend to the procedures by which those outcomes are reached. Any deviation from impartial and equal treatment threatens the legitimacy of the judicial system as a whole.",
      "char_length": 1866
    },
    {
      "page_number": 7,
      "text": "7 IV. CONCLUSION \nLindsey B aker’s conduc t as cour t coordinator, as d escribed,  is a clear ex ample of  how \ncourt s taff can pe rpetuate or  institutionalize unequal treatment  of pro se litigants, i n violation  of \nthe constitutional gua rantee of equ al protection  unde r Texas l aw. By altering or withholding parts \nof a pro se party’s court filing, Baker created procedural disadvantages that are not faced by \nrepresented p arties, unde rmining  both the  appearan ce and  reality of  fairness i n the judicial \nprocess. The  Texas Constitution,  relevant  statutes, and  case law al l require that al l litigants be  \ntreated equ ally, and any deviation  from this standard —whether t hrough formal rules or informal \npractices —risks both constitutional violation and loss of public confidence in the courts . The \njudiciary and cou rt staff must be  vigilant i n ens uring  that all p arties, r egardless of  representation,  \nhave equal a ccess t o justice and are not s ubjected t o systemic disadvantages. \nAccordingl y, and for all the reasons stated above, Respondent OBJECTS to any further \ninvolvement in this matter by court coordinator Lindsey Baker. \nThe Court is also put on official not ice that F ederal pr oceedings  will commenc e in t he \ncoming days . The Court should consider issuing an immediate stay as soon as possible \nconsidering  Baker, C arter, and ot hers cur rently pr esiding  over this cas e will be  named as \ndefendants. \nThis n otice and objection are filed in good faith as Respondent is not obligated to provide \nsuch not ice. \nIf the court chooses not to stay these proceedings, Respondent hereby invokes his right to \na trial by jur y, and object s to the final trial setting scheduled for December 1 0, 2025, being heard \nby District Judge James Munford, as he will also be named a defendant.",
      "char_length": 1845
    },
    {
      "page_number": 8,
      "text": "8 Due to the court’ s collective failures and unexplained abnormalities, Respondent has no \nother option, abse nt relief, but to initiate proceedings to protect his children, his interests, and his \nrights.  \nRespondent asks the Court to take judicial notice of these issues.  \nRes\npectfully submitted,  \n/s/ Charles Dustin Myers \nCHAR LES DUSTIN MYERS  \nCHUC\nKDUS TIN12@GMAIL.COM  \n817-546-3693\nPR\nO-SE RESPONDENT\nCER\nTIFICATE OF SERVICE  \nOn September 16, 2025, a true and accurate copy of this OBJECTION TO LOCAL \nRULE 1.06(B)(2) AND FOR JUDICIAL NOTICE OF FEDERAL ACTION was served upon \nall parties of record pursuant to Rule 21a of the Texas Rules of Civil Procedure. \nRes\npectfully submitted,  \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS \nPRO-S E RESPONDENT",
      "char_length": 768
    },
    {
      "page_number": 9,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 105636120\nFiling Code Description: Request\nFiling Description: OBJECTION TO LOCAL RULE 1.06(b)\nStatus as of 9/17/2025 8:41 AM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n9/16/2025 12:24:06 PM\n9/16/2025 12:24:06 PM\n9/16/2025 12:24:06 PM\n9/16/2025 12:24:06 PMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 860
    }
  ]
}