{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\08.29.25 - Objection to Order of Referral-1-1.pdf",
  "base_name": "08_29_25_objection_to_order_of_referral_1_1",
  "page_count": 7,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n 322-744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \nITMOMO,  \n    Morgan Michelle Myers  \n                                   Petitioner,  \n               v. \n Charles Dustin Myers,  \n                         Respondent  \n& in the interest of  \nM.E.M. & C.R.M.,  \nTwo minor children.  \n § \n§ \n§ \n§          \n§    Objection to Order of Referral  \n§            \n§                     \n§ \n§ \n§ \n \n TO THE HONORABLE JUDGE OF THIS COURT:  \n  Respondent, Charles Dustin Myers, respectfully OBJECTS to the \norder  of referral signed on August 29 , 2025, and in support thereof , shows the court \nthe following:  \nI. Summary  \n 1. It is procedurally improper for a court coordinator to forward an order of \nreferral for recusal based solely on a notice of intent to file a recusal, as Texas law \nrequires a formal, verified motion to trigger the recusal process, and the \ncoordinator has no  statutory authority to act in this capacity. The continued \ninvolvement of the coordinator in recusal matters undermines the integrity of the 322-744263-23 FILED\nTARRANT COUNTY\n8/29/2025 11:17 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1136
    },
    {
      "page_number": 2,
      "text": "2 \n process and deviates from the mandatory procedures established by Texas statutes \nand case law.  \n 2. Under Texas law, the recusal process is strictly governed by statute and \nrule, requiring a formal, verified motion to be filed before any judicial or \nadministrative action is taken. A mere notice of intent to file a recusal does not \ninitiate the recusal pr ocess, and the court coordinator has no legal authority to \nforward orders of referral or otherwise participate in the assignment of judges for \nrecusal motions.  \n 3. The responsibility for handling recusal motions lies exclusively with the \njudge and, upon referral, the presiding judge of the administrative judicial district. \nThe involvement of a court coordinator in forwarding orders of referral —\nespecially in the absen ce of a formal motion —contravenes both the letter and spirit \nof the law, as confirmed by controlling statutes and appellate decisions. This \nimproper involvement risks undermining the impartiality and public confidence in \nthe judiciary that the recusal proc ess is designed to protect.  \nII. Background and Relevant Law  \n 4. The Texas Government Code and Texas Rules of Civil Procedure set out a \ndetailed and mandatory process for judicial recusal. Under  Tex. Gov't. Code § \n25.00255 , the presiding judge of the administrative judicial region is vested with",
      "char_length": 1359
    },
    {
      "page_number": 3,
      "text": "3 \n the authority to hear or assign a judge to hear a referred motion for recusal or \ndisqualification. The statute does not mention or authorize any role for a court \ncoordinator in this process, underscoring that the responsibility is judicial, not \nadministrat ive. \n 5. Similarly, Tex. Civ. Prac. & Rem. Code § 30.016 addresses the procedure \nfor tertiary recusal motions, requiring the judge to continue presiding over the case \nbut to comply with all applicable rules for recusal and disqualification. Again, \nthere is no provi sion for a court coordinator to act in this context.  \n 6. The Texas Administrative Code  § 155.152 , further clarifies that a motion \nto recuse must be verified, state particular grounds, and be based on personal \nknowledge. Only upon the filing of such a motion do the procedural requirements \nfor recusal arise.  \nIII. Analysis  \nA. The Legal Effect of a Notice of Intent to File Recusal  \n 7. A notice of intent to file a recusal is not a recusal motion. The Texas Rules \nof Civil Procedure, specifically Rule 18a, and the Texas Administrative Code \nrequire that a motion to recuse be verified, state with particularity the grounds for \nrecusal, and be  based on personal knowledge. Only upon the filing of such a \nmotion do the procedural requirements for recusal arise . See Tex. Admin. Code §",
      "char_length": 1333
    },
    {
      "page_number": 4,
      "text": "4 \n 155.152 ; In re Marriage of Samford , 173 S.W.3d 887 (Tex. 2005) ; In re Johnson , \nNo. 14 -04-00519 -CV (Tex. 2004) ). A notice of intent does not satisfy these \nrequirements and does not trigger the judge's duty to recuse or refer.  \nB. The Role of the Court Coordinator  \n 8. The statutory and procedural framework for recusal is explicit in \nassigning responsibility to the judge and, upon referral, the presiding judge of the \nadministrative judicial district ( Tex. Gov't. Code § 25.00255 ; In re Alpert , 276 \nS.W.3d 592 (Tex. App. 2008) ). The court coordinator is not mentioned in any \nstatute or rule as having authority to forward orders of referral or otherwise \nparticipate in the recusal process. The coordinator's involvement, especially in the \nabsence of a formal motion, is therefore un authorized and improper .  \n 9. This is not a mere technicality. The recusal process is designed to ensure \nimpartiality and public confidence in the judiciary. Allowing a court coordinator —\nwho is not a judicial officer and may be perceived as aligned with the sitting \njudge —to participate  in the process risks undermining the appearance and reality \nof impartiality . \n 10. The continued involvement of the court coordinator in forwarding orders \nof referral, particularly in the absence of a formal recusal motion, is not only \nunauthorized but also risks creating the appearance of impropriety or bias. This is",
      "char_length": 1427
    },
    {
      "page_number": 5,
      "text": "5 \n precisely what the recusal process is designed to avoid ( Sears v. Nueces County \nSherriff Olivarez , 28 S.W.3d 611 (Tex. App. 2000) ; Sun Exploration and \nProduction Co. v. Jackson , 783 S.W.2d 202 (Tex. 1989) ). The Texas Supreme \nCourt has repeatedly emphasized that the less a judge (or by extension, court staff) \nis involved in recusal proceedings, the better, to maintain the integrity of the \nprocess ( Union Pacific Resources Co. , In re, 969 S.W.2d 427 (Tex. 1998) ).  \n 11. There are no exceptions found within Texas authorities that would permit \na court coordinator to act in the recusal process in the absence of a formal, verified \nmotion. The only administrative role contemplated is that of the court clerk, who is \nresponsible for delivering documents to the relevant j udges once a motion or order \nis filed . Any deviation from this process is not supported by statute, rule, or case \nlaw. \nIV. Conclusion  \n 12. In summary, Texas law is clear that the recusal process is triggered only \nby the filing of a formal, verified motion, and that the responsibility for handling \nsuch motions lies exclusively with the judge and, upon referral, the presiding judge \nof the admin istrative judicial district. The court coordinator has no statutory or \nprocedural authority to forward orders of referral or otherwise participate in the \nrecusal process, especially in the absence of a formal motion. The continued",
      "char_length": 1429
    },
    {
      "page_number": 6,
      "text": "6 \n involvement of the coordinator in these matters is improper and undermines the \nintegrity and impartiality of the judicial process. The court should ensure strict \ncompliance with the established procedures to maintain public confidence in the \njudiciary , and vacate the Order of Referral unti l and unless a statutorily proper \nrecusal is filed.  \n 13. The Notice of Intent to file a recusal is not the same as a recusal, and the \nRespondent therefore OBJECT S to the order of referral signed on August 29, 2025.  \n    Respectfully  submitted,  \n     /s/ Charles Dustin Myers  \n     CHARLE S DUSTIN MYERS  \n     CHUCKDUSTIN12@GMAIL.CO M \n     817-546-3693  \n     PRO -SE RESPONDENT  \n \n \nCERTIFICATE OF SERVICE  \n Pursuant to Tex. R. Civ. P. 21a , a true and accurate co py of this objection  \n \nwas served upon all parties of record  on 08/29 /2025. \n     \n       /s/ Charles Dustin Myers  \n       PRO -SE RESPONDENT",
      "char_length": 923
    },
    {
      "page_number": 7,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 105018285\nFiling Code Description: Request\nFiling Description: Objection to Order of Referral Signed 08/29/2025\nStatus as of 8/29/2025 2:56 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n8/29/2025 11:17:18 AM\n8/29/2025 11:17:18 AM\n8/29/2025 11:17:18 AM\n8/29/2025 11:17:18 AMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 877
    }
  ]
}