{"id": "11dcc03532afa5e210e29fc1f985fa626da70017", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322- 744263- 23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE DA VID L. EV ANS OF THE 8TH ADMINISTRATIVE REGION \nOF TEXAS:  \n \nCOMES NOW, CHARLES DUSTIN MYERS, Respondent Pro Se, and files this \nObjection to the \"ORDER OF ASSIGNMENT BY THE PRESIDING JUDGE\" signed on May 6, \n2025 (hereinafter \"Order of Assignment\"), in the above -referenced cause, and in support thereof \nwould respectfully show the Court the following:  \nI. BACKGROUND AND PROCEDURAL HISTORY \n1.  On April 28, 2025, Respondent Charles Dustin Myers filed his \"FIRST AMENDED \nMOTION TO RECUSE\" (hereinafter \"Amended Recusal Motion\"). This Amended Recusal \nMotion specifically sought the recusal of the Honorable James Munford, presiding judge of the  \nIN THE INTEREST OF M.E.M., C.R.M., two \nchildren)  \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS,  OBJECTION TO ORDER OF \nASSIGNMENT DATED MAY 6, 2025  \n  \nRespondent.   \n  \n  \n2025 -05-06\n\n2 \n 322nd District Court, based upon grounds detailed therein and pursuant to Texas Rule of Civil \nProcedure 18b. \n2. Crucially, the Amended Recusal Motion filed on April 28, 2025, named only the \nHonorable James Munford as the judge whose recusal was sought. It did not seek the recusal of \nthe Honorable Jeffrey Kaitcer.  \n3. Prior to the issuance of the Order of Assignment, on April 29, 2025, Respondent filed \nan \"OBJECTION – RECUSAL PROCEDURE.\" Exhibit A. This objection explicitly brought to \nthe attention of the Eighth Administrative Judicial Region that, among other procedural irregularities, the Honorable Jeffrey Kaitcer was being improperly implicated in recusal \nproceedings related to the Amended Recusal Motion, as said motion did not name him. The objection highlighted that any action by Judge Kaitcer concerning the Amended Recusal Motion (which did not seek his recusal) was procedurally incorrect and suggested that the motion itself had not been substantively reviewed before such erroneous actions "}
{"id": "769419e82ffe32c4ec17216576314eebe350c6bd", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "oncerning the Amended Recusal Motion (which did not seek his recusal) was procedurally incorrect and suggested that the motion itself had not been substantively reviewed before such erroneous actions were taken. \n4.  Subsequently, on May 6, 2025, the Presiding Judge of the Eighth Administrative \nJudicial Region issued the Order of Assignment. This Order assigns the Honorable John H. Cayce to preside in and rule on:  \ni.  \"the Motion to Recuse the Honorable James Munford and the Honorable Jeffrey Kaitcer filed by Charles Dustin Myers on April 25, 2025\" and  \nii. \"the First Amended Motion to Recuse the Honorable James Munford and the Honorable Jeffrey Kaitcer filed on April 28, 2025.\" – Exhibit B  \n 5.  Despite Respondent’s objections, the Court Coordinator for the 322nd District Court \nhas continued to be involved in the administrative handling and communication regarding these recusal proceedings.\n\n3 \n II. ARGUMENT AND AUTHORITIES  \nThe Order of Assignment dated May 6, 2025, is procedurally defective and based on a \nfundamental mischaracterization of the pending Amended Recusal Motion, particularly as it \npertains to the Honorable Jeffrey Kaitcer.  \n1. Mischaracterization of the Operative Pleading  \nThe Order of Assignment incorrectly states that the \"First Amended Motion to Recuse... \nfiled on April 28, 2025\" sought the recusal of both Judge Munford and Judge Kaitcer. This is factually incorrect. The Amended Recusal Motion filed by Respondent on that date sought only the recusal of Judge Munford.  \n2. Violation of TRCP 18a Requirements  \n     i. Texas Rule of Civil Procedure 18a(a) governs the filing of a motion to recuse. It \nrequires that such a motion \"must be verified and must state with particularity the grounds why the judge should be recused or disqualified and the specific provision of Rule 18b or other law relied on.\"  \n     ii. A motion to recuse is specific to the judge whose recusal is sought. If the Amended \nRecusal Motion did not name Judge Kaitcer, t"}
{"id": "b1883d4aa1c8dbb031821bd3e5215baa9b4a5032", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "the specific provision of Rule 18b or other law relied on.\"  \n     ii. A motion to recuse is specific to the judge whose recusal is sought. If the Amended \nRecusal Motion did not name Judge Kaitcer, then there was no valid, pending motion seeking Judge Kaitcer’s recusal before the Presiding Judge of the Administrative  Judicial Region upon \nwhich an assignment could be based.  \n     iii. Under TRCP 18a(f)(1), it is the \"respondent judge\" (the judge whose recusal is sought \nin a filed motion) who must either recuse or refer the motion. If Judge Kaitcer was not the respondent judge in the Amended Recusal Motion, he had no authority to take any action regarding that specific motion . \n     iv. Consequently, any referral or assignment based on the premise that the Amended \nRecusal Motion targeted Judge Kaitcer is without proper foundation under TRCP 18a.\n\n4 \n 3.  Improper Involvement of Court Coordinator in Recusal Process  \n     i. Texas Rule of Civil Procedure 18a meticulously details the procedural steps for recusal \nand disqualification of judges. TRCP 18a(e) specifically assigns duties related to the handling \nand delivery of recusal motions, responses, and orders of recusal or referral to the **\"clerk of the \ncourt.\"  \n     ii. TRCP 18a(e)(1) states: \"When a motion or response is filed, the **clerk of the court** \nmust immediately deliver a copy to the respondent judge and to the presiding judge of the administrative judicial region...\"  \n     iii. TRCP 18a(e)(2) states: \"When a respondent judge signs and files an order of recusal \nor referral, the **clerk of the court** must immediately deliver a copy to the regional presiding judge.\"  \n     iv. Significantly, TRCP Rule 18a makes no mention of the \"court coordinator\" and assigns \nno duties, responsibilities, or authority to a court coordinator in the recusal or disqualification \nprocess. The rule is explicit in its assignment of these administrative tasks to the \"clerk of the \ncourt.\"  \n     v. The legal principl"}
{"id": "1be2c3f2806615fedcd39a772d7d7f0da9fa231c", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "rity to a court coordinator in the recusal or disqualification \nprocess. The rule is explicit in its assignment of these administrative tasks to the \"clerk of the \ncourt.\"  \n     v. The legal principle of expressio unius est exclusio alterius (the express mention of one \nthing excludes all others) suggests that where a procedural rule details the roles of specific court personnel (the clerk) and omits others (the court coordinator), the omitted personnel do not have an official, mandated role in that specific process under that rule.  \n     vi. The continued handling of any aspect of this recusal proceeding by the Court \nCoordinator, particularly after Respondent has objected to such involvement, is therefore outside the procedural framework established by TRCP 18a and is improper. Such actions us urp the\n\n5 duties explicitl y assigned to the clerk of the court and can compromise the neutrality and \nintegrity o f the recusal pr ocess. \n4. Prior  Objection  Put Region  on N otice\nThe \"OBJECTION – R ECUSAL PROCEDURE\" filed by Respondent on April 29, 2025, \nexplicitly no tified  the Administrative Region  of the e rror regarding  Judge  Kaitcer’s in volvement \nbefore the Order of Assignment was issue d. The subsequent issuance of the Order of Assignment, \nwhich perpetuates this error by incorrectl y including Judge Kaitcer as a subject of the Amended \nRecusal Motion, demonstrates that the prior objection a nd the contents of the Amended R ecusal \nMotion itself may not have been fully considered . This failure to addr ess a clearly  articulated \nprocedural defect unde rmines the integrity and due process of the recusal procedure outlined in \nTRCP 18a. \n5. Prejudice to Respondent\nProceedi ng based on the current Order of Assignment would require Respondent to \naddress recusal i ssues concerning  Judge Kaitcer that w ere not r aised i n the operative  Amended \nRecusal Motion, there by misdirecting judicial resources and prejudicing Respondent by forcing \nlitigation on a n"}
{"id": "6b36fed7b0f335499716eee13892f57840da5920", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "l i ssues concerning  Judge Kaitcer that w ere not r aised i n the operative  Amended \nRecusal Motion, there by misdirecting judicial resources and prejudicing Respondent by forcing \nlitigation on a non-existent claim within tha t specific pl eading. \nIII. RELIEF REQ UESTED\nWHEREFORE, P REMISES CO NSIDERED, Re spondent  Charles Dustin Myers \nrespectfull y requests that the Honorable David L. Evans, Presiding Judge of the Eighth \nAdministrative  Judicial Region:  \n1.\nV ACATE or AMEND the Order of Assignment dated May 6, 2025, to correctly reflect\nthat the \"First Amended Motion to Recuse\" filed on April 28, 2025, seeks only the recusal \nof the Honorable James Munford;\n\n6 \n 2.  CLARIFY that the assignment of the Honorable John H. Cayce is solely to hear and \ndetermine the First Amended Motion to Recuse as it pertains to the Honorable James Munford;  \n3.  ORDER that all administrative and procedural handling of this recusal matter be conducted strictly in accordance with TRCP 18a, specifically by the clerk of the court, and that the Court Coordinator for the 322nd District Court cease any further involvement in the processing or communication related to this recusal proceeding; and  \n4.  For such other and further relief as Respondent may be justly entitled.   \n      Respectfully submitted,  \n       /s/ Charles Dustin Myers  \n       CHARLES DUSTIN MYERS  \n       CHUCKDUSTIN12@GMAIL.COM  \n       817-546-3693 \n \nCERTIFICATE OF SERVICE  \n Respondent certifies that on 05/07/2025 a true and accurate copy was served on all \nparties of record pursuant to Rule 21a of the Texas Rules of Civil Procedure.  \n       /s/ Charles Dustin Myers  \n       CHARLES DUSTIN MYERS  \n       CHUCKDUSTIN12@GMAIL.COM  \n       817-546-3693\n\n7 \n  \n \n \nA\n\nNO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HONORABLE DA VID L. EV ANS OF THE 8TH ADMINISTRATIVE \nREGION OF TEXAS:  \nThe undersigned, CHARLES DUSTIN MYERS, hereby OBJECTS to the handling of \nthese recusal matter"}
{"id": "3aa107ae9b386a8c29be6f429b1685368d3f080f", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": " TARRANT COUNTY , TEXAS  \nTO THE HONORABLE DA VID L. EV ANS OF THE 8TH ADMINISTRATIVE \nREGION OF TEXAS:  \nThe undersigned, CHARLES DUSTIN MYERS, hereby OBJECTS to the handling of \nthese recusal matters, and in support thereof, shows  the following: \nI. THE CORRECT RECUSAL PROCEDURE\nT he Texas Rules of Civil Procedure are clear . Tex. R. Civ. P. 18a lays out the proper  \nprocedure that shall be followed when a motion to recuse is filed. Id. (e) sets forth the Duties of \nthe Clerk, which amount to delivering the motion or response Id. (e)(1), and the delivery of the  \norder of recusal or referral. Id. (e)(2).  IN THE INTEREST OF M.E.M., C.R.M., two \nchildren) MORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , OBJECTION – RECUSAL PROCEDURE  \nRespondent.  \n2025 -04-29\n\nII. ISSUE  \n There are two significant procedural errors that must be immediately addressed.  \nFirst , Rule 18a of the Texas Rules of Civil Procedure does not authorize or delegate any \nresponsibility for handling recusal matters to the court coordinator. Despite an explicit and timely \nobjection to the coordinator's involvement outlined within the pending recusal motion itself, the coordinator continues to improperly manage and influence the referral process. This unauthorized participation represents a fundamental procedural violation that undermines the neutrality and integrity of the recusal proceedings.  \nSecond, the involvement of Hon. Jeffrey Kaitcer in the current referral is entirely \nimproper and unnecessary, as the current motion for recusal specifically and explicitly names only Hon. James Munford as the respondent judge. While the current motion does refer ence a \nprior joint recusal motion historically —where Hon. Kaitcer was previously named —that \nreference is strictly contextual and does not constitute a renewed or active request for his recusal at this juncture. The plain language and explicit identification in the current motion leave no \nreasonable ambiguity that the recusal "}
{"id": "669bb54e997b0f8387c442ba32cb0ea68fbb4388", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": " does not constitute a renewed or active request for his recusal at this juncture. The plain language and explicit identification in the current motion leave no \nreasonable ambiguity that the recusal sought at present involves only Judge Munford. Therefore, Judge Kaitcer’s unilateral decision to decline recusal and issue a referral, despite no pending recusal against him, is procedu rally incorrect and strongly suggests the motion itself was not \nreviewed substantively before action was taken.  \nThese procedural missteps —the continued improper involvement of the court coordinator \nand the erroneous implication of a second judge —constitute clear violations of Rule 18a, \ncompromise the impartiality required by judicial ethics, and further evidence tha t due diligence \nwas not exercised in considering the motion as filed .\n\nIII. APPLICATION OF LAW  \n A trial court has no discretion in determining what the law is or applying the law to the \nfacts even when the law is unsettled.  In re Prudential, 148 S.W.3d at 135. Consequently, a clear \nfailure by  the trial court to analyze or apply the law correctly will constitute an abuse of \ndiscretion.  Walker v Packer , 827 S.W.2d at 840 (Tex.1992). Here, the continuous disregard for \nthe undersigned’s pleadings, the Texas Constitution, the Texas Rules of Civil Procedure, and the \nTexas Family Code has resulted in cumulative and severe harm: a minor child has sustained preventable injury due solely to j udicial inaction; the Petitioner continues to evade adjudication \ndespite credible, unrefuted, and well -documented allegations of fraud; and opposing counsel —\nwho has never substantively responded to any pleading nor demonstrated her authority to act pursuant to Rule 12—continues to receive judicial favor, undermining fundamental due process protections. This persistent tolerance for procedural irregularities denies the undersigned equal protection under law and creates a significant risk of ongoing and futur e delays, as eve"}
{"id": "efe1f8e492ecd66fee962ef8c7bf124958b2574a", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": " due process protections. This persistent tolerance for procedural irregularities denies the undersigned equal protection under law and creates a significant risk of ongoing and futur e delays, as every action \nundertaken by this unauthorized attorney remains vulnerable to being stricken or invalidated. \nConsequently, the judicial process has become one that incentivizes silence, penalizes diligence, and leaves vulnerable children exposed  to avoidable and foreseeable harm. Moreover, this \nconduct demonstrates an unacceptable level of bias: a judge who was never implicated in the present recusal motion has inexplicably involved himself without justification, the court coordinator improperly continues to perform roles for which she has no lawful authority, and Texas law is repeatedly misapplied, consistently to the detriment of the undersigned and his children. This troubling pattern of behavior erodes public trust, compromises judicial integr ity, \nand necessitates immediate corrective action .\n\nIV . CONCLUSION \nThe issues necessitating this recusal  are precisely the errors and procedural misconduct \noutlined herein. The Court has repeatedly issued perfunctory orders lacking any substantive legal \nexplanation, mirroring the persistent silence and inaction of the opposing counsel. No valid legal justifi cation has been offered to explain the sustained disregard for the Texas Rules of Civil \nProcedure, the Texas Family Code, and fundamental principles of due process. The undersigned respectfully reiterates that this is a  Family Law proceeding —one that profoundly impacts \nchildren and families —not a venue for procedural indifference or selective enforcement. At a \nminimum, the Court must adhere strictly and impartially to the established rules and procedural requirements. Un less and until there is clear evidence that the pending Motion to Recuse has \nbeen properly and substantively reviewed and considered, the undersigned expressly objects to any scheduling of fur"}
{"id": "d8f4215b93e720581be7d5bc894da569d63ba295", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "ts. Un less and until there is clear evidence that the pending Motion to Recuse has \nbeen properly and substantively reviewed and considered, the undersigned expressly objects to any scheduling of further hearings or proceedings in this matter. This objection is f iled not out of \ndisrespect, but rather out of necessity and urgency, to document and bring attention to continued procedural irregularities and judicial oversights that have compromised the fairness and integrity \nof this case. The undersigned seeks only the due process and equal protection to which all litigants are entitled, and which the record thus far has conspicuously failed to reflect.   \n \nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148 \n 817-546-3693 \n CHUCKDUSTIN12@GMAIL.COM\n\nCERTIFICATE OF SERVICE  \nRelator c\nertifies that on April 29, 2025, a true and correct copy of the \nforegoing OBJECTION - RECUSAL PROCEDURE was served on all parties \nand counsel of record as follows pursuant to Rule 21a of the Texas Rules of \nCivil Procedure: PETITIONER\nMorgan Michelle Myers \nReal Pa rty in Interest \nMOR\nGANMW02@GMAIL.COM \nINT\nERVENOR \nHolly Hayes  \n2001 Beach St  \nFort Worth, TX 76103- 2308  \n817-459-6878\nCSD -Legal -914@oag.texas.govCOUNSEL FOR PETITIONER\nCooper L. Carter  \nMarx, Altman & Johnson  \n2905 Lackland Road \nFort \nWorth, TX 76116  \ncoopercarter@majadmin.com\n\n8 B\n\nTHE STATE OF TEXAS \n8th ADMINISTRATIVE JUDICIAL REGION \nORDER OF ASSIGNMENT BY THE PRESIDING JUDGE \nPursuant to Rule 18a, Texas Rules of Civil Procedure and Section 74.056, Texas Government \nCode, the undersigned Presiding Judge assigns the Honorable John H. Cayce, Senior Chief Justice, \nSecond Court of Appeals, to the \n322ND DISTRICT COURT, TARRANT COUNTY, TEXAS. \nThe judge is assigned to preside in the Motion to Recuse the Honorable James Munford and \nthe Honorable Jeffrey Kaitcer filed by Charles Dustin Myers on April 25, 2025 and the First \nAmended Motion to Rec"}
{"id": "bcf2da44e7fa5087e9e9ce1be8a770d0f56ab8f3", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_06_25_objection_to_order_of_assignment_1\\05_06_25_objection_to_order_of_assignment_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.06.25 - OBJECTION TO ORDER OF ASSIGNMENT-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 1597, "text": "judge is assigned to preside in the Motion to Recuse the Honorable James Munford and \nthe Honorable Jeffrey Kaitcer filed by Charles Dustin Myers on April 25, 2025 and the First \nAmended Motion to Recuse the Honorable James Munford and the Honorable Jeffrey Kaitcer filed \non April 28, 2025 in Cause Number 322-744263-23, styled fn the Matter of the Marriage of Morgan \nMichelle Myers and Charles Dustin Myers and In the Interest of Mara Myers and Caroline Myers, \nMinor Children, to rule on all pending motions, supplemental, amended and or subsequent motions \nto recuse and/or disqualify Judge Munford and Judge Kaitcer in the above-referenced matter. This \nassignment is effective immediately and will continue as necessary to rule on this and any pending, \nsupplemental, amended or subsequent motions to recuse and/or disqualify Judge Munford and Judge \nKaitcer filed by Charles Dustin Myers. \nIT IS ORDERED that the clerk of the court to which this assignment is made, if it is \nreasonable and practicable, and if time permits, give notice of this assignment to each attorney \nrepresenting a party to a case that is to be heard in whole or in part by the assigned judge. \nIT IS FURTHER ORDERED that the clerk, upon receipt hereof, shall post a copy of this \norder in a public area of the Clerk's office or courthouse so that attorneys and parties may be advised \nof this assignment. \nSIGNED this 6th day of May, 2025. \ncc: Honorable John H. Cayce \nHonorable James Munford \nDistrict Clerk, Tarrant County \nFile DA YID L. EV ANS, PRESIDING JUDGE \nEIGHTH ADMJNISTRA TIVE JUDICIAL REGION OF TEXAS"}