{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.12.25 - REQUEST TO SET UN-OPPOSED SUMMARY JUDGMENT AND UN-OPPOSED RULE 12 MOTIONS FOR SUBMISSION-1.pdf",
  "base_name": "03_12_25_request_to_set_un_opposed_summary_judgment_and_un_opposed_rule_12_motions_for_submission_1",
  "page_count": 30,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \nTo the Honorable 322nd District Court of Tarrant Cou nty: \nCHARLES DUSTIN MYERS, Respondent in the above captioned c ase, hereby \nmoves the court to set the Motion for Partial Summary Judgment filed on 02/22/2024 for \nsubmission and requests a ruling on the motion as  well as Respondent’s  Rule 12 Motion against \ncounsel COOPER L. CARTER filed on September 20, 2024, which also remains unopposed. In \nsuppor t of t his request, t he Responde nt shows as follows: Morgan Michelle Myers,  \nPetitioner,  \nv. REQUEST TO SET UN-O PPOSED \nSUMMARY JUDGMENT AND UN-\nOPPOSED RULE 12 MOTIONS F OR \nSUBMISSION \nCharles Dustin Myers,  \nRespondent  \nAND IN \nTHE INTEREST OF  \nM.E.M and C.R.M., two minor children\n2025 -03-12 322-744263-23 FILED\nTARRANT COUNTY\n3/12/2025 2:44 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 874
    },
    {
      "page_number": 2,
      "text": "1.COOPER L. CARTER has had ample time to submit a reply or response in opposition\nto the above-mentioned motions but has failed to do so.\n2.COOPER L. C\nARTER has had ample time to show her authority either through a\nverified affidavit or filing a notice of appeara nce.\n3.COOPER L. CARTER has failed to reply to t he requested admissions wi thin  the\nstatutory time frame. Pursuant to T\nexas law, the requested  admissions are now deemed\nadmitted without the necessity of a court order. See Tex. R. Civ. P. 198.\n4.Once an\n admission is admitted or deemed admitted, it becomes a judicial admission,\nand a party may not introduce evidence to contradict it.  Marshall v. Vi\nse, 767 S.W.2d\nat 700; Sherman Acquisition II LP v. Garcia, 229 S.W.3d 802, 812 (Tex. App.—W aco\n2007,  no pet.); Beasley v. Burns, 7 S.W.3d 768,  769-70 (T ex. App.—T exarkana 1999,\npet. denied).\n5.Deemed admissions are competent summary judgment evidence . Schafer v. Federal\nServs. Corp., 875 S.W.2d 455, 457 (Tex. App.—Houston [1st Dist.]1994, no writ)\n(holding that trial court was free to consider deemed admissions, although not\nspecifically referenced in motion for summary judgment); TEX. R. CIV . P. 166a(c)\n6.The requested and unanswered admissions have been attached as Exhibit 1.\nThus, considering the above, the Respondent is entitled to S ummary Judgment as a \nmatter\n of law as no  genuine dispute of  material fact exists outside of damage s. Respondent asks \nthe clerk of the court to promptly set these matters for submission and provide the relief \nrequested in the motion given no opposition has been raised by the oppos ing party. The summary \njudgm\nent has been attached as Exhibit 2. \nRespe\nctfully submitted,",
      "char_length": 1704
    },
    {
      "page_number": 3,
      "text": "/s/ CHARLES DUSTIN MYERS  \nCHARLES DUSTIN MYERS \n817-5 46-3693\nCHUCKDUSTIN12@GMAIL.COM\nPRO-SE",
      "char_length": 93
    },
    {
      "page_number": 4,
      "text": "CERTIFICATE OF SERVICE  \n \nPursuant to Rule 21 of the Texas Rules of Civil Procedure, Respondent, CHARLES \nDUSTIN MYERS, certifies that t he above  REQUEST TO SET UN -OPPOSED SUMMARY \nJUDGMENT AND UN- OPPOSED RULE 12 MOTIONS FOR SUBMISSION has been filed \nwith the electronic filing manager and served on the parties of record  on this 11th day of March, \n2025, including:  \n \nCOOPER L. CARTER, counsel for petitioner, at the email address \nCOOPERCARTER@MAJADMIN.COM  \nMORGAN MICHELLE MYERS, petitioner, at the email address \nMORGANMW02@GMAIL.COM  \nHOLLY HAYES, intervenor, at the email address  \ncsd-legal -914@oag.texas.gov \n \nRespectfully submitted,  \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n6641 Anne Court, Watauga, Texas 76148  \n817-546-3693  \nPRO SE",
      "char_length": 792
    },
    {
      "page_number": 5,
      "text": "EXHIBIT 1 -  UNANSWE RED \nA\nDMISSIONS\n0\n9/19/2024",
      "char_length": 49
    },
    {
      "page_number": 6,
      "text": "1 \n NO. 322 -744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , \nTEXAS  \nRespondent formally requests the forthcoming discovery  materials  \npursuant to the  level 2 discovery control plan . Given that this is the ﬁrst request \nfor discovery in this suit, the discovery period ends thirty days prior to the date \nof the ﬁnal tr ial pursuant to Rule 190.3 of the Tex as Rules of Civil Procedure.  \nI. Respondent’s Request for Disclosure  \nA. Under Subchapter B, Chapter 301, F amily Code, Section Pursuant to  \nSec. 301.051 and Sec. 301.052 of the Texas Family Code, Respondent \nformally requests that Petitioner disclose, not later than 30 days after the date \nof service of this request, the following information and material described \npursuant to Section 301.052 of the Texas Family Code: \n1. The correct names of the parties to the action.  \n(Sec. 301.052(a)(1)) Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. RESPONDENT’S FIRST REQUEST \nFOR DISCLOSURE , PRODUCTION, \nAND ADMISSIONS  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2024 -09-19  322-744263-23",
      "char_length": 1082
    },
    {
      "page_number": 7,
      "text": "2 \n 2. The name, address, and telephone number of any potential parties.  \n(Sec. 301.052(a)(2)) \n3. The legal theories and, in general, the factual bases of the \nPetitioner’s claims or defenses.  \n(Sec. 301.052(a)(3)) \n4. The name, address, and telephone number of any person having knowledge of relevant facts and a brief statement of each identified person’s connection with the action.  \n(Sec. 301.052(a)(5)) \n5. Any discoverable settlement agreement described by Rule 192.3(g), Texas Rules of Civil Procedure.  \n(Sec. 301.052(a)(7)) \n6. The name, address, and telephone number of any person who may be designated as a responsible third party.  (Sec. 301.052(a)(11 )) \nII. Respondent’s Request for Production  \nB. Pursuant to Rule 196 of the Texas Rules of Civil Procedure, \nRespondent formally requests that Petitioner produce the following documents \nwithin 30 days of service of this request. The documents should be made \navailable and filed with the E-filing system prior to 5:00 P.M. on 10/19/2024:  \n1.  All bank statements from December 2023 through September \n2024 regarding the bank account solely in Petitioner’s name.  \n2.  A certificate of completion regarding the “Children in the \nMiddle” parenting course,  which was due on May 5th, 2024, or in the \nalternative – a written statement explaining the reasons for not having \nthe certificate of completion.  \n3.  Receipt of rent payment for the last six  months made by the \nPetitioner in regard to 6641 Anne Court, Watauga TX, 76148.  \n4.  All documents related to the children’s healthcare, dental care, \nor any attempts to acquire healthcare and dental care for the children.  \n5.  Current employer and address, date of employment, and average \nhours per week worked.",
      "char_length": 1736
    },
    {
      "page_number": 8,
      "text": "3 \n 6.  A list of all any exhibits that are to be presented at the final trial \nthat have not been served to the Respondent under Rule 21a of the \nTexas rule of Civil Procedure.  \n7.  The names, addresses, and telephone numbers of all witnesses \nexpected to testify at trial.  \n8.  The names, addresses, and telephone numbers of all persons \nwho care for the minor children on a regular basis, the times of day the \nchildren are in their care, and for what purpose, and the cost of care, if \nany. \nIII. Respondent’s Request for Admissions  \nC. Pursuant to Rule 198.1 of the Texas Rules of Civil Procedure, \nRespondent Charles Dustin Myers requests that Petitioner Morgan Michelle \nMyers  admit or deny the following statements within the scope of discovery. \nEach admission or denial must be provided within 30 days of service of this \nrequest. Failure to respond in a timely manner may result in the admissions \nbeing deemed admitted by the Court and a motion to compel to follow.  For \neach denial, if any, Petitioner must provide a full explanation of the basis for the denial, along with any supporting facts, evidence, or documentation \nsubstantiating the denial: \n1. Admit or deny that between July 2015 and January 16, 2024, \nRespondent resided at the residence located at 6641 Anne Court, Watauga, \nTX 76148, with Petitioner.  _______________.  \n \nIf denied , provide the factual basis for the denial and any supporting \ndocumentation or proof of other residences during that time period.  \n \nResponse:",
      "char_length": 1510
    },
    {
      "page_number": 9,
      "text": "4 \n 2. Admit or deny that on January 26, 2021 , Respondent made an \nemployment switch to work from home, which contributed to the financial \nstability of the family leading up to January 16, 2024.  _______________.  \n \nIf denied , provide an explanation and any financial records or employment \ninformation to support the denial.  \n \nResponse:  \n \n \n \n \n \n3. Admit or deny that Petitioner transferred $1,576 to Daniel \nBranthoover’s PayPal account on December 15, 2023, which resulted in the \nmarital bank account being overdrawn by $-800.  _______________.  \n If denied , provide all facts, bank records, and other evidence supporting the \ndenial.  \n \nResponse:  \n     \n4. Admit or deny that over the weekend of December 15, 2023, \nPetitioner took the children to Oklahoma where she received  assistance from \nDaniel Branthoover in filing the divorce paperwork. _______________.  \n If denied , explain the purpose of the trip, the role of Daniel Branthoover, and \nprovide relevant documents or correspondence regarding the trip.  \n \nResponse:",
      "char_length": 1043
    },
    {
      "page_number": 10,
      "text": "5 \n 5. Admit or deny that over the weekend of December 15, 2023, \nPetitioner influenced her grandparents to serve an eviction notice to \nRespondent, citing a protective order and divorce petition that had not yet \nbeen filed.  _______________. \n \nIf denied , provide all facts and any documents relating to the eviction notice \nand its justification, including communications with Petitioner’s grandparents.  \n Response:     \n \n \n6. Admit or deny that on December 18, 2023, the Original Petition \nfor Divorce filed by Petitioner contains false and misleading statements \nregarding family violence and an active order of protection. ______________.  If denied , provide the factual basis for the accuracy of the statements made in \nthe Original Petition for Divorce.  \n Response:    \n \n  \n7. Admit or deny that on December 22, 2023, the Original Protective \nOrder filed by Petitioner contained additional claims of family violence, and \nat the time of filing, no active order of protection existed, and no such order \nhas existed throughout the marriage.  _______________. \n \nIf denied , provide the factual basis for any claims that an active protective \norder was in place during the marriage and during the filing of the protective \norder.  Response:",
      "char_length": 1252
    },
    {
      "page_number": 11,
      "text": "6 \n 8. Admit or deny that on March 6, 2024, during Petitioner’s visitation \nwith the children, while Respondent was walking the children to school, \nPetitioner ran inside the family residence and locked the Respondent out.  \n_______________.  \n If denied , provide an explanation and any evidence contradicting this event, \nincluding witness statements or other documentation.  \n \nResponse:  \n \n \n \n \n9. Admit or deny that during the course of these proceedings following \nMarch 14\nth, 2024, Petitioner has made no claims of abuse, drug use, or any \nconcerns of violence or threat of violence made by Respondent aimed at the \nPetitioner and has not served any documents related to the above to the \nRespondent during the pendency of the case through her attorney of record.  \n_______________.  \n If denied , provide all documents, pleadings, or correspondence where such \nclaims have been raised, filed, or served.  \n \nResponse:  \n \n \n10. Admit or deny that during the marriage, Petitioner directly \nbenefitted from and was aware of Respondent's work-from-home business \nup until his removal on January 16\nth, 2024.  _______________.  \n If denied , provide a full explanation and any financial documents or records \nto support the denial.  \n \nResponse:",
      "char_length": 1252
    },
    {
      "page_number": 12,
      "text": "7 \n 11. Admit or deny that during the pendency of the case, Petitioner is \naware that Respondent has lived in several different locations, seeking relief \nfrom ongoing damages caused by the removal of his home.  ______________.  \n If denied , provide an explanation and all relevant documents supporting the \ndenial.  \n \nResponse:  \n \n \n \n12. Admit or deny that the Petitioner has made no meaningful effort to \nensure that the Children’s status quo is preserved during the pendency of the \ncase.  _______________.  \n \nIf denied, provide an explanation and all relevant documents supporting the \ndenial.  \nResponse:  \n     \n \n 13. Admit or deny that the Respondent has ab ided by the current \ntemporary orders in place to the best of his ability, and that the child support \ncalculat ions, the child custody arrangements, and the current injunctions in \nplace have no legal or factual foundation.  \n If denied, provide an explanation and all relevant documents that can be found on the clerk’ s record supporting the denial and supporting the current \narrangements.  \n \nResponse:",
      "char_length": 1078
    },
    {
      "page_number": 13,
      "text": "8 \n I V.  Time for Compliance and Filing Instructions  \nD. Petitioner is hereby reminded that all responses to this Request for \nDisclosure, Discovery, and Admissions, along with any requested documents, \nmust be provided no later than 30 days after the date of service of this request.  \nAll documents and materials must be filed using the Electronic Filing Manager under the \"service only\"  option and served on the Respondent. \nFailure to respond in a timely manner may result in the filing of a Motion to \nCompel, and any objections to the requests for admissions being deemed \nwaived and the matters admitted by the Court.  \n \n• Please note that as of the time of this request, there are no formal pending settings that have been properly served on the Respondent pursuant to Texas Rules of Civil Procedure Rule 21a.  \n \nRespectfully submitted,  \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court Watauga, TX 76148  \nchuckdustin12@gmail.com  \n817-507-6562",
      "char_length": 974
    },
    {
      "page_number": 14,
      "text": "Respondent hereby certifies that on \n09/19/2024, a true and correct copy \nof the Respondent’s First Request for Disclosure, Discovery, and \nAdmissions was served on the following parties via electronic service \nthrough the Electronic Filing Manager (EFM) and via email to the email \naddress on record, pursuant to Texas Rules of Civil Procedure 21a and 191.4. \nServed to: \n• Morgan Michelle Myers , Petitioner via electronic filing system.  \n• Cooper Carter, Counsel for Petitioner via electronic filing system.  \n• Email Addresses for Service:  \ncoopercarter@majadmin.com & morganmw02@gmail.com  \nService was made using the \"service only\" option via the Electronic Filing \nManager and was also served via email to Respondent's email address: \nchuckdustin12@gmail.com. \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148  \nchuckdustin12@gmail.com  \n817-507-6562",
      "char_length": 893
    },
    {
      "page_number": 15,
      "text": "EXHIBIT 2 - UNOPPOSED SUMMA RY \nJUDGEM ENT\n02/22/2024",
      "char_length": 53
    },
    {
      "page_number": 16,
      "text": "IN THE 322nd DISTRICT COURT OF TARRANT COUNTY  \nSTATE OF TEXAS  \nMorgan Michelle Myers,  Cause No. 322 -744263 -23 \nPetitioner,  \nv. \nRESPONDENT’S MOTION FOR PARTIAL \nSUMMARY JUDGEMENT  \nCharles Dustin Myers,  \nRespondent  \nPursuant to Rule 166a of the Texas Rules of Civil Procedure ¹, the Respondent, Charles \nDustin Myers, firmly seeks a partial Summary Judgment  in regard to  the upcoming \nhearing scheduled for March 14th, 2024 . He categorically asserts that the evidence on file \nwith the Court definitively demonstrates there is no genuine issue as to any material fact \nrelated to the allegations against him which have led to his unwarranted removal from \nhis home, significantly disrupted his business operations, and unjustly grante d the \nPetitioner full custody of their children and possession of the family home  on a \ntemporary basi s. \nThe Respondent has meticulously and persistently contested the baseless allegations of \nfamily violence that have unjustly prejudiced the custody resolution to the detriment of \nthe children's interests. The absence of substantive evidence supporting these claims has \nbeen made clear through detailed submissions. ²  This unwarranted influence on custody  \n¹ Rule 166a specifically allows for summary judgment when \"the pleadings, depositions, answers to \ninterrogatories, and admissions on file, together with the affidavits, if any, show that there is no genuine \nissue as to any material fact and that the moving  party is entitled to a judgment as a matter of law.\" This \nprovision is utilized here to highlight the lack of factual dispute regarding the allegations of family \nviolence  which have led to the continuation of unlawful temporary orders currently in place . \n² Submissions on record filed by the Respondent: Motion of Continuance (granted), Motion of \nConsolidation (granted), Protective Order Answer (ignored), Counter Petition for Divorce (ignored), \nMotion of Withdrawal for Attorney (granted), Emergency Motion of Reconsideration of Evidence and to \nVacate Temporary Orders (Scheduled for March 14th, 2024) . See attach ed EXHIBIT A.  322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 2283
    },
    {
      "page_number": 17,
      "text": "arrangements negate  the principles of fairness and due process. The subsequent \ndismissal of the Protective Order suit not only vindicates the Respondent but also \ninvalidates the current custody orders, revealing that the initial award of custody was  \ngrounded solely in unsubstantiated claims of family violence. ³ \n \nBACKGROUND  \nThe documents on record  filed by the Respondent , by virtue of their acceptance , \ninherently meet the threshold for self -authentication, thereby bolstering the legal \nfoundation for the requested partial Summary Judgment. Detailed herewith are the \nenumerated  facts underpinning this motion:  \n1. On December 14th, 2023, the Petitioner sought an EX -PARTE Order of \nProtection from the Court, which was judiciously denied, affirming the \nabsence of immediate threat or harm that warranted such an extraordinary \nmeasure. Undeterred by this judicial determin ation, the Petitioner proceeded \nto file for divorce on December 18th, 2023, misleadingly alleging the existence \nof an active Order of Protection against the Respondent. This deliberate \nmisrepresentation constitutes not merely an attempt to skew the legal p rocess \nin the Petitioner’s favor but represents a flagrant abuse of the judicial system \ndesigned to secure an undue advantage in the divorce proceedings, which ha s \nultimately been successful.  \n \n2. On December 22nd, 2023, the Petitioner initiated a subsequent application for \na Protective Order, forming the cornerstone of litigation since the initial \nhearing on January 16th, 2024.  \n \n3. On January 16th, 2024, the Court  rendered Temporary Orders which required \nthe Respondent to vacate his family home and  give up custody of his children \non the presumption of family violence. The Court’s decision did not meet the \nstatutory requirements of the Texas Family Code, Sec. 6.502. ⁴ \n \n³ The non-suit of the protective order entitles the Respondent to this Partial Summary Judgement as a \nmatter of law, as there is now no genuine dispute over the baselessness of the allegations made against \nhim which are the foundation of the current temporary orders in place.  \n⁴ Sec. 6.502 mandates that a Court may make such a decision while a suit for dissolution of a marriage is \npending and on the motion of a party or on the court's own motion after notice and hearing . No hearing \ntook place, and no reasonable notice was given prior to the decision rendered on January 16th, 2024.   \n-2- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2625
    },
    {
      "page_number": 18,
      "text": "4. On January 22nd, 2024, before the start of the reset hearing, the Petitioner   \nacquired legal counsel at the last minute, delaying the case further until the \nreset date of February 1st, 2024 . \n \n5. On February 1st, 2024, both parties entered into an agreement which allowed \nthe respondent back into the home on a temporary basis, yet still awarded the \nPetitioner with full custody of the children.  The Respondent was given 30 days \nper the agreement to remain in the home. Despite having the ability to stay \nnext door, and after dropping the Protective Suit that initiated and are the \nfoundation for this agreement , the Petitioner chose to stay with her friend 9 \nmiles away and remove the children from their stable environment . \n \n6. On February 5th, 2024, the Respondent discharged his Legal Counsel for failure \nto address any of the issues  mentioned herewith, and for failure to diligently \nrepresent the Respondent, as no genuine effort was made to make the court \naware of these errors.  The Protective Order suit was non -suited on this day, \ninvalidating the current agreement, and requiring by law that the Court reset \nthe case back to the status quo ante until a fair discovery process can be \nconducted on relevant matters to the divorce proceeding, and restoring order \nback into the lives of the Respondent and his Children.  \n \n7. The Petitioner's decision to reside outside the family home, despite alternatives \nthat would minimize disruption during this transitional period, is a deliberate \nchoice. This choice, made independently, should not facilitate the continuation \nof unfounded c laims that have since been dismissed. Such actions have unduly \ninfluenced the living arrangements and well -being of the children at the heart \nof this case . \n \n8. The Respondent explicitly refrains from pursuing any sanctions or penalties \nagainst the Petitioner, emphasizing instead a heartfelt plea for a reasonable \ntransition period. This adjustment period is advocated as crucial for \nsafeguarding the welfare of his children, himself, and the Petitioner, ensuring \ntheir collective long -term well -being. Furthermore, the Respondent \nunderscores that the prevailing custody determinations were unjustly \npredicated on unsubstantiated allegations of family violence —a point \nunderscored by the unequivocal dismissal of the Protective Order, which \nconfirms the absence of any contested material facts . \n-3- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2610
    },
    {
      "page_number": 19,
      "text": "LEGAL BASIS  \nThe legal foundation for this Partial Summary Judgment is firmly rooted in the principles \nand mandates of the law, notably where the current temporary orders are predicated on \nunsubstantiated claims of family violence, for which no concrete evidence has been \npresented. This lack of evidence fundamentally challenges the integrity and validity of \nthe orders affectin g the lives and welfare of the children involved. The necessity for the \ncourt to vacate these orders and revert to the status quo ante is underscored by the \nfollowing critical legal argument s: \n1 . Misalignment with Texas Family Code Sec. 105.001:   \n \n1.1 The orders issued on January 16th, 2024, and continued on January \n22nd, 2024, starkly conflict with Texas Family Code Sec. 105.001, which \nunequivocally necessitates notice and a hearing prior to the issuance of \nsuch orders. This statute ensures that partie s are given a fair opportunity to \nbe heard, a fundamental aspect of due process, which was conspicuously \nabsent in this case.  \n \n2. Contravention of Texas Family Code Sec. 105.005:  \n2.1 The initial rendering of temporary orders on January 16th, 2024, did \nnot adhere to Texas Family Code Sec. 105.005 , requiring that court's \nfindings be grounded in a preponderance of the evidence  before making \nany child custody determination affecting the parent -child relationship .  \n \n2.2 The absence of evidence from the Petitioner, juxtaposed with the \ndisregard for the Respondent's timely submissions, underscores a \nsignificant deviation from this legal requirement.  \n \n3. Violation of Texas Family Code Sec. 153.002:   \n \n3.1 The proceedings failed to prioritize \"The best interest of the child,\" as \nmandated by Texas Family Code Sec. 153.002. This principle, deemed \nparamount in determining issues of conservatorship, possession, and \naccess, was overlooked.  \n \n3.2 The Respondent's work -from-home situation and the need for a  \n-4- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2118
    },
    {
      "page_number": 20,
      "text": "reasonable transition period to maintain his pivotal role in his children ’s \nlives were disregarded, further exacerbating the impact of the Petitioner ’s \nactions and the court ’s decisions on the children ’s stability and well -being.  \n4. Equal Opportunity and Fair Hearing (Sec. 152.205 & Sec. 105.003):  \n4.1 The Texas Family Code Sec. 152.205  and Sec. 105.003  enshrine the \nnecessity for equitable procedural rights, mandating that all parties are \ngranted a fair opportunity for notification and a meaningful hearing. The \nRespondent ’s ability to engage fully in the hearing process and to present a \ncomprehensive defense was significantly impeded, a deviation from the \ndue process envisaged by these statutes. Consequently, the temporary \norders issued lack the foundational fairness that i s central to the justice \nsystem and contravene the legal safeguards intended to ensure balanced \nparticipation by all parties in family law proceedings.  \n \n5. Managing Conservatorship Considerations (Sec. 153.005 & Sec. 153.007):  \n5.1 In deliberations of conservatorship, Texas Family Code Sec. 153.005 \nobligates the court to deliberate thoroughly on the child ’s best interest, \nincluding the living circumstances and stability provided by the parents. \nAdditionally, Sec. 153.007  advocates for the establishment of a mutually \nagreed parenting plan, prioritizing the child ’s welfare and the continuity of \ntheir established routine. The current  custodial provisions do not \ncorrespond with a collaboratively designed parenting plan that satisfies \nthese essential criteria. Given the disproven allegations of family violence \nand the unnecessary protective measures imposed during this period of \nchange, it is imperative for the Court to rescind these provisional measures. \nThe immediate restoration of the status quo ante is crucial to uphold the \nchildren ’s best interest, allowing for a planned and considerate period of \nadjustment that acknowledges the absence of any immediate risk or harm \nto their well -being  and without disruption to the Respondent’s business \noperations at -home.  \n \n6. Rules of Dispositions for Family Law Cases – (Tarrant County Rules):  \n6.1 The provisions under Rule 4.02: Trial Procedures of the Tarrant Family \nRules , specifically Part 4  concerning the disposition of family law cases, \nhave been notably contravened in the ongoing proceedings of the. This rule  \n-5- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2593
    },
    {
      "page_number": 21,
      "text": "mandates that, except upon order of the Court or a showing of good cause,  \nand notably in cases involving the characterization, value, or division of \nproperty, each party is required to provide the Court and opposing counsel \nwith a concise written summary of the relief requested and, in the context \nof a final trial, the party’s i nventory and appraisement and proposed \ndivision of property and debts at the time of the temporary hearing, final \ntrial, or other court proceeding.  \n \n6.2 The failure to adhere to this procedural requirement undermines the \nfairness and efficiency of the legal process, particularly in this case where \nthe Respondent, has faced significant challenges and disruptions based on \ntemporary orders and allegations wit hout the foundation of substantiated \nevidence or the proper procedural disclosures as outlined by Rule 4.02 . The \nabsence of such critical documentation and summaries from the Petitioner \nhas not only impaired the Respondent's ability to prepare and present a \ncomprehensive defense but has also deprived the Court of essential \ninformation necessary for a fair and informed decision -making process . \n \n7. Rule 60. Relief from a Judgment or Order ( Federal Rules of Civil \nProcedure):  \n7.1 In accordance with Rule 60(b)  of the Federal Rules of Civil Procedure , \nthis motion seeks relief from the temporary orders previously granted, and \nwhich are the basis of the current orders, which have unjustifiably removed \nthe Respondent  from his residence and disrupted his custodial rights \nwithout substantial evidence. Rule 60(b)  expressly allows for such relief \nunder conditions including, but not limited to, mistake, inadvertence, \nsurprise, excusable neglect, and most pertinently, fraud or \nmisrepresentatio n by an opposing party. Given the demonstrated lack of \nevidence supporting the allegations of family violence and the procedural \ndiscrepancies noted throughout the initiation and execution of these \ntemporary orders, it is imperative that the court immediately vacate the \ncurrent arrangements as their basis no longer exists . The circumstances \nsurrounding the issuance of these orders align with the instances wherein \nRule 60(b)  provides clear recourse for relief, underscoring the necessity for \ntheir immediate reevaluation to restore fairness and ensure justice is served \nin accordance with the foundational principles of our legal system . \n-6- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2601
    },
    {
      "page_number": 22,
      "text": "STATEMENTS OF FACT  \nBelow are the enumerated statements of fact  with no genuine dispute of material fact  \nthat entitle the Respondent to this Partial Summary Judgement:  \n1. The Petitioner has not provided any evidence of Family Violence .⁶ These claims \nunjustly removed the Respondent from his home starting on January 16th, 2024  \nand significantly impaired his at -home business operations , and are the basis for \nthe current custodial arrangements  which are unlawful and founded on false \nclaims.⁷ \n \n2. No basis exists for the current arrangements, as the Court has no t considered the \nbest interests of the children throughout this case, but rather has operated solely \non the accusations of family violence, which are now non -suited.⁸ \n \n3. The deadline approaching  March 1st to vacate,  and the current custodial \narrangements are void of any lawful basis . Any custodial arrangements are \nrequired to consider  the best interests of the children involved . \n \n4. Respondent’s parenting plan has been overlooked by the Court, filed January 6th, \n2024.⁹ \n \n5. The Court’s basis for conservatorship was based solely on the claims of Family \nViolence, which are now void.  \n \n6. The respondent is entitled to this Partial Summary Judgement as a matter of law, \nwhich will rightfully restore the status quo ante  given no genuine dispute of \nmaterial fact exists regarding family violence, which are the basis for the ongoing \nand current orders.  \n⁶ There exist no evidence supporting family violence on record, nullifying any custodial arrangements    \nbased on these foundational claims  alone . \n \n⁷ See attached EXHIBIT B . \n \n  ⁸ Attached EXHIBIT C, page 3. \n  ⁹ See attached EXHIBIT D, filed January 6th, 2024 , which better serve the children’s  best interests.  \n \n-7- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1962
    },
    {
      "page_number": 23,
      "text": "PRAYER FOR RELIEF  \nWHEREFORE, Charles Dustin Myers, the Respondent herein, respectfully requests  this \nHonorable Court to:  \n1. Annul the current temporary custody and visitation arrangements premised on \nallegations now proven to be baseless, taking into account the critical urgency \nimposed by the Respondent’s work -from -home requirements and the ongoing \ndetriment to his familial re lationships.  \n \n2. Recognize that the initial accusations of family violence, which underpinned \nthe imposition of these temporary measures, were not substantiated by \ncredible evidence. This failure has unjustly prejudiced the Respondent, \nundermining his right to an equitable  adjudication and rendering the imposed \nmeasures legally untenable.  \n \n \n3. Acknowledge the absence of substantial evidence for the allegations levied \nagainst the Respondent. Command a thorough reevaluation of both procedural \nand substantive legal missteps observed in the prevailing proceedings, with a \nview to rectifying the inequ itable temporary orders that have adversely \nimpacted the Respondent’s familial and professional life.  \n \n4.  In accordance with Rule 166a of the Texas Rules of Civil Procedure and Rule \n60(b) of the Federal Rules of Civil Procedure, award relief predicated on \nidentifiable mistakes, errors, and the conspicuous lack of evidential foundation \nfor the accusations face d by the Respondent.  \n \n \n5. Uphold Fairness and Due Process: Reorient the ongoing legal process to align \nstrictly with the principles of fairness, due process, and the paramount \ninterests of the children involved. This reorientation is essential to ensure the \nadministration of justic e, uphold the Respondent’s inalienable right to a fair \ntrial, and ameliorate the unwarranted disruptions to his familial life.  \n \n6. Consideration of Respondent’s Efforts: Reflect on the substantial time and \neffort dedicated by the Respondent in pursuit of equitable treatment under the  \n \n-8- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2139
    },
    {
      "page_number": 24,
      "text": "law and the significant repercussions stemming from his unjust displacement  \nbased on allegations now demonstrated to be without merit.  \n \n7. Reestablish the custodial and visitation status quo ante pending a lawful and \nunbiased reevaluation of the custody determination, ensuring that any future \ndecisions are made in a manner that genuinely reflects the best interests of the \nchildren and respect s the due process rights of all parties involved.  \nThe Respondent avers that such relief is not only justified but imperative to rectify the \ninjustices endured and to restore the integrity of this Court’s proceedings.  \nUnder penalty of perjury, I attest that the facts herein are true and accurate to the best of \nmy knowledge and belief.  Pursuant to the Tarrant Local Rules, no conference between \nCounsel was required to be filed with this motion.  \n \nRespectfully submitted,  \n \n/s/ Charles Dustin Myers   \n02/22/20224  \nCharles Dustin Myers  \nChuckdustin12@gmail.com  \n817-507-6562  \n \n \n \n \n \n \n-9- \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1183
    },
    {
      "page_number": 25,
      "text": "CASE NO.  \n \n \n__\n____________________ _____ ___        \n     \n \nVS        \n \n______________________________    TARRANT COUNTY, TEXAS \n \n \n \nCERTIFICATE OF SERVICE \n \nI\n certify that a true and correct copy of the : ________________________________________ \n________________________________________________________________ _______________  \nhas been delivered to all opposing parties on record in accordance with the Texas Rule of Civil \nProcedure, 501.4, on this _______ day of ___________________, 20____. \n \nSELECT ONE: \n \n \n     IN PERSON \n      MAILED/COURIER  RECEIPT #________________________ \n      FAX \n      E-MAIL (Only if the other party has agreed in writing to accept email service) \n          \n__\n________________________________  ___________________________________ \nSIGNATURE      PRINT NAME \n \n_____________________________________________________________________________ \nADDRESS       CITY, STATE AND ZIP CODE \n \n__________________________________ \nPHONE NUMBER \n \n \n ___________________322-744263-23\nMORGAN MICHELLE MYERS\nCHARLES DUSTIN MYERSPETITIONER (PRINT)\nRESPONDENT (PRINT)IN THE 322nd\nDISTRICT COURT\nMotion for Partial Summary Judgement\n22nd February 24\nX\n/s/ Charles Dustin Myers\nCharles Dustin Myers\n6641 Anne Court Watauga, TX 76148\n817-507-6562\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1447
    },
    {
      "page_number": 26,
      "text": "**THIS IS NOT A SUBSTITUTE FOR THE ADVICE OF AN ATTORNEY** \n \n  Pag\ne 1 of 3 NOTICE: THIS DOCUMENT \nCONTAINS SENSITIVE DATA \nCause No. _____________________________________ \n \n__________________________ §     In the (check one ) : \n__\n________________________ §            ________ District Court \n__________________________ §  County Court at Law No. ____  \n__________________________ §      _______________ County, Texas \n \nMotion for ___________________________________________ \nPrint your answers \nMy name is:  \n \n______________________________________________________________________ \n First     Middle    Last  \n \nI a\nm the         Petitioner      Respondent      in this case and request the Court grant  \n \nthis motion for _____________________________________________. In support, the \n                                                                            (ti tle of motion)  \nfoll\nowing is shown:                                         \n__\n____________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ Cause No. 322-744263-23\n322nd\nTARRANTXMORGAN MICHELLE MYERS\nV\nCHARLES DUSTIN MYERS\nPartial Summary Judgement\nCHARLES DUSTIN MYERS\nx\nPartial Summary Judgement\n______\n_____________________________________________The current orders in place were solely determined based on false allegations which are now non-suited.\nPlease see attached brief.322-744263-23 FILED\nTARRANT COUNTY\n2/22/2024 11:23 AM\nTHOMAS A. WILDER\nDISTRICT CLERK\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2342
    },
    {
      "page_number": 27,
      "text": "P age 2 of 3 \n____________________________________________________ __________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________\n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n______________________________________________________________________ \n \nRespectfully submitted, \n \n \n        \nYour Signature \n \n \n    Y\nour Printed Name                                                                          Phone  \n \n \nM\nailing Address City State Zip \n \nEmail Address     Fa x # (if any) \n \n \nNo\ntice of Hearing \nThe above motion is set for hearing on ________________ at __________. M. in \n______________________________________________________________________\n________________________________________________ (d esignation and location of court).  \nS\nIGNED on ___________________________. \n ________________________________  \n  Judge or Clerk /s/ Charles Dustin Myers\n817-507-6562\n6641 ANNE COURT WATAUGA\nTX 76148\nCHUCKDUSTIN12@GMAIL.COMCharles Dustin Myers2024-02-22_____________________________\nDate\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1945
    },
    {
      "page_number": 28,
      "text": "P age 3 of 3 \n \nCertific\nate of Conference  (check one)  \n \n    I\n certify that I telephoned the other party’s attorney or the other party (if the other \nparty does not have an attorney), three times, but my phone calls were never \nreturned. Therefore, we were not able to reach an agreement. \n \n    I certify that I telephoned the other party’s attorney or the other party (if the other \nparty does not have an attorney) and we were not able to reach an agreement. \nSignature                                                                                                                 Date  \n \n \n \nCertific\nate of Service \n \nI certify that I delivered a copy of this document to each party in this case, or if a party \nis represented by a lawyer to the party’s lawyer, by: (Check one or more)  \nHan\nd delivery to the other party  __________________________________________ \nHand delivery to the other party’s  lawyer  ___________________________________ \nEmail to this email address  ______________________________________________ \nRegular mail to this address:_____________________________________________ \n____________________________________________________________________ \nCertified mail to this address:_____________________________________________ \n____________________________________________________________________ \nCommercial delivery service (for example FedEx) to this address:  _______________  \n____________________________________________________________________ \nFax to fax #:__________________________________________________________ \n \n                  _____ ____________ \nSignature                                                                                             Date  x COOPERCARTER@MAJADMIN.COM\n/s/ Charles Dustin Myers 2024-02-22\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1939
    },
    {
      "page_number": 29,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 84786327\nFiling Code Description: Motion (No Fee)\nFiling Description: Motion for Partial Summary Judgement\nStatus as of 2/22/2024 11:59 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n2/22/2024 11:23:08 AM\n2/22/2024 11:23:08 AMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n2/22/2024 11:23:08 AMStatus\nSENT\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 1081
    },
    {
      "page_number": 30,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 98381088\nFiling Code Description: Motion (No Fee)\nFiling Description: REQUEST TO SET UN-OPPOSED SUMMARY\nJUDGMENT AND UN-OPPOSED RULE 12 MOTIONS FOR\nSUBMISSION\nStatus as of 3/13/2025 8:54 AM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n3/12/2025 2:44:58 PM\n3/12/2025 2:44:58 PM\n3/12/2025 2:44:58 PM\n3/12/2025 2:44:58 PMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 920
    }
  ]
}