{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\04.04.25 - PRE-OBJECTION TO TRANSFER-1.pdf",
  "base_name": "04_04_25_pre_objection_to_transfer_1",
  "page_count": 2,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 233-765358-25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE COURT:  \n Petitioner, CHARLES DUSTIN MYERS, PRE -OBJECTS to any motion to transfer filed  \non behalf of COOPER L. CARTER in this matter, and in support thereof, shows the following: \nI. INTRODUCTION \n1. On March 28, 2025, Petitioner  set a properly filed motion to be heard in front of the \nassociate Judge. \n2. Petitioner was denied an opportunity to be heard due to the claim that COOPER L.  \nCARTER would be filing a motion to consolidate in the 322nd District Court of Tarrant County  \nas justification for the denial of due process. \n 3. On April 2nd, 2025, Petitioner filed a PRE- OBJECTION laying out the legal reasons  \nwhy COOPER L. CARTER ’s consolidation motion was improper, and premature. \n 4. COOPER L. CARTER cannot move to consolidate this matter with the divorce suit  \npending before the 322nd District Court because the Texas Family Co de 6.407(b) explicitly  \nstates:  \n“On the transfer of the proceedings, the court with jurisdiction of the suit for dissolution of a \nmarriage shall consolidate the two causes of action. ” \n  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n PETITIONER’S PRE-OBJECTION TO \nMOTION TO TRANSFER   \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025-04-04",
      "char_length": 1334
    },
    {
      "page_number": 2,
      "text": "5. The refore, COOPER L. CARTER ’s motion to consolidate is procedurally improper, and was  \nused as a tool to interfere with emergency proceedings where  no answer was provided.  \n 6. The court  cannot refuse to hear a properly filed motion before it and give deference to an  \nimproperly filed motion notwithstanding COOPER L. CARTER ’s misconduct and failure to prosecute the  \ndivorce suit.  \nII. CONCLUSION \n 7. For the se reasons, Petitioner respectfully OBJECTS to any motion to transfer filed on behalf of  \nCOOPER L . CARTER.  \n 8. Furthermore, before any motion to transfer is to be set by COOPER L. CARTER, her authority  \npursuant to Rule 12 should be resolve d by citing COOPER L. CARTER to appear and prove her authority  \nto represent the Respondent in this matter.  \n \n Respectfully submitted,  \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE \n \n  \nCERTIFICATE OF SERVICE  \n \n Pursuant to rule 21a of the Texas Rules of Civil Procedure, this PRE -OBJECTION to \nmotion to transfer  was served on all parties of record via their EFM email registered with  \nre:Search Texas  on 04/04/2025. \nAnd also to COOPER L. CARTER via COOPERCARTER@MAJADMIN.COM  \n Respectfully submitted,  \n/s/ Charles Dustin Myers \n  CHARLES DUSTIN MERS  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693  \n  PRO -SE",
      "char_length": 1357
    }
  ]
}