{"id": "ba615b03afc3bf14dc97a7a52f85d2c426f03407", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322- 744263- 23 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nANALYSIS  \nA Legal Research Paper Examining the Validity of Temporary Orders Signed on March 26, 2024 \nPrepared for Court Submission  \nApril 1 4, 2025 \nABSTRACT \nThis research paper examines whether the Temporary Orders signed on March 26, 2024, \nin Cause No. 322- 744263- 23 (322nd District Court, Tarrant County) are facially void or legally \ninvalid due to procedural irregularities. The analysis focuses on how the Ass ociate Judge's \nReports from February 1, 2024, and March 14, 2024, were processed, highlighting significant \ndeviations from required legal procedures. The paper evaluates these irregularities against the framework of Texas Family Code provisions, Texas Rule s of Civil Procedure, and relevant case \nlaw. Particular attention is given to issues of consent, due process violations, and the legal consequences of these procedural failures. The research concludes with an assessment of potential remedies, including mandamus relief and other direct attacks to vacate the orders.   \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n PROCEDURAL IRREGULARITIES IN \nTEMPORARY ORDERS  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -04-13\n\nTABLE OF CONTENTS  \nI. INTRODUCTION AND ISSUE PRESENTED \n      A. Overview of the Case  .................................................................................................. \n      B. Issue Presented  ............................................................................................................ \nII. FACTUAL BACKGROUND AND PROCEDURAL HISTORY  ..................................... \n      A. February 1, 2024 – Associate Judge's Hearing and Report  .........................................  \n      B. March 14, 2024 – Attempt to Finalize Order and Second AJ's Report  .......................  \n      C. March 26, 2024 – Filing of the Temporary Orders and Circumstances of Signing  .... \nIII. LEGAL FR"}
{"id": "6d6339b39a6297e6e58c44cff6223f137f32d531", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " March 14, 2024 – Attempt to Finalize Order and Second AJ's Report  .......................  \n      C. March 26, 2024 – Filing of the Temporary Orders and Circumstances of Signing  .... \nIII. LEGAL FRAMEWORK  ..................................................................................................  \n      A. Authority of Associate Judges and Requirements for Temporary Orders  ................... \n      B. Agreed Orders and Rule 11  .........................................................................................  \n      C. Relevant Statutory Provisions and Case Law  ............................................................. \nIV . ANALYSIS OF PROCEDURAL IRREGULARITIES  ...................................................  \n      A. Failure to Follow Associate Judge's Explicit Procedures  ............................................  \n      B. Lack of Valid Consent to Support an \"Agreed\" Order  ................................................  \n            1. Missing Signature on Mar ch 14 Report  .................................................................  \n            2. Objection Not Resolved  .........................................................................................  \n            3. Coerced Signature = No Real Consent  ..................................................................  \n            4. Absent Attorney for Charles  ...................................................................................  \n      C. Non -Conformance to the Court's Actual Rulings – Possible Variances  ...................... \n      D. Due Process Violations and Equity  .............................................................................  \n            1. No Meaningful Opportunity to be Heard on Disputed Terms  ...............................  \n            2. Surprise and Lack of Notice  ..................................................................................  \n            3. Bias and Irregularity  ....................."}
{"id": "d056d4314e1ddd6fd66366e83fd9a4f0f9b5dfc6", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": ".........  \n            2. Surprise and Lack of Notice  ..................................................................................  \n            3. Bias and Irregularity  ..............................................................................................  \n            4. Infringement on Parental Rights without Due Course  ...........................................  \n      E. Are the March 26, 2024 Temporary Orders Facially V oid?  .........................................\n\nV . REMEDIES .......................................................................................................................  \n      A. Vacating the Temporary Orders – Mandamus Relief  ..................................................  \n      B. Alternative Remedies  .................................................................................................. \nVI. CONCLUSION ................................................................................................................ \nVII. REFERENCES  ............................................................................................................... \nVIII. CERTIFICATE OF SERVICE  ......................................................................................\n\nI. INTRODUCTION AND ISSUE PRESENTED  \nA. Overview of the Case  \nThis report examines whether the Temporary Orders signed on March 26, 2024, in Cause \nNo. 322- 744263- 23 (322nd District Court, Tarrant County) are facially void or legally invalid. \nEvidence indicates serious procedural irregularities in how the Associate Ju dge's Reports from \nFebruary 1, 2024, and March 14, 2024, were handled.  \nThe case involves a family law matter between Morgan Myers (Petitioner) and Charles \nMyers (Respondent). The procedural history reveals a concerning pattern of deviations from \nstandard legal practice and explicit judicial directives. Of particular concern a re the following \nnewly uncovered facts:  \nThe February 1, 2024, Associate Judge's Report "}
{"id": "80c48d5bd9df2ce2256d769d9eec98603fe43870", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "pattern of deviations from \nstandard legal practice and explicit judicial directives. Of particular concern a re the following \nnewly uncovered facts:  \nThe February 1, 2024, Associate Judge's Report required a typed Temporary Orders \nconforming to the report to be prepared by attorney Dan Bacalis within 20 days, approved by both attorneys within 5 days, and set for entry (\"motion to sign\") within 30 days if no agreement.  \nThe order filed (March 26, 2024 Temporary Orders) was prepared well past the 20 -\nday/30- day deadlines – in fact about 44 days later – and by Cooper L. Carter (opposing counsel) \ninstead of Dan Bacalis. It was not reviewed or approved by Charles's attorney (Bacalis had ceased representing Charles by then), and Charles was pressured to sign it immediately on March 26, 2024, under threat of adverse action, rather than being given the 5- day review period the \nAssociate Judge had ordered  and the parties actually had agreed to.  \nThe March 14, 2024, Associate Judge's Report contains handwritten directives written by \nopposing counsel, not the judge, including a coercive ultimatum that final orders must be presented by 1:30 PM that same day. The report notes that Charles objected to the form of the\n\nproposed order and refused to approve Paragraph 3 – evidencing that no true agreement on all \nterms existed.  \nB. Issue Presented  \nThis research paper addresses the following central question: Do these procedural failures \n– including non- compliance with the Associate Judge's instructions, lack of required \nsignatures/approvals, and coerced \"consent\" – render the February 1 and March 14 reports never \nproperly converted into a valid court order, and thus make the March 26, 2024, Temporary \nOrders facially void or otherwise invalid?  \nThe analysis will address the governing law (Texas Family Code provisions, Texas Rules \nof Civil Procedure, and case law) and analyze potential due process violations. The paper will also discuss remedies, including whethe"}
{"id": "5ca1e42d01e85361d2c850fdbd9f92c2f6b2c878", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ess the governing law (Texas Family Code provisions, Texas Rules \nof Civil Procedure, and case law) and analyze potential due process violations. The paper will also discuss remedies, including whether mandamus relief or other direct a ttacks are appropriate \nto vacate the orders.  \nII. FACTUAL BACKGROUND AND PROCEDURAL HISTORY \nA. February 1, 2024 – Associate Judge's Hearing and Report  \nOn February 1, 2024, an Associate Judge never heard Petitioner Morgan Myers's motion \nfor temporary orders. The purpose of the setting was for Petitioner to produce evidence of her \nfamily violence claims.  According to the Associate Judge's Report for Temporary Orders signed \nthat day, both parties appeared with counsel. The report recites that Petitioner (Morgan) and Respondent (Charles) \"signed an Associate Judge's Report regarding Agreed Temporary Orders.\" In other words, the Associate Judge’ s Report for Temporary Orders was represented as an agreed \norder.\n\nNotably, however, the February 1 report itself was not a final typed order; it was a \nhandwritten form that Dan Bacalis, not the Associate Judge, completed. Crucially, at the end of \nthe hearing the Associate Judge did not enter a final written order but instead set out a procedure \nto finalize one:  \n1. A typed Temporary Order conforming to the Associate Judge's Report was to be prepared within 20 days of February 1, 2024. The report explicitly says: \"A typed written Order conforming to this Report will follow within 20 days from the date this Report is signed. The Temporary Order shall be prepared by [Dan Bacalis].\"  \n2. Each attorney was to approve the order, with 5 days for review. The report states: \"Each attorney should approve the Order. The parties do not need to approve the Order. The attorney reviewing the proposed Order shall have five (5) days to do so.\" Thus, both \nMorgan's and Charles's attorneys were required to sign off as to  form; the parties' \nsignatures on the final typed version were not strictly requi"}
{"id": "da60478e2d2f805f9ee802cac0dcca5af03f3c2f", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "rder shall have five (5) days to do so.\" Thus, both \nMorgan's and Charles's attorneys were required to sign off as to  form; the parties' \nsignatures on the final typed version were not strictly required by this instruction (since it says parties \"do not need to approve\"), but the initial report itself contemplated an agreed order and included signature lines for the parti es as evidence of their agreement. In \npractice, for an agreed family order it is standard that both parties and counsel sign \"Approved as to Form and Substance.\"  \n3. If the attorneys could not agree on the form of order, a \"Motion to Sign\" hearing was to be set within 30 days of February 1. The report directs: \"If an agreement is not reached, a Motion to Sign shall be filed and set within thirty (30) days from the signing of this Report.\" This meant by approximately March 2, 2024, any dispute about the order's \nwording or contents should be brought to the court for resolution.\n\nFinally, the February 1 Associate Judge's Report has an \"AGREED AS TO FORM AND \nSUBSTANCE\" signature block for the parties and attorneys.  \nThe Associate Judge did sign the report on February 1, making the report effective as an \ninterim order of the court. Under Texas Family Code § 201.013, a signed Associate Judge's \nproposed order is in full force and effect pending any request for a de novo hearing by the referring court. No reque st for a de novo hearing was filed by either party within the 3- working-\nday window (Tex. Fam. Code § 201.015(a)). Therefore, the Associate Judge's rulings of February 1 became the governing temporary orders in effect – but only in the form of the handwritt en \nreport, pending entry of the formal typed order.  \nB. March 14, 2024 – Attempt to Finalize Order and Second AJ's Report  \nBy early March 2024, no agreed typed order had been submitted or signed. Dan Bacalis \n(Charles's attorney) did not prepare the order within 20 days, nor was a Motion to Sign filed \nwithin 30 days. In fact, during "}
{"id": "3aada8203cefab3268c67f6b0d0c3473e697d6d2", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "h 2024, no agreed typed order had been submitted or signed. Dan Bacalis \n(Charles's attorney) did not prepare the order within 20 days, nor was a Motion to Sign filed \nwithin 30 days. In fact, during this period Charles's counsel was termina ted from representation \njust four days after the associate judge ’s report was signed on February 1. To address the basis \nfor any agreement being fraudulent, Charles promptly filed an emergency motion to reconsider \nevidence and vacate any agreement , which was eventually set for March 14 due to Cooper \nCarter’s availability.  \nAt the March 14 proceeding, instead of simply holding an entry hearing, the court and \ncounsel engaged in off -the-record discussions to get the order finalized. Opposing counsel \n(Cooper Carter) took it upon herself  to hand- write the directives on a new Associate Judge's \nReport form. These handwritten notes (penned by Carter, not the judge) included a coercive instruction that Charles must sign the final order by 1:30 PM that same day (March 14).\n\nEssentially, Charles was given an ultimatum to immediately acquiesce to the written \norder's terms. The March 14 report also documented that Charles objected to the form of the \norder and specifically did not approve Paragraph 3 (a provision in the draft order). In other words, as of March 14 there was not a full meeting of the minds – Charles had an unresolved objection to at least one substantive term. Despite this, the pressure was on to finalize the order that day , and the purpose of being there was for an entire different purpose.  \nImportantly, the handwritten March 14 notes were not written by the judge and were not \ntraditional judicial findings or rulings – they were more in the nature of instructions and a deadline apparently dictated by opposing counsel. There is no indication th e Associate Judge \nheld an evidentiary hearing on March 14 or made independent findings; instead, it appears the goal was simply to force execution of the previously \""}
{"id": "0b3b2d02a465a1861bf1217cb404b61cad36a0b5", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "unsel. There is no indication th e Associate Judge \nheld an evidentiary hearing on March 14 or made independent findings; instead, it appears the goal was simply to force execution of the previously \"agreed\" temporary order that had essentially been nullified by Dan Bacalis ’ depa rture from the case.  \nC. March 26, 2024 – Filing of the Temporary Orders and Circumstances of Signing  \nOn March 26, 2024, a typed \"Temporary Orders\" document was finally filed with the District \nClerk. This document, which spans numerous pages, purports to memorialize the temporary conservatorship, possession, and injunction terms that were discussed back on February 1. The key points about this March 26, 2024 Temporary Orders are:  \n1. It was drafted by Cooper L. Carter, counsel for Morgan (as evidenced by the signature block indicating Carter's authorship and by the fact that Bacalis was no longer involved). This violated the Associate Judge's explicit instruction that Dan Bacalis would  prepare \nthe order. In effect, opposing counsel unilaterally drafted the order.\n\n2. It was prepared and filed well after the 20 -day deadline set by the February 1 report. \nNearly two months had elapsed (far beyond the expected February 21 deadline for \ndrafting and March 2 deadline for a motion to sign). No extension or modification of the Associate Judge's timeline was on record. Thus, the order was untimely under the terms of the February 1 directive. \n3. Critically, the order was not reviewed or approved by Charles Myers's attorney. By the time the order was drafted in late March, Charles had no attorney of record (Bacalis did not sign the order and had withdrawn). The February 1 report's procedure – requi ring \neach attorney to approve within 5 days – became impossible to follow, since Charles had no counsel to review the draft. Carter did not seek approval from any attorney on Charles's side. In fact, the signature block shows Dan Bacalis's signature line b lank (he \ndid not sign off because he w"}
{"id": "6d397e08f0a5b37b1ccc0f6f610b096979545cdd", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "counsel to review the draft. Carter did not seek approval from any attorney on Charles's side. In fact, the signature block shows Dan Bacalis's signature line b lank (he \ndid not sign off because he wasn't even on the case).  \n4. The March 26 order was presented to Charles for his signature on extremely short notice (apparently on the same day). Charles did not sign the order. He was essentially confronted with the final order and told to sign immediately (recall the March 14 \"1:30  \nPM deadline\" threat) or face adverse consequences (the implication being the judge would sign it without his consent or possibly hold him in contempt or consider him uncooperative). Feeling coerced and with no counsel to advise him, Charles signed \"Approved and Consented to as to Form and Substance\" on March 26, 2024 – but this signature was not truly voluntary. It was done under protest to avoid an even worse outcome. It is telling that Charles had explicitly refused to approve the same order's Paragraph 3 on March 14, yet by March 26 he capitulated and signed – a strong indicator of coercion rather than genuine agreement.\n\n5. The recitals in the March 26 Temporary Orders are misleading. The order opens by \nreciting that both parties appeared on February 1 and \"signed an Associate Judge's Report regarding Agreed Temporary Orders\", and that \"The parties have agreed to the terms of this order as evidenced by the signatures below.\" While Morgan and her counsel indeed \nsigned the report, Charles's signature was not on that report, so that recital is factually inaccurate. Thus, the very foundation – that the order is an agreed order – is incorrect. \nIn summary, the March 26, 2024, Temporary Orders were entered following a process in \nwhich the Associate Judge's explicit procedures were not observed, one party's counsel was no longer involved to approve the order, and the other party's consent was effectively forced. \nIII. LEGAL FRAMEWORK  \nA. Authority of Associate Judges and Requirements f"}
{"id": "a7fa3cc9c16ee94cb8f545bede3b50d86a4f50b0", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "rved, one party's counsel was no longer involved to approve the order, and the other party's consent was effectively forced. \nIII. LEGAL FRAMEWORK  \nA. Authority of Associate Judges and Requirements for Temporary Orders  \nAssociate Judge's Orders and Reports (Texas Family Code Ch. 201)  \nIn Texas family law cases, an associate judge may hear temporary orders matters and \nissue a report or even render an order, but certain procedures apply. Under Tex. Family Code § 201.011, an associate judge's report must be in writing and in the form direc ted by the referring \ncourt. The associate judge can include a proposed order in the report. After the hearing, notice of the substance of the report must be given to the parties (which can be done in open court, as happened on February 1). \nCrucially, parties have a right to request a de novo hearing before the referring District \nJudge within a short window (generally 3 working days for temporary orders in SAPCR cases) after receiving notice of the associate judge's report. See Tex. Fam. Code  § 201.015(a). If no \ntimely de novo hearing is requested, the associate judge's proposed order may be adopted and\n\nenforced as an order of the district court. In fact, pending any de novo request, the associate \njudge's proposed order is in full effect as an order of the court (Tex. Fam. Code § 201.013(a)). This legal mechanism is intended to give immediate effect to te mporary rulings, while allowing a \nquick review by the district judge if a party is dissatisfied.  \nAn associate judge has authority to \"render and sign... a temporary order\" in a SAPCR or \ndivorce case. Tex. Fam. Code § 201.007(a)(14)(C) expressly so provides. The associate judge can also sign a final order if it is agreed in writing by all parties as to  both form and substance. In \nother words, the statute recognizes that a true agreed order (with all parties signing off) can be signed by the associate judge and will carry the same weight as if the district judge signed"}
{"id": "78a43107b335c93ab1441b6bbf62503a083dad32", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "nce. In \nother words, the statute recognizes that a true agreed order (with all parties signing off) can be signed by the associate judge and will carry the same weight as if the district judge signed it. For contested matters, typically the associate judge issues a report and proposed order for the district judge to sign, unless no party objects (in which case the associate judge's order often effectively becomes final after the de novo period).  \nRequirements for Temporary Orders (Tex. Family Code § 105.001)  \nSection 105.001 of the Family Code governs temporary orders in suits affecting the \nparent -child relationship. It broadly allows a court to make temporary orders for the safety and \nwelfare of the child (e.g., conservatorship, support, restraining certain be havior, etc.). However, \nit also imposes certain procedural safeguards. For example, except in emergencies, temporary orders (like those appointing conservators or ordering support) can only be issued after notice and a hearing. \nNotably, a temporary order that excludes a parent from possession of or access to a child \n(as happened here, since Charles was forced out of the home and effectively had limited access) cannot be rendered without a verified pleading or affidavit showing the requisite facts\n\n(essentially a showing of immediate danger to the child). This is to ensure a parent is not denied \naccess without due process and evidentiary support. In our case, the initial February 1 hearing was tied to a protective order application, so there likely w ere affidavits/pleadings on file – but \nwhether evidence was presented is disputed. Regardless, the overarching principle is that due process must be afforded in temporary orders.  \nB. Agreed Orders and Rule 11  \nTexas strongly favors parties resolving issues by agreement, but any agreement touching \na pending lawsuit must satisfy Rule 11, Texas Rules of Civil Procedure to be enforceable. Rule 11 requires agreements to be either (1) in writing, signed by"}
{"id": "92cc4dae7f5e28a1f0f9cfe40ffa474ad84d11a8", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "s by agreement, but any agreement touching \na pending lawsuit must satisfy Rule 11, Texas Rules of Civil Procedure to be enforceable. Rule 11 requires agreements to be either (1) in writing, signed by the parties  or their attorneys, and \nfiled with the court, or (2) made on the record in open court. An \"Agreed Temporary Order\" is essentially a Rule 11 agreement on the interim issues, incorporated into a court order. If one party does not actually consent or withdra ws consent before the court renders the order, then \nthere is no valid agreement to support an agreed order.  \nTexas case law is clear that a court cannot render a valid agreed judgment or order \nwithout the genuine consent of both parties at the time of rendition. If a party revokes consent or never consented in the first place, the agreed judgment is improper. As the Texas Supreme Court has held in Burnaman v. Heaton, 240 S.W.2d 288 (Tex. 1951), a judgment purporting to be a consent judgment, but actually rendered without consent, is void. Similarly, in S&A Restaurant Corp. v. Leal , 892 S.W.2d 855, 857 (Tex. 1995), the court confirmed that a party may revoke \nconsent any time before judgment is rendered.  \nC. Relevant Statutory Provisions and Case Law\n\nThe legal analysis in this paper draws upon the following key statutory provisions and case \nlaw: \n• Texas Family Code § 201.007(a)(14)(C) : Authorizes associate judges to render and sign \ntemporary orders.  \n• Texas Family Code § 201.011: Requirements for associate judge's reports.  \n• Texas Family Code § 201.013: Effect of associate judge's report pending de novo \nhearing.  \n• Texas Family Code § 201.015(a) : Time frame for requesting de novo hearing.  \n• Texas Family Code § 105.001: Requirements for temporary orders in SAPCR cases.  \n• Texas Rules of Civil Procedure, Rule 11 : Requirements for enforceable agreements.  \n• Texas Rules of Civil Procedure, Rule 305: Procedure for submission of proposed judgments.  \nKey cases that inform this analysis inc"}
{"id": "c15147b063334993a17cab1732765b24936f888f", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "il Procedure, Rule 11 : Requirements for enforceable agreements.  \n• Texas Rules of Civil Procedure, Rule 305: Procedure for submission of proposed judgments.  \nKey cases that inform this analysis include:  \n• Burnaman v. Heaton , 240 S.W.2d 288 (Tex. 1951): A judgment purporting to be a \nconsent judgment but rendered without consent is void. \n• S&A Restaurant Corp. v. Leal , 892 S.W.2d 855, 857 (Tex. 1995): Party may revoke \nconsent any time before judgment rendered.  \n• In re Stephanie Lee , 411 S.W.3d 445, 450 (Tex. 2013): Court must enforce valid \nagreements but has no discretion to impose an agreement if not statutorily compliant or if no genuine agreement exists.\n\n• Page v. Sherrill , 415 S.W.2d 642 (Tex. 1967): Mandamus granted where temporary \ncustody order issued without notice and hearing violated due process.  \n• In re Stearns , 202 S.W.3d 414 (Tex. App.–Houston [14th Dist.] 2006, orig. proceeding): \nMandamus relief where trial court's temporary orders effectively changed custody \nwithout proper notice/evidence.  \n• In re C.J.C. , 603 S.W.3d 804 (Tex. 2020): Reaffirming the fundamental right of a fit \nparent and that any order infringing that right must have compelling justification.  \n• In re Southwestern Bell Tel. Co. , 35 S.W.3d 602, 605 (Tex. 2000): If an order is void, \nmandamus relief is available without showing inadequate remedy by appeal.  \n• O'Neil v. Blake , 86 S.W.3d 538, 541 (Tex. App.–Dallas 2002, no pet.): Consent \njudgment valid only if parties consent at time of rendition; trial court should not enter agreed order if one party's attorney did not sign it and party objected.  \nIV . ANALYSIS OF PROCEDURAL IRREGULARITIES  \nA. Failure to Follow Associate Judge's Explicit Procedures  \nThe February 1, 2024 Associate Judge's Report established a clear procedure for finalizing \nthe Temporary Orders. This procedure was not followed in several critical respects:  \n1. Preparation by Wrong Attorney : The Associate Judge explicitly directed that Dan \nB"}
{"id": "2076e486f092bfd2c5c237e7b8b974abef42e0f9", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "r procedure for finalizing \nthe Temporary Orders. This procedure was not followed in several critical respects:  \n1. Preparation by Wrong Attorney : The Associate Judge explicitly directed that Dan \nBacalis (Charles's attorney) would prepare the typed order within 20 days. Instead, Cooper L. Carter (Morgan's attorney) prepared the order. This is a direct contravention of the court's instruction. The c ourt's designation of a specific attorney to draft the order was \nnot a mere suggestion but a directive. When a court specifies which attorney will draft an\n\norder, it is typically to ensure fairness and balance in the drafting process. By having \nopposing counsel draft the order instead, the court's intent was undermined, and the resulting document may reflect a bias toward Morgan's interests.  \n2. Missed Deadlines: The Associate Judge set clear deadlines: 20 days for preparation of the typed order (approximately February 21, 2024) and 30 days for a Motion to Sign if agreement could not be reached (approximately March 2, 2024). The final order was not prepared until  March 26, 2024 – approximately 54 days after the February 1 hearing. This \ndelay of nearly two months exceeds both deadlines by a substantial margin. No extension of these deadlines appears in the record. The court's timeline was not merely advisory; it was a binding directive that established the parameters for finalizing the order. The \nfailure to adhere to these deadlines constitutes a procedural irregularity that calls into question the validity of the resulting order.  \n3. No Attorney Approval : The Associate Judge directed that each attorney should approve \nthe order, with a 5- day review period. By the time the order was prepared, Charles no \nlonger had counsel of record. Dan Bacalis had withdrawn from representation and did not sign the final or der. This means the order was never reviewed or approved by an attorney \nrepresenting Charles's interests, as explicitly required by the Associate Judge. "}
{"id": "805fb8480c655f4453be81900c6de1e1900d30cd", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": " representation and did not sign the final or der. This means the order was never reviewed or approved by an attorney \nrepresenting Charles's interests, as explicitly required by the Associate Judge. The requirement for attorney approval serves an important purpose: ensuring that the written order accu rately reflects what was agreed or ordered at the hearing. Without this \nsafeguard, there is no assurance that the final document faithfully represents the court's rulings or any agreement between the parties.  \n4. No Motion to Sign Hearing : The Associate Judge directed that if agreement could not be \nreached on the form of the order, a Motion to Sign should be filed and set within 30 days.\n\nNo such motion was filed, despite the fact that Charles objected to at least one provision \n(Paragraph 3) of the proposed order on March 14, 2024. Instead of following this procedure for resolving disagreements, opposing counsel and the court apparently attempted to force Charles's acquiescence through coercive means. The Motion to Sign \nprocedure is designed to provide a formal mechanism for resolving disputes about the form of an order. By bypassing this process, the court denied Charles the opportunity to present his objections in a proper procedural context.  \nThese procedural failures are not mere technicalities. They represent significant deviations \nfrom the court's own directives and from standard legal practice. The Associate Judge's instructions were designed to ensure a fair and orderly process for finaliz ing the Temporary \nOrders. By disregarding these instructions, the parties and the court undermined the integrity of the process and cast doubt on the validity of the resulting order.  \nB. Lack of Valid Consent to Support an \"Agreed\" Order  \nThe March 26, 2024 Temporary Orders purport to be an \"Agreed\" order, as evidenced by \nthe recitals and the signature blocks. However, several factors indicate that there was no valid consent to support an agreed order:  \n1. Missi"}
{"id": "4604e431a1d0b59ef2ccca15d5c3c5b630cd62bc", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "Orders purport to be an \"Agreed\" order, as evidenced by \nthe recitals and the signature blocks. However, several factors indicate that there was no valid consent to support an agreed order:  \n1. Missing Signature s \nThe March  26, 2024 Associate Judge's Report recites that both parties \"signed an \nAssociate Judge's Report regarding Agreed Temporary Orders\" and that \"The parties have agreed to the terms of this order as evidenced by the signatures below.\" However, Charles Myers's signature is notably absent from the report. This discrepancy between the recital and the actual \nsignatures calls into question whether Charles ever agreed to the terms in the first place.\n\nThe absence of Charles's signature on the report is particularly significant because the \nreport itself states that the parties' agreement would be \"evidenced by [their] signatures.\" Without \nCharles's signature, there is no evidence of his agreement as contemplated by the report itself. This creates a fundamental inconsistency: the document claims to be based on an agreement evidenced by signatures, yet one party's signature is missing.  \n2. Objection Not Resolved  \nAs of March 14, 2024, Charles explicitly objected to Paragraph 3 of the order and refused \nto approve it. This is documented in the March 14 Associate Judge's Report. This objection is clear evidence that Charles had not consented to all terms of the would- be agreed order. When a \nparty voices an objection to the form or substance of a judgment before it is signed, the proper course is for the court to refrain from entering it as an agreed judgment.  \nIn family cases, either party can revoke consent to an agreement any time before the \njudge signs the order. Charles's conduct on March 14 amounted to either a non- consent or \nrevocation of any prior tentative consent regarding that disputed term. Therefore,  at that point, \nthe matter ceased to be fully agreed. Under Texas law, the judge could only proceed by either obtaining a new agreement"}
{"id": "391ecfadbf3d2e20d2ff0306bab4d46a49c298cf", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "rior tentative consent regarding that disputed term. Therefore,  at that point, \nthe matter ceased to be fully agreed. Under Texas law, the judge could only proceed by either obtaining a new agreement or by treating it as a contested matter. Forcing the party to sign under threat is not a valid option. If consent is withdrawn, the court cannot render an agreed order – doing so is an abuse of discretion and the order will be void because one party's consent was lacking at rendition.  \n3. Coerced Signature = No Real Consent\n\nCharles's signature on February 1 was obtained under duress. He was effectively given an \nultimatum: sign immediately or face some unspecified but presumably severe consequence. \nConsent obtained through coercion, threats, or duress is not valid consent.  \nIn contract law, an agreement signed under duress can be voided. In judgment law, a \nparty's forced assent is no assent at all – it is akin to no agreement. Here, Charles did not willingly approve the order's substance; he relented to pressure  from his own counsel . This calls \ninto question the voluntariness of the agreed order. Texas courts have noted that agreed judgments are essentially contracts approved by the court. Just as a contract signed under duress is voidable, an agreed judgment signed under duress should not be given effect. The integrity of the judicial process is undermined if one party is bullied into signing a judgment.  \n4. Absent Attorney for Charles  \nCharles was pro se by March 26, without the benefit of counsel to advise him. This made \nhim more vulnerable to coercion and means there was no attorney on his side agreeing to the \norder's terms. Morgan's attorney drafted it and of course agreed to it; Charles had no attorney to negotiate or ensure fairness. The disparity in representation and the rushed nature of the signing further indicate the \"agreement\" was one -sided. Es sentially, the March 26 document was Morgan \n(through her attorney) agreeing with herself and getti"}
{"id": "36ed86781906f14768a632ce91ecaf581d24d016", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "resentation and the rushed nature of the signing further indicate the \"agreement\" was one -sided. Es sentially, the March 26 document was Morgan \n(through her attorney) agreeing with herself and getting Charles's signature as a formality. That is not a true meeting of minds. \nUnder these circumstances, the March 26 Temporary Orders cannot be considered a valid \nagreed order. It was a unilateral order imposed on Charles with a veneer of consent. In Texas, \nwhen a judgment is recited as agreed but in fact one party did not consent, the remedy is \ntypically to set it aside. For instance, in Samples Exterminators, the Texas Supreme Court held\n\nthe agreed judgment void when one party's consent was lacking. Likewise, in divorce cases, if \none party withdraws consent to a mediated settlement, the trial court cannot enter it as a judgment (see Burnaman v. Heaton, 240 S.W.2d 288 (Tex. 1951) – a decades- old case still often \ncited for the proposition that a judge has no authority to impose an agreement on a party who has repudiated it prior to judgment). Here, Charles's actions are tantamount to having never truly consented or having repudiated any earlier tentative consent.  \nIn sum, the final Temporary Orders are built on a false premise of party consent. On their \nface, they recite an agreement and show signatures, but the surrounding record shows Charles's signature and his attorney's signature is missing. This kind of discrepancy is something an appellate court or any reviewing court would look at with great concern. Facially, the order proclaims an agreement that did not actually exist – that is a strong indicator o f invalidity. A \njudgment that misstates the existence of an agreement is at least voidable, if not void, because the court's authority to render that particular agreed  judgment was never triggered by an actual \nagreement of the parties.  \nC. Non -Conformance to the Court's Actual Rulings – Possible Substantive Variances  \nAnother question is whether the M"}
{"id": "10b76fbe3284659bcc387356e2190d2452e27065", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 2000, "text": "ar agreed  judgment was never triggered by an actual \nagreement of the parties.  \nC. Non -Conformance to the Court's Actual Rulings – Possible Substantive Variances  \nAnother question is whether the March 26 order fails to conform to what the Associate \nJudge ordered on February 1. If the final written order includes provisions that were never agreed to or never ruled on by the judge, it is improper. Charles's objection to Paragraph 3 suggests he believed that portion of the order was not agreed or not ordered on Febr uary 1. Indeed, reviewing \nthe text of the Temporary Orders, Paragraph 3 (and related provisions) deals with the parents using the \"AppClose\" program for communication and sharing information. It is unclear if this specific requirement was discussed on Febr uary 1 or if it was an added term Carter inserted in \nthe written draft. Often, such  app requirements are agreed to by parties or ordered by judges to\n\nfacilitate communication. If Charles objected, perhaps he felt it was beyond what was decided at \nthe hearing.  \nFurthermore, initially , the Feb 1 report gave Charles access to the family residence until \nMarch 1, 2024 and took the children out of their own home. On the March 26 report, the dates suddenly shi fted, actually  creating a window where nobody would be inside the home . Perhaps \nmost egregious, is that on March 6\nth, 2024, prior to this hearing being held, Mother locked Father \nout of the family residence.  \nSince the final order went beyond the scope of the February 1 hearing and imposed new \nobligations not covered in the AJ's oral pronouncement, the proper course would have been to \nlitigate those terms (or at least for the judge to confirm both sides agreed). By unilaterally adding it and forcing Charles's signature, the order contain s terms to which there was never a true assent \nor judicial determination. In Texas, a written judgment must conform to the court's oral rendition (or the parties' agreement). When it does not, that po"}
{"id": "39980bd829866c0e7a9da5f481671f05c1cfaf7a", "vector_id": 19, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 19, "char_len": 2000, "text": " terms to which there was never a true assent \nor judicial determination. In Texas, a written judgment must conform to the court's oral rendition (or the parties' agreement). When it does not, that portion of the judgment is subject to being set aside or re formed. Here, we lack a transcript of February 1, but given Charles's resistance and the \nblatant differences in the two reports , there is no agreement.  That means the final order, at least \nin part, does not reflect the actual \"report\" of the judge but rather what opposing counsel wanted, which is highly prejudicial.  \nAdditionally, because the final order was delayed, by March 26 the Associate Judge did \nnot personally \"render\" those orders – he had made recommendations on February 1, but the \nactual signing on March 26 was by the Associate Judge. If the District Judge signed it believing \nit was agreed, when in fact it was not, then the District Judge was essentially misled. The district court has authority to enter temporary orders after an AJ's hearing, but if it's contested, the district court sh ould know it's contested. Here, labeling it \"Agreed\" circumvented any further\n\nhearing by the district court. That implicates due process again – Charles never had a de novo \nhearing because it was never presented as a contested matter; the \"agreed\" label short -circuited \nhis ability to get the referring court to hear his side.  \nIn conclusion on this point , the content of the March 26 order exceeds or deviates from \nwhat was legitimately agreed or ordered on the record, making those portions of the order unauthorized. An order that a court had no power to make (because the party didn't consent and no evidence was taken on that issue) is invali d. At the very least, it's an abuse of discretion to \ninclude terms not supported by the hearing. This is another reason the order is vulnerable to attack.  \nD. Due Process Violations and Equity  \nBeyond the technical rule violations, the manner in which these temporary "}
{"id": "eb89a8d17203c5371cfa05fdbeb8198996be2bac", "vector_id": 20, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 20, "char_len": 2000, "text": " supported by the hearing. This is another reason the order is vulnerable to attack.  \nD. Due Process Violations and Equity  \nBeyond the technical rule violations, the manner in which these temporary orders were \nobtained raises serious due process concerns:  \n1. No Meaningful Opportunity to be Heard on Disputed Terms  \nCharles was not afforded a real chance to argue against Paragraph 3 or any other disputed \nprovision. The March 14 \"hearing\" was a farce in terms of due process – instead of an impartial \njudge considering his objection, he got an opposing counsel's ultimatu m. The next step should \nhave been a hearing before the district judge (since the AJ process had broken down into disagreement). By never allowing Charles a forum to voice why he objected (e.g., the changed dates, incorrect mailing address, etc. ), the court denied him the basic hearing on that issue. \nTemporary orders, while expedited, still require that each party can present their case on any point of contention. This did not happen.\n\n2. Surprise and Lack of Notice  \nThe attempted  final order was pushed through on March 26 without prior notice to \nCharles of an \"entry\" setting. Typically, when an order is to be entered, especially if the form isn't \nagreed, the party is entitled to notice  when the judge will sign it and what version is being \nsubmitted. Here, Charles was ambushed with a sign- now scenario. That is arguably a violation of \nlocal rules or at least the spirit of Rule 305, Texas Rules of Civil Procedure, which contemplates notice  to all parties of the presentation of a judgment for signing if not all parties have approved \nit. In Page v. Sherrill , the Texas Supreme Court voided a temporary custody change that was \ndone ex parte without notice. While our case was not ex parte (Charles was physically present), the lack of formal notice and rushing is analogous to a notice failure. Due process require s notice \nreasonably calculated to inform the person of the action and an oppor"}
{"id": "0845e5df26e767d1d9445e37b1154fa21ca8d16e", "vector_id": 21, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 21, "char_len": 2000, "text": "les was physically present), the lack of formal notice and rushing is analogous to a notice failure. Due process require s notice \nreasonably calculated to inform the person of the action and an opportunity to respond. Charles's \"opportunity\" to respond was truncated to mere minutes under threat.  \n3. Bias and Irregularity  \nHaving opposing counsel write the judge's orders (handwritten on the report) is irregular. \nIt creates an appearance that the neutral arbiter (the judge) abdicated decision -making to one \nside's lawyer. The result is not a product of a court's reasoned decis ion or mutual consent, but \nessentially the wish list of one party imposed as an order. Courts have inherent authority to sign orders, but they should draft or carefully review them – not just sign whatever one lawyer puts in front of them without the other's approval. If the March 14 report notes were indeed by Carter, the Associate Judge should not have relied on those as if they were the AJ's own findings. This informality undermines confidence that the order was the result of a fair process.\n\n4. Infringement on Parental Rights without Due Course  \nThe temporary orders severely restricted Charles's rights (requiring him to leave the \nmarital home, giving Mother primary custody, supervising exchanges, etc.). Such significant \ndeprivations, even temporarily, demand scrupulous adherence to procedure. By c utting \nprocedural corners, the court potentially violated Charles's constitutional right to due process. The Texas Family Code's requirement of affidavits for excluding a parent (Fam. Code §105.001(c)) is one manifestation of due process protection. If those requirements were not strictly met or if the evidence was lacking (Charles alleges no evidence was presented on February 1 to justify kicking him out and giving mom full custody), that initial order itself was problematic. Compounding that with an improper finalization process makes it worse. Essentially, Charles and his children were"}
{"id": "d4f9355e4dd1c0ef1853d3d9e2c48ca59f999237", "vector_id": 22, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 22, "char_len": 2000, "text": "cking him out and giving mom full custody), that initial order itself was problematic. Compounding that with an improper finalization process makes it worse. Essentially, Charles and his children were subject to a significant custody determination without the full protections of a proper adversarial hearing or a proper agreed resolution – a hybrid worst -\nof-both: no heari ng, and no genuine agreement. Such a result is fundamentally unfair.  When \ntaken into consideration that Charles needed the family home to operate his usua l course of \nbusiness, this makes even less sense and raises eyebrows as to h ow the mother was able to get \naway with such conduct.  \nEquity and good conscience would call for such an order to be set aside. Courts have the \npower to vacate interlocutory orders that were improvidently granted or that resulted from procedural irregularity. Here, the temporary orders process was tainted star t to finish – from the \nlack of evidence at the outset (if Charles's earlier contentions are correct), to the failure to follow the AJ's procedures, to the coercion in obtaining signatures. There is a strong argument that Charles was denied due process, and  thus the order is voidable on that independent basis. In \nsome circumstances, a due process violation can render an order void (for example, an order\n\nissued without notice or jurisdiction is void). While Charles was present in the case (so \njurisdiction over him existed), the manner of depriving him of rights without a fair hearing could be deemed void as a violation of constitutional due process. This i s especially true if we \nanalogize to cases where a court had jurisdiction but acted in a way that violated a party's constitutional rights – courts have not hesitated to grant mandamus or other relief in such scenarios because the usual deference to trial court discretion does not extend to ignoring fundamental rights.  \nE. Are the March 26, 2024 Temporary Orders Facially Void? \nConsidering all the abo"}
{"id": "c9c8fe08f8ef7415d7c99c16ecc7f00ce7905cfc", "vector_id": 23, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 23, "char_len": 2000, "text": "uch scenarios because the usual deference to trial court discretion does not extend to ignoring fundamental rights.  \nE. Are the March 26, 2024 Temporary Orders Facially Void? \nConsidering all the above, we assess whether the final Temporary Orders can be deemed \nfacially void (void on their face) or at least voidable and subject to being vacated.  \nAn order is \"void\" (as opposed to merely voidable) if the court that rendered it lacked \njurisdiction or authority or if it violates a fundamental jurisdictional requirement. Typically, \nerrors in following procedure make an order voidable (to be corrected on direct appeal or by \nmotion), not outright void. However, Texas law provides that agreed judgments entered without \nconsent are void because the court had \"no power to render\" an agreed judgment absent an actual agreement. In this case, the 322nd District Court had subject matter jurisdiction over the divorce/child case and personal jurisdiction over the parties, so jurisdiction in the traditional sense is not at issue. But did the court have authority to render the particular order it rendered? That is que stionable, because the court believed it was entering an agreed temporary order – an \nact that is only authorized if all parties truly agreed. Since Charles's consent was not valid, the court's act of signing an agreed order was beyond its lawful authority (it could have held a contested hearing or sent it back to the AJ, but it could not force an agreement). Thus, one could\n\nargue the order is void ab initio for lack of the required consent. The face of the order proclaims \nthat consent, but the supporting record contradicts it.  \nWhen determining facial voidness, courts normally look at the judgment roll or the order \nitself and related documents. Here, the face of the order contains an internal inconsistency: it says both parties agreed and evidenced by signatures, but one attorney's signature is missing and we know one party's signature was coerced. Admittedl"}
{"id": "c6eb29a287c30a768858df5e424622ed39acc534", "vector_id": 24, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 24, "char_len": 2000, "text": " the order contains an internal inconsistency: it says both parties agreed and evidenced by signatures, but one attorney's signature is missing and we know one party's signature was coerced. Admittedly, coercion is an extrinsic fact (not evident solely from the document). However, the absence of Charles's attorney's approval is evident from the order itself – any reader can  see one side's attorney did not sign. That is a facial defect in an \n\"agreed\" order. One could say the order is void on its face because it recites a non -existent \nagreement and because it was entered in violation of the statute that requires all parties' w ritten \nagreement for an associate judge to sign a final order. (Although a temporary order doesn't require written agreement of all parties to be signed by an AJ, in this case the order explicitly relies on supposed agreement.)  \nEven if a court hesitates to label it \"void,\" it is unquestionably voidable for abuse of \ndiscretion and should be vacated on a direct attack. The trial court's failure to follow its own procedures and the statutory framework is a clear abuse of discretion. Few scenarios fit the definition of an abuse of discretion more squarely than a judge signing an order that one party's attorney never approved and that one party objected to and only signed under threat. The integrity of the order is so compromised that it cannot be allowed to stand. \nV . REMEDIES  \nA. Vacating the Temporary Orders – Mandamus Relief\n\nBecause these are temporary orders in a family law case, they are not appealable by ordinary \nmeans. Texas law is clear that temporary orders in family cases cannot be challenged by interlocutory appeal. See Tex. Fam. Code § 105.001(e) (\"Temporary orders re ndered under this \nsection are not subject to interlocutory appeal.\"). Instead, the proper vehicle for challenging such orders is a petition for writ of mandamus. Mandamus is an extraordinary remedy that will issue only when (1) the trial court clearly abus ed i"}
{"id": "8cdd12a5b3521bd14dabc1e612ec7529c3825872", "vector_id": 25, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 25, "char_len": 2000, "text": "peal.\"). Instead, the proper vehicle for challenging such orders is a petition for writ of mandamus. Mandamus is an extraordinary remedy that will issue only when (1) the trial court clearly abus ed its discretion and (2) there is no adequate remedy by \nappeal.  \nIn this case, both elements for mandamus relief are present:  \n1. Clear Abuse of Discretion : As detailed above, the trial court clearly abused its discretion \nby: \n• Failing to follow the Associate Judge's explicit procedures for finalizing the order  \n• Entering an \"agreed\" order without valid consent from both parties  \n• Allowing procedural irregularities that violated due process  \n• Permitting coercion to obtain a party's signature  \n2. No Adequate Remedy by Appeal : Since temporary orders are not appealable, Charles \nhas no adequate remedy by appeal. He would have to wait until a final decree is entered to challenge these orders on appeal, by which time the harm from the improper temporary orders would be irreparable . The children's living arrangements, Charles's access to them, \nand other important matters would be governed by invalid orders for months or even years while the case proceeds to final judgment.\n\nTexas courts have consistently granted mandamus relief in family law cases where temporary \norders were entered improperly. For example, in In re Stearns , 202 S.W.3d 414 (Tex. App.–\nHouston [14th Dist.] 2006, orig. proceeding), the court granted mandamus relief where the trial \ncourt's temporary orders effectively changed custody without proper notice or evidence. Similarly, in Page v. Sherrill , 415 S.W.2d 642 (Tex. 1967), the Texas Supreme Court granted \nmandamus relief where a temporary custody order was issued without notice and hearing, violating due process.  \nIf the order is truly void (as opposed to merely voidable), mandamus relief is even more \nappropriate. As the Texas Supreme Court held in In re Southwestern Bell Tel. Co., 35 S.W.3d \n602, 605 (Tex. 2000), if an order is void, mand"}
{"id": "c5376cc14da2890dd9159b41155cb7b7b8526d9e", "vector_id": 26, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 26, "char_len": 2000, "text": " opposed to merely voidable), mandamus relief is even more \nappropriate. As the Texas Supreme Court held in In re Southwestern Bell Tel. Co., 35 S.W.3d \n602, 605 (Tex. 2000), if an order is void, mandamus relief is available without showing inadequate remedy by appeal.  \nB. Alternative Remedies \nIn addition to mandamus relief, Charles might consider the following alternative remedies:  \n1. Motion to Vacate or Set Aside : Charles could file a motion in the trial court asking the \njudge to vacate or set aside the temporary orders based on the procedural irregularities and lack of valid consent. While this approach has the advantage of giving the trial court an opportunity t o correct its own error, it may be less effective if the trial court is \nunwilling to acknowledge the problems with the order.  \n2. Motion for Reconsideration or New Trial : Charles could file a motion for \nreconsideration or new trial on the temporary orders. This would allow him to present evidence of the procedural irregularities and coercion. However, there is no guarantee\n\nthat the trial court would grant such a motion, and the time for filing may have already \nexpired.  \n3. Motion for Further Temporary Orders: Charles could file a motion for further temporary orders, essentially asking the court to revisit the custody and possession arrangements. This would not directly challenge the validity of the existing orders but could provide an opportunity to modify them. The disadvantage is that it would not address the underlying procedural problems.  \nOf these alternatives, mandamus relief is likely the most appropriate and effective remedy \ngiven the nature of the procedural irregularities and the fact that temporary orders are not appealable. A petition for writ of mandamus would allow an appellate cou rt to review the process \nby which the temporary orders were obtained and, if appropriate, to vacate them and direct the trial court to conduct proper proceedings. \nVI. CONCLUSION  \nThe procedural "}
{"id": "bdcca2e23a43a7ffd98a758ddf0fb2e2873c1bbd", "vector_id": 27, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 27, "char_len": 2000, "text": "ou rt to review the process \nby which the temporary orders were obtained and, if appropriate, to vacate them and direct the trial court to conduct proper proceedings. \nVI. CONCLUSION  \nThe procedural irregularities surrounding the March 26, 2024 Temporary Orders in Cause No. 322-744263- 23 raise serious questions about their validity. The evidence demonstrates multiple \nsignificant deviations from proper legal procedure, including:  \n1. Failure to follow the Associate Judge's explicit instructions regarding who would prepare the order, the timeline for preparation, and the requirement for attorney approval;  \n2. Lack of valid consent to support an \"agreed\" order, as evidenced by Charles's missing signature on the February 1 report, his explicit objection to Paragraph 3 on March 14, the coerced nature of his signature on March 26, and the absence of his attorney's approval;\n\n3. Potential non- conformance between the final written order and what was actually ordered \nor agreed to at the February 1 hearing;  \n4. Due process violations, including the denial of a meaningful opportunity to be heard on \ndisputed terms, lack of proper notice, irregularities in the process, and significant infringement on parental rights without proper procedural safeguards.  \nThese procedural failures are not mere technicalities. They strike at the heart of the judicial \nprocess and the fundamental fairness that must characterize court proceedings. When a court \norder purports to be based on the agreement of the parties, but one party's consent was obtained \nthrough coercion or was never actually given, the integrity of the judicial system is compromised.  \nThe March 26, 2024 Temporary Orders are, at minimum, voidable due to the clear abuse of \ndiscretion in their entry. There is a strong argument that they are void on their face because they \nrecite an agreement that did not exist and because the court lacked authority to enter an agreed \norder without genuine consent from both parties.  \n"}
{"id": "16ff6a7b4428c6f9667ae304e5834e1ddca2de0e", "vector_id": 28, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\04_12_25_march_26_orders_analysis_1\\04_12_25_march_26_orders_analysis_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\04.12.25 - MARCH 26 ORDERS ANALYSIS-1.pdf", "source_exists": true, "page": null, "chunk_index": 28, "char_len": 1806, "text": "ent that they are void on their face because they \nrecite an agreement that did not exist and because the court lacked authority to enter an agreed \norder without genuine consent from both parties.  \nGiven the non- appealable nature of temporary orders in family cases, mandamus relief is the \nappropriate remedy. Charles should consider filing a petition for writ of mandamus asking the \nappellate court to vacate the temporary orders and direct the trial co urt to conduct proper \nproceedings, either by holding a contested hearing on the temporary orders or by ensuring that any agreed order truly reflects the voluntary agreement of both parties.  \nThe procedural history of this case serves as a cautionary tale about the importance of \nadhering to proper legal procedures, especially in family law cases where the rights of parents and the welfare of children are at stake. Courts and attorneys must be v igilant in ensuring that\n\nagreed orders truly reflect agreement, that parties' due process rights are respected, and that the \nintegrity of the judicial process is maintained.  \nVII. REFERENCES  \nBurnaman v. Heaton, 240 S.W.2d 288 (Tex. 1951). \nIn re C.J.C ., 603 S.W.3d 804 (Tex. 2020). \nIn re Southwestern Bell Tel. Co., 35 S.W.3d 602 (Tex. 2000). In re Stearns , 202 S.W.3d 414 (Tex. App.–Houston [14th Dist.] 2006, orig. proceeding). \nIn re Stephanie Lee , 411 S.W.3d 445 (Tex. 2013). \nO'Neil v. Blake, 86 S.W.3d 538 (Tex. App.–Dallas 2002, no pet.).  \nPage v. Sherrill , 415 S.W.2d 642 (Tex. 1967).  \nS&A Restaurant Corp. v. Leal, 892 S.W.2d 855 (Tex. 1995). Texas Family Code § 105.001. Texas Family Code § 201.007. \nTexas Family Code § 201.011. \nTexas Family Code § 201.013. \nTexas Family Code § 201.015. Texas Rules of Civil Procedure, Rule 11. \nTexas Rules of Civil Procedure, Rule 305."}