{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\04.04.25 - NOTICE OF NEW INFO-1.pdf",
  "base_name": "04_04_25_notice_of_new_info_1",
  "page_count": 5,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322-744263-23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE COURT:  \nRespondent, CHARLES DUSTIN MYERS, submits this notice of new information, and \nreiterates the absurdity of this case through the following facts con clusively established by the \nrecord:  \n1. There has been no effort by the opposing party to prosecute this matter since \nApril  24, 2024. \n2. There is conclusive evidence supporting this suit was brought in bad faith by \nMORGAN MICHELLE MYERS, Petitioner  \n3. There is conclusive evidence supporting this suit has been litigated in bad \nfaith by COOPER L. CARTER.  \n4. There are no valid orders in effect which has been the case for the cases ’ \nentirety.  ITMOMO  \n(AITIO M.E.M., C.R.M., two children) \nMORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS , RESPONDENT ’S NOTICE OF NEW \nINFORMATION  \n  \nRespondent.   \n  \n2025 -04-04  322-744263-23 FILED\nTARRANT COUNTY\n4/4/2025 11:58 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 996
    },
    {
      "page_number": 2,
      "text": "5. The current orders , despite bearing the Associate Judge ’s signature, are void  \nand of n o legal effect . \n6. The Respondent has s uffered now over $1 10,500 in verifiable damages due to \nbeing unlawfully locked out of his residence on March 6, 2024.  \n7. The Respondent cannot find alternative housing while being barred from \nbeing able to work.  \n8. The Petitioner knows this to be true but  instead sabotaged the Respondent ’s \nability to provide for the children for the purpose of pursuing an extramarital  \nrelationship that began prior to the commencement of these proceedings.  \n9. The Petitioner is now ENGAGED to DAMEN KAZLAUSKAS, who proposed to Petitioner in the presence of the children.  \n10. There is no child support set up for the children.  \n11. Petitioner continues to dispose of Respondent ’s personal belongings. \n12. Desp ite her authority being in question, and despite her failure to prosecute, \nCOOPER L. CARTER unilaterally inter rupted emergency proceedings on \nMarch 28, 2025, claiming that the case would be consolidated the following week  without being present in the courtroom.  \n13. The 233\nrd district court blatantly denied the Respondent due process in the \nface o f COOPER L. CARTER ’s false promise.  \n14. COOPER L. CARTER doesn ’t know the law, because you cannot consolidate \na SAPCR with a divorce matter unless the suit is transferred according to the TEXAS FAMILY CODE.",
      "char_length": 1418
    },
    {
      "page_number": 3,
      "text": "15. The court , at this point, is choosing to not grant relief despite having no reason \nto do so. \n16. This litigation has no possible means to an end, and it should be dismissed \noutright so that the SAPCR may continue. \n17. There has been no filed opposition, objection, or arguments made against the Respondent ’s position in either suit.  \n18. The Petitioner has wasted everyone ’s time, cau sed significant damage, and \nremains hidden in fear of being held accountable.  \n19. The Petitioner prioritized an extramarital affair over prosecuting the divorce, and the children and Respondent have been signi ficantly harmed.  \nTherefore, this case should be dismissed as a matter of law. Every day causes more \nirreparable harm, and this court has every abili ty an d reason to rectify this s ituation immediately.  \nRespondent already has the solution and has been the only party in this matter seeking relief. It is \nsimply unacceptable to permit this to co ntinue. \n \nRespectfully submitted,  \n /s/ Charles Du stin M yers \n CHARLES DUSTIN MYERS  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n PRO -SE",
      "char_length": 1103
    },
    {
      "page_number": 4,
      "text": "CERTIFICATE OF SERVICE  \n \nRespondent, CHARLES DUSTIN MYERS, certifies that, pursuant to Rule 21a of the Texas \nRules of Civil Procedure that: \n \nA copy of this NOTICE  has been served to MORGAN MICHELLE MYERS through her EFM \nregistered under MORGANMW02@GMAIL.COM  \n \nA copy of this NOTICE  has been provided to COOPER L. CARTER through her email \nCOOPERCARTER@MAJADMIN.COM  \n \nA copy of this NOTICE  has been served to HOLLY HAYES through her EFM registered email \naddress: CSD-FILER914@TEXAS.OAG.GOV  \n \nServed on: 04/04/2025 \n \n  /s/ Charles Dustin Myers \n  CHARLES DUSTIN MYERS  \n  817-546-3693  \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE",
      "char_length": 639
    },
    {
      "page_number": 5,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99292305\nFiling Code Description: Notice\nFiling Description: Notice\nStatus as of 4/4/2025 3:32 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/4/2025 11:58:22 AM\n4/4/2025 11:58:22 AM\n4/4/2025 11:58:22 AM\n4/4/2025 11:58:22 AMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 828
    }
  ]
}