{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.20.25 EMERGENCY EX-PARTE MOTION TO-1.pdf",
  "base_name": "03_20_25_emergency_ex_parte_motion_to_1",
  "page_count": 47,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 233-765358-25 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \n \nTO THE HONORABLE JUDGE OF THE 233rd DISTRICT COURT : \n  \n1. For the preceding twelve months and fourteen days, Petitioner has been unlawfully  \nBarred from entering his residence and has been cut out of his children’s lives . On March 6th,  \n2024, while walking M.E.M and C.R.M. to school, Respondent unlawfully locked the Petitioner \nout of the matrimonial home and called the Watauga police depar tment who came to assist in the \ndispute. When on scene a t 6641 Anne Court, Watauga , Texas 76148, Respondent produced an \nagreed associate judge’s report where consent had been withdrawn and use d it a s a means to bar \nthe Petitioner ’s entry to the home. With a n emergency hearing date set for March 14th, 2024, the \nPetitioner took the advice of the officers and stayed with his father temporarily in Flower \nMound, Texas  to avoid unnecessary  conflict.   \n 2. On March 14th, 2024, the Petitioner appeared in person and was served a reduced copy \nof the orders he was in court to challenge and from which he withdrew his consent from. Despite  \nIN RE: M.E.M.,  C.R.M, .    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \nVs. EMERGENCY EX -PARTE MOTION TO \nDECLARE JUDGMENT VOID AB INITIO \nAND FOR IMME DIATE RE -ENTRY  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-20  233-765358-25 FILED\nTARRANT COUNTY\n3/20/2025 12:18 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1462
    },
    {
      "page_number": 2,
      "text": "2 \n this, the orders were rendered anyway , effectively barring the Petitioner from his own home and \nChildren’ s live s despite his cons ent not being present  at the time of rendition.  \n 3. The orders in question, attached hereto as EXHIBIT 1 , are facially void and lack legal \neffect. Despite this, they continue to cause ongoing and irreparable harm, as further detailed \nbelow. Accordingly, Petitioner respectfully requests that this Court issue a declaratory judgment formally recognizing the invalidity of these orders whi ch will simultaneously provide long-\noverdue relief to the children in this matter . In support of this request, the Petitioner  shows as \nfollows:  \nI. STATEMENT OF FACTS  \n 4. On page 1 of the orders, they  read  as follows:  “The parties have agreed to the terms of \nthis order as evidenced by the signatures below .” \n 5. On the final page of the orders, the signatures of CHARLES DUSTIN MYERS and his \nprevious attorney, DAN BACALIS, are not present on the document. \n 6. The Petitioner refused to sign the orders to which he did not consent to on March 14\nth, \n2024.  7. The orders were rendered on March 26\nth, 2024, as an agreement between the parties \ndespite consent not being present at the time of rendition . \n 8. The order s are void ab initio and  have no legal effect.  \nII. ARGUMENT  \nA. An “Agreed” Order Without Actual Consent is Void Ab Initio  \n9. Texas law is unequivocal that a judgment purporting to rest on an agreement of the \nparties cannot be rendered or enforced if one of the parties did not genuinely consent at the time of rendition. The consent  of all parties at the time the court renders judgment is a prerequisite for",
      "char_length": 1686
    },
    {
      "page_number": 3,
      "text": "3 \n a valid agreed order.  As the Texas Supreme Court has stated, a trial court cannot render a valid \nagreed judgment absent the consent of the parties at the time it is rendered , and the  \nagreement can be revoked at any time before judgment is rendered on the agreement.  S & A \nRestaurant Corp. v. Leal , 892 S.W.2d 855, 857 (Tex.1995). This is so because a trial court cannot \nrender a valid agreed judgment absent the consent of the parties at the time it is rendered. Padilla \nv. LaFrance , 907 S.W.2d 454, 461 (Tex.1995).  \n10. In S&A Restaurant Corp. v. Leal , the Court reaffirmed that a party may revoke \nconsent to a settlement at any time before judgment is rendered, and if a court nonetheless signs a judgment after consent has been revoked, “a judgment rendered after one party revokes his \nconsent is void .” This rule reflects a fundamental principle: t rue consent  is the linchpin of any \nagreed order.  \n11. Here, Petitioner never consented to the order  at the time they were entered. Indeed, \nhis missing signature is a prima facie showing of this fact.  Under these circumstances, it was \nerror for the Court to sign the order as an “agreed” judgment , and the result is that the order \nis void ab initio. The Texas Supreme Court’s decision in Quintero v. Jim Walter Homes, Inc., 654 S.W.2d 442 (Tex. 1983) is directly on point. In Quintero, the Court held that when a trial court has knowledge that one party does not consent to a judgment, the court “should refuse to sanction [the] agreement by making it the judgment of the court.”  Id. By entering an order in \nthe absence of Petitioner’s consent, the agreed judgment in this case was not just voidable —it is \nabsolutely void from inception . In legal effect, there never was a valid temporary order at all, \nbecause the requisite meeting of the minds was absent. \n12. Texas courts of appeals have applied these principles in situations analogous to \nPetitioner’s, particularly in family law cases. For example, in In re E.B. , No. 12- 17-00214- CV",
      "char_length": 2029
    },
    {
      "page_number": 4,
      "text": "4 \n (Tex. App.—Tyler Oct. 18, 2017) , the trial court had entered temporary orders incorporating a \nRule 11 settlement agreement regarding conservatorship and possession of children. The father, \nhowever, had timely revoked his consent to that agreement. The Tyler Court of Appeals held that because the father withdrew consent before judgment, the agreed terms regarding \nconservatorship and possession were void . The appellate court unequivocally stated that the \nprovisions of the temporary orders involving the children “ are void, and the trial court abused \nits discretion in entering temporary orders based on the [purported] Agreement .” The court \nconditionally granted mandamus and directed the trial judge to vacate those portions of the temporary order .  \nB. A Void Judgment is a Nullity and Can Be Challenged or Vacated at Any Time  \n13. Because the temporary orders were entered without jurisdiction (i.e. without consent \njurisdiction conferred by the parties’ agreement), the resulting “agreed” order is void. Under Texas law, a void judgment or order has no legal force or effect from the ou tset. It is “null”  ab \ninitio, and any person or court affected by it is entitled to treat it as a nullity . The Texas Supreme \nCourt has explained that a void order is, in effect, no order at all: “[A] void judgment is a legal \nnullity . . . .”  Alanis v. Barclays Capital Real Estate Inc., No. 04 -17-00069- CV (Tex. App. Mar. \n27, 2017) .  \n14. Such a judgment may be collaterally attacked and set aside at any time, as it is not \nsubject to ordinary procedural bars. Browning v. Placke , 698 S.W.2d 362 (Tex. 1985) (per \ncuriam), is instructive on this point. In Browning, the Supreme Court recognized that courts of equal jurisdiction have the authority to declare a judgment void when it suffers from a fundamental defect (such as lack of jurisdiction or lack of consent) . Here, this is a direct fit with \nthe present situation.",
      "char_length": 1947
    },
    {
      "page_number": 5,
      "text": "5 \n C. Respondent ’s most recent attempt to subvert the process  \n 15. On Marc h 20th, 2025, Respondent filed an original answer and motion to consolidate \nthrough COOPER L. CARTER, which was prepared by RODERICK MARX. These filings are a \ndirect showing of the Respondent ’s game. She remains silent for months, and then at the first \nsign of her false narrative being under attack, she unleashes her attorney to file pleadings using \nthe EFM Credentials of another individual not named in the suit – Roderick Marx – to prevent \nthe relief duly entitled to Petitioner.  \n 16. Petitioner reminds this c ourt that Responde nt’s answer is clearly a boilerplate \nresponse te mplate that d oesn’t even address  the core issues raised in the SAPCR . The first lines \nof the Response claim that Respondent has no driver ’s license or social security number, which \nshows the rushed nature of her pleading in an attempt to defend the Respondent ’s false narrative \nshe has procured through fraud.  \n 17. Petitioner also points out that the Respondent wants to consolidate this matter with \nthe divorce matter that is procedurally defunct, which would not be in the best interests of the \nchildren  because it would move the matter back to the procedu rally stalled case that hasn ’t bene \nprosecute d by the same attorne y who is reque sting consolidation. Such would defeat the entire \npurpose of this suit, and would cause undue delay and prejudice the children and Petitioner. D. Request for immediate re -entry.  \n 18. G iven the orders in question are facially void, Petitioner requests an immediate notice \nto be filed and served on the parties of record so that he may return home to his children, residence, and place of business until this matter can be set for a hearing. Petitioner ’s unlawful \nexclusion from his residence creates further harm to the children  each day it is left unaddressed.",
      "char_length": 1898
    },
    {
      "page_number": 6,
      "text": "6 \n  19. Petitioner r eiterates that his immediate re turn is in line with Texas Public Policy, \nnobody has argued a gainst his relief sought, and this court has the discretion to issue temporary \norders and dispense without the  necessity of a bond or verified pleading pursuant to TEX. FAM. \nCODE. 1 05.001.  \n 20. Preventing a father from accessing his home whi ch is needed for financial stability \nwill continue to cause monetary and emotional damage to the children until resolved.  \nPRAYER FOR EXPEDITED RELIEF  \nWHEREFORE, promises considered, Petitioner respectfully request of this court \nwithout delay:  \n1. To declare the orders attached as Exhibit 1 void ab initio  and issue findings \npermitting the Petitioner to return home  to 6641 Anne Court, Watauga, Texas \n76148 immediately  for the orders  lacking consent of all parties at the time of \nrendition and for not bearing the Petit ioner ’s signature . \n2. To serve on all parties of record confirmation that the orders are without legal \neffect . \n3. Enforce the Texas Rules of Civil Pro cedure and prevent Cooper L. Carter \nfrom representing the Respondent in this matter until s he can conform to \nelectronic filing requirements  and strike her pleadings outright . \n4. Any further relief that the court de ems just and equitable.  \n5. Given the extraordinary circumstances, set this motion for hearing at the earliest possible time, to be conducted via zoom if possible f or judicial \nefficiency  given the Petitioner ’s financial strain caused by this situation.",
      "char_length": 1534
    },
    {
      "page_number": 7,
      "text": "7 \n Respectfully submitted,  \n \n /s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS  \n 6641 ANNE COURT, WATAUGA, TEXAS 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n PRO -SE \n \n \n CERTIFICATE OF SERVICE \n \nPursuant to Rule 21 of the Texas Rules of Civil Procedure, Respondent, CHARLES \nDUSTIN MYERS, certifies that this EMERGENCY EX -PARTE MOTION TO DECLARE \nJUDGMENT VOID AB INITIO  AND FOR IMME DIATE RE- ENTRY  has been filed with the \nelectronic filing manager and served on the parties of record on this 20th day of March 2025, \nincluding:  \n \n MORGAN MICHELLE MYERS, RESPONDENT  \n Via her email registered under the EFM: MORGANMW02@GMAIL.COM  \n \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693  \n6641 ANNE COURT, WATAUGA, TEXAS 76148  \nPRO -SE",
      "char_length": 792
    },
    {
      "page_number": 8,
      "text": "EXHIBIT 1\nCURRENT ORDERS\nvoid ab initio",
      "char_length": 39
    },
    {
      "page_number": 9,
      "text": "IN THE MATTER OF \nTHE MARRIAGE OF \nMORGAN MYERS \nAND \nCHARLES MYERS \nAND IN THE INTEREST OF CAUSE NO. 322-744263-23 \nIN THE DISTRICT COURT \n322ND JUDICIAL DISTRICT \nMARA MYERS AND CAROLINE \nMYERS, CHILDREN § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ TARRANTCOUNTY,TEXAS \nTEMPORARY ORDERS \n1JC \nOn February JI, 2024, the Court heard Petitioner's motion for temporary orders. \nAppearances \nPetitioner, MORGAN MYERS, appeared in person and through attorney of record, \nCooper L. Carter, and announced ready and signed an Associate Judge's Report regarding \nAgreed Temporary Orders. \nRespondent, CHARLES MYERS, appeared in person and through attorney of record, \nDaniel Bacalis, and announced ready and signed an Associate Judge's Report regarding Agreed \nTemporary Orders. \nThe parties have agreed to the terms of this order as evidenced by the signatures below. \nJurisdiction \nThe Court, after examining the record and the agreement of the parties and hearing the \nevidence and argument of counsel, finds that all necessary prerequisites of the law have been \nlegally satisfied and that the Court has jurisdiction of this case and of all the parties. \nChildren \nThe following orders are for the safety and welfare and in the best interest of the 322-744263-23 FILED\nTARRANT COUNTY\n3/26/2024 3:19 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 1467
    },
    {
      "page_number": 10,
      "text": "following children: \nName: \nSex: \nBirth date: \nHome state: \nName: \nSex: \nBirth date: \nHome state: \nConservator ship MARAMYERS \nFemale \n7 years \nTexas \nCAROLINE MYERS \nFemale \n5 years \nTexas \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS are appointed \nTemporary Joint Managing Conservators of the following children: MARA MYERS and \nCAROLINE MYERS \nIT IS ORDERED that, at all times, MORGAN MYERS, as a parent temporary joint \nmanaging conservator, shall have the following rights: \n1. the right to receive information from any other conservator of the children \nconcerning the health, education, and welfare of the children; \n2. the right to confer with the other parent to the extent possible before making a \ndecision concerning the health, education, and welfare of the children; \n3. the right of access to medical, dental, psychological, and educational records of \nthe children; \n4. the right to consult with a physician, dentist, or psychologist of the children; \n5. the right to consult with school officials concerning the children's welfare and \neducational status, including school activities; \n6. the right to attend school activities, including school lunches, performances, and \nfield trips; \n7. the right to be designated on the children's records as a person to be notified in \ncase of an emergency; \n8. the right to consent to medical, dental, and surgical treatment during an \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1568
    },
    {
      "page_number": 11,
      "text": "emergency involving an immediate danger to the health and safety of the children; and \n9. the right to manage the estates of the children to the extent the estates have been \ncreated by the parent's family or by the parent, other than by the community or joint property of \nthe parent. \nIT IS ORDERED that, at all times, CHARLES MYERS, as a parent temporary joint \nmanaging conservator, shall have the following rights: \n1. the right to receive information from any other conservator of the children \nconcerning the health, education, and welfare of the children; \n2. the right to confer with the other parent to the extent possible before making a \ndecision concerning the health, education, and welfare of the children; \n3. the right of access to medical, dental, psychological, and educational records of \nthe children; \n4. the right to consult with a physician, dentist, or psychologist of the children; \n5. the right to consult with school officials concerning the children's welfare and \neducational status, including school activities; \n6. \nfield trips; the right to attend school activities, including school lunches, performances, and \n7. the right to be designated on the children's records as a person to be notified in \ncase of an emergency; \n8. the right to consent to medical, dental, and surgical treatment during an \nemergency involving an immediate danger to the health and safety of the children; and \n9. the right to manage the estates of the children to the extent the estates have been \ncreated by the parent's family or by the parent, other than by the community or joint property of \nthe parent. \nIT IS ORDERED that, at all times, MORGAN MYERS and CHARLES MYERS, as \nparent temporary joint managing conservators, shall each have the following duties: \n1. the duty to inform the other conservator of the children in a timely manner of \nsignificant information concerning the health, education, and welfare of the children; \n2. the duty to inform the other conservator of the children if the conservator resides \nwith for at least thirty days, marries, or intends to marry a person who the conservator knows is \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2303
    },
    {
      "page_number": 12,
      "text": "registered as a sex offender under chapter 62 of the Texas Code of Criminal Procedure or is \ncurrently charged with an offense for which on conviction the person would be required to \nregister under that chapter. IT IS ORDERED that notice of this information shall be provided to \nthe other conservator of the children as soon as practicable, but not later than the fortieth day \nafter the date the conservator of the children begins to reside with the person or on the tenth day \nafter the date the marriage occurs, as appropriate. IT IS ORDERED that the notice must include \na description of the offense that is the basis of the person's requirement to register as a sex \noffender or of the offense with which the person is charged. WARNING: A CONSERVATOR \nCOMMITS AN OFFENSE PUNISHABLE AS A CLASS C MISDEMEANOR IF THE \nCONSERVATOR FAILS TO PROVIDE THIS NOTICE; \n3. the duty to inform the other conservator of the children if the conservator \nestablishes a residence with a person who the conservator knows is the subject of a final \nprotective order sought by an individual other than the conservator that is in effect on the date \nthe residence with the person is established. IT IS ORDERED that notice of this information \nshall be provided to the other conservator of the children as soon as practicable, but not later than \nthe thirtieth day after the date the conservator establishes residence with the person who is the \nsubject of the final protective order. WARNING: A CONSERVATOR COMMITS AN \nOFFENSE PUNISHABLE AS A CLASS C MISDEMEANOR IF THE CONSERVATOR \nFAILS TO PROVIDE THIS NOTICE; \n4. the duty to inform the other conservator of the children if the conservator resides \nwith, or allows unsupervised access to a child by, a person who is the subject of a final protective \norder sought by the conservator after the expiration of sixty-day period following the date the \nfinal protective order is issued. IT IS ORDERED that notice of this information shall be \nprovided to the other conservator of the children as soon as practicable, but not later than the \nninetieth day after the date the final protective order was issued. WARNING: A \nCONSERVATOR COMMITS AN OFFENSE PUNISHABLE AS A CLASS C \nMISDEMEANOR IF THE CONSERVATOR FAILS TO PROVIDE THIS NOTICE; and \n5. the duty to inform the other conservator of the children if the conservator is the \nsubject of a final protective order issued after the date of the order establishing conservatorship. \nIT IS ORDERED that notice of this information shall be provided to the other conservator of the \nchildren as soon as practicable, but not later than the thirtieth day after the date the final \nprotective order was issued. WARNING: A CONSERVATOR COMMITS AN OFFENSE \nPUNISHABLE AS A CLASS C MISDEMEANOR IF THE CONSERVATOR FAILS TO \nPROVIDE THIS NOTICE. \nIT IS ORDERED that, during her periods of possession, MORGAN MYERS, as parent \ntemporary joint managing conservator, shall have the following rights-and duties: \n1. the duty of care, control, protection, and reasonable discipline of the children; \n2. the duty to support the children, including providing the children with clothing, \nfood, shelter, and medical and dental care not involving an invasive procedure; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 3402
    },
    {
      "page_number": 13,
      "text": "3. the right to consent for the children to medical and dental care not involving an \ninvasive procedure; and \n4. the right to direct the moral and religious training of the children. \nIT IS ORDERED that, during his periods of possession, CHARLES MYERS, as parent \ntemporary joint managing conservator, shall have the following rights and duties: \n1. the duty of care, control, protection, and reasonable discipline of the children; \n2. the duty to support the children, including providing the children with clothing, \nfood, shelter, and medical and dental care not involving an invasive procedure; \n3. the right to consent for the children to medical and dental care not involving an \ninvasive procedure; and \n4. the right to direct the moral and religious training of the children. \nIT IS ORDERED that MORGAN MYERS, as a parent temporary joint managmg \nconservator, shall have the following rights and duty: \n1. the independent right to consent to medical, dental, and surgical treatment \ninvolving invasive procedures; \n2. the independent right to consent to psychiatric and psychological treatment of the \nchildren; \n3. the independent right to receive and give receipt for periodic payments for the \nsupport of the children and to hold or disburse these funds for the benefit of the children; \n4. the independent right to represent the children in legal action and to make other \ndecisions of substantial legal significance concerning the children; \n5. the independent right to consent to marriage and to enlistment in the armed forces \nof the United States; \n6. the independent right to make decisions concerning the children's education; \n7. except as provided by section 264.0111 of the Texas Family Code, the \nindependent right to the services and earnings of the children; \n8. except when a guardian of the children's estates or a guardian or attorney ad litem \nhas been appointed for the children, the independent right to act as an agent of the children in \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2141
    },
    {
      "page_number": 14,
      "text": "relation to the children's estates if the children's action is required by a state, the United States, or \na foreign government; \n9. the right, subject to the agreement of the other conservator, to apply for passports \nfor the children, to renew the children's passports, and to maintain possession of the children's \npassports; and \n10. the independent duty to manage the estates of the children to the extent the estates \nhave been created by the community or joint property of the parent. \nIT IS ORDERED that CHARLES MYERS, as a parent temporary joint managmg \nconservator, shall have the following rights and duty: \n1. the independent right to consent to medical, dental, and surgical treatment \ninvolving invasive procedures; \n2. the independent right to consent to psychiatric and psychological treatment of the \nchildren; \n3. the independent right to receive and give receipt for periodic payments for the \nsupport of the children and to hold or disburse these funds for the benefit of the children; \n4. the independent right to represent the children in legal action and to make other \ndecisions of substantial legal significance concerning the children; \n5. the independent right to consent to marriage and to enlistment in the armed forces \nof the United States; \n6. the independent right to make decisions concerning the children's education; \n7. except as provided by section 264.0111 of the Texas Family Code, the \nindependent right to the services and earnings of the children; \n8. except when a guardian of the children's estates or a guardian or attorney ad litem \nhas been appointed for the children, the independent right to act as an agent of the children in \nrelation to the children's estates if the children's action is required by a state, the United States, or \na foreign government; \n9. the right, subject to the agreement of the other conservator, to apply for passports \nfor the children, to renew the children's passports, and to maintain possession of the children's \npassports; and \n10. the independent duty to manage the estates of the children to the extent the estates \nhave been created by the community or joint property of the parent. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2342
    },
    {
      "page_number": 15,
      "text": "Notwithstanding any provision in this order to the contrary, IT IS ORDERED that \nMORGAN MYERS shall have the exclusive right to enroll the children in school. Each \nconservator, during that conservator's period of possession, is ORDERED to ensure the \nchildren's attendance in the schools in which MORGAN MYERS has enrolled the children. \nThe Court finds that, in accordance with section 153.001 of the Texas Family Code, it is \nthe public policy of Texas to assure that children will have frequent and continuing contact with \nparents who have shown the ability to act in the best interest of the child; to provide a safe, \nstable, and nonviolent environment for the child; and to encourage parents to share in the rights \nand duties of raising their child after the parents have separated or dissolved their marriage. IT \nIS ORDERED that the primary residence of the children shall be within Tarrant County, Texas, \n1 and counties contiguous to Tarrant County, Texas, and the parties shall not remove the children \nfrom Tarrant County, Texas, and counties contiguous to Tarrant County, Texas for the purpose \nof changing the primary residence of the children until this geographic restriction is modified by \nfurther order of the court of continuing jurisdiction or by a written agreement that is signed by \nthe parties and filed with that court. \nExcept as expressly provided otherwise in this temporary order, IT IS ORDERED that all \ninformation of which a conservator is required to notify the other conservator and all documents \nand information that a conservator is required to provide to the other conservator shall be sent in \nthe following manner: \na. delivery to the recipient at the recipient's electronic mail address as \nfollows or to such other electronic mail address subsequently designated \nby the recipient: \nMORGAN MYERS morganm202@gmail.com \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2034
    },
    {
      "page_number": 16,
      "text": "CHARLES MYERS chuckdustic 12@gmail.com \nand in the event of any change in a recipient's electronic mail address, that \nrecipient is ORDERED to notify the other recipient of such change in \nwriting within twenty-four hours after the change. \nIf a party applies for a passport for the children, that party, is ORDERED to notify the \nother party of that fact no later than 10 days after the application. \nIT IS ORDERED that if a parent's consent is required for the issuance or renewal of a \npassport, that parent shall provide that consent in writing no later than ten days after receipt of \nthe consent documents, unless the parent has good cause for withholding that consent. \nPossession and Access \nIT IS ORDERED that nothing in this order shall supercede any term of any \nprotective order or condition of bond, probation, or parole. \n1. Standard Possession Order \nIT IS ORDERED that each conservator shall comply with all terms and \nconditions of this Standard Possession Order. IT IS ORDERED that this Standard \nPossession Order is effective immediately and applies to all periods of possession \noccurring on and after the date the Court signs this Standard Possession Order. IT IS, \nTHEREFORE, ORDERED: \n(a) Definitions \n1. In this Standard Possession Order \"school\" means the elementary \nor secondary school in which the child is enrolled or, if the child is not enrolled in \nan elementary or secondary school, the public school district in which the child \nprimarily resides. \n2. In this Standard Possession Order \"child\" includes each child, \nwhether one or more, who is a subject of this suit while that child is under the age \nof eighteen years and not otherwise emancipated. \n(b) Mutual Agreement or Specified Terms for Possession \nIT IS ORDERED that the conservators shall have possession of the child \nat times mutually agreed to in advance by the parties, and, in the absence of \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2063
    },
    {
      "page_number": 17,
      "text": "mutual agreement, it is ORDERED that the conservators shall have possession of \nthe child under the specified terms set out in this Standard Possession Order. \n(c) When Parents Reside 50 Miles or Less Apart \nExcept as otherwise expressly provided in this Standard Possession Order, \nwhen CHARLES MYERS resides 50 miles or less from the primary residence of \nthe child, CHARLES MYERS shall have the right to possession of the child as \nfollows: \n1. Weekends -\nOn weekends that occur during the regular school term, beginning at the \ntime the child's school is regularly dismissed, on the first, third, and fifth Friday of \neach month and ending at the time the child's school resumes after the weekend. \nOn weekends that do not occur during the regular school term, beginning \nat 6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \n2. Weekend Possession Extended by a Holiday -\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \nterm, as determined by the school in which the child is enrolled, or a federal, \nstate, or local holiday that falls on a Friday during the summer months when \nschool is not in session, that weekend period of possession shall begin at the time \nthe child's school is regularly dismissed on the Thursday immediately preceding \nthe student holiday or teacher in-service day and 6:00 p.m. on the Thursday \nimmediately preceding the federal, state, or local holiday during the summer \nmonths. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on \na Monday during the regular school term, as determined by the school in which \nthe child is enrolled, or a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 8:00 a.m. on Tuesday. \n3. Thursdays -On Thursday of each week during the regular school \nterm, beginning at the time the child's school is regularly dismissed and ending at \nthe time the child's school resumes on Friday. \n4. Spring Vacation in Even-Numbered Years -In even-numbered \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2608
    },
    {
      "page_number": 18,
      "text": "years, beginning at the time the child's school is dismissed and ending at 6:00 \nP.M. on the day before school resumes after that vacation. \n5. Extended Summer Possession by CHARLES MYERS -\nWith Written Notice by April 1 -If CHARLES MYERS gives MORGAN \nMYERS written notice by April 1 of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for thirty days beginning no earlier than the day after the \nchild's school is dismissed for the summer vacation and ending no later than seven \ndays before school resumes at the end of the summer vacation in that year, to be \nexercised in no more than two separate periods of at least seven consecutive days \neach, as specified in the written notice. These periods of possession shall begin \nand end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April 1 -If CHARLES MYERS does not give \nMORGAN MYERS written notice by April 1 of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for thirty consecutive days in that year beginning at \n6:00 P.M. on July 1 and ending at 6:00 P.M. on July 31. \nNotwithstanding the Thursday periods of possession during the regular \nschool term and the weekend periods of possession ORDERED for CHARLES \nMYERS, it is expressly ORDERED that MORGAN MYERS shall have a \nsuperior right of possession of the child as follows: \n1. Spring Vacation in Odd-Numbered Years -In odd-numbered \nyears, beginning at the time the child's school is dismissed and ending at 6:00 \nP.M. on the day before school resumes after that vacation. \n2. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P.M. on Friday and ending at 6:00 P.M. on the following \nSunday during any one period of the extended summer possession by CHARLES \nMYERS in that year, provided that MORGAN MYERS picks up the child from \nCHARLES MYERS and returns the child to that same place and that the weekend \nso designated does not interfere with Father's Day possession. Not later than the \nfifteenth day before the Friday that begins the designated weekend, CHARLES \nMYERS must give MORGAN MYERS written notice of the location at which \nMORGAN MYERS is to pick up and return the child. \n3. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear or gives CHARLES MYERS fourteen days' written notice on or after April \n16 of a year, MORGAN MYERS may designate one weekend beginning no \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2878
    },
    {
      "page_number": 19,
      "text": "earlier than the day after the child's school is dismissed for the summer vacation \nand ending no later than seven days before school resumes at the end of the \nsummer vacation, during which an otherwise scheduled weekend period of \npossession by CHARLES MYERS shall not take place in that year, provided that \nthe weekend so designated does not interfere with CHARLES MYERS's period or \nperiods of extended summer possession or with Father's Day possession. \nNotwithstanding the weekend and Thursday periods of possession of \nCHARLES MYERS, MORGAN MYERS and CHARLES MYERS shall have the \nright to possession of the child as follows: \n1. Christmas Holidays in Even-Numbered Years -In even-numbered \nyears, CHARLES MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and MORGAN MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n2. Christmas Holidays in Odd-Numbered Years -In odd-numbered \nyears, MORGAN MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and CHARLES MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n3. Thanksgiving in Odd-Numbered Years -In odd-numbered years, \nCHARLES MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n4. Thanksgiving in Even-Numbered Years -In even-numbered years, \nMORGAN MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n5. Child's Birthday -If a parent is not otherwise entitled under this \nStandard Possession Order to present possession of a child on the child's birthday, \nthat parent shall have possession of the child and the child's minor siblings \nbeginning at 6:00 P.M. and ending at 8:00 P.M. on that day, provided that that \nparent picks up the child from the other parent's residence and returns the child to \nthat same place. \n6. Father's Day -CHARLES MYERS shall have the right to \npossession of the child each year, beginning at 6:00 P .M. on the Friday preceding \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2801
    },
    {
      "page_number": 20,
      "text": "Father's Day and ending at 8:00 a.m. on the Monday after Father's Day, provided \nthat if CHARLES MYERS is not otherwise entitled under this Standard \nPossession Order to present possession of the child, he shall pick up the child \nfrom MORGAN MYERS's residence and return the child to that same place. \n7. Mother's Day -MORGAN MYERS shall have the right to \npossession of the child each year, beginning at the time the child's school is \nregularly dismissed on the Friday preceding Mother's Day and ending at the time \nthe child's school resumes after Mother's Day, provided that if MORGAN \nMYERS is not otherwise entitled under this Standard Possession Order to present \npossession of the child, she shall pick up the child from CHARLES MYERS's \nresidence and return the child to that same place. \n( d) When Parents Reside More than 50 Miles but 100 Miles or Less Apart \nExcept as otherwise expressly provided in this Standard Possession Order, \nwhen CHARLES MYERS resides more than 50 Miles but 100 miles or less from \nthe primary residence of the child, CHARLES MYERS shall have the right to \npossession of the child as follows: \n1. Weekends -\nOn weekends that occur during the regular school term, beginning at the \ntime the child's school is regularly dismissed, on the first, third, and fifth Friday of \neach month and ending at the time the child's school resumes after the weekend. \nOn weekends that do not occur during the regular school term, beginning \nat 6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \n2. Weekend Possession Extended by a Holiday-\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \nterm, as determined by the school in which the child is enrolled, or a federal, \nstate, or local holiday that falls on a Friday during the summer months when \nschool is not in session, that weekend period of possession shall begin at the time \nthe child's school is regularly dismissed on the Thursday immediately preceding \nthe student holiday or teacher in-service day and 6:00 p.m. on the Thursday \nimmediately preceding the federal, state, or local holiday during the summer \nmonths. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2744
    },
    {
      "page_number": 21,
      "text": "a Monday during the regular school term, as determined by the school in which \nthe child is enrolled, that weekend period of possession shall end at 8:00 a.m. on \nTuesday. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 6:00 P.M. on that Monday. \n3. Thursdays -On Thursday of each week during the regular school \nterm, beginning at the time the child's school is regularly dismissed and ending at \nthe time the child's school resumes on Friday. \n4. Spring Vacation in Even-Numbered Years -In even-numbered \nyears, beginning at the time the child's school is dismissed for the school's spring \nvacation and ending at 6:00 P.M. on the day before school resumes after that \nvacation. \n5. Extended Summer Possession by CHARLES MYERS -\nWith Written Notice by April 1 \n-If CHARLES MYERS gives MORGAN \nMYERS written notice by April 1 of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for thirty days beginning no earlier than the day after the \nchild's school is dismissed for the summer vacation and ending no later than seven \ndays before school resumes at the end of the summer vacation in that year, to be \nexercised in no more than two separate periods of at least seven consecutive days \neach, as specified in the written notice. These periods of possession shall begin \nand end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April 1 -If CHARLES MYERS does not give \nMORGAN MYERS written notice by April 1 of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for thirty consecutive days in that year beginning at \n6:00 P.M. on July 1 and ending at 6:00 P.M. on July 31. \nNotwithstanding the Thursday periods of possession during the regular \nschool term and the weekend periods of possession ORDERED for CHARLES \nMYERS, it is expressly ORDERED that MORGAN MYERS shall have a \nsuperior right of possession of the child as follows: \n1. Spring Vacation in Odd-Numbered Years -In odd-numbered \nyears, beginning at the time the child's school is dismissed for the school's spring \nvacation and ending at 6:00 P.M. on the day before school resumes after that \nvacation. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2705
    },
    {
      "page_number": 22,
      "text": "2. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P.M. on Friday and ending at 6:00 P.M. on the following \nSunday during any one period of the extended summer possession by CHARLES \nMYERS in that year, provided that MORGAN MYERS picks up the child from \nCHARLES MYERS and returns the child to that same place and that the weekend \nso designated does not interfere with Father's Day possession. Not later than the \nfifteenth day before the Friday that begins the designated weekend, CHARLES \nMYERS must give MORGAN MYERS written notice of the location at which \nMORGAN MYERS is to pick up and return the child. \n3. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear or gives CHARLES MYERS fourteen days' written notice on or after April \n16 of a year, MORGAN MYERS may designate one weekend beginning no \nearlier than the day after the child's school is dismissed for the summer vacation \nand ending no later than seven days before school resumes at the end of the \nsummer vacation, during which an otherwise scheduled weekend period of \npossession by CHARLES MYERS shall not take place in that year, provided that \nthe weekend so designated does not interfere with CHARLES MYERS's period or \nperiods of extended summer possession or with Father's Day possession. \n(e) Parents Who Reside More Than 100 Miles Apart \nExcept as otherwise expressly provided in this Standard Possession Order, \nwhen CHARLES MYERS resides more than 100 miles from the residence of the \nchild, CHARLES MYERS shall have the right to possession of the child as \nfollows: \n1. Weekends -Unless CHARLES MYERS elects the alternative \nperiod of weekend possession described in the next paragraph, CHARLES \nMYERS shall have the right to possession of the child on weekends beginning at \n6:00 P.M., on the first, third, and fifth Friday of each month and ending at 6:00 \nP.M. on the following Sunday. \nAlternate Weekend Possession -In lieu of the weekend possession \ndescribed in the foregoing paragraph, CHARLES MYERS shall have the right to \npossession of the child not more than one weekend per month of CHARLES \nMYERS's choice beginning at 6:00 P.M. on the day school recesses for the \nweekend and ending at 6:00 P.M. on the day before school resumes after the \nweekend. CHARLES MYERS may elect an option for this alternative period of \nweekend possession by giving written notice to MORGAN MYERS within ninety \ndays after the parties begin to reside more than 100 miles apart. If CHARLES \nMYERS makes this election, CHARLES MYERS shall give MORGAN MYERS \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2923
    },
    {
      "page_number": 23,
      "text": "fourteen days' written or telephonic notice preceding a designated weekend. The \nweekends chosen shall not conflict with the provisions regarding Christmas, \nThanksgiving, the child's birthday, and Mother's Day possession below. \n2. Weekend Possession Extended by a Holiday -\nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS begins on a student \nholiday or a teacher in-service day that falls on a Friday during the regular school \nterm, as determined by the school in which the child is enrolled, or a federal, \nstate, or local holiday during the summer months when school is not in session, \nthat weekend period of possession shall begin at the time the child's school is \nregularly dismissed on the Thursday immediately preceding the student holiday or \nteacher in-service day and 6:00 p.m. on the Thursday immediately preceding the \nfederal, state, or local holiday during the summer months \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a student holiday or a teacher in-service day that falls on \na Monday during the regular school term, as determined by the school in which \nthe child is enrolled, that weekend period of possession shall end at 8:00 a.m. on \nTuesday. \nExcept as otherwise expressly provided in this Standard Possession Order, \nif a weekend period of possession by CHARLES MYERS ends on or is \nimmediately followed by a federal, state, or local holiday that falls on a Monday \nduring the summer months when school is not in session, that weekend period of \npossession shall end at 6:00 P.M. on that Monday. \n3. Spring Vacation in All Years -Every year, beginning at 6:00 P.M. \non the day the child is dismissed from school for the school's spring vacation and \nending at 6:00 P.M. on the day before school resumes after that vacation. \n4. Extended Summer Possession by CHARLES MYERS -\nWith Written Notice by April 1 \n-If CHARLES MYERS gives MORGAN \nMYERS written notice by April 1 of a year specifying an extended period or \nperiods of summer possession for that year, CHARLES MYERS shall have \npossession of the child for forty-two days beginning no earlier than the day after \nthe child's school is dismissed for the summer vacation and ending no later than \nseven days before school resumes at the end of the summer vacation in that year, \nto be exercised in no more than two separate periods of at least seven consecutive \ndays each, as specified in the written notice. These periods of possession shall \nbegin and end at 6:00 P.M. on each applicable day. \nWithout Written Notice by April 1 -If CHARLES MYERS does not give \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2917
    },
    {
      "page_number": 24,
      "text": "MORGAN MYERS written notice by April 1 of a year specifying an extended \nperiod or periods of summer possession for that year, CHARLES MYERS shall \nhave possession of the child for forty-two consecutive days beginning at 6:00 \nP.M. on June 15 and ending at 6:00 P.M. on July 27 of that year. \nNotwithstanding the weekend periods of possession ORDERED for \nCHARLES MYERS, it is expressly ORDERED that MORGAN MYERS shall \nhave a superior right of possession of the child as follows: \n1. Summer Weekend Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS shall have possession of the child on any one weekend \nbeginning at 6:00 P .M. on Friday and ending at 6:00 P .M. on the following \nSunday during any one period of possession by CHARLES MYERS during \nCHARLES MYERS's extended summer possession in that year, provided that if a \nperiod of possession by CHARLES MYERS in that year exceeds thirty days, \nMORGAN MYERS may have possession of the child under the terms of this \nprovision on any two nonconsecutive weekends during that period and provided \nthat MORGAN MYERS picks up the child from CHARLES MYERS and returns \nthe child to that same place and that the weekend so designated does not interfere \nwith Father's Day possession. \n2. Extended Summer Possession by MORGAN MYERS -If \nMORGAN MYERS gives CHARLES MYERS written notice by April 15 of a \nyear, MORGAN MYERS may designate twenty-one days beginning no earlier \nthan the day after the child's school is dismissed for the summer vacation and \nending no later than seven days before school resumes at the end of the summer \nvacation in that year, to be exercised in no more than two separate periods of at \nleast seven consecutive days each, during which CHARLES MYERS shall not \nhave possession of the child, provided that the period or periods so designated do \nnot interfere with CHARLES MYERS's period or periods of extended summer \npossession or with Father's Day possession. These periods of possession shall \nbegin and end at 6:00 P.M. on each applicable day. \n(t) Holidays \nNotwithstanding the weekend and Thursday periods of possession of \nCHARLES MYERS, except when CHARLES MYERS resides fifty miles or less \nfrom the primary residence of the child, MORGAN MYERS and CHARLES \nMYERS shall have the right to possession of the child as follows: \n1. Christmas Holidays in Even-Numbered Years -In even-numbered \nyears, CHARLES MYERS shall_ have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and MORGAN MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2917
    },
    {
      "page_number": 25,
      "text": "at 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n2. Christmas Holidays in Odd-Numbered Years -In odd-numbered \nyears, MORGAN MYERS shall have the right to possession of the child \nbeginning at the time the child's school is dismissed for the Christmas school \nvacation and ending at noon on December 28, and CHARLES MYERS shall have \nthe right to possession of the child beginning at noon on December 28 and ending \nat 6:00 P.M. on the day before school resumes after that Christmas school \nvacation. \n3. Thanksgiving in Odd-Numbered Years -In odd-numbered years, \nCHARLES MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n4. Thanksgiving in Even-Numbered Years -In even-numbered years, \nMORGAN MYERS shall have the right to possession of the child beginning at \nthe time the child's school is dismissed before Thanksgiving and ending at 6:00 \nP.M. on the Sunday following Thanksgiving. \n5. Child's Birthday -If a parent is not otherwise entitled under this \nStandard Possession Order to present possession of a child on the child's birthday, \nthat parent shall have possession of the child and the child's minor siblings \nbeginning at 6:00 P.M. and ending at 8:00 P.M. on that day, provided that that \nparent picks up the child from the other parent's residence and returns the child to \nthat same place. \n6. Father's Day -CHARLES MYERS shall have the right to \npossession of the child each year, beginning at 6:00 P.M. on the Friday preceding \nFather's Day and ending at 8:00 a.m. on the Monday after Father's Day, provided \nthat if CHARLES MYERS is not otherwise entitled under this Standard \nPossession Order to present possession of the child, he shall pick up the child \nfrom MORGAN MYERS's residence and return the child to that same place. \n7. Mother's Day -MORGAN MYERS shall have the right to \npossession of the child each year, beginning at the time the child's school is \nregularly dismissed on the Friday preceding Mother's Day and ending at the time \nthe child's school resumes after Mother's Day, provided that if MORGAN \nMYERS is not otherwise entitled under this Standard Possession Order to present \npossession of the child, she shall pick up the child from CHARLES MYERS's \nresidence and return the child to that same place. \n(g) Undesignated Periods of Possession \nMORGAN MYERS shall have the right of possession of the child at all \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2704
    },
    {
      "page_number": 26,
      "text": "other times not specifically designated in this Standard Possession Order for \nCHARLES MYERS. \n(h) General Terms and Conditions \nExcept as otherwise expressly provided in this Standard Possession Order, \nthe terms and conditions of possession of the child that apply regardless of the \ndistance between the residence of a parent and the child are as follows: \n1. Surrender of Child by MORGAN MYERS -MORGAN MYERS \nis ORDERED to surrender the child to CHARLES MYERS at the beginning of \neach period of CHARLES MYERS's possession at the residence of MORGAN \nMYERS. \nIf a period of possession by CHARLES MYERS begins at the time the \nchild's school is regularly dismissed, MORGAN MYERS is ORDERED to \nsurrender the child to CHARLES MYERS at the beginning of each such period of \npossession at the school in which the child is enrolled. If the child is not \nphysically attending school, CHARLES MYERS shall pick up the child at the \nresidence of MORGAN MYERS at 6:00 P.M., and MORGAN MYERS is \nORDERED to surrender the child to CHARLES MYERS at the residence of \nMORGAN MYERS at 6:00 P.M. under these circumstances. \n2. Surrender of Child by CHARLES MYERS -CHARLES MYERS \nis ORDERED to surrender the child to MORGAN MYERS at the residence of \nCHARLES MYERS at the end of each period of possession. \nIf a period of possession by CHARLES MYERS ends at the time the \nchild's school resumes, CHARLES MYERS is ORDERED to surrender the child \nto MORGAN MYERS at the end of each such period of possession at the school \nin which the child is enrolled or, if the child is not physically attending school, at \nthe residence of MORGAN MYERS at 6:00 P.M. \n3. Surrender of Child by CHARLES MYERS -CHARLES MYERS \nis ORDERED to surrender the child to MORGAN MYERS, if the child is in \nCHARLES MYERS's possession or subject to CHARLES MYERS's control, at \nthe beginning of each period of MORGAN MYERS's exclusive periods of \npossession, at the place designated in this Standard Possession Order. \n4. Return of Child by MORGAN MYERS -MORGAN MYERS is \nORDERED to return the child to CHARLES MYERS, if CHARLES MYERS is \nentitled to possession of the child, at the end of each of MORGAN MYERS's \nexclusive periods of possession, at the place designated in this Standard \nPossession Order. \n5. Personal Effects -Each conservator is ORDERED to return with \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2501
    },
    {
      "page_number": 27,
      "text": "the child the personal effects that the child brought at the beginning of the period \nof possession. \n6. Designation of Competent Adult -Each conservator may designate \nany competent adult to pick up and return the child, as applicable. IT IS \nORDERED that a conservator or a designated competent adult be present when \nthe child is picked up or returned. \n7. Inability to Exercise Possession -Each conservator is ORDERED \nto give notice to the person in possession of the child on each occasion that the \nconservator will be unable to exercise that conservator's right of possession for \nany specified period. \n8. Written Notice -Written notice, including notice provided by \nelectronic mail or facsimile or as otherwise authorized in this order, shall be \ndeemed to have been timely made if received or, if applicable, postmarked before \nor at the time that notice is due. Each conservator is ORDERED to notify the \nother conservator of any change in the conservator's electronic mail address or \nfacsimile number within twenty-four hours after the change. \n9. Notice to School and MORGAN MYERS -If CHARLES \nMYERS's time of possession of the child ends at the time school resumes and for \nany reason the child is not or will not be returned to school, CHARLES MYERS \nshall immediately notify the school and MORGAN MYERS that the child will not \nbe or has not been returned to school. \nThis concludes the Standard Possession Order. \n2. Duration \nThe periods of possession ordered above apply to each child the subject of this \nsuit while that child is under the age of eighteen years and not otherwise emancipated. \nChild Support \nIT IS ORDERED that CHARLES MYERS pay to MORGAN MYERS for the support of \nMARA MYERS and CAROLINE MYERS nine hundred seventy-three dollars and nineteen \ncents ($973.19) per month, with the first payment being due and payable on April 1, 2024 and a \nlike payment being due and payable on the first day of each month thereafter until further order \nof this Court. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2164
    },
    {
      "page_number": 28,
      "text": "Withholding from Earnings \nIT IS ORDERED that any employer of CHARLES MYERS shall be ordered to withhold \nthe child support payments ordered in this order from the disposable earnings of CHARLES \nMYERS for the support of MARA MYERS and CAROLINE MYERS. \nIT IS FURTHER ORDERED that all amounts withheld from the disposable earnings of \nCHARLES MYERS by the employer and paid in accordance with the order to that employer \nshall constitute a credit against the child support obligation. Payment of the full amount of child \nsupport ordered paid by this order through the means of withholding from earnings shall \ndischarge the child support obligation. If the amount withheld from earnings and credited \nagainst the child support obligation is less than 100 percent of the amount ordered to be paid by \nthis order, the balance due remains an obligation of CHARLES MYERS, and it is hereby \nORDERED that CHARLES MYERS pay the balance due directly as specified below. \nOn this date the Court signed an Income Withholding for Support. \nPayment \nIT IS ORDERED that all payments shall be made through the state disbursement unit at \nTexas Child Support Disbursement Unit, P.O. Box 659791, San Antonio, Texas 78265-9791, and \nthereafter promptly remitted to MORGAN MYERS for the support of the children. IT IS \nORDERED that all payments shall be made payable to the Office of the Attorney General and \ninclude the ten-digit Office of the Attorney General case number (if available), the cause number \nof this suit, CHARLES MYERS's name as the name of the noncustodial parent (NCP), and \nMORGAN MYERS's name as the name of the custodial parent (CP). Payment options are found \non the Office of the Attorney General's website at www.texasattorneygeneral.gov/cs/payment­\noptions-and-types. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1948
    },
    {
      "page_number": 29,
      "text": "IT IS ORDERED that each party shall pay, when due, all fees charged to that party by the \nstate disbursement unit and any other agency statutorily authorized to charge a fee. \nChange of Employment \nIT IS FURTHER ORDERED that CHARLES MYERS shall notify this Court and \nMORGAN MYERS by U.S. certified mail, return receipt requested, of any change of address \nand of any termination of employment. This notice shall be given no later than seven days after \nthe change of address or the termination of employment. This notice or a subsequent notice shall \nalso provide the current address of CHARLES MYERS and the name and address of his current \nemployer, whenever that information becomes available. \nClerk's Duties \nIT IS ORDERED that, on the request of a prosecuting attorney, the title IV-D agency, the \nfriend of the Court, a domestic relations office, MORGAN MYERS, CHARLES MYERS, or an \nattorney representing MORGAN MYERS or CHARLES MYERS, the clerk of this Court shall \ncause a certified copy of the Income Withholding for Support to be delivered to any employer. \nMedical and Dental Support \n1. IT IS ORDERED that MORGAN MYERS and CHARLES MYERS shall each \nprovide additional child support for each child as set out in this order for as long as the Court \nmay order MORGAN MYERS and CHARLES MYERS to provide support for the child under \nsections 154.001 and 154.002 of the Texas Family Code. Beginning on the day MORGAN \nMYERS and CHARLES MYERS's actual or potential obligation to support a child under \nsections 154.001 and 154.002 of the Family Code terminates, IT IS ORDERED that MORGAN \nMYERS and CHARLES MYERS are discharged from these obligations with respect to that \nchild, except for any failure by a parent to fully comply with these obligations before that date. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1951
    },
    {
      "page_number": 30,
      "text": "IT IS FURTHER ORDERED that the additional child support payments for costs of health and \ndental insurance ordered below are payable through the state disbursement unit or as directed \nbelow and subject to the provisions for withholding from earnings provided above for other child \nsupport payments. \n2. Definitions -\n\"Health Insurance\" means insurance coverage that provides basic health-care services, \nincluding usual physician services, office visits, hospitalization, and laboratory, X-ray, and \nemergency services, that may be provided through a health maintenance organization or other \nprivate or public organization, other than medical assistance under chapter 32 of the Texas \nHuman Resources Code. \n\"Reasonable cost\" means the total cost of health insurance coverage for all children for \nwhich MORGAN MYERS is responsible under a medical support order that does not exceed 9 \npercent of MORGAN MYERS's annual resources, as described by section 154.062(b) of the \nTexas Family Code. \n\"Health-care expenses\" include, without limitation, medical, surgical, prescription drug, \nmental health-care services, dental, eye care, ophthalmological, and orthodontic charges but do \nnot include expenses for travel to and from the provider or for nonprescription medication. \n\"Health-care expenses that are not reimbursed by insurance\" (\"unreimbursed expenses\") \ninclude related copayments and deductibles. \n3. Findings on Availability of Health Insurance -Having considered the cost, \naccessibility, and quality of health insurance coverage available to the parties, the Court finds: \nIT IS FURTHER FOUND that the following orders regarding health-care coverage are in \nthe best interest of the children. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1878
    },
    {
      "page_number": 31,
      "text": "4. Provision of Health-Care Coverage -\nAs Petitioner's child support, MORGAN MYERS is ORDERED to obtain Medicaid for \nthe children the subject of this suit, and then maintain health insurance for the children as long as \nchild support is payable for that child. MORGAN MYERS is ORDERED -\na. to provide to each conservator of the children the following information no later \nthan the thirtieth day after she received Medicaid for the children: \na. MORGA MYERS' Social Security number; \nb. Proof that health insurance has been provided for the children; \nc. The following information and documents: \n1. The name of the health insurance carrier; \n11. The number of the policy; \n111. A copy of the policy; \n1v. A schedule of benefits; \nv. A health insurance membership card; \nv1. Claim forms; and \nVII. Any other information necessary to submit a claim; and \nd. To provide each conservator of the children with a copy of any \nrenewals or changes to the health insurance coverage of the children \nand any additional information regarding health insurance coverage \nof the children no later than the fifteenth day after MORGAN \nMYERS receives or is provided with the renewal, change, or \nadditional information; \ne. To notify each conservator of the children of any termination or \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1446
    },
    {
      "page_number": 32,
      "text": "lapse of health insurance coverage of the children no later than the \nfifteenth day after the date of the termination or lapse; \nf. After termination or lapse of health insurance coverage, to notify \neach conservator of the children of the availability to MORGAN \nMYERS of additional health insurance for the children no later than \nthe fifteenth day after the date the insurance becomes available; \ng. After termination or lapse of health insurance coverage, to enroll the \nchildren in a health insurance plan that is available to MORGAN \nMYERS at a reasonable cost at the next available enrollment period. \nPursuant to section 1504.051 of the Texas Insurance Code, IT IS ORDERED that if \nMORGAN MYERS is eligible for dependent health coverage but fails to apply to obtain \ncoverage for the children, the insurer shall enroll the children on application of CHARLES \nMYERS or others authorized by law. \n5. Allocation ofUnreimbursed Expenses -\nThe conservator who incurs a health-care expense on behalf of a child is ORDERED to \nprovide to the other conservator receipts, bills, statements, or explanations of benefits showing \nthe uninsured portion of the health-care expenses within thirty days after the incurring \nconservator receives them. The nonincurring conservator is ORDERED to pay the non-incurring \nconservator's percentage of the unreimbursed portion of the health-care expenses either by \npaying the health-care provider directly or by reimbursing the incurring conservator for any \nadvance payment exceeding the incurring conservator's percentage of the unreimbursed portion \nof the health-care expenses within thirty days after the nonincurring conservator receives \nreceipts, bills, statements, or explanations of benefits showing the unreimbursed portion of the \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1950
    },
    {
      "page_number": 33,
      "text": "health-care expense. \nFor the Court to hold the nonincurring conservator in civil or criminal contempt for \nfailing to pay the nonincurring conservator's percentage of the unreimbursed portion of a health­\ncare expense, the incurring conservator must prove beyond a reasonable doubt that the \nnonincurring conservator personally received receipts, bills, statements, or explanations of \nbenefits reflecting the unreimbursed portion of the health-care expense no later than thirty days \nafter the incurring conservator received them. Even if the incurring conservator fails to meet that \nburden of proof, the Court may award the incurring conservator a judgment in the nature of child \nsupport against the nonincurring conservator in the amount of the unreimbursed portion of the \nheath-care expense the nonincurring conservator was ordered but fail to pay. \n6. WARNING - A PARENT ORDERED TO PROVIDE HEALTH INSURANCE \nOR DENTAL INSURANCE OR TO PAY THE OTHER PARENT ADDITIONAL CHILD \nSUPPORT FOR THE COST OF HEALTH INSURANCE OR DENTAL INSURANCE WHO \nFAILS TO DO SO IS LIABLE FOR NECESSARY MEDICAL EXPENSES OF THE \nCHILDREN, WITHOUT REGARD TO WHETHER THE EXPENSES WOULD HA VE BEEN \nPAID IF HEALTH INSURANCE OR DENTAL INSURANCE HAD BEEN PROVIDED, AND \nFOR THE COST OF HEALTH INSURANCE PREMIUMS, DENTAL INSURANCE \nPREMIUMS, OR CONTRIBUTIONS, IF ANY, PAID ON BEHALF OF THE CHILDREN. \n7. Notice to Employer -On this date a Medical Support Notice was signed by the \nCourt. For the purpose of section I 169 of title 29 of the United States Code, the conservator not \ncarrying the health or dental insurance policy is designated the custodial parent and alternate \nrecipient's representative. \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1854
    },
    {
      "page_number": 34,
      "text": "No Termination of Orders on Death ofObligee \nAn obligation to pay child support under this order does not terminate on the death of \nMORGAN MYERS but continues as an obligation to MARA MYERS and CAROLINE \nMYERS. \nOther Child Related Provisions \nRequired Notices \nNOTICE TO ANY PEACE OFFICER OF THE STATE OF TEXAS: YOU MAY USE \nREASONABLE EFFORTS TO ENFORCE THE TERMS OF CHILD CUSTODY SPECIFIED \nIN THIS ORDER. A PEACE OFFICER WHO RELIES ON THE TERMS OF A COURT \nORDER AND THE OFFICER'S AGENCY ARE ENTITLED TO THE APPLICABLE \nIMMUNITY AGAINST ANY CLAIM, CIVIL OR OTHERWISE, REGARDING THE \nOFFICER'S GOOD FAITH ACTS PERFORMED IN THE SCOPE OF THE OFFICER'S \nDUTIES IN ENFORCING THE TERMS OF THE ORDER THAT RELATE TO CHILD \nCUSTODY. ANY PERSON WHO KNOWINGLY PRESENTS FOR ENFORCEMENT AN \nORDER THAT IS INVALID OR NO LONGER IN EFFECT COMMITS AN OFFENSE THAT \nMAY BE PUNISHABLE BY CONFINEMENT IN JAIL FOR AS LONG AS TWO YEARS \nAND A FINE OF AS MUCH AS $10,000. \nTHE COURT MAY MODIFY THIS ORDER THAT PROVIDES FOR THE SUPPORT \nOF A CHILD, IF: \n(1) THE CIRCUMSTANCES OF THE CHILD OR A PERSON AFFECTED BY \nTHE ORDER HAVE MATERIALLY AND SUBSTANTIALLY CHANGED; OR \n(2) IT HAS BEEN THREE YEARS SINCE THE ORDER WAS RENDERED OR \nLAST MODIFIED AND THE MONTHLY AMOUNT OF THE CHILD SUPPORT AWARD \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1448
    },
    {
      "page_number": 35,
      "text": "UNDER THE ORDER DIFFERS BY EITHER 20 PERCENT OR $100 FROM THE AMOUNT \nTHAT WOULD BE AWARDED IN ACCORDANCE WITH THE CHILD SUPPORT \nGUIDELINES. \nWarnings to Parties \nWARNINGS TO PARTIES: FAILURE TO OBEY A COURT ORDER FOR CHILD \nSUPPORT OR FOR POSSESSION OF OR ACCESS TO A CHILD MAY RESULT IN \nFURTHER LITIGATION TO ENFORCE THE ORDER, INCLUDING CONTEMPT OF \nCOURT. A FINDING OF CONTEMPT MAY BE PUNISHED BY CONFINEMENT IN JAIL \nFOR UP TO SIX MONTHS, A FINE OF UP TO $500 FOR EACH VIOLATION, AND A \nMONEY JUDGMENT FOR PAYMENT OF ATTORNEY'S FEES AND COURT COSTS. \nFAILURE OF A PARTY TO MAKE A CHILD SUPPORT PAYMENT TO THE \nPLACE AND IN THE MANNER REQUIRED BY A COURT ORDER MAY RESULT IN THE \nPARTY'S NOT RECEIVING CREDIT FOR MAKING THE PAYMENT. \nFAILURE OF A PARTY TO PAY CHILD SUPPORT DOES NOT JUSTIFY \nDENYING THAT PARTY COURT-ORDERED POSSESSION OF OR ACCESS TO A \nCHILD. REFUSAL BY A PARTY TO ALLOW POSSESSION OF OR ACCESS TO A \nCHILD DOES NOT JUSTIFY FAIL URE TO PAY COURT-ORDERED CHILD SUPPORT TO \nTHAT PARTY. \nProperty and Parties \nThe Court finds that the following orders respecting the property and parties are \nnecessary and equitable. \nIT IS ORDERED that MORGAN MYERS shall be responsible for the timely payment of \nthe following: \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1407
    },
    {
      "page_number": 36,
      "text": "1. The auto insurance for the vehicle in her possession; \n2. the monthly payment for her cell phone; \n3. the rent payment for the residence located at 6641 Anns Court, Watauga, \nTexas beginning after March 30, 2024. \nIT IS ORDERED that CHARLES MYERS shall be responsible for the timely payment of \nthe following: \n1. The auto insurance for the 2021 Mazda, the 2023 Mazda, and any other \nvehicle currently in his possession; \n2. the car payments for the 2021 Mazda, the 2023 Mazda, and any other \nvehicle currently in his possession; \n3. the monthly payment for his cell phone; \n4. the rent payment for the residence located at 6641 Anns Court, Watauga, \nTexas for February and March 2024. \nIT IS ORDERED that Petitioner have the exclusive and private use and possession of the \nfollowing property while this case is pending: the personal property and clothing in her \npossession, the 2007 Mazda motor vehicle currently in her possession, and the residence located \nat 6641 Anns Court, Watauga, Texas beginning March 30, 2024. \nIT IS ORDERED that Respondent have the exclusive and private use and possession of \nthe following property while this case is pending: the personal property and clothing in his \npossession, the 2021 Mazda motor vehicle, the 2023 Mazda motor vehicle, and the residence \nlocated at 6641 Anns Court, Watauga, Texas ONLY until March 20, 2024. \nCo-Parenting Website \nIT IS ORDERED that the parties are to attend \"Children in the Middle\" part 1 and/or 2 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1646
    },
    {
      "page_number": 37,
      "text": "by May 1, 2024, and file a certificate of completion with the Court for their attendance to this co­\nparenting class. \nIT IS FURTHER ORDERED that each party shall be solely liable for their own costs for \nthe attendance of this co-parenting class. \nApp Close \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS each shall, within \nten days after the entry of the Associate Judge's Report is signed by the Court, obtain at his/her \nsole expense a subscription to the AppClose program. IT IS FURTHER ORDERED that \nMORGAN MYERS and CHARLES MYERS each shall maintain that subscription in full force \nand effect for as long as the child is under the age of eighteen years and not otherwise \nemancipated. \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS shall each \ncommunicate through the AppClose program with regard to all communication regarding the \nchildren, except in the case of emergency or other urgent matter. \nIT IS ORDERED that MORGAN MYERS and CHARLES MYERS each shall timely \npost all significant information concerning the health, education, and welfare of the children, \nincluding but not limited to the children's medical appointments, the children's schedules and \nactivities, and request for reimbursement of uninsured health-care expenses, on the AppClose \nwebsite. However, IT IS ORDERED that neither party shall have any obligation to post on that \nwebsite any information to which the other party already has access through other means, such as \ninformation available on the website of the children's schools. \nIT IS FURTHER ORDERED that MORGAN MYERS and CHARLES MYERS shall \neach timely post on the AppClose website a copy of any email received by the party from the \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1858
    },
    {
      "page_number": 38,
      "text": "children's school or any health-care provider of the children, in the event that email was not also \nforwarded by the school or health-care provider to the other party. \nFor purposes of this section of this order, \"timely\" means on learning of the event or \nactivity, or if not immediately feasible under the circumstances, not later than twenty-four hours \nafter learning of the event or activity. \nBy agreement, the parties may communicate m any manner other than usmg the \nAppClose program, but other methods of communication used by the parties shall be in addition \nto, and not in lieu of, using the AppClose program. \nTemporary Injunction \nThe temporary injunction granted below shall be effective immediately and shall be \nbinding on the parties; on their agents, servants, employees, and attorneys; and on those persons \nin active concert or participation with them who receive actual notice of this order by personal \nservice or otherwise. The requirement of a bond is waived. \nIT IS ORDERED that Petitioner and Respondent are enjoined from: \n1. Intentionally communicating with the other party in person or m any other \nmanner, including by telephone or another electronic voice transmission, video chat, in writing, \nor electronic messaging, by use of vulgar, profane, obscene, or indecent language or in a coarse \nor offensive manner, with intent to annoy or alarm the other party. \n2. Threatening the other party in person or in any other manner, including by \ntelephone or another electronic voice transmission, video chat, in writing, or electronic \nmessaging, to take unlawful action against any person, intending by this action to annoy or alarm \nthe other party. \n3. Placing a telephone call, anonymously, at any unreasonable hour, in an offensive \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1937
    },
    {
      "page_number": 39,
      "text": "and repetitious manner, or without a legitimate purpose of communication with the intent to \nannoy or alarm the other party. \n4. Intentionally, knowingly, or recklessly causing bodily injury to the other party or \nto a child of either party. \n5. Threatening the other party or a child of either party with imminent bodily injury. \n6. Intentionally, knowingly, or recklessly destroying, removing, concealing, \nencumbering, transferring, or otherwise harming or reducing the value of the property of one or \nboth of the parties with intent to obstruct the authority of the Court to order a division of the \nestate of the parties in a manner that the Court deems just and right, having due regard for the \nrights of each party and the children of the marriage. \n7. Intentionally falsifying any writing or record, including an electronic record, \nrelating to the property of either party. \n8. Intentionally misrepresenting or refusing to disclose to the other party or to the \nCourt, on proper request, the existence, amount, or location of any tangible or intellectual \nproperty of one or both of the parties, including electronically stored or recorded information. \n9. Intentionally or knowingly damaging or destroying the tangible or intellectual \nproperty of one or both of the parties, including electronically stored or recorded information, \nand causing pecuniary loss or substantial inconvenience to the other party. \n10. Intentionally or knowingly tampering with the tangible or intellectual property of \none or both of the parties, including electronically stored or recorded information, and causing \npecuniary loss or substantial inconvenience to the other party. \n11. Selling, transferring, assigning, mortgaging, encumbering, or in any other manner \nalienating any of the property of one or both of the parties, whether personal property, real \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 2026
    },
    {
      "page_number": 40,
      "text": "property, or intellectual property, and whether separate or community property, except as \nspecifically authorized by this order. \n12. Incurring any debt, other than legal expenses in connection with this suit, except \nas specifically authorized by this order. \n13. Withdrawing money from any checking or savmgs account in any financial \ninstitution for any purpose, except as specifically authorized by this order. \n14. Spending any money in either party's possession or subject to either party's \ncontrol for any purpose, except as specifically authorized by this order. \n15. Withdrawing or borrowing money in any manner for any purpose from any \nretirement, profit-sharing, pension, death, or other employee benefit plan, employee savings \nplan, individual retirement account, or Keogh account of either party, except as specifically \nauthorized by this order. \n16. Withdrawing, transferring, ass1gmng, encumbering, selling, or in any other \nmanner alienating any funds or assets held in any brokerage account, mutual fund account, or \ninvestment account by one or both parties, regardless of whether the funds or assets are \ncommunity or separate property and whether the accounts are self-managed or managed by a \nthird party, except as specifically authorized by this order. \n17. Withdrawing or borrowing in any manner all or any part of the cash surrender \nvalue of any life insurance policy on the life of either party or a child of the parties, except as \nspecifically authorized by this order. \n18. Entering any safe-deposit box in the name of or subject to the control of one or \nboth of the parties, whether individually or jointly with others. \n19. Changing or in any manner altering the beneficiary designation on any life \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1908
    },
    {
      "page_number": 41,
      "text": "insurance policy on the life of either party or a child of the parties. \n20. Canceling, altering, failing to renew or pay premiums on, or m any manner \naffecting the level of coverage that existed at the time this suit was filed of, any life, casualty, \nautomobile, or health insurance policy insuring the parties' property or persons including a child \nof the parties. \n21. Opening or diverting mail or email or any other electronic communication \naddressed to the other party. \n22. Signing or endorsing the other party's name on any negotiable instrument, check, \nor draft, including a tax refund, insurance payment, and dividend, or attempting to negotiate any \nnegotiable instrument payable to the parties or the other party without the personal signature of \nthe other party. \n23. Taking any action to terminate or limit credit or charge cards in the name of the \nparties or the other party, except as specifically authorized in this order. \n24. Discontinuing or reducing the withholding for federal income taxes from either \nparty's wages or salary. \n25. Destroying, disposing of, or altering any financial records of the parties, including \nbut not limited to a canceled check, deposit slip, and other records from a financial institution, a \nrecord of credit purchases or cash advances, a tax return, and a financial statement. \n26. Destroying, disposing of, or altering any email, text message, video message, or \nchat message or other electronic data or electronically stored information relevant to the subject \nmatter of this case, whether stored on a hard drive, in a removable storage device, in cloud \nstorage, or in another electronic storage medium. \n27. Modifying, changing, or altering the native format or metadata of any electronic \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1924
    },
    {
      "page_number": 42,
      "text": "data or electronically stored information relevant to the subject matter of this case, whether \nstored on a hard drive, in a removable storage device, in cloud storage, or in another electronic \nstorage medium. \n28. Deleting any data or content from any social network profile used or created by \neither party or a child of the parties. \n29. Using any password or personal identification number to gain access to the other \nparty's email account, bank account, social media account, or any other electronic account. \n30. Consuming, use or have in their possession any illegal drug or drugs at any time \nnor shall they have, at any time, a legal drug or drugs in their possession for which that party \ndoes not have a prescription. \n31. Neither party shall consume alcohol at least 12 hours prior to their time for \npossession of the children. \n32. Neither party shall consume alcohol during their period of possession with the \nchildren. \n33. Neither party shall attend one of the children's activities if they have consumed \nalcohol or they are under the influence of alcohol. \n34. Neither party shall leave the children with a person who is consuming alcohol at \nleast 12 hours prior to taking possession of the children or has in their possession an illegal \ndrug(s), including prescription drugs, as a childcare provider. \n35. No disparaging remarks in the presence of the children and no discussion of \nlitigation or issues of the case with children. \n36. The parties are not to discuss the litigation or issues with the children about the \nother party. The aforementioned sentence means that neither party shall belittle, talk bad, refer to \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1818
    },
    {
      "page_number": 43,
      "text": "the other party using a profane name or names, profanity or curse words. \n37. The parties are not to discuss the litigation or issues with the children. \n38. Neither party shall discuss what occurred in Court including testimony of any \nwitness or witnesses with the children. \nIT IS ORDERED that Petitioner is further enjoined from: \n1. Entering, operating, or exercising control over the 2021 Mazda motor vehicle and \nthe 2023 Mazda motor vehicle in the possession of Respondent. \nIT IS ORDERED that Respondent is further enjoined from: \n1. Excluding Petitioner from the use and enjoyment of the residence located at 6641 \nAnns Court, Watagua, Texas on or after March 30, 2024;. \n2. Entering, operating, or exercising control over the 2007 Mazda motor vehicle in \nthe possession of Petitioner. \nIT IS ORDERED that Petitioner is specifically authorized: \nTo make expenditures and incur indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medical care. \nTo make expenditures and incur indebtedness for reasonable attorney's fees and expenses \nin connection with this suit. \nTo make withdrawals from accounts m financial institutions only for the purposes \nauthorized by this order. \nIT IS ORDERED that Respondent is specifically authorized: \nTo make expenditures and incur indebtedness for reasonable and necessary living \nexpenses for food, clothing, shelter, transportation, and medical care. \nTo make expenditures and incur indebtedness for reasonable attorney's fees and expenses \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1711
    },
    {
      "page_number": 44,
      "text": "in connection with this suit. \nFor purposes of this order, \"personal property\" includes, but 1s not limited to, the \nfollowing: \na. cash, checks, traveler's checks, and money orders; \nb. funds on deposit in financial accounts with commercial banks, savings banks, and \ncredit unions; \nc. funds and assets held in brokerage, mutual fund, and other investment accounts; \nd. publicly traded stocks, bonds, and other securities; \ne. stock options and restricted stock units; \nf. bonuses; \ng. closely held business interests; \nh. retirement benefits and accounts; \n1. deferred compensation benefits; \nJ. insurance policies, annuities, and health savings accounts; \nk. motor vehicles, boats, airplanes, cycles, mobile homes, trailers, and recreational \nvehicles; \nI. money owed to one or both parties, including notes and expected income tax \nrefunds; \nm. household furniture, furnishings, and fixtures; \nn. electronics and computers; \no. antiques, artwork, and collections; \np. sporting goods and firearms; \nq. jewelry and other personal items; \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1211
    },
    {
      "page_number": 45,
      "text": "r. pets and livestock; \ns. club memberships; \nt. travel award benefits and other award accounts; \nu. crops, farm equipment, construction equipment, tools, leases, cemetery lots, gold \nor silver coins not part of a collection, tax overpayments, loss carry-forward deductions, lottery \ntickets/winnings, stadium bonds, stadium seat licenses, seat options, season tickets, ranch brands, \nand business names; \nv. digital assets such as email addresses, social network accounts, Web sites, domain \nnames, digital media such as pictures, music, e-books, movies, and videos, biogs, reward points, \ndigital storefronts, artwork, and data storage accounts; \nw. virtual assets such as virtual pets, avatars, accessories for virtual characters, \nvirtual prizes, virtual real estate, and virtual currency; \nx. safe-deposit boxes and their contents; \ny. storage facilities and their contents; and \nz. contingent assets. \nDuration \nThese Temporary Orders shall continue in force until the signing of the Final Decree of \nDivorce or until further order of this Court. \nSIGNED on JVl /✓? l / t 26 2_1f . \n.TI..JDGE PRESIDING \nAPPROVED AS TO FORM ONLY: \nMARX ALTMAN & JOHNSON \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1330
    },
    {
      "page_number": 46,
      "text": "2905 Lackland Rd. \nFT. WORTH, Texas 76116 \nTel: (817) 926-6211 \nFax: (817) 926-6188 \nBy:__,__..,,c_-f#--1-b~----------­\nCooper \nAttome for Petitioner \nState Bar No. 24121530 \ncoopercarter@maj admin. com \nDaniel R. Bacalis PC \n669 Airport Freeway \nSuite 307 \nHurst, TX 76053 \nOffice Phone: (817)498-4105 \nFax: (817)282-0634 \nBy: _______________ _ \nDaniel Bucalis \nAttorney for Respondent \nState Bar No. 01487550 \nEmail: dbacalis@dbacalis.com \nAPPROVED AND CONSENTED TO AS TO BOTH FORM AND SUBSTANCE: \nMORGAN MYERS \nPETITIONER \nCHARLES MYERS \nRESPONDENT \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 723
    },
    {
      "page_number": 47,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 85983756\nFiling Code Description: No Fee Documents\nFiling Description:\nStatus as of 3/27/2024 7:40 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n3/26/2024 3:19:25 PM\n3/26/2024 3:19:25 PMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nDaniel Bacalis\nTammy L.Johnson\nDaniel R.Bacalis\nCHARLES MYERSBarNumber Email\nservice@dbacalis.com\ntjohnson@dbacalis.com\ndbacalis@dbacalis.com\nchuckdustin12@gmail.comTimestampSubmitted\n3/26/2024 3:19:25 PM\n3/26/2024 3:19:25 PM\n3/26/2024 3:19:25 PM\n3/26/2024 3:19:25 PMStatus\nSENT\nSENT\nSENT\nSENT\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 1232
    }
  ]
}