{"id": "5effe402889b4526795ea620d1391e22a7fa456b", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 322-744263 -23\nIN THE 322ND DISTRICT COURT \nOF TARRANT COUNTY, TEXAS  \nMorgan Michelle Myers,  \n  Petition\ner, \n  v. \nCharles\n Dustin Myers,  \n        Responde\nnt. \nAnd In the interest of M.E.M. and \nC.R.M., two children.§ \n§ \n§ \n§ \n§ MOTION TO RECUSE\n§ THE REGIONAL PRESIDING\n§ JUDGE\n§\n§\n§ \nTO THE HONORA BLE CHIEF JUSTICE O F THE S UPREME CO URT O F TEXAS : \nCOMES NOW , Respondent, CHARLES DUSTIN MYERS, who respectfully submits \nthis First Amended Motion to Recuse the Regional Presiding Judge, D avid L. Ev ans, and in \nsupport thereof, shows the Court the following: \nS\nince D ecember of 2023,  Respondent  has pled t ime and  time again r egarding  a fraudulent  \nscheme to d ivest hi m of his bus i ness and  property t ha t be gan w ith M organ M ichell e Myers and  \nDaniel Kenneth Branthoover , involving  interstat e travel and  communications.  \nEach t i\nme the Respondent  has uti lized a legal pa thwa y , he has be en  met w ith unj ustifiable \nconduct t hat ha s, by i ts’ ve r y n ature, w i llfully expa nded t he scope of  the initial M ye rs-\nBranthoover enterprise into what it is today -  a  collection  of officials, at torneys, and  cour t staff \nm\nembers t hat w ho – when pres ented w ith unrefuted f act s, and  were made aware of  the  fraudulent \nscheme – chos e to be come entangled w ith the enterprise’s affairs.  \nIt is of upmost importance to our  judicial s ys tem t hat the following  issues be  ad judicated,  \nand a fair and  impa rtial judge preside over t his m atter who  will no t tolerate such be h avior. FIRST AMENDED322-744263-23\nFILED\nTARRANT COUNTY\n9/11/2025 3:04 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n2 I.SCOPE\nThe factual allegations raised herein are not conclusory and are supported by the record \ndirectly. Furthermore, given that Respondent has filed six mandamus petitions naming \nHonorables James Munford, Jeffrey Kaitcer, Kenneth Newell, Kate Stone, David Evans, and John Cayce as respondents, the record exists within the public domain and c"}
{"id": "ab9ce840cbccf71da46f04bbd83f8f0398e7014b", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "filed six mandamus petitions naming \nHonorables James Munford, Jeffrey Kaitcer, Kenneth Newell, Kate Stone, David Evans, and John Cayce as respondents, the record exists within the public domain and can be found here: https://search.txcourts.gov/SearchMedia.aspx?MediaVersionID=8e2d45b4-fb4f-40a0- 93bc-\ned9ed5f3cebd&coa=cossup&DT=RECORD&MediaID=804ac8d3-9b5f-40b0-bc41-\nbbc08c814365  \nTh ose who have been made aware of the fraudulent scheme but have inadvertently furthered its ’ affairs amount to two district judges, two associate judges, two visiting retired \njudges, the regional presiding judge, two court coordinators, one deputy clerk, and a licensed attorney, forming an associate-in -fact enterprise for purposes of RICO, as explained be low. \nII.GROUNDS FOR RECUSAL\nThe Regional Presiding Judge has permitted and  recklessly tolerated an ongoing RICO \nEnterprise that continues to expand within  the Texas Judiciary due to  the collective and  willful \nneglect by the enjoined individuals to uphold their mandatory dut ies. By neglecting the \nresponsibilit ies of his position of power, David L. Evans has inadvertently  aided in the furtherance \nof the RICO enterprise’s  primary objective: to secure a fraudulent final decree of divorce  and \nescape accountability . \nAs the record establishes, the Respondent has exhausted every appellate and administrative \nremedy in an attempt to seek redress . Unopposed relief continues to be denied, and more  predicate \nacts in furtherance of the enterp rise’s affairs continue to occur.  \nFor the forthcoming reasons, David L. Evans must recuse fr om this matter :\n\n3 II. GROUNDS FOR RECUSAL\nA.Disregard for Recusal Procedure\n1.Texas law mandates strict adherence to procedural safeguards in the recusal process to\nensure both actual and apparent judicial impartiality. When a court coordinator —who is not a \nneutral party and serves at the pleasure of the judge subject to recusal —handles the \nadministrative delivery of a recusal motion, th"}
{"id": "afa350d8835bd20ab8e7fe49b2fcdb2f3b0dd30b", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "nt judicial impartiality. When a court coordinator —who is not a \nneutral party and serves at the pleasure of the judge subject to recusal —handles the \nadministrative delivery of a recusal motion, this contravenes the explicit requirements of Rule \n18a(e) and creates an appearance of impropriety.  \n2. David L. Evans has allowed the coordinator Lindsey Baker – not the clerk – to handle\nthe duties the legislature explicitly designates to court clerks. Rule 18a(e)(2) plainly stat es that \n“…when a respondent judge signs and files an order of recusal or referral, the clerk of the court must immediately deliver a copy to the regional presiding judge. ”  \n3. Furthermore, as Rule 18(a)(f)(3) also plainly states , “…if the respondent judge fails to\ncomply with a duty imposed by this rule, the movant may notify the regional presiding judge.” \n4. Here, the Regional Presiding Judge was notified of and provided with a modified\nversion of the recusal motion rather than the original, and was notified of these discrepancies, but \nchose to ignore them. B.Recusal  Tampering\n5. The record facially establishes that on October 7, 2024, the Respondent filed a Joint\nMotion to Recuse Honorable Judges James Munford and Jeffrey Kaitcer from the matter and provided supporting evidence which is self -authenticating under the Texas Rules of Evidence. \n6. The following day, on October 8 at 4:42 P.M., correspondence was received from court\ncoordinator Lindsey Baker regarding the order of referral. REC. 1277\n\n4 7. Upon inspection, it was discovered that the affidavit and exhibits were both missing\nfrom the motion  which was sent to the Regional Judge, and this was quickly pointed out to the \ncoordinator.  \n8. She confirms that the exhibits were indeed filed  electronically  but as the clerk ’s office\nprefers – they were filed as one document, just  as the Tarrant County District Clerk ’s Filing FAQ \nstates : \nQ: “What process should be used for eFiling exhibits?”  \nA: “Same process for exhibit a"}
{"id": "ae84e77ff696fe60b8b38f9b778a1b4ea348285d", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "e\nprefers – they were filed as one document, just  as the Tarrant County District Clerk ’s Filing FAQ \nstates : \nQ: “What process should be used for eFiling exhibits?”  \nA: “Same process for exhibit as initial filings- Exhibits should be merged into one \n      document with the lead document. ” REC. 1262. \nC. Re peated Tamper ing\n9. The record facially shows that on October 10, 2024, Judge James Munford filed an\n“Amended Order of Referral” and on ce again th e correspondence  to David L Evans was handled \nby the coordinator.  \n10.This time, the coordinator claimed that due to the “size of the motion ” that it could be\njustified to split the motion into three separate files, this time with the exhibits and affidavit \nincluded, defeating the entire purpose of removing the exhibits and affidavit two days earlier.  \nREC. 1282 \nD. Object ing\n11.All of these issues were raised in both  notice and an objection filed timely after these\nissues were discovered. REC. 1245-1252 It included all email exchanges with the coordinator, \nthe modifications of the original motion, with  the objection specifically stating  that “ the \nexplanation changed to the document being too large. This inconsistency raises concerns about transparency and procedural fairness.” No ac tion was taken by David Evans .\n\n5 \n E. Subsequent R ecusals  \n 12. After waiting four months for the judges to be reinstated as per David Evans ’ order, \nRespondent had to rea ch out to the court coordinator to remind her to reinstate the trial judges . \nREC. 1306.  \n 13. The Respondent , in the face of a serious dental emergency for his youngest child, \nopened a separate SAPCR suit, arguing for dominant jurisdiction , (REC. 2088) only to be denied \naccess to the courts by Judge s Kate Stone and Kenneth Newell, which prevented an emergency \nTRO needed for the safety and welfare of the Respondent’s children . This negligence lead to a \ndirect injury to the youngest child in this case  and three concurrent mandamus petit"}
{"id": "6df34aac2c60060361e3251c7487905794111987", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "nted an emergency \nTRO needed for the safety and welfare of the Respondent’s children . This negligence lead to a \ndirect injury to the youngest child in this case  and three concurrent mandamus petitions  \nfollowed, none of which received  any response from the implicated Judges. See  25-0361, 25-\n0367, 25-0378.  \n 14. In the midst of these efforts, James Munford continued to ignore the issues and after \nthe SAPCR was improperly consolidated by Judge Newell, Judge Munford chose to move the case towards final deposition , which was promptly objected to and ignored the same. REC. 2480. \n 15. These actions lead to the second recusal motion,  facially naming James Munford as \nthe respondent judge. REC. 2488. \n 16. This time, David Evans addressed two major issues raised in an objection by the Respondent:   i. The continued involvement of Lindsey Baker, the court coordinator; \n  ii. The erroneous order of referral sent by Judge Kaitcer; REC. 2620  \n 17. In his order, he argued that  \n“The court coordinators and clerks work together to assist the trial judges and the administrative \njudges. Only the judges, not the litigants, have the authority to direct the activities of the court \ncoordinators and clerks. Mr. Myers' objections regarding the involvement are overruled ” REC. \n3507.\n\n6 \n  18. This argument fails – because the rules of procedure does not designate any role to  \nthe Court Coordinator, and based on prior conduct – her involvement has facially created  \nambiguity in a process designe d to promote transparency and fairness . By refusing to comply \nwith the Rule 18a of the Texas Rules of Civil Procedure in multiple recusal proceedings – there \nis no question regarding his impartiality – it has been compromised by , what the Responde nt \nbelieves to be, political reas ons.  \n 19. Even when raising these issues to the highest Court in the State  on direct appeal , \nleading to cause numbers 25-0426 an d 25- 0458, which related to compliance with Rule 18a and \nthe "}
{"id": "7c986eab8cb65073758efd760e039e027086b8be", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "as ons.  \n 19. Even when raising these issues to the highest Court in the State  on direct appeal , \nleading to cause numbers 25-0426 an d 25- 0458, which related to compliance with Rule 18a and \nthe entertainment  and subsequent denial of a motion which was never filed , result ing in five \nconcurrent mandamus pe titions before the Texas Supreme Court.  \n 20. A ll that was received in response to these efforts was “ Denied, per curiam ”. \nRespondent understands that the Court of appeals has the d iscretion to is sue such explanations, \nhowever, given the scope of these issues , they cannot be addressed at final disposition, and based \non everything above, there  no reasonable possibility  that one would think that there could be a \nfair and impartial trial  given these circumstances . This will only lead to further appeals and more  \nwasted judicial resources when these issues could just be dealt with at present.  \n 21. The regional judge’s repeated failure to follow mandatory recusal procedures —by \ndenying hearings on recusal motions, involving non-neutral staff, and failing to provide meaningful appellate remedies —constitutes a pattern of procedural irregularities that violates \nboth statutory requirements and the fundamental due process right to a fair and impartial tribunal. Texas law is clear that recusal is required whenever a judge’s conduct creates reasonable \ndoubt as to impartiality, and the deprivation of a meaning ful appellate remedy further supports \nthe necessity of recusal to protect the substantive rights of the parties and restore confidence in\n\n7 the judicial process. The authorities provided leave no doubt that adherence to recusal procedures \nis essential to the integrity of the Texas judicial system.  \nIII. CONCLUSION  AND PRAYER\nRespondent has suffered significant damages , which continue to accrue,  and unexplained \nand unethical behavior co ntinues to run afoul within this administrative region. He has provided \nthe Court and several judi"}
{"id": "56d0eb455754a64976e2f38d5a3e2a36a5e0dd27", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "suffered significant damages , which continue to accrue,  and unexplained \nand unethical behavior co ntinues to run afoul within this administrative region. He has provided \nthe Court and several judicial officers wi th multiple opportunities in tandem with the information \nneeded to address these pressing issues, but rather than address them, they continue to compound these issues for unknown reasons. \nTherefore, for all reasons stated herein, Respondent respectfully pray that this H onorable \nCourt: \n1.Grant this motio n to recuse;\n2.Effectuate a stay of these proceedings immediately to preserve the integrity o f\nthe Texas judiciary;\n3. Provide interim relief to the Respondent pursuant to Rule 18a(g)(4) that\nrestores his property interests ;\n4. Require the Petitioner and her counsel, for the first time in this matter, be\nrequired to provide a written response;\n5. Provide any further relief the Court deems just and right under these\ncircumstances.\nR\nespectfully,  \n/s/ Charles Dustin  Myers  \nCHAR LES DUSTIN MYERS \nCHUCKDUSTIN12@GMAIL.COM  \n817 -546-3693\n\n8 AFFIDAVIT OF CHARLES DUSTIN MYERS  \nINTRODUCTION AND VERIFICATION \nI, CH\nARLES DUSTIN MYERS, being of sound mind and over the age of eighteen (18) \nyears, hereby swear and affirm under penalty of perjury pursuant to Texas Civil Practice and \nRemedies Code § 132.001 that I am personally familiar with the facts stated herein, that I have personal knowledge of the matters stated in this affidavit, that the statements made herein are true and correct, and that I am competent to make this affidavit.  \nFACTUAL BACKGROUND  \n1. I am the Respondent in cause number 322-744263-23, styled \"Morgan Michelle Myers v.\nCharles Dustin Myers,\" currently pending in the 322nd District Court of Tarrant County,Texas.\n2.Since December of 2023, I have repeatedly attempted to address a fraudulent scheme todivest me of my business and property interests through proper legal channels. Each timeI have utilized legitimate legal pathways, I ha"}
{"id": "ce528477cc4de0f6f260b66840c1ca431ecb1397", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "23, I have repeatedly attempted to address a fraudulent scheme todivest me of my business and property interests through proper legal channels. Each timeI have utilized legitimate legal pathways, I have been met with procedural irregularitiesand violations that have prevented fair adjudication of my claims.\n3. The Regional Presiding Judge, Honorable David L. Evans, has been directly involved in\nhandling multiple recusal proceedings related to my case, and has consistently failed tofollow the mandatory procedures required by Texas law, as detailed below.\n4.I have exhausted all available appellate and administrative remedies in my attempts toseek redress. Despite filing multiple mandamus petitions with the Texas Supreme Court(cause numbers 25-0361, 25-0367, 25-0378, 25-0426, and 25-0458), I have received only\"Denied, per curiam\" responses without substantive consideration of the seriousprocedural violations occurring in my case.\n\n9 \n PROCEDURAL VIOLATIONS  \n5. On October 7, 2024, I filed a Joint Motion to Recuse Honorable Judges James Munford \nand Jeffrey Kaitcer, including supporting evidence and a properly executed affidavit as required by Texas Rule of Civil Procedure 18a. \n6. On October 8, 2024, at 4:42 P.M., I received correspondence from court coordinator \nLindsey Baker regarding the order of referral. Upon inspection, I discovered that both my \naffidavit and supporting exhibits had been removed from the motion that was sent to  \nRegional Judge Evans.  \n7. I immediately notified the court coordinator that the exhibits and affidavit were missing from the materials sent to Judge Evans. The coordinator confirmed that my exhibits were indeed filed electronically as one document with the lead document, in accordance with the Tarrant County District Clerk's Filing FAQ, which states: \"Same process for exhibit as initial filings - Exhibits should be merged into one document with the lead document.\"  \n8. On October 10, 2024, Judge James Munford filed an \"Amended Order of"}
{"id": "18014994256ec4462fcb9e2927c7859f8701dc5f", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "ich states: \"Same process for exhibit as initial filings - Exhibits should be merged into one document with the lead document.\"  \n8. On October 10, 2024, Judge James Munford filed an \"Amended Order of Referral,\" and once again the correspondence to Judge Evans was handled by the court coordinator Lindsey Baker rather than the clerk of the court as required by Rule 18a(e)(2).  \n9. This time, the coordinator claimed that the \"size of the motion\" justified splitting it into three separate files, this time including the exhibits and affidavit that had been previously omitted, thereby contradicting the earlier handling of the motion.  \n10. These actions directly violated Texas Rule of Civil Procedure 18a(e)(2), which explicitly states: \"When a respondent judge signs and files an order of recusal or referral, the clerk of the court must immediately deliver a copy to the regional presiding jud ge.\"\n\n10 \n 11. The law does not permit a court coordinator, who serves at the pleasure of the judge \nsubject to recusal, to handle this sensitive procedural matter. Instead of the neutral clerk of court processing these materials as required by statute, the court coordinator for the very judge whose impartiality was being questioned took possession of and modified the \nrecusal motion.  \nOBJECTIONS AND LACK  OF REMEDY  \n12. I timely filed formal objections to these procedural irregularities, including documentation of all email exchanges with the coordinator and the modifications made to my original motion.  \n13. My objection specifically stated that \"the explanation changed to the document being too large. This inconsistency raises concerns about transparency and procedural fairness.\"  \n14. Judge Evans took no action to remedy these procedural violations despite being properly notified of them.  \n15. After waiting four months for the judges to be reinstated as per Judge Evans' order, I had to personally reach out to the court coordinator to remind her to reinstate the trial judges. \n"}
{"id": "df38ad91f74528825175bb407a32c5b5fafafad6", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "f them.  \n15. After waiting four months for the judges to be reinstated as per Judge Evans' order, I had to personally reach out to the court coordinator to remind her to reinstate the trial judges. \n16. When I filed a second recusal motion naming Judge Munford as the respondent judge, Judge Evans issued an order addressing my objections regarding:  \na. The continued involvement of Lindsey Baker, the court coordinator; and  \nb. The erroneous order of referral sent by Judge Kaitcer.  \n17. In his order, Judge Evans stated: \"The court coordinators and clerks work together to assist the trial judges and the administrative judges. Only the judges, not the litigants, have the authority to direct the activities of the court coordinators and clerk s. Mr. Myers' \nobjections regarding the involvement are overruled.\"\n\n11 \n 18. This reasoning directly contradicts the plain language of Rule 18a of the Texas Rules of \nCivil Procedure, which does not designate any role to the court coordinator in the recusal process, and instead explicitly assigns these duties to the clerk of the cou rt. \nPATTERN OF CONDUCT AND HARM  \n19. As a direct result of these procedural violations and Judge Evans' failure to remedy them, \nI have suffered substantial harm, including but not limited to:  \n  a. Being denied access to the courts when I sought emergency relief for my  \n  youngest child who was facing a serious dental emergency;  \n  b. Being denied the opportunity for a fair hearing on my recusal motions;  \n  c. Having my properly filed motions improperly modified before being presented  \n  to the decision -maker;  \n  d. Being subjected to biased handling of critical procedural matters by non-neutral \n  staff members who serve at the pleasure of the judges whose impartiality I was  \n  challenging; and  \n  e. Suffering financial harm through the continued deprivation of my property and  \n  business interests while these procedural violations remain unaddressed.  \n20. In the face of a serious denta"}
{"id": "0cf5817ed5b9e0791f69fe197919017805cb3961", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "d  \n  e. Suffering financial harm through the continued deprivation of my property and  \n  business interests while these procedural violations remain unaddressed.  \n20. In the face of a serious dental emergency for my youngest child, I opened a separate \nSAPCR suit, arguing for dominant jurisdiction, only to be denied access to the courts by Judges Kate Stone and Kenneth Newell, which prevented an emergency TRO needed for the safety and welfare of my children. This negligence led to a direct injury to my youngest child.\n\n12 \n 21. After the SAPCR was improperly consolidated by Judge Newell, Judge Munford moved \nthe case toward final disposition, which I promptly objected to. My objections were ignored.  \n22. This pattern of procedural violations has persisted despite my repeated, documented \nefforts to seek proper administration of justice through the channels provided by Texas \nlaw. \nLEGAL AUTHORITIES  \n23. Texas Rule of Civil Procedure 18a establishes mandatory procedures for the recusal of \njudges, including the requirement that \"the clerk of the court must immediately deliver a copy [of the recusal motion] to the regional presiding judge\" under Rule 18a(e)(2).  \n24. The Texas Constitution Article V , Section 1 -a provides that judges may be removed for \nincompetence, partiality, oppression, official misconduct, or failure to execute their official duties.  \n25. Texas Government Code § 33.001 defines judicial misconduct to include willful or persistent violation of rules promulgated by the Supreme Court of Texas and willful or persistent conduct that is clearly inconsistent with the proper performance of judicial duties.  \n26. Texas Penal Code § 39.02 prohibits abuse of official capacity by public servants, providing that a public servant commits an offense if, with intent to harm another, they intentionally or knowingly violate a law relating to their office.  \n27. Texas Penal Code § 39.03 prohibits official oppression, stating that a public servant commits an o"}
{"id": "f3fde13a7efc22ce84087bd5d5f47053f046689e", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "intent to harm another, they intentionally or knowingly violate a law relating to their office.  \n27. Texas Penal Code § 39.03 prohibits official oppression, stating that a public servant commits an offense if they intentionally deny or impede another in the exercise of their rights, privileges, powers, or immunities, knowing their conduct is unlawful.\n\n13 28.Under established Texas case law, recusal is required not only for actual bias but also\nwhere procedural irregularities create an appearance of impropriety or reasonable doubtas to a judge's impartiality. See Sears v. Nueces County Sheriff Olivarez , 28 S.W.3d 611\n(Tex. App. 2000) .\n29.The Texas Supreme Court has emphasized that judges must strictly adhere to recusalprocedures to preserve public confidence in the judiciary. See In re Inquiry ConcerningHonorable Bonnie Rangel , 677 S.W.3d 918 (Tex. 2023) .\nCONCLUSION AND PRAYER FOR RELIEF  \n30.Based on all the fo regoing facts, I respectfully assert that Judge David L. Evans has  \ndemonstrated a pattern of disregard for the mandatory recusal procedures established by \nTexas law, creating both an appearance of impropriety and reasonable doubt as to his \nimpartiality in  handling matters related to my case.\n31.His failure to adh ere to the clear req uirements of Rule 18a, combin ed with his explicit  \napproval of non-n eutral staff han dling sensitive recusal materials in  contravention of \nthe rule's plain language, constitutes grounds for recusal under Texas law.\n32.I respectfully request that this Honorable Court:\na.Grant this first amended motion to recuse Judge David L. Evans;\nb.Effectuate an immediate stay of these proceeding s to preserve the integrity of\nthe Texas judiciary;  \nc. P\nrovide interim relief pursuant to Rule 18a(g)(4) that restores my property\ninterests;  \nd. Require the Petitioner and her counsel to provide a written response to theallegations contained herein; and\n\n14 e. Provide any further relief the Court deems just and right under these\nci"}
{"id": "08ac3c81a5da53d5b0c0227e6ce2789fced38bb3", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1\\09_11_25_first_amended_motion_to_recuse_the_regional_presiding_judge_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\09.11.25 - FIRST AMENDED MOTION TO RECUSE THE REGIONAL PRESIDING JUDGE-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 1913, "text": "rests;  \nd. Require the Petitioner and her counsel to provide a written response to theallegations contained herein; and\n\n14 e. Provide any further relief the Court deems just and right under these\ncircumstances.  \nF\nURTHER AFFIANT SAYETH NOT.  \n___\n________________________ \nCHARLES DUSTI N MYERS  \nC\nHUCKDUSTI N12@GMAIL.COM  \n817 -546-3693\nPRO-SE RESPONDENT\n \n \nState of Florida\nCounty of Bay County \nSworn to (or affirmed) and subscribed before me by means of online notarization,\nthis 09/11/2025 by Charles Dustin Myers.\nSeth Riggs\n___ Personally Known OR ___ Produced Identification\nType of Identification Produced _______ DRIVER LICENSE\n\n15 CERTIFICATE OF SERVICE \nRespondent certifies that on 09/11/2025, a true and accurate copy of this FIRST \nAMENDED MOTI ON TO RECUSE THE REGIONAL PRESIDI NG JUDGE was served upon \nall parties of record pursuant to rule 21a of the Texas Rules of Civil Procedure. \n/\ns/ Charles Dustin Myers  \nC HARLES DUSTI N MYERS  \nC\nHUCKDUSTI N12@GMAIL.COM  \n817 -546-3693\nPRO-SE RESPONDENT\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 105511953\nFiling Code Description: Amended Filing\nFiling Description: First Amended Motion to Recuse the Regional\nPresiding Judge\nStatus as of 9/12/2025 3:39 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n9/11/2025 3:04:22 PM\n9/11/2025 3:04:22 PM\n9/11/2025 3:04:22 PM\n9/11/2025 3:04:22 PMStatus\nSENT\nSENT\nSENT\nSENT"}