{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\09.20.24 - RULE 12 MOTION-1.pdf",
  "base_name": "09_20_24_rule_12_motion_1",
  "page_count": 7,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 322-744263-23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , TEXAS \n \n \nTo the Honorable Judge of the 322nd District Court of Tarrant County: \nI. THE LAW  \nThere is a general presumption that an attorney is acting with authority; \nhowever, that presumption is rebuttable. Breceda v. Whi, 187 S.W.3d 148, 152 \n(Tex. App. --El Paso 2006, no pet.); Kelly v. Murphy, 630 S.W.2d 759, 761 \n(Tex. App. --Houston [1st Dist.] 1982, writ ref'd n.r.e.); see also City of San \nAntonio v. Aguilar, 670 S.W.2d 681, 684 (Tex. App. --San Antonio 1984, writ \ndism'd) (\"[A]n attorney who has conducted a case in the trial court is \npresumed to have authority to pursue an appeal, although this presumption can \nbe rebutted.\").  Here, however, this presumption is to be rebutted for the \nforegoing reasons:  \n Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. Respondent ’s Rule 12 Motion to Show \nAuthority  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2024 -09-20",
      "char_length": 966
    },
    {
      "page_number": 2,
      "text": "2 \n I. Legal Basis for Rule 12 Motion  \n2. Pursuant to Tex. R. Civ. P. § 12, a party may challenge an attorney’s \nauthority to act on behalf of a party in a proceeding.  When such a challenge is \nraised, the burden of proof shifts to the challenged attorney to demonstrate \ntheir authority to represent the party.  Id. The attorney must appear before the \ntrial court and show sufficient authority to prosecute or defend the suit on \nbehalf of their client. (Breceda v. Whi (2006) 187 S.W.3d 148, 152; Kelly v. \nMurphy (1982) 630 S.W.2d 759, 761).  \n3. Rule 12 of the Texas Rules of Civil Procedure permits any party to \nchallenge an attorney’s authority to prosecute or defend a lawsuit. (See Nolana \nOpen MRI Ctr.,  Inc. v. Pechero (2015) No. 13- 13-00552-CV , at *15). The \npurpose of a Rule 12 motion is to protect parties from groundless suits and to \npermit dismissal of suits instituted without authority. (See Nicholas v. Envtl. Sys. (Int’l) Ltd.  (2016) 499 S.W.3d 888, 895; Angelina Cty. v. McFarland \n(1964) 374 S.W.2d 417, 422–23).  \n  4. Here, the procedural inconsistencies, lack of formal notice, and \nsubmission of documents by other parties on behalf of Ms. raise substantial \ndoubts about whether she possesses the necessary authority to represent the \nPetitioner.  Despite being allegedly retained on January 22, 2024, Ms. Carter \nhas not filed a formal notice of appearance, leaving her role ambiguous. Further complicating matters, filings under her name have been submitted by \nothers, including the founder of Marx Altman & Johnson, her purported \nformer employer.  Coupled with her suspiciously timed State Bar profile \nupdate and lack of meaningful engagement, these facts compel the Respondent to seek clarification and challenge her authority under Rule 12.",
      "char_length": 1784
    },
    {
      "page_number": 3,
      "text": "3 \n II. Procedural Basis \n 5. No Formal Notice of Appearance Filed.  Although Cooper Carter \nwas allegedly retained on January 22, 2024 , she has not filed a formal Notice \nof Appearance in this case. The absence of a Notice of Appearance creates \nsubstantial ambiguity regarding her authority to represent the Petitioner, \nespecially given the procedural irregularities discussed below.   \n  6. Lack of engagement.  Throughout the proceedings, Ms. Carter \nhas cons istently failed to engage in any meaning ful way  and has failed \nto respond to any pleadings  in the suit.  \n  7. Filings Submitted on Behalf of Cooper Carter . All court \ndocuments and pleadings attributed to Ms. Carter have been submitted \"on her \nbehalf\" by Roderick Marx , the founder of Marx Altman & Johnson . There \nis no indication that Ms. Carter  is directly involved in this matter, raising \nsignificant questions about whether she is properly authorized to act as \ncounsel for Morgan Michelle Myers.  \n    8. Discrepan cies in employment.  On Ms. Carter ’s public social \nmedia, she claims to be a former attorney for Marx Altman & Johnson and claims to be employed currently with Cantey Hanger LLP.\n1 The timeliness of \nher profile aligns with the public article releas ed by Cantey Hanger LLP \n \n1 Ms. Carter's public LinkedIn proﬁle",
      "char_length": 1314
    },
    {
      "page_number": 4,
      "text": "4 \n themselves.2 Further, Every attorney in Texas is required by law to maintain a \ncurrent and up-to-date profile. Tex. Gov’ t Code § 81.115. Notably, Ms. \nCarter ’s profile was updated on March 13th, 2024, one day prior to the only \nhearing that has occurred in this matter3 to her former employer . The \nRespondent has actively been seeking relief from the result of the \naforementioned hearing for nearly seven months without any engagement or \nany authoritative activity from Ms. Carter , thus warranting this motion.  \nIII. Prayer and Relief  \n9. Given the ongoing procedural irregularities and the apparent lack of \nclarity surrounding Cooper Carter’s authority to represent Petitioner Morgan \nMyers , the Respondent respectfully requests the following: \ni.  The Court should schedule a hearing requiring Cooper Carter to \npersonally appear and definitively prove her authority to represent \nMorgan Myers , and to provide clarification as to who is involved in \nthe case, and in what capacity Morgan Michelle Myers is being \nrepresented  in this matter.  \nii.  \"Upon [her] failure to show such authority, the court shall refuse \nto permit the attorney to appear in the cause, and shall strike the \npleadings if no person who is authorized to prosecute or defend \nappears. \" (Tex. R. Civ. P. 12; see Kindle v. Wood Cnty. Elec. Co-op, Inc.  \n(2004) 151 S.W.3d 206, 210)  \n \n2 News article corroborating employment timeline  \n3 Ms. Carter ’s Texas State Bar proﬁle .",
      "char_length": 1470
    },
    {
      "page_number": 5,
      "text": "5 \n iii.  Grant of Summary Judgment Motion: Given that the \nRespondent’s pending summary judgment motion filed on February \n26th, 2024,  remains unchallenged due to the lack of any meaningful \nengagement from Cooper Carter, and in light of the procedural \ndeficiencies highlighted above, the Court should grant the pending \nsummary judgment via the attached order as unopposed for judicial \nefficiency and to reset the status quo ante. \niv.  Stay all other formal settings and proceedings until resolution of \nthis motion.  \nv.  Respondent seeks no further sanction s against Ms. Carter \ngiven she fails to show her authority over the Petitioner in this \nmatter.  \n \n Respectfully submitted,  \n \nRespectfully Submitted,  \n/s/ Charles Dustin Myers  \nCharles Dustin Myers  \nChuckdustin12@gmail.com  \n1-817 -507 -6562",
      "char_length": 814
    },
    {
      "page_number": 6,
      "text": "6 \n CERTIFICATE OF SERVICE  \nRespondent hereby certifies that on 09/20/2024, a true and correct copy \nof  the Respondent ’s Rule 12 Motion to Show Authority was served on the \nfollowing parties via electronic service through the Electronic Filing \nManager (EFM) and via email to the email address on record, pursuant to \nTexas Rules of Civil Procedure 21a and 191.4.  \nServed to: \n• Morgan Michelle Myers , Petitioner via electronic filing system.  \n• Cooper Carter, Counsel for Petitioner via electronic filing system.  \n• Email Addresses for Service:  \ncoopercarter@majadmin.com & morganmw02@gmail.com  \n \n \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148  \nchuckdustin12@gmail.com  \n817-507-6562",
      "char_length": 733
    },
    {
      "page_number": 7,
      "text": "7 \n Certificate of Conference  \nPursuant to the Tarrant County Local Rule 4.01(10)(b), a conference \nwas not held with Cooper L. Carter on the merits of this motion because \nCooper Carter failed to respond to email correspondence sent on 09/17/2024.  \n \n/s/ Charles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148  \nchuckdustin12@gmail.com  \n817-507-6562  \n \nState of Texas\nCounty of Johnson\nSworn to and subscribed before me\non 09/20/2024 by Charles Dustin Myers.\nElectronically signed and notarized online using the Proof platform.",
      "char_length": 556
    }
  ]
}