{
  "source": "C:\\code\\LEGAL_DESTROYER\\INCONSISTENCIES\\12.22.23 - APPLICATION FOR PROTECTIVE ORDER-1.pdf",
  "base_name": "12_22_23_application_for_protective_order_1",
  "page_count": 6,
  "pages": [
    {
      "page_number": 1,
      "text": "14 \nCause No.:322 7 4 4 5-3 8 2 3 \nApplicant: _f\\f\\~~t---=Ga...,...(\\ ___ r-1___._rl\\__,\\......,_U ............ h:1.......,1 E~N\\~i '=~~ g~-s __ § \n§ \n§ \n§ \n§ \n§ \n§ In the \nV. of \nRespondent: (J\\A~ll S b1)S,1IN Mi(;J<S \nApplication for Protective Order \n1 Parties \nName: County of Residence: \nApplicant: M~l¼Acl M1C\\:\\Hl£ MVE (2..S 1A12-\\'LAN r \nRespondent: (',\\\\ A (lU~:S Qvs:nr1 Mi F (2.S 'AA (2..A N-r \nRespondent's address for service: _,\\\"'\"\"e lp,.____,4---'l----'-A~N-'--'N--'--\"-f:_,t,'-,__,yJ..___._,1\\~1A_\\J\"-'G\"'\"'A_11-1-'---'-'-'f.. __ :1.....,._lp...._\\_,_4\" .... '£'-----------\nCheck all that apply: \n-IZL The Applicant and Respondent are or were members of the same family or household. \noZL The Applicant and Respondent are parents of the same child or children. \n□ The Applicant and Respondent used to be married. \nO The Applicant and Respondent are or were dating. \n□ The Applicant is an adult asking for protection for the Children named below from child abuse and/or \nfamily or dating violence. \nO The Applicant is dating or married to a person who was married to or dating the Respondent. \n2 Children: The Applicant is asking for protection for these Children under age 18: \nName: Is Respondent the biological parent? County of Residence: \na. MA R--A · tV D rJ rJ[ MV ERS ~ '(es D No __ -r:__,_A__,f-~(2..--'A-'-'-N,.c:_f'-- ____ _ \nb. ( ~()l\\ NE (?J)S,F N\\Yt;]Z-S [d_Yes □ No __ t1.,_,£r'e,...........,..i..;..t2--..:...i& ....... rJ,;;_1 _____ _ \nc. • □ Yes D No \nd. □ Yes □ No \nCheck all that apply: \n□ Other children are listed on a sheet attached to this Application. \ng]_ The Children are or were members of the Applicant's family or household. \nD The Children are the subject of a court order affecting access to them or their support. \n3 Other Adults: The Applicant is asking for protection for these Adults, who are or were members of the \nApplicant's family or household, or are in a dating or marriage relationship with the Applicant. \nName: County of Residence: \na. \nb. \n4a Other Court Cases: Are ·there other court cases, like divorce, custody, support, involving the Applicant. Respondent, \nor the Children? \n(I Yes□ No \nIf \"Yes,\" say what kind of case and if the case is active or completed. \nD\\\\/DRC,£\" -A cr,vf \nIf \"completed,\" (check all that apply): □ A copy of the final order is atta-ched. \n.A.;Jp!lcat!or' ror Protestive O~de:-\nForm Approved by the Su::ireme Court of Texas □ A copy of the final order will be filed before the hearing on this Application. \nD The Texas Office of the Attorney General Child Support Division has been \ninvolved with a child support case. List the agency case number for each \nopen case, if known. Case Number: \nPage 1 of 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2867
    },
    {
      "page_number": 2,
      "text": "15 \n4b Presumption of Family Violence: Has the Respondent ever been convicted of or placed on deferred adjudication \ncommunity supervision for any crime under Title 5 or Title 6 of the Texas Penal Code? (see list of crimes at the \nend of the kit) • \n□Yes filNo \nIf \"Yes,\" say what kind of case: \nIf the Respondent was convicted or placed on community supervision for a Title 5 crime, did the Court make a \nfinding that the crime involved family violence? \n□Yes □No \nWas the crime against a child listed in this petition under Number 2 ;'Children\"? \n□Yes □No \nHave the Respondent's parental rights to this child been terminated? \n□Yes □No \nIs the Respondent seeking or attempting to seek contact with this child? \n□Yes□ No \n5 Grounds: Why is the Applicant asking for this Protective Order? Check one or both: \n~ The Respondent committed family violence. \n□ The Respondent violated a prior Protective Order that expired, or will expire in 30 days or less. A copy of the \nOrder is (check one): -• □ Attached, or \n□ Not available now but will be filed before the hearing on this Application \nThe Applicant requests a PROTECTIVE ORDER and asks the Court to make all Orders marked with a check V \n6 v Orders to Prevent Family Violence \nThe Applicant asks the Court to order the Respondent to (Check all that apply): \na. V, Not commit family violence against any person named on page 1 of this form. \nb. • ~ Not communicate in a threatening or harassing manner with any person named on page 1 of this form. \nc. ~ Not communicate a threat through any person to any person named on page 1 of this form. \nd. el' Npt communicate or attempt to communicate in any manner with (Check all that apply): \nE1 Applicant □ Children □ Other Adults named on page 1 of this form. \nThe Respondent may communicate through: ____________ or other person the Court \nappoints. Good cause exists for prohibiting the Respondent's direct communications. \ne. i{ N9\"t go within 200 yards of the (Check all that apply): • \n~ Applicant □ Children □ Other Adults named on page 1 of this form. \nf. { Not go within 200 yards of the residence, workplace, or school of the (Check all that apply): \nf:{· Applicant □ Other Adults named on page 1 of this form. \ng. rJ Not go within 200 yards of the Children's residence, child-care facility, or school, except as specifically \n/ authorized in a possession schedule entered by the Court. \nh. ~ Not stalk, follow, or engage in conduct directed specifically to anyone named on page 1 of this form that is \nreasonably likely to harass, annoy, alarm, abuse, torment, or embarrass them, including tracking or \nmonitoring a car or other property. \nThe Applicant asks the Court to: \ni. Dt Suspend any license to carry a handgun issued to the Respondent by the State of Texas. • \nj. ~ Require the Respondent to complete a battering intervention and prevention program; or if no such program \nis available, counseling with a social worker, family service agency, physician, psychologist, licensed \ntherapist, or licensed professional counselor;· and pay all costs for the counseling or treatment ordered. \nk. □ Prohibit the Respondent from taking, harming, threatening, or interfering with the care, custody, or control \nof the following pet, companion animal, or assistance animal: _________ (describe the \nanimal). \nI. D Require the Respondent to follow these provisions to prevent or reduce the likelihood of family violence: \nThe law requires a trial court issuing a protective order to prohibit the Respondent from possessing a firearm or \nammunition, unless the Respondent is a peace officer actively engaged in employment as a sworn, full-time paid \nemployee of a state agency or political subdivision. \nApp!icn~ion for P;otec::ive Orde'\" \nForm Approved by the Supreme Court of Texns Page 2 of 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 3970
    },
    {
      "page_number": 3,
      "text": "16 \n7 ~ Property Orders \nThe Residence located at: lolo4\\ ArJNE c;f W:61/?<\\)GA I TX ]\\o \\M \n(Check one): ~is jointly owned or leased by the Applicant and Respondent; \n□ is solely owned or leased by the Applicant; or \n□ is solely owned or leased by the Respondent; and the Respondent is obligated to support the Applicant \nor a child in the Applicant's possession. \nThe Applicant also asks the Court to make these orders (Check all that apply): \n~ The Applicant to have exclusive use of the Residence identified above, and the Respondent must vacate \nthe Residence. \ntL The sheriff, constable, or chief of police shall provide a law enforcement officer to accompany the Applicant to the \nResidence, to inform the Respondent that the Court has ordered the Respondent excluded from the Residence, to \nprovide protection while the Applicant takes possession of the Residence and the Respondent removes any neces­\nsary personal property, and, if the Respondent refuses to vacate the Residence, to remove the Respondent from \nthe Residence and arrest the Respondent for violating the Court's Order. \n\"©.. The Applicant to have exclusive use of the following propert that the Applicant and Respondent jointly own or lease: \nI . t1. :T ' \nill The Respondent must not damage, transfer, encumber, or otherwise dispose of any property jointly owned or \nleased by the parties, except in the ordinary course of business or for reasonable and necessary living expenses, \nincluding, but not limited to, removing or disabling any 'Jehicle O'Nned or cossessed 'cy the Aoplicant or jointly \nowned or possessed by the parties (whether so titled or not). \n8 ilSpousal Support Order \nThe Applicant is married to the Respondent or otherwise legally entitled to support from the Respondent and asks \nthe Court to order the Respondent to pay support in an amount set by the Court. \n9 R..Orders Related to Removal, Possession, and Support of Children \nThe Respondent is a parent of the following of the Applicant's children: Mf\\'e-f\\ pJ Dt:l rJE: /J\\i ctS c AtDt , f\\l E flose rAt e tz-~ \nAnd, the Applicant asks for these O~ders in the best interest of the people named on page 1 of this form. \nCheck all that apply: \ncE1. The Respondent must not remove the children from the Applicant's possession or from their child-care facility or \nschool. except as specifically authorized in a possession schedule entered by the Court. \n~ The Respondent must not remove the children from the jurisdiction of the Court. \n@. Establish or modify a schedule for the Respondent's possession of the Children, subject to any terms and conditions \nnecessary for the safety of the Applicant or·the Children. \n~ Require the Respondent to pay child support in an amount set by the Court. \n10 I/Temporary Ex Pa rte PROTECTIVE ORDER \nBase.d on the information in ·the attached Affidavit or Declaration, there is a clear and present danger of family violence \nthat will cause the Applicant, Children, or Other Adults named on page 1 of this form immediate and irreparable injury, \nloss, and damage, for which there is no adequate remedy at law. Applicant asks the Court to issue a Temporary Ex Parte \nProtective Order immediately without bond, notice, or hearing. \n11 fi.Ex Pa rte Order: Vacate Residence Immediate Ix · \nThe Applicant now lives with the Respondent at: ~lef\\ Acl~E C( W~Tf\\vGl'.\\1T-i tlo \\4& or has resided at this \nResidence within the 30 days prior to filing this Application. The Respondent committed family violence against a \nmember of the household within the 30 days prior to the filing of this Application, as described in the attached \nAffidavit or Declaration. There is a clear and present danger that the Respondent is likely to commit family violence \nApplication for Protective Or~ier \n. Form Aporoved by the Supreme Court of Tex::is Page 3 of 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 3999
    },
    {
      "page_number": 4,
      "text": "17 \nagainst a member of the household. The Applicant is available for a hearing but asks the Court to issue a Temporary \nEx Parte Protective Order immediately without bond, notice, or hearing: \n• Granting the Applicant exclusive use and possession of the Residence and ordering the Respondent to vacate \nthe Residence immediately, and remain at least 200 yards away from the Residence pending further Order of the \nCourt; and \n• Directing the sheriff, constable, or chief of police to provide a law enforcement officer to accompany the Applicant \nto the Residence, to inform the Respondent that the Court has ordered the Respondent to vacate the Residence, \nand to provide protection while the Applicant either takes possession of the Residence or removes necessary \npersonal property. \n12 VKeep Information C~nfidential \nThe Applicant asks the Court to keep addresses and telephone numbers for residences, workplaces, schools, and \nchildcare facilities confidential. The Applicant asks the Court to order the Court Clerk to strike contact information for \nProtected People, including: addresses, mailing addresses, county of residence, telephone numbers, places of \nemployment, businesses, child-care facilities, and schools from the public records of the Court, and maintain a • \nconfidential record of this information. The Applicants asks the Court to prohibit the Court Clerk from releasing \ncontact information of Protected People except to the Court or to law enforcement for the purpose of entering the \ninformation into the Department of Public Safety law enforcement information system. The Applicant asks the \nCourt to order that all contact information of Protected People be confidential. \nThe Applicant asks the Court to order that the following person is designated as a person to receive any notice \nor documents filed with the Court related to the Application on behalf of tr,e .Applicant: \nName: M~~~\\E ~\\L~ON Address:\\ ?f;o A N~ ex \\tJ fff MlG,A , -U :1 lei 111'. \nThe Applicant asks the Court to order that the Applicant's address is confidential and shall only be disclosed to the \nCourt. \nWARNING: A copy of this court document will be served to the respondent with any information that you include \navailable for public inspection. Marking the box on number 12 means that you are asking the judge to order the \nclerk to remove some addresses and telephone numbers from the final order in this case so that the public cannot \nsee them. If you are requesting this, DO NOT INCLUDE this personal information in this form OR a temporary ex \npa rte protective order form. \n13 v' Fees And Costs \nThe Applicant asks the Court to order the Respondent to pay fees for service of process, all other fees and costs of \nCourt. and reasonable attorneys· fees, if applicable. \nI ha_ve read the entire Application and it is true and correct to the best of my knowledge .. \n~afb2 \nApplicant, Pro \nAddress where Applicant may be contacted: le~4\\ Ab\\tJf C;( \\;JkifruGA 1 \\K 10 l~ \nPhone# where Applicant may be contacted: ( g \\ 1) q4-0-OiS--z \n(List another address/phone if you want yours kept confidential) Fax#:------~----\nA;ipl1c;:it1on for Protec:ive Orde: \nForni A.corcve1j by tre-• .Su8rs<rA Court c:f Te'<.8S Page 4 of 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 3404
    },
    {
      "page_number": 5,
      "text": "18 \nAFFIDAVIT \nCounty of :=[A)2..\\'<.f,\\ J\\l 'r \nState of Texas Use this form if YOU WANT your Date of Birth \nand Address to REMAIN CONFIDENTIAL. \nYou will need to have it SIGNED BY A NOTARY. \nDo NOT use the Declaration form \nif you use this form. \nMy name is ,N\\O(LGf\\t,.\\ tM:}J\\\\t\\\\1 llt Mjf g,5 (First Middle Last). I am 31 years old and otherwise \ncompetent to make this Affidavit. The information and events described in this Affidavit are true and correct. \n1. Describe the most recent time the Respondent hurt you or threatened to hurt you: \n:lliLP Mt I DES(&\\J~D :TO pf P-,(:,c,(T VP, -n-tA1 ANaDttR.\\NoN\\ftN S±h)LILD U)Mt \n,, K.\\t~ Mi ASS''. \n2. In which county did this happen? ·1 A],~ A-N 1\" \n3. What date did this happen?~/ JL / 23 \n4. Was a weapon involved? □ Yes l9 No If yes, what kind? _______________ _ \n5. Were any children there? '.&Yes D No If yes, who? t'.J0i:tA rNtt~-\\-0MQUN~ fJ\\''lt:e.<; \n6. Did anyone call the police? D Yes f&No If yes. what happened? _____________ _ \n7. D_id you get medical care? □ Yes ~No If yes, describe your injuries: -'--. ___________ _ \nHas the Respondent ever threatened or hurt you before? Describe below in detail how the Respondent threatened or \nhurt you, including date(s) if possible. • \n.N'.\\\\JLilt?lt MENTIONS Of \"WF J\\JST r-1ffD --ro AJC/<\" AtJD OTll:fr?: S~'l\\lAkl'I \nWN'--r vJANT ro Sth)w/PAtDctPATE trJ fb\\l'{Af PfNSICll:L AEf:~r,orJ. \n9. Were weapons ever involved? □ Yes [B.. No If yes, what kind? _______________ _ \n10. Were any children there? ~Yes □ No If yes. who? Mf<'r~A f'J\\i~R--5 t CAJ?PLlrJ~ Mimes \n11. Have the police ever been called? D Yes fl1. No \n12. Did you ever have to get medical care? □Yes ~No If yes, describe your injuries: ___________ _ \n13. Has the Defendant ever been convicted of family violence? Yes ~ \nIf yes, list when and in which county and state the convictions occurred: ________________ _ \nOn lZ._1J~;_23 the Applicant Mo~GAN f\\l\\'ffl<S \npersonally appeared before me, the undersigned notary. After being \nsworn. the Applicant stated that she/he is qualified to make this \noath. that sheihe has read the foregoing Application and Affidavit, \nthat she/he has personal knowledge of the facts asserted. and the \nfacts asserted are true and to the best of herihis knowledge and \nbelief. Subscribed and sworn before me on \nApplication :or Pr::itecli'1e O,de, \nForm A,;::prcved by :t-e Su;:;:-e:-r.e Ct>~rt c! T-::~_\\as Page 5 of 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2596
    },
    {
      "page_number": 6,
      "text": "19 \nDECLARATION Use this form if you w1;1nt your Date of Birth and \nAddress to be public information (not confidential). \nCounty of ·rM\\2/\\r,!1\" \nState of Texas You will NOT need to have it signed by a notary. \nDo NOT use the Affidavit form \nif you use this form. \nMy name is M 0126A N M IC,ti11Jf rv\\Yf:'(25 (First Middle Last), my date of birth is ID 'D2 I V1 r,,_ 1. \nandmyaddr~is Ldo41 ANN( CT (Street), ___ ..,,...-___________ _ \n(City), \\rJAJfnJGA (State), (i (Zip Code) 11a 14::% (Country) :f ()St\\ \nI declare under penalty of perjury that the foregoing is true and correct. \n1.,2-r'D \nExecuted in IA:)'L@.A-NTc unt. State of~ day of Pfc. (Month), ·'Zoi.3 (Year). \n------,,4-,L-\\:::,-''-\"-'-'\"'---\"\"\"'--'-½,..,c;_-------- (Declarant Signature). \n1. Describe the most rece time the Respondent hurt you or threatened to hurt you: \n• --foLD N't I DfSE12-\\/8 D 10 I~£\" &A, I )P, -n+A:, AtJ DTti:EJ?-\\rJOMArJ st-touLD \n(,o N\\f ''ll.\\C'? Mi A~s'' • \n2. In which county did this happen? 1Afl2A1,.rr \n3. What date did this happen? JL / JJL / -2 ~ \n4. Was a weapon involved? \n5. Were any children there? \n6. Did anyone call.the police? \n7. Did you get medical care? □Yes&] i'lo \n~Yes □ No \n□Yes~ No \n□ Yes [21 No If yes. what kind? ______________ _ \nIf yes, who? MkLA M~ rts -t CA:rc.-0 lA N~ [A y 82-), \nIf yes, what happened? ____________ _ \nIf yes, describe your injuries: ___________ _ \n8. Has the Respondent ever threatened or hurt you before? Describe below in detail how the Respondent threatened \nhurt you, including date(s) if possible. \nt/1Vl~1e1 £ MfN1\\l)rJ~ OE'' WE ~usT rJEEJ> -ro PVtt'· p.,-Jp o:ntB'2-se:xuALL:-/ \nAGGl?-f\"SSNE (,Qt/lN'.\\£N,S, I A'-I1/\\IG L\"11 \nfxD AIAK-ED WHEN t Pl?:EV\\Du~L-1 SA1J> DorJr \nwArJI To s~h>w I PAtJJ c,PA1E 1N 4N'l eth'S1CAL AfE£tr1 DrJ-\n9. Were weapons ever involved? □ Yes &No \n10. Were any children there? G4'es □ No If yes, what kind?----------~---­\nIf yes, who? r{\\k-2.A M-/f'f_,<; .. CA\\2.-0 1--lN t MYrY-.S \n11. Have the police ever been called? □ Yes fl.No \n12. Did you ever have to get medical care? D Yes· ~o 'If yes. describe your injuries: -------,------\n13. Has the Defendant ever been convicted of family violence? ,JD \nIf yes, list when and in which county and state the convictions occurred: ---------------\nApp1icantsigD$8 \nAppiicat1on for Protective Order \nForm Acoroved by :re Su:;re...,...,,e Ccurt ~)f Tex:;::; Page 5 of. 5 \n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/15/2024\nCatherine Saenz",
      "char_length": 2559
    }
  ]
}