{"id": "4928daf965dd5834a9139b6cb3c27dead1872ae4", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322-744263-23 \n  \nIN THE MATTER OF                                                    IN THE DISTRICT COURT \nTHE MARRIAGE OF                                                  \nMORGAN MICHELLE MYERS  \nAND                                                322ND JUDICIAL DISTRICT \nCHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF  \nM.E.M. AND C.R.M.,  \nCHILDREN                                                                       TARRANT COUNTY, TEXAS  \n \nMOTION FOR NO- EVIDENCE SUMMARY JUDGMENT  \nTO THE HONORABLE JUDGE OF THE COURT: \nI. Introduction  \n Respondent Charles Dustin Myers (hereinafter “Father”) moves for no-evidence \nsummary judgment pursuant to Texas Rule of Civil Procedure 166a(i) to dismiss all claims filed \nby Petitioner Morgan Michelle Myers (“Mother”). After an adequate time for discovery has \npassed, Rule 166a(i) authorizes summary judgment on the ground that there is no evidence of \none or more essential elements of a claim on which the adverse party would bear the burden of \nproof at trial. This rule is “essentially a pretrial directed verdict”  procedure, shifting the burden \nto the non-movant to produce more than a scintilla of probative evidence once a proper motion is \nfiled. Here, Father specifically identifies each essential element of Mother’s claims for which no \nevidence exists. Because Mot her has failed to produce any evidence to support those elements § \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n \n 322-744263-23\nFILED\nTARRANT COUNTY\n11/5/2025 12:48 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n2 \n despite nearly two years of litigation, the Court must grant summary judgment in Respondent’s \nfavor unless Mother comes forward with competent evidence raising a genuine fact issue.  \n In this case, more than 22 months have elapsed since Mother initiated the divorce, and \nshe has produced nothing to substantiate her serious allegations of family violence, the existence \nof a protective order, financial indigence, or the supposed benefit of onerous temporary order"}
{"id": "e71c40cc0108e2e7c8bcb42dec5ee788841ade77", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " and \nshe has produced nothing to substantiate her serious allegations of family violence, the existence \nof a protective order, financial indigence, or the supposed benefit of onerous temporary orders to \nthe children. She also ignored written discovery requests, allowing requests for a dmission to be \ndeemed admitted by operation of law. Texas law does not permit a claimant to continue a lawsuit \nin the absence of evidence. Indeed, courts have not hesitated to dispose of divorce -related claims \nby summary judgment where a spouse lacks evidence on an essential fact – for example, an \nalleged informal marriage was summarily dismissed when one party was underage and “there was no evidence”  of the required parental or court consent. Likewise, Mother’s claims here \nshould be conclusively resolved now. After such a prolonged and unsupported litigation and two \nyears of substantial damages, Respondent is entitled to judgment as a matter of law.  \nII. Background and Undisputed Facts  \n1. Father incorporates by reference the  chronology of events  in this case leading up to May \n27, 2025, which are drawn from the Father’s Statement of Facts as outlined in his “Third \nAmended Motion to Consolidate” which exists in the public domain, and has been served on the opposing party.  See Third Amended Consolidated Mandamus Record – p.6-36; See also Second \nAmended Consolidated Mandamus Record. Both of these documents have been duly served on \nthe opposing party, who continues to remain silent on the issues within this matter.  No factual \nstatements are in dispute at the time of filing this motion for no -evidence summary judgment  \nwhich  is November 5, 2025.\n\n3 \n III. Legal Standards  \nA. No -Evidence Summary Judgment Under Rule  166a(i) \n2. Under Texas Rule of Civil Procedure 166a(i), after an adequate time for discovery, a \nparty may move for summary judgment on the ground that there is “no evidence”  of one or \nmore essential elements of a claim or defense on which the non -"}
{"id": "9bce2322d17c4c67e87576c52df021d05f520eee", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "(i), after an adequate time for discovery, a \nparty may move for summary judgment on the ground that there is “no evidence”  of one or \nmore essential elements of a claim or defense on which the non -movant would bear the burden of \nproof at trial. The rule was added in 1997 to provide a mechanism analogous to a directed verdict \nbefore trial , allowing courts to dispose of baseless claims or defenses at the summary judgment \nstage. The movant is not  required to present evidence in support of a no-evidence motion; rather, \nthe motion itself can be based solely on the absence of evidence in the record.  \n3. A proper no-evidence motion must  state the specific elements as to which there is no \nevidence, and it must not be conclusory or overly general. The purpose of this specificity requirement is to give fair notice to the non -movant of exactly what must be rebutted. Once such \na motion is fil ed, the burden shifts to the non-moving party (here, Petitioner) to produce \nevidence raising a genuine issue of material fact on each challenged element. The non -movant \nmust come forward with more than a scintilla of evid ence – i.e., evidence that rises above mere \nspeculation and would enable reasonable jurors to differ. If the non-movant fails to meet this burden, the court “must” grant the motion.  \n4. Importantly, Rule  166a(i) requires that an adequate time for discovery has elapsed \nbefore a no- evidence motion is heard. The rule does not mandate that discovery be entirely \ncompleted – only that the parties have had a reasonable opportunity to conduct discovery on the \nissues. All cases in Texas are governed by one of the di scovery control plans in Rule  190. In a \nLevel  2 family law case (the category this divorce falls under), there is a presumptive discovery\n\n4 \n period that ends 30 days before trial. In other words, by a month before the trial date, the parties \nare expected to have had adequate time to gather evidence. Here, this case has been pending for alm"}
{"id": "517ac61663f0e000056d5c2943c2cb2651f00df0", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "eriod that ends 30 days before trial. In other words, by a month before the trial date, the parties \nare expected to have had adequate time to gather evidence. Here, this case has been pending for almost two years without trial, and Petitioner has neither responded to discovery nor sought additional time. Courts have held that even if the formal discovery period has not expired, a movant can show an adequate time has passed by demonstrating that further discovery would be futile or that the non -movant had ample opportunity but failed to act. If a non-movant believes \nmore discovery is needed, the proper course is to file a verified motion for continuance explaining the necessity. Petitioner here filed no such motion or affidavit. Accordingly, the “adequate ti me” requirement is satisfied by the lengthy pendency of the case and Petitioner’s \ninaction.  \nB. Equitable Defense of Laches in Divorce Cases  \n5. Laches is an equitable defense that prevents a party from asserting a claim after an \nunreasonable delay that has caused prejudice to the opposing party. The two essential elements of laches are: (1) an unreasonable delay  by one having a legal or equitable right in asserting it, and \n(2) a good faith change of position by another to their detriment because of the delay. In Texas, courts have observed that “[a]s a general rule, laches will not bar a plaintiff’ s suit before the statute of limitations has run absent extraordinary circumstances that would work a grave injustice.”  See Fox v. O’Leary , No. 03-11 -00270-CV, 2012 WL 2979053, at *3 (Tex. App.—\nAustin July 10, 2012, pet. denied) (mem. op.) (quoting Caldwell v. Barnes , 975 S.W.2d 535, 538 \n(Tex. 1989)). \n6.  In other words, if a claim is brought within the limitations period, laches typically does \nnot apply unless the delay was extraordinarily prejudicial. However, where no fixed limitations \nperiod governs (as in certain divorce -related proceedings), or where  the delay extends well\n\n5 \n beyond what is"}
{"id": "c61d9e38d0075480c897416776c0bcd26d270493", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "unless the delay was extraordinarily prejudicial. However, where no fixed limitations \nperiod governs (as in certain divorce -related proceedings), or where  the delay extends well\n\n5 \n beyond what is reasonable, laches can be invoked to protect the opposing party from inequity. \nThe Texas Family Code explicitly acknowledges that equitable defenses like laches and estoppel are available to bar enforcement of certain family law agreements o r judgments. See Tex. Fam. \nCode § 4.008. \n7. In the present case, Mother effectively slept on her rights for nearly two years after \nobtaining temporary orders. She initiated claims of abuse and other misconduct but then failed to \nprosecute those claims or produce evidence, allowing the case to stagnate. During that time, \nFather drastically changed his positi on in reliance on the expectation that Mother had abandoned \nher allegations – he incurred debt, lost employment opportunities, and scrambled to maintain \nstability for the children, all while Mot her remained silent  as Father appealed and exhausted \nevery available remedy for redress . Equity aids the vigilant, not those who slumber on their \nrights. Mother’s extreme delay in pursuing any final resolution is unreasonable, and it has caused \nreal prejudice to Father and the children’s well -being. Should Mother attempt at the last minute \nto introduce new claims or evidence that were available long ago, the Court should find such \nmaneuver barred by laches. In the context of divorce litigation, Texas courts  have applied laches \nto prevent unfair surprise or prejudice – for example, a party who waited many years to enforce a \ndivorce decree faced a laches defense, and the courts noted that unless “extraordinary \ncircumstances” exist, laches will not save a dilat ory party acting within limitations. Here, \nMother’s delay is coupled with extraordinary circumstances: Father has been forced to undertake multiple legal battles and the children have endured prolonged instabilit"}
{"id": "cf0db1bc61ad58822c7f31201ed0d6afe3c8a25c", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "ing within limitations. Here, \nMother’s delay is coupled with extraordinary circumstances: Father has been forced to undertake multiple legal battles and the children have endured prolonged instability, all due to Mother’s \ninaction. Therefore, even if  Mother were now to scramble and produce some evidence, the Court \nshould exercise its equitable power to deny relief on grounds of laches. (Notably, Mother has not \neven attempted to bring forth evidence to this day, so the laches discussion is somewhat\n\n6 \n hypothetical; the primary basis for judgment remains the lack of evidence. Nonetheless, \nRespondent raises laches in an abundance of caution to foreclose any eleventh -hour revival of \nstale claims.)  \nIV. No -Evidence Grounds for Summary Judgment  \n8. Respondent challenges the following essential elements  of Petitioner’s claims, for \nwhich there is no evidence:  \ni. Family Violence During the Marriage – Petitioner cannot produce evidence that family \nviolence occurred at any time during the marriage. There are no police reports, medical records, credible witness testimony, or other admissible evidence to substantiate any act or threat of “family violence” as defined by Texas law. Petitioner’s own conduct – including her continued cohabitation with Father after the alleged incidents and her \nwithdrawal of the protective order application – contradicts her allegations. Wit hout \nevidence meeting the statutory definition, Petitioner cannot satisfy this essential element (see Tex. Fam. Code § 71.004, defining “family violence” as an act intended to result in physical harm, bodily injury, assault, or a threat that reasonably places the family member in fear of imminent harm).  \nii. Existence of an Active Protective Order with a Finding of Family Violence – \nPetitioner cannot produce evidence that any active protective order  with a finding of \nfamily violence existed during the marriage. No court ever issued such an order, and Petitioner’s only application was withd"}
{"id": "6ed82b608e7cf8ebb1f274f268c953b25f3bbe91", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "annot produce evidence that any active protective order  with a finding of \nfamily violence existed during the marriage. No court ever issued such an order, and Petitioner’s only application was withdrawn before any hearing. There is no signed order \nor judgment in the record titled “Protective Order” as required by law, and no judicial \nfinding of family violence was ever made. Texas law requires a hearing and family -\n\n7 \n violence finding for a protective order to issue (Tex. Fam. Code §§ 85.001, 81.001). \nWithout a court’s finding and a resulting order, this alleged element fails as a matter of law. (See also Tex. Fam. Code §  85.004, requiring a protective order to be a separate \ndocument.)  \niii. Petitioner’s Alleged Indigence on December 18, 2023 – Petitioner cannot produce \nevidence that she was financially indigent  on the date she filed suit (Dec.  18, 2023) under \noath. Her sworn affidavit of inability to pay costs  is conclusively refuted by objective \nfacts – e.g., her withdrawal of $1,576 in marital funds just days earlier (Dec. 15, 2023) which she failed to disclose. There are no bank statements or other financial records supporting her claim that she only had $21 to her name on that date. To the  contrary, the \nevidence shows she had access to and actually took substantial funds. Without any evidence to substantiate true indigence, this element cannot be established , making this \ncase ripe for dismissal under the Texas Practice and Remedies Code.  \niv. Notice and Hearing on Temporary Orders (February  1, 2024) – Petitioner cannot \nproduce evidence that a proper hearing occurred on her Motion for Temporary Orders \nand Injunction on February 1, 2024, or that this motion was ever properly served on Respondent. There is no transcript, no court reporter’s record, no signed waiver, and not even a file- marked copy of any such motion served on Respondent in advance  containing \na certificate of service. Absent proof that Respondent received due notice of a"}
{"id": "56bd02162ae615a318fce6e2c4634e890cba26c1", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "cord, no signed waiver, and not even a file- marked copy of any such motion served on Respondent in advance  containing \na certificate of service. Absent proof that Respondent received due notice of a temporary orders hearing and that an actual evidentiary hearing was held, any Temporary Orders resulting from that date lack a lawful foundation. In short, there is no evidence that the procedural prerequisites (notice, hearing, opportunity to be heard) for temporary\n\n8 \n injunctive relief were satisfied, so any claim by Petitioner premised on the validity of \nthose February 1 proceedings is unsupported. \nv. Respondent’s Agreement to the March 14, 2024 “Agreed” Orders  – Petitioner cannot \nproduce evidence that Respondent ever agreed  to the terms of the March  14, 2024, \nTemporary Orders . There is no signed agreement by Respondent, no written consent, no \nemail, no testimony – nothing – indicating that Respondent approved those terms. In fact, \nall evidence is to the contrary: the orders were drafted exclusively by Petitioner’s counsel \nand imposed unilaterally by the court over Respondent’s objection. The signature l ine for \nRespondent is blank (since he refused to sign), and there is sworn testimony from \nRespondent that he objected at every opportunity. Thus, Petitioner cannot show the Temporary Orders were truly “agreed” – an essential underpinning of their legitimac y. \nWithout evidence of a meeting of the minds or consent, any contention that Respondent agreed to those orders fails , as evidenced by his lack of signature.  \nvi. Temporary Orders Are in the Best Interests of the Children  – Petitioner cannot \nproduce evidence that the current Temporary Orders (which grant Mother exclusive occupancy of the home and curtail Father’s rights) are in the best interest of the children . Under Texas law, the best interest of the child is the paramount consideration in \ndetermining conservatorship or possession (Tex. Fam. Code § 153.002). Petitioner has offered no exper"}
{"id": "063b77b5071f712df322a9b23712a15523a2bd08", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": " the children . Under Texas law, the best interest of the child is the paramount consideration in \ndetermining conservatorship or possession (Tex. Fam. Code § 153.002). Petitioner has offered no expert testimony, no child therapist statements, no school records, no medic al \nrecords, nor any factual evidence at all demonstrating that these Temporary Orders \n(which severely limit Father’s access and removed the children from their father and home) benefit the children. To the contrary, Petitioner ignored a court -ordered parenting \ncourse designed to benefit the children, which undercuts any claim that the current orders\n\n9 \n serve the children’s best interests. With zero evidence showing that the children are better \noff under these restrictive orders, Petitioner cannot meet her burden on this essential issue.  \n8. Each of the above elements is one on which Petitioner bears the burden of proof at trial. \nAfter nearly two years, she has adduced nothing – no documents, no affidavits, no testimony – \nthat could prove any of these points. By contrast, Father has actively s ought to uncover the truth \nand provide evidence, but in a no-evidence motion the movant’s evidence need not be \nconsidered. Still, for completeness, Father summarizes below some of the evidence that further \nnegates Petitioner’s claims.  \nV. Respondent’s Affirmative Evidence (For Context)  \n9. While not required to prevail on a no -evidence motion, Respondent notes that ample \nevidence in the record affirmatively disproves  Petitioner’s allegations, including but not limited \nto: \ni. Financial Responsibility:  Father was the financially responsible spouse throughout the \nmarriage, as shown by bank records, pay stubs, and tax returns. He paid the bills, managed investments, and ensured both car payments were made – directly contradicting Petitioner’s claim of her  own indigence or that Father left her without support.  \nii. No History of Violence: Father has no criminal or family -violence history. A "}
{"id": "6ec3c1d6339c79d9e608e002e66f58b33ceef3ee", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "ere made – directly contradicting Petitioner’s claim of her  own indigence or that Father left her without support.  \nii. No History of Violence: Father has no criminal or family -violence history. A Texas \nDepartment of Public Safety background check and sworn affidavits from acquaintances confirm he has never been reported or charged with any act of family violence. This clean record undermines Pet itioner’s assertions that Father suddenly became abusive.\n\n10 \n iii. Use of Home for Work: Father’s livelihood depended on the marital residence \n(specifically, its home office and internet access) for his business operations and remote work. The Temporary Orders removing him inflicted immediate financial harm – which was precisely what Petition er sought in order to gain leverage. This evidence reinforces \nthat the orders were punitive, not child -centered.  \niv. Mother’s Misconduct:  Petitioner unilaterally disposed of many of Father’s personal \nbelongings after obtaining exclusive use of the house (e.g. throwing items onto the curb or selling them). She also interfered with Father’s possession of the children (as evidenced by text mes sages and emails), further indicating that her actions were \nmotivated by malice rather than any genuine fear.  \nv. False Statements: There is documented proof of numerous false statements made by \nPetitioner under oath (for example, claiming an active protective order existed when it did not, claiming poverty while hiding funds, etc.). These falsehoods, now proven, erode any credibility  Petitioner might try to invoke if she belatedly offers self -serving \ntestimony.  \n10. In sum, not only is Petitioner’s case devoid of supporting evidence, but the evidence that \ndoes exist in the record affirmatively supports Father’s position that Petitioner’s claims are \nunfounded. Nevertheless, because Rule  166a(i) places no burden on Respondent to produce \nevidence at this stage, the above points are provided merely for context and to illustrate "}
{"id": "4a0620efa5c58dc7d40ac5e246323a36d07de5f1", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "oner’s claims are \nunfounded. Nevertheless, because Rule  166a(i) places no burden on Respondent to produce \nevidence at this stage, the above points are provided merely for context and to illustrate the futility of any further proceedings on Petitioner’s claims.  \nVI. Adequate Time for Discovery\n\n11 \n 11. This Motion is filed after an adequate time for discovery has passed, as required by \nRule  166a(i). The divorce has been pending since December  2023 (nearly 23 months as of this \nfiling). Petitioner had every opportunity to conduct discovery, compel information, or otherwise \ndevelop evidence to support her claims. Respondent, for his part, served discovery requests on \nPetitioner (interrogatories, requests for production, requests for admissions) in September 2024 – to which Petitioner never responded, the reby resulting in deemed admissions. Under the Level  2 \ndiscovery control plan applicable to this case, an adequate time for discovery is presumptively 30 days before trial. Although a final trial setting was only recently contemplated,  and not even \nby the Petitioner but the Court itself,  the reality is that Petitioner effectively ceased litigating this \ncase for almost two years . By any measure, the parties have had more than an adequate \nopportunity to investigate the claims. Petitioner cannot credibly claim  she needs more time – if \nshe believed as much, her remedy was to file a motion for continuance with an affidavit explaining what additional discovery was needed. She filed no such motion. Accordingly, the Court can confidently conclude that the “adequate time for discovery” requirement is met. In \nfact, further delay would reward the very indifference that necessitated this motion in the first place.  \nVII. Legal Standard for Granting No-Evidence Summary Judgment \n12. Under Rule  166a(i) and the applicable case law, a no -evidence summary judgment must  \nbe granted unless the non- movant produces more than a scintilla of evidence raising a genuin"}
{"id": "47c1321519b32fbacb45926259ba4de407d5ece9", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "mary Judgment \n12. Under Rule  166a(i) and the applicable case law, a no -evidence summary judgment must  \nbe granted unless the non- movant produces more than a scintilla of evidence raising a genuine \nissue of material fact on each challenged element. In other words, if the evidence is so weak that it creates merely a surmise or suspicion of a fact, it is legally insufficient  to defeat the motion. \nSee Cole  v. Cole , No. 03-24-00275-CV (Tex. App.–Austin Aug. 28, 2025) (mem. op.) (more than \na scintilla is required); In re G.D.P. , No. 02-23-00001-CV, 2023 WL 5620089 (Tex. App.–Fort\n\n12 \n Worth Aug. 1, 2023, no pet.) (mem. op.) (same standard). Evidence that is so slight or so \nthoroughly discredited that reasonable jurors could not infer the existence of the disputed fact is considered “no evidence”  in legal contemplation . See Wilkerson  v. Wilkerson , 321 S.W.3d 110, \n117 (Tex. App.–Houston [1st Dist.] 2010, pet. denied) (evidence that amounts to nothing more \nthan suspicion is legally insufficient).  \n13. Here, as detailed above, Petitioner has come forward with zero  evidence on multiple \nessential elements of her case. By contrast, Respondent has highlighted the complete lack of \nproof and, indeed, the record reveals admissions and uncontested facts that negate Petitioner’s \nclaims. Because Petitioner cannot point to mo re than a scintilla of competent evidence in support \nof the challenged elements, the Court must  grant summary judgment as a matter of law.  \n \n \n \nVII. Conclusion  \n14. There is no need for a trial on the merits in this case, as the Petitioner has no merit to her \nclaims and has abused and intentionally misrepresented fact to the Court.  She has intentionally \ndisrupted the lives of her own children, intentionally displaced the Father from his home and \nchose to pursue an extramarital affair over finalizing the divorce, and has caused significant financial harm to the marital estate.  \n15. Because the Petitioner has failed to produce any "}
{"id": "7de238029b8df3c8bbb2874004d7d0425bc28c86", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "s home and \nchose to pursue an extramarital affair over finalizing the divorce, and has caused significant financial harm to the marital estate.  \n15. Because the Petitioner has failed to produce any evidence for her claims, has obtained a \ncourt order by fraudulent misrepresentations through her alleged attorney, Cooper L. Carter, and\n\n13 because Petitioner brought this suit in bad faith, this no -evidence motion for summary judgment \nshould be granted as a matter of law, and a subsequent hearing regarding Father’s contempt \nmotion should be held at the earliest opportunity to ensure Petitioner is held accountable for her egregious actions, and that her alleged attorney, Cooper L. Carter, is referred to the appropriate disciplinary authorities to prevent similar conduct from occurring in the future.  \nVIII. Prayer\nWHEREFORE, PREMISES CONSIDERED , Respondent Charles Dustin Myers  \nrespectfully prays that this  Court: \n1.Grant this No -Evidence Motion for Summary Judgment in its entirety upon\nwritten submission, deny all relief requested by Petitioner, and dismiss all ofPetitioner’s claims with prejudice  for want of any supporting evidence. In the\nalternativ e,  Respondent prays that the Court hold that Petitioner’s claims are\nequitably barred by laches due to her unreasonable delay and the resulting prejudice;\n2.If the Petitioner is unable to prove her initial claims of financial indigency, dismissthis suit pursuant to Tex. Prac. Rem. Code § 13.001;\n3.Vacate the December 10, 2025, trial setting;\n4. Respondent further prays for such other and further relief, at law or in equity, to\nwhich he may show himself justly entitled.\nR\nespectfully submitted,  \n/s/ Charles Dustin Myers  \nCha rles Dustin Myers -Pro  Se Respondent \n6641 Anne Court  \nWatauga, TX 76148\n\n14 Telephone: 817-546-3693 \nEmail: chuckdustin12@gmail.com \nC\nERTIFICATE OF SERVICE \nRe spondent certifies that on November 05, 2025, a true and accurate copy of this \nMOTION FOR SUMMARY JUDGMENT was served on all "}
{"id": "db1a89e349bfac6533588cbbbc610c1695983b78", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\11_05_25_motion_for_noevidence_summary_judgment\\11_05_25_motion_for_noevidence_summary_judgment.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\11.05.25 - MOTION FOR NOEVIDENCE SUMMARY JUDGMENT.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 1225, "text": "817-546-3693 \nEmail: chuckdustin12@gmail.com \nC\nERTIFICATE OF SERVICE \nRe spondent certifies that on November 05, 2025, a true and accurate copy of this \nMOTION FOR SUMMARY JUDGMENT was served on all parties of record pursuant to rule 21a of the Texas Rules of Civil Procedure. \n/s/ Charles Dustin Myers  \nCH ARLES DUSTIN MYERS  \nPro-se Respondent\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 107694956\nFiling Code Description: Motion (No Fee)\nFiling Description: MOTION FOR NO-EVIDENCE SUMMARY\nJUDGMENT\nStatus as of 11/5/2025 4:17 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n11/5/2025 12:48:15 PM\n11/5/2025 12:48:15 PM\n11/5/2025 12:48:15 PM\n11/5/2025 12:48:15 PMStatus\nSENT\nSENT\nSENT\nSENT"}