{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.14.25 - BAKER JUDGE REINSTATEMENTS-1.pdf",
  "base_name": "03_14_25_baker_judge_reinstatements_1",
  "page_count": 5,
  "pages": [
    {
      "page_number": 1,
      "text": "FUDST OP <chuckdustin12@gmail.com>\nRuling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No.\n322-744263-23\n9 messages\nFUDST OP <chuckdustin12@gmail.com> Fri, Mar 14, 2025 at 4:47 PM\nTo: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>, Cooper Carter <coopercarter@majadmin.com>\nMs. Baker ,\nMy Motion for Partial Summary Judgment, filed February 22, 2024, remains unopposed for over a year . Under TRCP\n166a(c) and Local Rule 4.01(d), this motion is ripe for ruling. Opposing counsel’ s failure to respond waives any objection.\nFurther , opposing counsel (CC'ed here), cannot prosecute her case in accordance with Texas law , and still has an\noutstanding rule 12 motion that is now also unopposed.\nA granting of either motion would resolve the core case issues, and given the circumstances, is duly warranted.\nI formally request an immediate ruling or confirmation of when the Court will act. Further delay is unacceptable.\nIf the judges cannot legally act given opposing counsels failure to comply with Tex. R. CIV . P. 237a, then the matter should\nbe brought before David L. Evans without delay .\nSincerely ,\nCharles Dustin Myers\nChuckdustin12@gmail.com  \n817-546-3693\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Sun, Mar 16, 2025 at 1:54 PM\nTo: FUDST OP <chuckdustin12@gmail.com>, Cooper Carter <coopercarter@majadmin.com>\nCc: \"chuckdustin12@gmail.com\" <chuckdustin12@gmail.com>\nMr. Dustin:\n \nPrior to providing available dates to set your hearing request, the Court must know how much time you are\nrequesting for the hearing? Further, you must E-file or personally appear with a Notice of Hearing for the\nCourt to set the hearing.\n \nThank you,\n \n \n \nIf you received a Notice of Dismissal, you MUST file a Motion to Retain. The Motion\nMUST be SET, HEARD and concluded with a SIGNED ORDER TO RETAIN.\n \nDO NOT EMAIL ME FOR A SETTING REGARDING THE DWOP.\n4/12/25, 1:51 PM Gmail - Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1662214371576409810&simpl=msg-a:r-845768473253540… 1/5",
      "char_length": 2127
    },
    {
      "page_number": 2,
      "text": "YOU MUST APPEAR IN PERSON TO SET THE HEARING.\n \n \nAll Orders that requir e the J udge’ s signa ture must be pr esented in per son and will not be\nprocessed thr ough e-filing.\n \nLindsey Baker\n322nd Court Coordinator\nTarrant County Family Law Center\n200 E. Weatherford, 4th floor\nFort Worth, Texas 76196\nPhone: (817) 884-1597\n \n \nF r o m : FUDSTOP <chuckdustin12@gmail.com>\nS e n t : Friday, March 14, 2025 4:47 PM\nT o : Lindsey K. Baker <LKBaker@tarrantcountytx.gov>; Cooper Carter <coopercarter@majadmin.com>\nS u b j e c t : Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\n \nEXTERNAL EMAIL ALERT! Think Before You Click!\n[Quoted text hidden]\nFUDST OP <chuckdustin12@gmail.com> Sun, Mar 16, 2025 at 4:26 PM\nTo: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>\nCc: Cooper Carter <coopercarter@majadmin.com>\nHello Lindsey ,\nI hope you are doing well. I am following up on the Myers v . Myers matter (Cause No. 322-744263-23 in the 322nd District\nCourt), which was remanded back from federal court on December 17, 2024. As of today , the opposing party still has not\nfiled the Notice of Remand or otherwise re-engaged with the case. This has left our case in limbo on the court’ s docket. In\nthe meantime, Charles Dustin Myers (Respondent), is suf fering ongoing harm each day without the court’ s intervention on\npending matters.\nTo recap the situation briefly:\nThe federal court remanded the case to state court on 12/17/2024. Under Texas Rule 237a, it was Petitioner ’s\nresponsibility to file the remand order with the clerk and notify us. That never happened. W e are now three months post-\nremand, and the case has not been of ficially re-docketed due to this oversight.4/12/25, 1:51 PM Gmail - Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1662214371576409810&simpl=msg-a:r-845768473253540… 2/5",
      "char_length": 1966
    },
    {
      "page_number": 3,
      "text": "I have multiple pending motions that were filed before and after the remand. Critically , Petitioner and her counsel have not\nresponded to ANY of these motions. For example, the Motion for Summary Judgment (filed 2/26/2024) received no\nresponse. More urgently , our Ex Parte Motion for Child Custody , Exclusive Use of Marital Residence, Contempt, and\nSanctions (filed 2/12/2025) remains unopposed and unaddressed. W e also filed a Proposed Order on 2/20/2025 and a\nRequest for Immediate Ruling on 2/28/2025, with no response from the other side.\nThe issues in that ex parte motion are time-sensitive and critical: we need a court order for custody and to regain access\nto the marital home. Opposing counsel’ s failure to follow procedure has ef fectively stalled relief that desperately needs\nattention. (Respondent has been without access to his home and children for an extended period through no fault of his\nown). There are also allegations of contempt by the opposing party that have not been heard because of these delays.\nGiven this extraordinary situation, we respectfully ask the Court to take immediate action. Specifically , we request one of\nthe following at the Court’ s earliest convenience (and we truly mean as soon as possible, even this week if feasible):\nImmediate ruling/signing of orders: Since the motions are unopposed, the Court can rule on them without a hearing. I\nhave a proposed Order for the ex parte motion ready for Judge Kaitcer ’s signature. I urge the Court to sign an order\ngranting Respondent temporary custody of the children and exclusive use of the residence immediately . This would\nprovide much-needed stability while the case proceeds. Similarly , the motion for summary judgment can be granted on\nthe papers, as no controverting evidence or response was ever filed by Petitioner .\nEmergency hearing: If the Court prefers to hold a hearing, please provide the soonest possible date and time for an\nemergency hearing on the Ex Parte Motion (2/12/2025), and a notice will be filed tomorrow . I am prepared to appear on\nshort notice. Given that the motion is unopposed, the hearing should be brief. Respondent will gladly testify to confirm the\nfacts if needed. He just needs the Court’ s authorization to move forward – every day of delay is another day he is barred\nfrom his home and children.\nFiling of Remand Order: To remove any procedural barrier , Respondent will obtain a certified copy of the federal remand\norder and he will file it himself (or hand-deliver a copy) to the Court. If the clerk needs that filed separately to of ficially\nreopen the case, please let me know – it will be done immediately . I do not want a clerical formality to stand between the\nchildren and justice any longer .\nSanctions for non-compliance (if appropriate): Resppndent also wants the Court to be aware that opposing counsel’ s\nconduct – failing to file the remand notice and ignoring court filings – is sanctionable. While the priority is getting relief for\nthe children,  the intent is to address this issue at the appropriate time. For now , this failure should at least not be\nrewarded by further delaying proceedings. Respondent shouldn’t have to wait indefinitely due to the other side’ s\nprocedural neglect.\nIn sum, Respondent is asking for the Court’ s help to break the logjam created by the opposing party . Our requests are\nstraightforward and unopposed. The court has the authority to grant the relief either ex parte or by default given the\ncircumstances. Respondent is simply requesting that the Court exercise that authority as soon as possible to prevent\nfurther irreparable harm.\nMy tone in this email is urgent because the situation is urgent. I have been exceedingly patient while trying every avenue\nto move this case forward. With each passing day , the situation worsens and the children at issue remain in uncertainty . I\ntrust that the 322nd District Court strives to resolve such matters fairly and expeditiously , and I am eager to assist in any\nway to facilitate a prompt resolution.\nProposed next steps:\nIf Judge Kaitcer (or the assigned judge) is available to review the file tomorrow , we urge him to sign the proposed Order\n(filed 2/20/2025) granting the relief in the 2/12/2025 motion. I am available by phone or email if the Court has any\nquestions or slight modifications to the order .\nAlternatively , please provide a setting for an emergency hearing as early as possible. Even a telephone or Zoom hearing\nwould be acceptable, given the urgency , if that would expedite the process. A notice of hearing will be filed Monday .\nIf there are any concerns about the procedural posture (such as the missing Notice of Remand), please let me know . I am\nprepared to cure any such issue immediately . I can file the remand order and serve opposing counsel (to the extent she\nwill accept service) to remove any doubt that the case is properly before the Court.\nThank you very much for your time and attention to this matter , Lindsey . I understand the Court has a busy docket, but\nthis case has unusual circumstances that warrant special handling. I greatly appreciate any assistance you can provide in\nconveying the urgency of this situation to Judge Kaitcer , Judge Munford, or in the alternative, Judge Evans. I am hopeful\nthat, with the Court’ s intervention, we can obtain a ruling or hearing in a matter of days, bringing much-needed relief and\nallowing the case to progress.4/12/25, 1:51 PM Gmail - Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1662214371576409810&simpl=msg-a:r-845768473253540… 3/5",
      "char_length": 5695
    },
    {
      "page_number": 4,
      "text": "Please let me know if you need any additional information or have any instructions for me. I will be watching for your reply\nand am ready to act immediately on any opportunity to be heard.\nSincerely ,\nCharles D. Myers\n[Quoted text hidden]\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Mon, Mar 17, 2025 at 12:01 PM\nTo: FUDST OP <chuckdustin12@gmail.com>\nCc: Cooper Carter <coopercarter@majadmin.com>\nALL motions must be set for a hearing. If you are requesting relief from the Court, you must provide the\nCourt with a formal Notice of Court Proceeding to set each of your E-filed motions. I also informed you of\nthis in my previous email response. I will take no further action responding to your email communications\nunless you are requesting an in person hearing AND provide the Court with a E-filed Notice of Court\nProceeding in compliance with the Texas Rules of Civil Procedure. Please refer to the Texas Rules of Civil\nProcedure, The Texas Family Code, and the Tarrant County Family Court’s Local Rules.\n \nThe 322nd District Court and Associate Court hears ALL matters in person and not by submission.\n \nThank you,\n[Quoted text hidden]\nFUDST OP <chuckdustin12@gmail.com> Mon, Mar 17, 2025 at 3:53 PM\nTo: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>\nDear Ms. Baker ,\nThanks for your response.\nAs I previously pointed out, the Order of Assignment from Judge David L. Evans assigned Justice Lee Gabriel to the case.\nThat assignment remains in ef fect until Judge Evans issues a written termination order , as stated. To my knowledge, no\nsuch order has been issued or served.\nUntil that occurs, it would be procedurally improper to request a court hearing, particularly given that the opposing party\nhas yet to fulfill their obligation under Texas Rule of Civil Procedure 237a by filing a Notice of Remand after removal to\nfederal court.\nIt would be helpful if these issues could be resolved as soon as possible so that the case can proceed ef fectively .\nBest regards,\nCharles Dustin Myers\n[Quoted text hidden]\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Mon, Mar 17, 2025 at 4:22 PM\nTo: FUDST OP <chuckdustin12@gmail.com>\nI will address this with Judge David Evans first thing tomorrow morning.4/12/25, 1:51 PM Gmail - Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1662214371576409810&simpl=msg-a:r-845768473253540… 4/5",
      "char_length": 2460
    },
    {
      "page_number": 5,
      "text": "[Quoted text hidden]\nFUDST OP <chuckdustin12@gmail.com> Mon, Mar 17, 2025 at 4:22 PM\nTo: \"Lindsey K. Baker\" <LKBaker@tarrantcountytx.gov>\nThank you very much.\nI hope you have a good evening.\nRespectfully ,\n[Quoted text hidden]\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Mon, Mar 17, 2025 at 4:24 PM\nTo: FUDST OP <chuckdustin12@gmail.com>\nYou do the same.\n[Quoted text hidden]\nLindsey K. Baker <LKBaker@tarrantcountytx.gov> Wed, Mar 19, 2025 at 3:19 PM\nTo: FUDST OP <chuckdustin12@gmail.com>, Cooper Carter <coopercarter@majadmin.com>\nAttached is an Order Terminating Assignment that has been signed by Judge David Evans.\n \nThank you.\n[Quoted text hidden]\nOrder T erminating Assignment.pdf\n330K4/12/25, 1:51 PM Gmail - Ruling Requested – Unopposed Summary Judgment (Filed 2/22/2024) – Case No. 322-744263-23\nhttps://mail.google.com/mail/u/0/?ik=13839461f7&view=pt&search=all&permthid=thread-a:r1662214371576409810&simpl=msg-a:r-845768473253540… 5/5",
      "char_length": 951
    }
  ]
}