{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\01.16.2024_ATT COMPREHENSIVE_STATEMENT-1.pdf",
  "base_name": "01_16_2024_att_comprehensive_statement_1",
  "page_count": 7,
  "pages": [
    {
      "page_number": 1,
      "text": "DKT (16)\n(ATT) COMPREHENSIVE_STATEMENT\nFILED ON: 01/16/2024\nFEE: $0.00\nFILER/REQUESTOR: CHARLES DUSTIN MYERSM.168 M.168\nM.168 M.168 M.168 M.168",
      "char_length": 143
    },
    {
      "page_number": 2,
      "text": "COUNTER -PETITION FOR DIVORCE AND COMPREHENSIVE STATEMENT OF CONTEXT  \n \nIN THE DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n322ND JUDICIAL DISTRICT  \n \nMORGAN MICHELLE MYERS,  \nPlaintiff,  \n \nvs. \n \nCHARLES DUSTIN MYERS,  \nDefendant.  \n \nCOUNTER -PETITION FOR DIVORCE AND COMPREHENSIVE STATEMENT OF CONTEXT  \n \nTO THE HONORABLE JUDGE OF SAID COURT:  \n \nI, Charles Dustin Myers, the Defendant in the above -captioned case, submit this Counter -Petition for \nDivorce and Comprehensive Statement of Context in response to the Original Petition for Divorce filed by \nMorgan Michelle Myers, the Plaintiff. This documen t addresses the inaccuracies in the Plaintiff's petition, \nprovides a detailed account of the situation, and outlines the evidence I am prepared to present to the \nCourt.  \n \nI. OVERVIEW AND CONTEXT  \n \nThis divorce is intertwined with two additional legal proceedings - an eviction suit (Case No. JP01 -23-\nE00102017) and a protective order (Case No. 322 -744538 -23), both of which are deeply entangled with \nthe divorce case (Case No. 322 -744263 -23). \n \n \n 322-744263-23M.169 M.169\nM.169 M.169 M.169 M.169",
      "char_length": 1123
    },
    {
      "page_number": 3,
      "text": "The significant third -party influence exerted by individuals named Debbie, Damen, and Dan , as well as \nour landlord – her Grandmother – who lives next door to us - has critically impacted the Plaintiff's \ndecisions and actions in our marital matters and the ongoing divorce proceedings. Notably, Dan \nBranthoover, a family member, has played an active and concerning role in the process  – claiming to be \nher legal representative yet possessing no license to practice law in the state of Texas.  \n \n1. Debbie and Damen's Influence:  \nI possess extensive text and call logs that unequivocally demonstrate the Plaintiff's prioritization \nof Debbie and Damen over our family obligations and commitments. These interactions, which \nhave been meticulously logged and analyzed, reveal a consistent pattern where the Plaintiff has \nchosen to allocate a significant amount of her time an d attention to these individuals, even \namidst our divorce proceedings.  It wasn’ t until the dis covery and subsequent discussion of these \ninteractions that lead to the situation escalating. It is my fir m belief that the protective order was \nfiled in an att empt to escape responsibility  rather than to seek protection, as we have been co -\nhabiting th roughout this process, and joint conservatorship was requested on the original \ndivorce petition . \n2. Dan Branthoover's Role:  \nDan Branthoover's involvement has escalated beyond mere influence to active participation in \nthe legal aspects of our divorce. He has notably assisted the Plaintiff in preparing and filing \ndivorce papers.  \nCritically, under Dan's advice, the Plaintiff withdrew $1,600 from our joint bank account without \nmy authorization. This unauthorized transaction led to a dire financial situation, with a deficit of \n$800 in our account, resulting in bounced bills and consi derable strain on my business \noperations.  \nThis act of financial maneuvering, advised and facilitated by Dan, not only infringed upon our \nmutual financial responsibilities but also breached the trust inherent in our joint financial \nmanagement. It underscores the extent of third -party involvement in  our personal and legal \naffairs.  \n \n3. Communication Breakdown:  \nThroughout these developments, the Plaintiff has consistently failed to communicate with me \nabout these significant third -party influences and their implications on our divorce and family \ndynamics. This lack of communication has been a major contributing f actor to the \nmisunderstandings and the subsequent escalation of conflict between us.  \nThe involvement of these third parties, particularly the actions taken by Dan Branthoover, have \nnot only influenced the Plaintiff’s decisions but also actively interfered with our joint financial \nintegrity and the legal process. This has added layers of co mplexity to an already challenging \nsituation and has necessitated the presentation of this comprehensive account in the interest of \ntransparency and fairness in these proceedings.  M.170 M.170\nM.170 M.170 M.170 M.170",
      "char_length": 3036
    },
    {
      "page_number": 4,
      "text": "4.  Deterioration of Parental Responsibility  \nSince the announcement of our divorce on December 1st, 2023, there has been a noticeable and \nconcerning shift in Morgan’s parenting responsibilities and her involvement in our children’s \nlives. Prior to this date, Morgan was an engaged and active parent. H owever, since the \nannouncement, her day -to-day interactions with Mara and Caroline have noticeably \ndeteriorated. This change is not only alarming but also detrimental to the well -being and \nemotional stability of our children.  \nMorgan has increasingly prioritized her personal interests, specifically her interactions with \nfriends, Debbie,  and Damen, over her responsibilities as a mother. It has been observed and \ndocumented that she spends an excessive amount of time, estimated to be up to 24 hours per \nweek, visiting these friends. This extensive time spent away from home has not only reduc ed her \nphysical presence in our children's lives but also impacted her emotional availability to them.  \nMore concerning is the complete lack of effort on Morgan's part to communicate effectively \nabout the children’s needs, their daily routines, and their emotional well -being since the divorce \nannouncement. This breakdown in communication is critical, as co -parenting effectively is \nparamount for the children's adjustment to the changes in our family structure. The inability or \nunwillingness to engage in meaningful dialogue regarding our children’s care is not in their best \ninterest and is counterproductive to their needs during this challenging time.  \n5. Contradicting  and False Statements  \n \nThroughout  the ongoing divorce proceedings, there have been several instances of contradictory  \nand demonstrably false statements made by Morgan, which have significantly complicated and \ndistorted the case. A critical point of contention is Morgan's claim regarding her inability to pay, \nwhich is incongruent with the financial facts presented. Additi onally, her request for the waiver \nof the standard 60 -day waiting period for divorce, citing an alleged order that found I had \ncommitted family violence, is entirely baseless and untrue.  \n \nThere is no evidence or record to substantiate claims of family violence in our marriage. In fact, \nthis assertion directly contradicts my clean record and consistent history of being a caring and \nnon-violent partner and father. The accusation appears to be  a strategic move to gain an unfair \nadvantage in the divorce proceedings.  \n \nFurthermore, Morgan's actions in filing a protective order, followed by the initiation of an \neviction process, appear to be coordinated attempts to remove me from our family home. \nNotably, the eviction notice cited the protective order as a reason, even though  the protective \norder had not been filed at the time of the eviction notice. This sequence of events points \ntowards a premeditated strategy to unfairly influence the custody and property aspects of our \ndivorce.  \n \nGiven these concerning developments, it is imperative  that this counter petition replace the \noriginal . This counter -petition is not just a necessary step to address the false allegations and M.171 M.171\nM.171 M.171 M.171 M.171",
      "char_length": 3222
    },
    {
      "page_number": 5,
      "text": "contradicting statements made by Morgan, but also a crucial measure to ensure a fair and \nequitable trial , and t o correct the inaccuracies made by Morgan on the original petition.  It is \nessential to have the appropriate amount of time and a factual basis for the proceedings to \nensure that any decisions made, particularly those affecting our children’s future and well -being, \nare based on truth and justice, rather than unfounded alle gations. This approach will also \nfacilitate a smoother and more amicable transition for all parties involved, especially for our \nchildren, who are of utmost importance in this process.  \n \nII. EVIDENCE TO BE PRESENTED  \n \n1. Text Message Evidence:  \n I will present text interactions between myself and the Plaintiff that show my attempts to work \ntowards a resolution and her avoidance of communication and accountability.  \n \n2. Data Analysis and Phone/Text Logs:  \n \nI have prepared charts and graphs created from our joint account's text and phone call logs. \nThese will illustrate the extreme levels of interaction the Plaintiff had with Debbie and Damen, \nhighlighting her priorities outside of our marriage.  This priority in her fr iends has remained \nconsistent - even throughout the divorce proceedings . \n \n3. No History of Family Violence:  \n I will present my criminal record from the Texas Department of Public Safety, proving the \nabsence of any history of family violence . \n \n4. Bank Statements and Financial Transactions:  \nEvidence of bank transactions will demonstrate financial maneuverings by the Plaintiff, advised \nby Dan Branthoover, affecting our joint account.  \n \n5. Eviction Notice and Protective Order Claims:  \n \n I have the eviction notice served to me, which was later voided, and evidence related to the \nprotective order, demonstrating the misuse of legal processes to influence our divorce and \ncustody proceedings.  \n \n \n M.172 M.172\nM.172 M.172 M.172 M.172",
      "char_length": 1939
    },
    {
      "page_number": 6,
      "text": "III. CHILDREN'S WELFARE AND FAMILY STABILITY  \n \nThe children's welfare remains my primary concern. The Plaintiff's actions, influenced by third parties \nand her unfounded claims, threaten our children's stability and well -being. I advocate for maintaining \nthe standard 60 -day waiting period for the divorc e to provide our children with a stable and gradual \ntransition.  \n \nSince the divorce announcement, I have remaine d an active role in my children ’s lives, finding activities \nfor us to do together due to their time off from school. Desp ite all inclusion efforts – Morgan has \ndeclined to join us on these ac tivities  – something the children  don’t understand  and have taken notice \nto. Morg an, on the other hand, has been extremely short with the children, impatient, and has kept her \npriorities in line with her friends . \n \n \n \nIV. PROPOSAL FOR INTER IM CUSTODY ARRANGEMENT   \nConsidering  the current complexities surrounding our divorce proceedings, and with the paramount goal \nof ensuring the best interests and minimal disruption to our children’s lives, I propose the following \ninterim custody arrangement:  \n1. Full Custody Arrangement  \nI propose to take on full custody of our children, Mara and Caroline. This decision is motivated by the \nneed to provide them with a stable and consistent environment, especially during this transitional \nphase of our family's life. My commitment to their da y-to-day needs, emotional well -being, and \ncontinued growth has been and will remain unwavering.  \n2. Co-Habitation in Current Family Home:  \nRecognizing the importance of maintaining a sense of normalcy for our children, I suggest that we \ncontinue to cohabit in our current family home. This arrangement will prevent any immediate \nupheaval in the children's living environment, allowing them to re tain their sense of security and \nfamiliarity amidst the ongoing changes , and will afford Morgan the opportunity to find full -time \nstable employ ment, and allow me to continue making rent payments to her grandmother, our \nlandlord. This is in the best interest of all parties involved.  \n3. Transition to a New Home  \n I am planning to move out of my current family home with the children, but only when a suitable \nand equally accommodating residence is secured. The aim is to ensure this new home is near  our M.173 M.173\nM.173 M.173 M.173 M.173",
      "char_length": 2378
    },
    {
      "page_number": 7,
      "text": "current location, thus allowing the children to remain in their current school and maintain their \nusual routines and social connections.  \n4. Active Roles for Both Parents  \n It is imperative that both Morgan and I continue to play active roles in our children's lives. The \nproposed arrangement is designed to facilitate this by ensuring that the children have regular and \nconsistent access to both parents. This continued parental  presence will be crucial in minimizing the \nemotional and psychological impact of our separation on Mara and Caroline.  \n \nMitigating Potential Damage: The current petition, as it stands, poses a significant risk of causing \ndisruption and potential harm to our children's well-being.  \nby abruptly altering their living situation and limiting their access to one parent. My proposal aims to \nmitigate this damage by providing a more balanced and thoughtful approach to the transition, one \nthat prioritizes the emotional and psychological healt h of our children above all else.  \nFlexibility and Cooperation: This proposal is made with a spirit of flexibility and cooperation, \nunderstanding that the situation may evolve as we navigate this process. I am open to discussions \nand modifications to this plan, if they serve the best interests of Mara and Caroline.  \nProfessional Support if Needed: To aid in this transition and to ensure that the emotional needs of \nour children are being met, I also propose that we engage the services of a child psychologist or a \nfamily counselor. This professional can provide support to Mara and Caroline, helping them to \nunderstand and adapt to the changes in their family dynamics.  \nRegular Review and Adjustment of the Arrangement: I propose that this interim custody \narrangement be subject to regular review, with the possibility of adjustments based on the evolving \nneeds of our children and our family situation. This will ensure that the arrangement remains \nrelevant and beneficial for Mara and Caroline.  \n \nV. PRAYER  \n \nWHEREFORE, premises considered, I respectfully request that the Court consider this Counter -Petition \nfor Divorce with due diligence. My earnest prayer is for a fair and just resolution that corrects the \ninaccuracies in the original petition and uncovers th e true nature of the events leading to the divorce \nannouncement. It is vital that these matters are resolved amicably, prioritizing the best interests of our \nchildren, Mara,  and Caroline. I seek a fair outcome that recognizes the complexities of our situation and \npromotes a stable, nurturing environment for our family moving forward.  \nRespectfully submitted,  \n \nCHARLES DUSTIN MYERS  \nCHARLES MYERSM.174 M.174\nM.174 M.174 M.174 M.174",
      "char_length": 2714
    }
  ]
}