{"id": "f425941491b945674bbe2069eb0a3081937d7a14", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 233-765358-25\nIN THE 233RD DISTRICT C OURT OF TARRANT C OUNT Y , TEXAS \n \n \nTO THE\n HONORABLE COURT:  \n \nCHARLES DUSTIN MYERS, Petitioner  in the above filed case, files this  \n \nRequest  for Declaratory Judgement, and in support thereof shows the following: \n \nI. STATEMENT OF FACTS  \n \n1. Petitioner, representing himself pro-se, removed cause number 322-744263-23 to the  \nNorthern District of Texas on December 6, 2024. (No. 4:24- CV-01185-O)  \n2. The case was remanded on December 8, 2024, for lack of subject matter jurisdiction.  Exhibit 1  \n3. Rule 237a of the Texas Rules of Civil Procedure states:  \n“When any cause is removed to the Federal Court and is afterwards remanded to the state \ncourt, the plaintiff  shall file  a certified copy of the order of remand with the clerk of the \nstate court and shall forthwith give written notice of such filing to the attorneys of record \nfor all adverse parties.” (emphasis added)  \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n Petitioner’s Statement  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-31  233-765358-25 FILED\nTARRANT COUNTY\n4/1/2025 12:00 AM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n4. This places the obligation on COOPER L. CARTER to file with the clerk of the state \ncourt a certified notice of remand , which she has failed to do as of March 31, 2025, nearly three \nmonths later.  \n5. COOPER L. CARTER’s authority to represent MORGAN MICHELLE MYERS has been in \nquestion since September 20, 2024, in cause number 322- 744263- 23 and is similarly in question in the \ninstant case.  \n6. COOPER L. CARTER has never filed a pleading on MORGAN MICHELLE MYERS’ behalf \nin either this court or the 322nd district court since she was allegedly retained on January 22, 2024, in her \nindividual capacity over fourteen months ago . \n7. RODERICK D. MARX has filed every pleading on behalf of COOPER L. CARTER in both \nthis matter and the divorce matter.  \n8. RODERICK D. MARX has not made an appearance"}
{"id": "9fb2bbc640cd59e833e92972b60d41f9189b882c", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ity over fourteen months ago . \n7. RODERICK D. MARX has filed every pleading on behalf of COOPER L. CARTER in both \nthis matter and the divorce matter.  \n8. RODERICK D. MARX has not made an appearance or otherwise been named as a party in \neither suit.  \n9. Neither RODERICK D. MARX nor COOPER L. CARTER have filed any response to any \npleadings served to them by CHARLES DUSTIN MYERS.  \n10. Neither RODERICK D. MARX nor COOPER L. CARTER have filed any pleading since \nApril 24, 2024, in the divorce matter , nearly twelve months ago.  \n11. COOPER L. CARTER has left the 322nd District Court without any ability to proceed \nto final trial, thereby resulting in an inevitable dismissal for want of prosecution. Exhibit 2  \n12. COOPER L. CARTER ’s EFM is registered to  her prior employer’s email address, \nwhich has been pointed out several times by Petitioner. Exhibit 3  \n13. The 322nd District Court of Tarrant County does not have  continuous exclusive \njurisdiction of the minor children.  \n14. The Petitioner opened a separate SAPCR before this court in March of 2025.\n\n15. Without any submissions from Respondent since April 24, 2024, COOPER L. \nCARTER suddenly submits pleadings to this court claiming bad faith and answers with a general \ndenial.  \n16. COOPER L. CARTER has not provided a response to the EMERGENCY TRO , yet \nfeels it is appropriate to influence the proceedings with false promises to the tribunal. Exhibit 4  \n17. On March 28, 2025, the Petitioner arrived at the 233rd District Court to present his \nemergency TRO as scheduled with the Court Coordinator  on March 27, 2025. Exhibit 5  \n18. The Petitioner was then told to contact COOPER L. CARTER by the Court \nCoordinator to select dates for the TRO hearing prior to his presentation  once he arrived at the \ncourt . Exhibit 6  \n19. The parties selected April 10, 2025, to have the hearing, and the Petitioner went \nbefore the Associate Judge to present his emergency TRO.  Exhibit 7  \n20. Prior to being called up to prese"}
{"id": "11aa79503e4425ca3b1beb04bb342c98a7affe66", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "t 6  \n19. The parties selected April 10, 2025, to have the hearing, and the Petitioner went \nbefore the Associate Judge to present his emergency TRO.  Exhibit 7  \n20. Prior to being called up to present, the Associate Judge left the room and conversed \nwith the court coordinator. \n21. When she returned, Petitioner was called up to present the emergency TRO. 22. Before getting a chance to speak, the Associate Judge informed the Petitioner that \nCOOPER L. CARTER had filed the consolidation motion in the wrong court and would be filing \none with the 322\nnd District Court.  \n23. The Petitioner was denied an opportunity to present his emergency TRO and  was told \nto instead file the pleading with the 322nd District Court.  \n24. The Petitioner then reminded the Associate Judge that the 322nd District Court does \nnot have the ability to proceed on the merits lacking a certified notice of remand pursuant to Rule 237a .\n\n25. The Associate Judge disagreed and refused to hear the emergency TRO.  \n26. At the close of business on March 28, 2025, nothing was ever filed with the 322nd \nDistrict Court by COOPER L. CARTER.  \n27. Petitioner and the children in this suit were denied due process outright despite being \ncorrect in his legal position. \n28. Petitioner’s detriment to his position is the fact that he is self -represented.  \n29. Respondent’s detriment to her position is the lack of prosecution or defense. \nII. ARGUMENT  \n30. When it comes to remand, the obligation falls on the plaintiff to file with the state \ncourt a certified copy of the order of remand. TEX. R. CIV . P. 237a; see also Kashan v. McLane \nCo., NO. 03- 11-00125- CV , 7 (Tex. App. Jun. 7, 2012)  (holding that rule 237a’s notice \nrequirements cannot be satisfied by the district court, but must come from the plaintiff.)  \n 31. This prevents any trial on the merits, and prevents any relief to the Petitioner and his \nchildren.  \n 32. All other facts supported by evidence have already been provided to COOPER L. \nCA"}
{"id": "2bf2b5ad4877db997dceb2bba96a3e31fdaf614a", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "ff.)  \n 31. This prevents any trial on the merits, and prevents any relief to the Petitioner and his \nchildren.  \n 32. All other facts supported by evidence have already been provided to COOPER L. \nCARTER yet  continues to not engage and instea d call in favors from t he bench.  \n \nIII. CONCLUSION \nPetitioner  traveled to this court with a prepared emergency supported by exhibits only to \nbe turned away at the eleventh hour due to his self -represented status and in the face of no real \nopposition. The children were denied due process outright, and now have been l eft without a \nremedy. The proper course of action should have been to hear the TRO and put in place protections for the minor children pending any promises of consolidation.\n\nThe above statement of facts, unless promptly rebutted by COOPER L. CARTER, warrant \nimmediate relief as duly requested in the emergency TRO through a declaratory judgement, and this court \nshould proceed with the hearing date originally set for April 10th, 2025, and the emergency TRO should be \nGRANTED without further delay.  \nCOOPER L. CARTER disrupted much needed relief for the minor children in this case with false \npromises delivered to the tribunal that directly undermined the Petitioner’s due process rights. COOPER L. \nCARTER is fully aware that she cannot file anything in 322nd District Court because in doing so she would \nbe acting ultra vires.    \nPetitioner reasserts his position that COOPER L. CARTER is acting without authority, has no \nability to comply with 237a of the Texas Rules of Civil Procedure , and cannot explain how she is able to \nabandon a case for nearly a full calendar year, yet can suddenly show up to defend her alleged client before \nthis court for the sole purpose to prevent Petitioner’s emergency TRO from being heard , which was \npermitted despite being told he could present the motion. In what sense is this appropriate when children are involved? Does the attorney’s license give her a free pass to thwar"}
{"id": "f1934c7fcef579604275c7d972d6e2b7e28655f8", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "ing heard , which was \npermitted despite being told he could present the motion. In what sense is this appropriate when children are involved? Does the attorney’s license give her a free pass to thwart the rules and litigate in bad faith?  \nIt may be a needle in the haystack, but this case defies the initial presumption that pro -se litigants \nare not as equipped or as capable as licensed attorneys, and it is no fault of COOPER L. CARTER. The \nPetitioner reminds the court that the true culprit responsible for this circumstance remains the puppet master \nhiding in the background – the Respondent – and yet Petitioner wishes no harm to her because this litigation \nis about the children. The children need their mother, but they also need their father.  \nPerhaps the zealous passion has been misunderstood for contempt by the tribunal, but Petitioner’s \nmotive runs parallel to that set forth in the Texas Family Code. However, despite the procedural quagmire, the anomalies, the pro -se status, the solution rema ins simple:  \nGrant the relief. Nobody has argued against it, Texas law demands  it, and the best interests of the \nChildren depend on it. There remains no logical or legal basis to give COOPER L. CARTER any further \ndeference in the face of Petitioner’s self -represented status.  Petitioner  welcome s any response from\n\nCOOPER L. CARTER to the contrary . If such response were to be filed, it would be the first in over fourteen \nmonths of litigation.  \nIf approached from a logical standpoint, the situation can be interpreted as such:  \ni. COOPER L. CARTER is shackled by Rule 12 and Rule 237a of the \nTexas Rules of Civil Procedure  from reaching final trial. \nii. The 322nd District Court is shackled from proceeding due to Cooper \nL. Carter’s failure to prosecute.  \niii. The Petitioner is shackled from his home, his children’s daily lives, and his place of business under facially void orders  that claim \nconsent . \niv. Most critically, the children are shackled in a si"}
{"id": "a286c5d34313adeba794b0af41249b3e4a05d890", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "he Petitioner is shackled from his home, his children’s daily lives, and his place of business under facially void orders  that claim \nconsent . \niv. Most critically, the children are shackled in a situation that is not in their best interests and continue to suffer irreparable harm without any opportunity for relief  and without any lawful basis. \nIndeed, that leaves just one party un- chained from this situation:  \nthe Respondent.  Petitioner rests his case.  \nIV. PRAYER  \nWHEREFORE promises considered, the Petitioner, CHARLES DUSTIN MYERS, \nrequests the following expedited relief:  \n1. Take judicial knowledge that COOPER L. CARTER disrupted an emergency in bad faith and failed to fulfill her promise.  \n2. Grant the emergency TRO without delay and keep the original hearing date set for April 10\nth as agreed by the parties on March 28th, 2025.  \n3. Give no further deference to attorney COOPER L. CARTER, who has not prosecuted nor defended her position, and require a written response .\n\n4. Provide any further relief that the court deems appropriate given the \nextraordinary circumstances of this case.  \n \nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n PRO -SE \n \n \n \n \nCERTIFICATE OF SERVICE  \n Petitioner, CHARLES DUSTIN MYERS, confirms that on 03/31/2025, a copy of this \nPETITIONER’S STATEMENT  was served on the following party of record through their \naccount registered under the Electronic Filing Manager pursuant to Rule 21a of the Texas Rules \nof Civil Procedure:  \n  MORGAN MICHELLE MYERS, Respondent, at:  \n  MORGANMW02@GMAIL.COM  \n  A copy of the above pleading was also served to:  \n  COOPERCARTER@MAJADMIN.COM  \n \n \n \nRespectfully submitted,  \n \n /s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generat"}
{"id": "f0dc1c0f5d5b81b3158f954b9ac2ff5aed5622c5", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioners_statement_1\\03_31_25_petitioners_statement_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - Petitioners Statement-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 877, "text": "  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99125522\nFiling Code Description: Notice\nFiling Description: Petitioner's Statement\nStatus as of 4/1/2025 3:16 PM CST\nCase Contacts\nName\nMORGAN MICHELLEMYERS\nCHARLES DMYERS\nCHARLES MYERS\nMORGAN MICHELLEMYERSBarNumber Email\nMORGANMW02@GMAIL.COM\nCHUCKDUSTIN12@GMAIL.COM\nchuckdustin12@gmail.com\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/1/2025 11:18:44 AM\n4/1/2025 11:18:44 AM\n4/1/2025 11:18:44 AM\n4/1/2025 11:18:44 AMStatus\nSENT\nSENT\nSENT\nSENT"}