{"id": "e325cc333287a94b51b2ef2235afb22bbe48d452", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "322-744263-23\nNOTICE OF INTENT TO FILE MANDAMUS\n05.21.25M.3905 M.3905\nM.3905 M.3905 M.3905 M.3905\n\n1 \n NO. 322-744263-23 \n \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTo the Honorable John H. Cayce Jr. : \n         Respondent in the above styled cause, CHARLES DUSTIN MYERS, (“the \nRespondent”) submits this notice of intent to file mandamus to respectfully challenge the orders entered into the record of cause number 322-744263-23 on May 20, 2025. This notice is submitted in good faith to afford the Court an opportunity to vacate or correct \nthe orders, and to avoid the necessity of further extraordinary intervention. The \nRespondent maintains that the record, on its face, demonstrates a clear deviation from procedural due process and established Texas jurisprudence regarding recusal proceedings, warranting immediate corrective action to uphold this court’s impartiality \nand public confidence in the judiciary. \n  \nIN THE INTEREST OF M.E.M., C.R.M., two \nchildren) MORGAN MICHELLE MYERS  \n  \n  \nPetitioner,   \n  \n  \nCHARLES DUSTIN MYERS,  Notice of Intent to File Mandamus  \n \n  \nRespondent.   \n  \n  \n2025 -05-21  322-744263-23 FILED\nTARRANT COUNTY\n5/21/2025 9:37 AM\nTHOMAS A. WILDER\nDISTRICT CLERKM.3906 M.3906\nM.3906 M.3906 M.3906 M.3906\n\n2 \n I. INTRODUCTION \nThis Court overruled an objection filed by the Respondent, CHARLES DUSTIN \nMYERS, which complained that the Court was deviating from Rule 18a of the Texas \nRules of Civil Procedure by involving the judge’s personally appointed court coordinator \nin the process. The court then used the same rule to summarily deny relief. This selective \nuse of Rule 18a defeats the entire purpose of the rule, undermines the recusal process, and serves the opposite effect of what the Legislature had intended.  \nII. THE RECUSAL PROCESS  \nEach party in this process has their own clear, designated role which is \nunambiguously set forth in the Texas Rules of Civil Procedure to ensure that the proceedings do not appear prejudi"}
{"id": "2928e14011b268bb6841a82505e44e7603b71823", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "L PROCESS  \nEach party in this process has their own clear, designated role which is \nunambiguously set forth in the Texas Rules of Civil Procedure to ensure that the proceedings do not appear prejudicial or impartial after a question of impartiality has been raised.   \n1. THE MOV ANT \nThe Movant’s responsibility is to comply with the requirements of Id.  18a(a) et seq., \nwhich the Court contends were not satisfied. However, compliance is a matter to be addressed only after the motion has been received and processed in accordance with the rule's mandatory transfer procedures. Once a motion is filed—regardless of perceived sufficiency—the initial responsibility shifts to the clerk of the Court. \n2. THE CLERK OF THE COURT \nThe filing of the motion activates the clerk’s responsibility under Id. 18a(e)(1), which \nrequires prompt delivery of the motion to both the Regional Presiding Judge and the M.3907 M.3907\nM.3907 M.3907 M.3907 M.3907\n\n3 \n Respondent Judge. Upon completion of this task, the next procedural duty shifts to the \nRespondent Judge. \n3. THE RESPONDENT JUDGE  \nUpon receipt of the motion from the clerk, the Respondent Judge is required to make \none of two possible decisions set forth in Id. 18a(f)(1). He can either choose to recuse \nhimself pursuant to Id. 18a(f)(1)(A) by filing with the clerk an order of recusal, or he can \nchoose to file with the clerk an order of referral to the Regional Presiding Judge. When this decision is made, the procedural responsibility shifts back to the clerk, who must then comply with Id. 18a(e)(2) and deliver a copy of the decision made to the Regional Presiding Judge. \n4. THE REGIONAL PRESIDING JUDGE  \nUpon receipt of a referred motion, the Regional Presiding Judge can either rule on the \nmotion or assign a judge to rule pursuant to Id. 18a(g)(1). This portion in the chain of procedural responsibility is when a determination can be made regarding the Movant’s compliance with Id. 18a(a) et seq assuming all procedural requiremen"}
{"id": "0fe17100d0a1b80dd427f4ee8407df69f94df651", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "to Id. 18a(g)(1). This portion in the chain of procedural responsibility is when a determination can be made regarding the Movant’s compliance with Id. 18a(a) et seq assuming all procedural requirements were followed, \nand no objections arise. \n5. FAILURE TO COMPLY  \nIf the Respondent Judge fails to comply with a duty imposed by the rule, the \nRelator reserves the right to “notify the Regional Presiding Judge”. Id. 18a(f)(3 ).  \nOtherwise, Id. 18a(a) et seq. would now be fair game to attack the merits of the \nmotion filed by the Respondent.  M.3908 M.3908\nM.3908 M.3908 M.3908 M.3908\n\n4 \n  \nM.3909 M.3909\nM.3909 M.3909 M.3909 M.3909\n\n5 III. LEGAL ANALYSIS\nIn the instant matter, the recusal process was not followed in accordance \nwith the procedure outlined above. The Respondent correctly invoked Texas Rule \nof Civil Procedure 18a(f)(3) by filing a timely objection to procedural deviations in the administratio n of the recusal proceedings . The objection identified two core \nissues: (1) the involvement of the court coordinator in the handling and forwarding of the recusal motion, and (2) the fact that the motion to recuse the Honorable Jeff Kaitcer was never forma lly filed in this cause number, thereby invalidating any \nreferral or adjudication related to it.  \nThese two procedural irregularities, when viewed together, undermine the \nstructural integrity of the recusal process and violate the mandatory requirements under Rule 18a. The rule does not permit informal substitution or delegation of \nduties to non- judici al actors such as court coordinators in matters as serious as \njudicial Recusal . If the Legislature had intended for a role designation in  this \nprocess for coordinators, it would be set forth in the Rule.  By overruling this \nrequest on the grounds of  74.102(b)  and leaving the issue of the Kaitcer motion \nunresolved, the Respondent filed a Petition for Writ of Mandamus in the Texas \nSupreme Court docketed under case No. 25 -0426 . However, without a s"}
{"id": "f32a8fefb3c05a66eb08d94924b24f451712bc80", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "02(b)  and leaving the issue of the Kaitcer motion \nunresolved, the Respondent filed a Petition for Writ of Mandamus in the Texas \nSupreme Court docketed under case No. 25 -0426 . However, without a stay in \nplace, this Court had the ability to attack the merits of the motion, which were ripe \nfor attack regardless of his filing of a Mandamus in the Texas Supreme Court.  M.3910 M.3910\nM.3910 M.3910 M.3910 M.3910\n\n6 IV. THE MOTION TO RECUSE\nIn the opening paragraph of the Amended Motion to Recuse Hon. James Munford, \nit states: \n“ The act of setting this case for final trial after sustaining over a year of \nirreparable harm while appellate proceedings remain unresolved is itself an act of \npartiality warranting mandatory recusal pursuant to Tex. R. Civ. P. 18b(b)(1) and \n18b(b)(2) on the grounds that the impartiality of the tribunal is reasonably in \nquestion, and there is a clear personal bias and prejudice exhibited towards the \nundersigned. This petition has been amended as the youngest child named in this \nsuit has now sustained injury due to the collective negligence of the parties named \nherein, and the entire compiled case record has been attached. The statement of \nfacts below highlights a clear bias towards the undersigned for reasons that can’t \nbe attributed to the record. ” \nPursuant to Rule 18a et seq. , the motion was verified, the motion stat ed with \nparticularity the grounds for recusal pursuant to 18b, it pr ovided a statement of facts \nreflecting the Respondent ’s beliefs, provi ded direct links to the references which make up \nthe foundation for those beliefs, and those references are self-authenticating documents, \nare part of the official court record, and therefore would be admissible into evidence. \nV. SUMMARY DENIAL\nThe Court’s decision to summaril y deny the motion to recuse Hon. James Munford \nand also summarily deny a motion that was never filed raises the question as to what \nmotion the court was reviewing, and if it was a true and accura"}
{"id": "efe794ce6418909338677e43e048c03242d7663d", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "il y deny the motion to recuse Hon. James Munford \nand also summarily deny a motion that was never filed raises the question as to what \nmotion the court was reviewing, and if it was a true and accurate copy of the motion as \nfiled with the clerk of the court.  While the Respondent respects t his court’s engagement, \nthe reasoning provi ded does not co mport with the face of the motio n. The bookmarks M.3911 M.3911\nM.3911 M.3911 M.3911 M.3911\n\n7 provided in the P DF alone provide clear grounds for recusal that a re not solely based on \nthe judge’ s rulings. Had the court summar ily denied the motion on the grounds of \ntimeliness – it would have been more appropriate and ma ndamus would not have been \nthe appropriate method of attack.  \nHere, the ruling on a motion which was ne ver filed came a fter the involvement of \nthe court coordinator who serves at the pleasure of the same Judge subject to recusal. See \nTex. Gov’t. Code § 74.101(b). By introdu cing unnecessary ambiguity into these \nproceedings which have a clear process outlined in the Rules, the impartiality of the trial \ncourt remains in question, the summary denial does not c omport with the motion filed, \nand the core issues of the case remain burie d underneath procedural abnormalities that \ncontinue to compound. \nCONCLUSION AND PRAYER \nFor all these reasons, the Respondent respectfully argues that it was an abuse of \ndiscretion to summarily deny the r ecusal motion regarding Hon. James Munford without \na hearing. As stated across all four concurre nt mandamus petitions currently pending in \nthe Supreme Court of Texas, the Respondent and the Children continue to suf fer ongoing \nharm while the Petitioner remains silent, her counsel refuses to prosecute, and the errors \ncontinue to compo und, leaving the Respondent without an adequat e remedy for relief. \nThe Respondent pr ays the Court reconsider its’ denial and set this matter for a  hearing, or \nin the alternative, provide input in the Texas Supreme Cour"}
{"id": "768d214d245fa9425d674d2d614acd594f898881", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_21_25_notice_of_intent_to_file_mandamus_233_1\\05_21_25_notice_of_intent_to_file_mandamus_233_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.21.25 - Notice of Intent to File Mandamus (233)-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 1530, "text": "dent without an adequat e remedy for relief. \nThe Respondent pr ays the Court reconsider its’ denial and set this matter for a  hearing, or \nin the alternative, provide input in the Texas Supreme Court to effectuate justice. \nThis situation warrants further clarification as it has no basis in Texas law. M.3912 M.3912\nM.3912 M.3912 M.3912 M.3912\n\n8 Respectfully submitted, \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS \nCHUCKDUSTIN12@GMAIL.COM \n817-546-3693\nPRO -SE\nCERTIFICA TION OF SERVICE \nPursuant to rule 2 1a Tex.R.Civ.P., a copy of this notice has been served to all \nparties of record via the EFM. \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS M.3913 M.3913\nM.3913 M.3913 M.3913 M.3913\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 101092760\nFiling Code Description: Notice\nFiling Description: Notice of Intent to File Mandamus\nStatus as of 5/22/2025 3:06 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYESBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.govTimestampSubmitted\n5/21/2025 9:37:57 AM\n5/21/2025 9:37:57 AM\n5/21/2025 9:37:57 AMStatus\nSENT\nSENT\nSENTM.3914 M.3914\nM.3914 M.3914 M.3914 M.3914"}