{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\02.25.25 - OBJECTION AND REQUEST FOR JUDICIAL NOTICE-1.pdf",
  "base_name": "02_25_25_objection_and_request_for_judicial_notice_1",
  "page_count": 19,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF \nTARRANT COUNTY , TEXAS  \n \n \nTO T HE HONORABLE REVEWING JUDGE:  \n \nI. INTRODUCTION \nWhat incentive does this Court have, if not to uphold the \nvery laws it is sworn to enforce, to restore long-overdue justice in \nthis matter? How many unopposed motions must be filed, and how \nmuch procedural entanglement must be endured, before \nsubstantive relief is granted? This case hinges on a purported \nsettlement agreement that plainly lacks the required consent of \nboth parties, leaving no valid mutual assent. Yet procedural barriers \nand administrative mishandling have thwarted any genuine review \nof these issues.  \nBefore this Court can even see the motion, it must pass \nthrough the same administrative staff whose conduct has hindered \nthe proper adjudication of this dispute. In particular, the Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. OBJECTION  AND REQUEST FOR \nJUDICIAL NOTICE  \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2025-02-25  322-744263-23\nFILED\nTARRANT COUNTY\n2/24/2025 1:14 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1097
    },
    {
      "page_number": 2,
      "text": "undersigned formally objects to the involvement of Court \nCoordinator Lindsey Baker —who has already mishandled crucial \naspects of recusal proceedings —in any further handling of \npleadings or hearing requests. Despite clear entitlement to timely \njudicial review, the undersigned, CHARLES DUSTIN MYERS , \nremains unjustly delayed in receiving the relief this Court is well within its authority to provide. \nFor these reasons, and because justice must not be \nindefinitely postponed, the Court should act promptly and \ndecisively, granting the long- overdue relief warranted under the \nlaw and prevent court administrati on from further obstructing \njustice.  \nThe undersigned, CHARLES DUSTIN MYERS, is long \noverdue for relief from this court , and it should be delivered now \nand without delay for the forthcoming reasons  as supported by \nlong- standing Texas  laws – both ethical and statutory : \n \nII. STATEMENT OF FACTS  \n \n1. On October 1, 2024, pursuant to Misc. Docket No. 24- 9030  \n \nissued by the Supreme Court of Texas, electronic filing   became mandated which included the provision that county   clerks are to integrate their local case management systems   with the electronic filing manager - re:SearchTX . \n \n2. On October 7, 2024, at exactly 7:30 A.M. CST, the \nundersigned, CHARLES DUSTIN MYERS, submitted a \nJoint Motion to Recuse Judges James Munford and Jeff Kaitcer of the 322\nnd District Court of Tarrant County, Texas",
      "char_length": 1445
    },
    {
      "page_number": 3,
      "text": "and the motion was  submitted via the re:SearchTX \nplatform.  \n3. On October 7, 2024, at exactly 10:46 A.M. CST, the court \nstaff accepted the Joint Motion to Recuse via envelope number 92846417 through the re:SearchTX platform . \n4. On October 8, 2024, at exactly 4:43 P.M. CST, the undersigned was sent an email by the court coordinator, Lindey Baker, of the 322\nnd District Court of Tarrant Count y \nwhich contained two files:  \ni. The correspondence letter between District Judge James Munford and Regional Presiding Judge David L. Evans. \nii. A modified version of the original Joint Motion to Recuse filed by the undersigned which was missing the sworn affidavit and attached exhibits.  \n5. On October 8, 2024, at exactly 6:29 P.M. CST, the undersigned responded to Baker’s email pointing out the discrepancy and attached a copy of the original motion. \n6. On October 8, 2024, at exactly 10:43 P.M., Baker replied “The exhibits were e -filed and are included in the Courts \nfile.”.",
      "char_length": 987
    },
    {
      "page_number": 4,
      "text": "7. On October 9, 2024, at exactly 12:06 A.M., the undersigned \nfurther noted the discrepancy in file sizes between the original submission and the version that was delivered to regional judge David L. Evans and marked the end of email correspondence.  \n8. On October 9, 2024, at exactly 12:18 P.M., the undersigned \nwas forwarded another email correspondence from Baker, which contained four files:  \ni. The amended correspondence letter between District Judge James Munford and Regional Presiding Judge David L. Evans, \nii-v.   A modified version of the original Joint \nMotion to Recuse – now spliced into three documents labeled “Myers -Part1”, “Myers -\nPart2”, and “Myers -Part3”.  \n9. Baker’s justification for the modification of the original submission was claimed to be due to the file size of the motion.  \n10. Baker’s answer directly contradicted how electronic filing is normally handled by the clerks. https://www.tarrantcountytx.gov/content/dam/main/district-\nclerk/Efiling_Frequently_Asked_Questions.pdf",
      "char_length": 1016
    },
    {
      "page_number": 5,
      "text": "11. The file size limit on the re:Search Texas platform is 35mb, \nand the undersigns original motion was well under this limit at approximately 20mb in size.  \n12. On October 10, 2024, Jeff Kaitcer also chose not to recuse himself, and Baker forwarded a third email correspondence to the undersigned which contained two files:  \ni. The correspondence letter between Associate Judge Jeff Kaitcer and Regional Presiding Judge David L. Evans, \nii. A modified version of the original Joint Motion to Recuse , however, as one \ndocument containing all exhibits and the affidavit that were missing from District \nJudge James Munford’s original order of referral, and directly in conflict with Baker’s prior statement regarding the file size.  \nIII. LEGAL ANALYSIS  \n1. Sec. 37.01 of the Texas Penal Code defines the following terms:  \n“(1) ‘Court record’  means a decree, judgment, order, \nsubpoena, warrant, minutes, or other document issued by a \ncourt of:  \n(A) this state; \n(B) another state;  \n(C)  the United  States;  \n(2) \"Governmental record\" means:",
      "char_length": 1051
    },
    {
      "page_number": 6,
      "text": "(A) anything belonging to, received by, or kept by \ngovernment for information, including a court record;  \n(3) \"Statement\" means any representation of fact. ” \n2. Sec. 37.10.  of the Texas Penal Code sets forth the following if a \nGovernmental Record is tampered with:  \n  “(a) A person commits an offense if [s]he:  \ni. knowingly makes a false entry in, or false \nalteration of, a governmental record;  \n ii. makes, presents, or uses any record, document, or thing with knowledge of its falsity and with intent that it be taken as a genuine governmental record;  \n \niii. intentionally destroys, conceals, removes, or otherwise impairs the verity, legibility, or availability of a governmental record;  \n 3. Texas Government Code §§ 74.101–74.106 (Court \nAdministration Act)  sets forth the purpose and duties of the court \ncoordinator , which:  \ni. authorizes the appointment of court coordinators to assist \njudges in administering court dockets and operations.  \nii. The statute lays out that court coordinators “shall \nperform nonjudicial duties assigned by the judge, including \nmaintaining the judge’s docket, scheduling hearings, and other administrative tasks.”  \n4. The Texas Rules of Civil Procedure  rule 18a outlines the recusal \nprocess, which amongst other provisions  including the duties of the \nregional presiding judge  and the clerk of the court , which states  \nunder subparagraph (g):",
      "char_length": 1406
    },
    {
      "page_number": 7,
      "text": "“The regional presiding judge or judge assigned to decide \nthe motion may issue interim or ancillary orders in the \npending case as justice may require. ” \n5. And for the clerk , under subparagraph (e) of the Texas Rules of \nCivil Pr ocedure 18a:  \ni. When a motion or response is filed, the clerk of the court \nmust immediately deliver a copy to the respondent judge and to the presiding judge of the administrative judicial region in which the court is located ( \"the regional presiding judge\" ). \n6. And for the Respondent Judge(s)  under subparagraph (f):  \ni. (1) Responding to the Motion. Regardless of whether the \nmotion complies with this rule, the respondent judge, within three business days after the motion is filed, must either:  \n(A) sign and file with the clerk an order of recusal or disqualification; or  \n(B) sign and file with the clerk an order referring the motion to the regional presiding judge. \n7. Finally, TRCP 21(f)(11) forbids the clerk from refusing to file a \ndocument that fails to strictly conform to the e -filing rules. Instead,",
      "char_length": 1063
    },
    {
      "page_number": 8,
      "text": "“the clerk may not refuse to file a document that fails to conform \nwith this rule” – the clerk may only notify the filer of the error and set a deadline to resubmit in correct form.  \n8. The aforementioned laws have been grossly neglected by this \ncourt, and rather than providing justice, it is being actively denied.  \nIV. ARGUMENT  \nA. The Court Coordinator Lacked Legal Authority to Handle the Recusal Filings  \n  \n \n \n \n \n \n \n \n  \n \n \n 1.Coordinators Have No Independent Authority Over F iling \nor Docketing.\nUnder Texas Government Code §§ 74.101–74.106, a court \ncoordinator’s role is strictly administr ative: maintaining the  \njudge’s docket, scheduling hearings, and other nonjudicial  \ntasks. In contrast, the clerk of the court is the official  \ncustodian of court filings, responsible for receiving, filing,  \nand preserving all pleadings.\n2.Texas Rule of Civil Procedure 21(f)(1 1) explicitly states  \nthat once a document is e-f iled in accordance with the rules, \nthe clerk “may not refuse to file” it, even if  it fails to  \nconform perfectly . There is no mention of a coordinator  \nhaving any parallel authority .",
      "char_length": 1132
    },
    {
      "page_number": 9,
      "text": "3.As explained in the facts, Court Coordinator Lindsey Baker  \ntook it upon herself to “modify” the Joint Motion to \nRecuse, omitting the sworn affidavit and exhibits from the \nversion that was apparently sent to the Regional Presiding \nJudge. Such an act goes beyond any permissible  \nadministrative function and constitutes a direct interference  \nwith court records and is a criminal offense in Texas.\n4. Coordinators Are Not Granted a Role Under TRCP 18a \nMotions to recuse are governed by Rule 18a of the Texas  \nRules of Civil Procedure, which specifically names the \nclerk of the court, the respondent judge, and the regional  \npresiding judge— not a court coordinator.\n5.Rule 18a(e): The clerk “must immediately deliver a copy” \nof the filed recusal motion to the respondent judge and \nregional presiding judge. This duty is the clerk’s alone, not  \nthe coordinator’s.\n6.Rule 18a(f): The respondent judge has three business days \nto act—either recuse voluntarily or refer the motion to the  \nregional presiding judge. Again, no role is assigned to a  \ncoordinator for screening, modifying, or distributing the  \ndocument.\n7.Unauthorized Alteration of Filings C an Constitute \nTampering.",
      "char_length": 1194
    },
    {
      "page_number": 10,
      "text": "By “splicing” the motion af ter pointing out the modi fied \nsubmission, Baker created what amounts to a false or \nincomplete record  for official purposes. Texas Penal Code \n§ 37.10(a) prohibits knowingly making a “false entry in, or false alteration of, a governmental record” and intentionally “impairing the availability” of that record.  \n8. Because court filings fall within the definition of “governmental record” in Penal Code § 37.01(2), Baker’s unilateral modifications raise serious concerns under the tampering statute, as well as potential violations of due process.  \n9. Accordingly, any action Baker took regarding the recusal motion was ultra vires  (beyond lawful authority) \nand compels the Court to acknowledge that the filing process was improperly subverted. \n  B. The failure to properly File and Refer the Recusal \nMotion Violates TRCP 18a \n10.\n The Respondent Judge’s Strict Three -Day Obligation  \nRule 18a(f)(1) imposes a mandatory duty on a judge who is the subject of a recusal motion: within three business days of the motion’s filing, the judge must either sign an order of recusal or sign and file  an order referring the motion to the \nregional presiding judge. Failing to comply is more than a",
      "char_length": 1225
    },
    {
      "page_number": 11,
      "text": "minor procedural error— it thwarts the entire recusal \nframework.  An informal email is not the proper way to \nhandle recusal in Texas.  \n  \n \n \n \n \n \n  \n \n \n \n  \n \n \n \n \n \n \n  \n 11.As stated in the facts, District Judge James Munford did \nnot promptly issue a signed referral order upon the filing of  \nthe Joint Motion to Recuse. Instead, the motion was  first \ncirculated via unofficial emails—rather than properly  filed\n—to the regional presiding judge, causing confusion  and \nincomplete documentation  and a modified version of the \noriginal.\n12.This departure from Rule 18a is not trivial. The Texas \nSupreme Court has emphasized that a respondent judge’s \nprompt action is crucial to safeguarding a party’s due \nprocess right to a neutral decision-m aker.\n13.Email Transmissions Do Not Substitute for Official F iling.\nThe rule unequivocally requires the judge to file the order \n(whether recusal or referral) with the clerk. Emailing  \nmaterials to the regional judge does not satisfy the formal \nrequirement of “filing,” which ensures transparency , an \nofficial record, and compliance with e-f iling mandates.\n14.By attempting to circumvent the standard procedure, Judge  \nMunford effectively allowed the motion to proceed in a  \nmanner that bypassed the clerk’s docket, thereby denying",
      "char_length": 1298
    },
    {
      "page_number": 12,
      "text": "the undersigned the procedural safeguards guaranteed by \nRule 18a(e) –(g). \n  \n \n \n \n \n \n \n \n \n  \n \n 15.Consequence: Improper Handling Voids Subsequent \nActions Under well-e stablished case law (e.g., Hudson v. \nTex. Children’ s Hosp., 177 S.W.3d 232 (Tex. App.—\nHouston [1st Dist.] 2005, no pet.)), actions taken after a \nrecusal motion is improperly handled or ignored may be \nrendered void. This is precisely what has occurr ed here, \nand now the court is stonewalling the undersigned when it  \nhas every reason to g rant immediate relief.\n16.Here, since the required procedure was never followed, any  \nsubsequent determinations or referrals by Judge Munford or \nAssociate Judge Kaitcer ( also named in the recusal) stand \non precarious legal ground.\n \n  C. The Clerk Must Docket t he Recusal Motion in Full and \nWithout Alteration \n 17. Clerk’s Non-D iscretionary Duty Under TRC P 21 \nOnce a motion is e- filed, the clerk must file -stamp and note \nit on the court’s docket. The clerk’s office has no discretion to reject or modify a filing based on substantive content. There is still no tra ce of the originally submitted Joint \nRecusal motion found on the re: Search Texas platform.",
      "char_length": 1190
    },
    {
      "page_number": 13,
      "text": "18.TRCP 21(f)(11): “The clerk may not refuse to file a  \ndocument that fails to conform to these rules.” Thus, even if \nthere were perceived tech nical issues (e.g., file size), the  \ncorrect remedy is for the clerk to notify the filer, not to alter  \nthe motion or remove exhibits and then give false \nstatements as to the intentions behind t he alteration.\n19.Coordinator Interference Does Not Relieve the Clerk of \nResp onsibility\nEven if the coordinator allegedly modified the filing or  gave \ninstructions, the clerk’s statutory obligation remains.  If the \nclerk allowed the coordinator’s altered version to  replace \nthe original in official communications with the regional \njudge, that constitutes a serious breakdown of  mandated \nprocesses and a violation of the court’s duty to maintain \naccurate records.\n20.Presumption of Prejudice\nGiven the importance of a recusal motion and the  \nrequir ement of impartiality, any int erference with the  \nfiling is presumed prejudicial to the party seeking recusal.  \nThe undersigned was effectively denied the protections of \ndue process, including the right to have his motion heard on  \nthe complete merits with all supporting exhibits an d \naffidavits.",
      "char_length": 1207
    },
    {
      "page_number": 14,
      "text": "D. Denial of Due Process and Subversion of Justice \n  \n \n \n \n \n \n \n \n  \n \n \n \n \n \n \n \n  \n \n \n \n 21.Fundamental Right to a Fair  Tribunal\nThe undersigned has a constitutional right to an impartial  \njudge, guaranteed by Article I, Section 19 of the Texas  \nConstitution (due course of law) and the Fourteenth  \nAmendment of the U.S. Constitution (due process). When a \nlitigant files a motion to recuse, the rules ser ve as a  \nsafeguard for that right. Subverting these procedures \nequates to subverting due process.\n22.Active Denial of Justice\nThe undersigned remains unjustly barred from relief, as the \ncentral issue—lack of valid consent in the purported \nsettlement—h as never been legitimately addressed. Instead,  \nit is tangled in administrative gatekeeping that co ntravenes  \nmultiple provisions of state law. “Justice delay ed is justice  \ndenied,” and the repeated mishandling of filings amounts to \nan active refusal to apply the law.\n23.Public Confidence Und ermined\nThe proper functioning of the judiciary requires the highest \nstandards of transparency and fairness. When court \npersonnel assume unauthorized roles (e.g., altering  motions) \nand judges neglect their duties to file and refer recusal \nmotions within the prescri bed time, the public",
      "char_length": 1264
    },
    {
      "page_number": 15,
      "text": "confidence in the judicial system  is undermined. Texas \nlaw and judicial ethics both demand swift correction. \nE. The Court Should Grant Immediate Relief and Rectify \nProcedural  Violations \n  \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n  24.Restoring the Proper Status of the Recusal Motio n\nTo remedy these violations, the Court must o rder the clerk  \nto place the original, unaltered Joint Motion to Recuse on \nthe official docket. Any reference to the coordinator’s\n“spliced” or incomplete version should be nullified.\n25.Enjoin Court Coordinator fro m Interfering with Filings  \nThe Court should instruct that the coordinator has no \nauthority to edit, withhold, or otherwise alter motions or \nother pleadings, especially those that are time-sensitive and \nimplicate the impartiality of th e judiciary. If necessary, the  \nCourt should issue an order forbidding any unauthorized  \nhandling of recusal or other critical motions. The \nundersigned respectfully objects to Baker’s handling of any \nfurther documents  or administrative actions in this case,  \nincluding scheduling h earings, and the undersigned reserves \nthe right to pursue legal  action if necessary to protect his \nrights and the rights of his children.\n26.Award Such Other Relief as Justice Requires\nThe undersigned seeks any further orders to which he may",
      "char_length": 1319
    },
    {
      "page_number": 16,
      "text": "be entitled, whether to address any ongoing interference, to \nprovide injunctive relief ensuring fair access to the Court, or to sanction improper conduct that has obstructed the administration of justice.  The Regional Presiding judge \nwho is overseeing this matter not only ha s the legal \ndiscretion to issue inter im orders pursuant to TRCP 18a, but \na legal obligation considering the circumstances.  \nV . PRAYER FOR IMMEDIATE RELIEF  \nWHEREFORE,  based on the foregoing legal arguments and \napplicable authorities, the undersigned respectfully urges this Court to: \n  \n \n  \n \n \n  \n \n  \n \n 27.Recognize that the recusal motion was improperly withheld  \nand altered by the court coordinator;\n28.Direct the clerk to immediately file and docket the  \ncomplete, unaltered Joint Motion to Recuse with all  \nexhibits and affidavits;\n29.Enjoin any further unauthorized modifications or \ninterference by non-clerk personnel; and\n30.Grant such other and further relief as the interests of justice  \nand due process require without a hearing and with specific  \ninstructions permitting the undersigned to return to his  \nhome at 6641 Anne Court, Watauga, Tx, 76148.  \nOnly until then can justice be served in this matter and the best interests of the \nchildren upheld.",
      "char_length": 1263
    },
    {
      "page_number": 17,
      "text": "Respectfully Submitted,  \n  /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 AN NE COURT  \n WATAUGA, TEXAS  76148 \n 817-546-3693  \n CHUCKDUSTIN12@GMAIL.COM  \n PRO -SE",
      "char_length": 174
    },
    {
      "page_number": 18,
      "text": "CERTIFICATE OF SERVICE  \nPursuant to TRCP  21(a), the undersigned certi fies that a \ntrue and accurate copy of the OBJECTION AND \nREQUEST FOR JUDICIAL NOTICE has been filed and served upon all parties of record through the Texas Supreme Court approved electronic filing manager, re:Search Texas  at the following: \nT\no Opposing Counsel COOPER L. CARTER at her email \naddress not on file with the EF M: \nCOOP\nERCARTER@MAJADMIN.COM  \nTo the Petitioner, MORGAN MICHELLE MYERS, via email  on file with the EFM:  \nM\nORGANMW02@GMAIL.COM  \nD\nated on this 24th day of February, 2025. \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \n6641 AN NE COURT  \nWATAUGA, TEXAS  76148 \n817-546-3693\nCHUCKDUSTIN12@GMAIL.COMPRO -SE",
      "char_length": 711
    },
    {
      "page_number": 19,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 97716806\nFiling Code Description: Request\nFiling Description: Objection and Request for Judicial Notice\nStatus as of 2/24/2025 1:58 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYESBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n2/24/2025 1:14:22 PM\n2/24/2025 1:14:22 PM\n2/24/2025 1:14:22 PMStatus\nSENT\nSENT\nSENT",
      "char_length": 797
    }
  ]
}