{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\07.11.25 - RELATOR'S STATEMENT.pdf",
  "base_name": "07_11_25_relator_s_statement",
  "page_count": 15,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 25-0458 \nIN THE SUPREME COU RT OF \nTEXAS \nIN RE: CH\nARLES DUSTIN MYERS  § \n§ \n§ \n§ \n§ RELATOR ’S STATEMENT\n§\n§ \n§ \n§ \n§ \nTO THE H\nONORABLE SUPREME COURT OF TEXAS:  \nRelator CHARLES DUSTIN MYERS  (“M yers”) respectfully submits this \nstatement to the Court out of deep concern for our Texas Judiciary, the future of \nour State, and the children who will be our future leaders.  \nI.Summary\n1.The Texas judiciary has systematically failed Charles Dustin Myers and\nhis children through an interconnected pattern of procedural violations, refusal to \naddress meritorious claims, and disregard for clear mandates of law requiring \nprioritization of children's welfare. This multi -level judicial breakdown—from FILED\n25-0458\n7/11/2025 3:29 PM\ntex-103044950\nSUPREME COURT OF TEXAS\nBLAKE A. HAWTHORNE, CLERK\nCopy from re:SearchTX",
      "char_length": 825
    },
    {
      "page_number": 2,
      "text": "unanswered trial court motions to unexplained appellate denials —demonstrates \nhow when judges fail to uphold their constitutional and statutory responsibilities, \nvulnerable children suffer irreparable harm and citizens lose faith in the very institutions de signed to protect them.  \n 2. The case of Charles Dustin Myers reveals a troubling pattern of judicial \nfailures at every level of the Texas court system. From trial courts that refuse to hear properly filed emergency motions affecting children's welfare, to appellate courts issuing une xplained per curiam  denials, to the apparent unwillingness of the \nSupreme Court to exercise its supervisory authority, this case exemplifies a systemic breakdown in judicial accountability. These failing courts have ignored clear statutory mandates requiring that proceedings  involving children be \nconducted expeditiously and with the children's best interests as the \"primary consideration.\"  \n 3. The consequences of this judicial abdication extend far beyond a single \ncase. When courts fail to fulfill their most basic duties —hearing motions, \nexplaining decisions, correcting errors, and ensuring timely resolution— they not \nonly harm the specific child ren involved but also send a dangerous message that \nthe judiciary may selectively enforce laws and procedural requirements. This undermines public confidence in the legal system and suggests that self -\nCopy from re:SearchTX",
      "char_length": 1438
    },
    {
      "page_number": 3,
      "text": "represented litigants may expect less protection from the courts, directly \ncontradicting the fundamental promise of equal justice under law.  \nII. Background and Relevant Law  \n 4. The Texas legal framework establishes clear and unequivocal \nresponsibilities for judges at all levels when handling cases involving children. The Texas Family Code mandates that \"[t]he best interest of the child shall always be the primary consideration of  the court in determining the issues of conservatorship \nand possession of and access to the child.\"  Tex. Fam. Code § 153.002. This is not \nmerely aspirational language but a binding directive that guides all judicial decision -making in family law cases.  \n 5. Additionally, the Texas Government Code requires that courts \"shall \nrequire that proceedings be conducted with dignity and in an orderly and expeditious manner and control the proceedings so that justice is done.\"  Tex. Gov't. \nCode § 21.001. This provision establishes the fundamental duty of trial courts to ensure timely proceedings, particularly crucial in matters involving children's welfare.  \n 6. For emergency situations, the Texas Family Code specifically authorizes \ncourts to issue temporary orders \"for the safety and welfare of the child.\"  Tex. \nFam. Code § 105.001 . This provision acknowledges that situations involving \npotential harm to children may require immediate judicial intervention.  \nCopy from re:SearchTX",
      "char_length": 1437
    },
    {
      "page_number": 4,
      "text": "7. In cases involving termination of parental rights or similar matters \naffecting the parent -child relationship, the Texas Family Code emphasizes the need \nfor expedited resolution, mandating that \"[t]he appellate court shall render its final \norder or judgment  with the least possible delay.\"  Tex. Fam. Code § 263.405. This \nunderscores the legislature's recognition that prolonged legal proceedings can themselves harm children.  \n 8. The Texas Supreme Court also has specific statutory responsibilities \nregarding cases involving children. The Texas Government Code requires that \"the supreme court, in conjunction with the Supreme Court of Texas Permanent Judicial Commission for Children, Youth and Families, annually shall provide guidance to \njudges who preside over child protective services cases or juvenile cases to establish greater uniformity across the state.\"  Tex. Gov't. Code § 22.0135. This \nprovision recognizes the Supreme Court's supervisory role in ensuring consistent \nhandling of cases involving children.  \n 9. Furthermore, the Texas Supreme Court has authority to issue writs of \nmandamus to compel lower courts to fulfill their judicial obligations. The Texas Government Code specifically provides that \"the supreme court or a justice of the supreme court may issue writs of procedendo and certiorari and all writs of quo warranto and mandamus agreeable to the principles of law regulating those writs\" \nCopy from re:SearchTX",
      "char_length": 1456
    },
    {
      "page_number": 5,
      "text": "against lower court judges.  Tex. Gov't. Code § 22.002. This authority is essential \nfor addressing situations where lower courts fail to act or act improperly.  \nAnalysis of Judicial Failures in Myers' Case  \nIII. Trial Court Failures  \n 10. The record in Myers' case reveals profound failures at the trial court \nlevel that directly contravene the statutory mandates outlined above. Most \negregiously, the trial court refused to hear Myers' properly filed emergency temporary restraining order (TRO), turning him away from the courtroom without a hearing. This refusal violates the court's basic ministerial duty to hear and rule on properly filed motions, particularly those alleging imminent risk to children.  \nAs emphasized by Texas courts, \"When a motion is properly filed and pending before a trial court, the act of considering and ruling upon that motion is a ministerial duty.\"  In re Layton, 257 S.W.3d 794, 795 (Tex. App. —Amarillo 2008, \norig. proceeding). The refusal to even consider an emergency application \nconcerning child welfare directly contravenes this principle and the statutory mandate to prioritize children's best interests under  Tex. Fam. Code § 153.002.  \n 11. The court's refusal is particularly troubling given that it apparently acted \nswiftly on earlier applications filed by the opposing party, suggesting an  \ninconsistent application of procedural standards. This differential treatment raises concerns about judicial neutrality, a principle that Texas courts have emphasized is \nCopy from re:SearchTX",
      "char_length": 1540
    },
    {
      "page_number": 6,
      "text": "essential: \"Our legal system only works when the parties can be confident that they \nare appearing before a neutral, detached, and fair judiciary.\"  In re The Tex. Dep't of \nFamily & Protective Servs . (2024).  \n 12. Most disturbingly, the record indicates that the predicted harm to the \nchild materialized after the court's refusal to hear the emergency motion —the \nyoungest child suffered a preventable dental emergency. This outcome starkly illustrates how judicial inact ion can directly lead to preventable harm to children, \nundermining the very purpose of the judicial system in family law matters.  \nIV.  Appellate Court Failures  \n 13. The Second Court of Appeals compounded the trial court's failures by \nissuing a series of per curiam  denials without substantive explanation. The record \nindicates that Myers faced \"nine per curiam denials from that court concerning the same set of underlying facts and without any opposition from the opposing party or \nthe judges below.\" These unexplained denials directly contravene the appellate court's responsibility to provide reasoned decisions that address the issues raised.  \nTexas law requires that appellate courts \"must hand down a written opinion that is as brief as practicable but that addresses every issue raised and necessary to final disposition of the appeal.\" This requirement serves essential functions of \"promoting re spect for court decisions and confidence in the rule of law, enhancing \nthe transparency we strive to achieve in our legal system, and upholding parties' \nCopy from re:SearchTX",
      "char_length": 1568
    },
    {
      "page_number": 7,
      "text": "reasonable expectations that their arguments will be fairly heard and reasonably \nconsidered.\"  Indus. Specialists, LLC v. Blanchard Ref. Co. , 652 S.W.3d 11 (Tex. \n2022). \n14.The appellate court's pattern of per curiam denials without addressing\nthe substantive issues raised by Myers represents a significant departure from this standard. This failure is particularly concerning in a case involving children's welfare, where Tex. Fam. Code § 263.405 mandates expedition and resolution \n\"with the least possible delay.\"  \nV. Supreme Court Inaction\n15. Myers has filed multiple mandamus petitions that remain unanswered\nwith the Texas Supreme Court, seeking intervention to address the lower courts' failures.  This situation implicates the Supreme Court's responsibilities under  Tex. \nGov't. Code § 22.0135  to provide guidance in cases involving children and its \nauthority under  Tex. Gov't. Code § 22.002 to issue writs of mandamus to compel \nlower courts to fulfill their duties. The Texas Supreme Court has previously recognized that \"[j]ustice demands a speedy resolution of child custody and child support issues.\"  Proffer v. Yates , 734 S.W.2d 671 (Tex. 1987). The apparent failure \nto ensure such resolution in Myers' case contradicts this principle.  \nCopy from re:SearchTX",
      "char_length": 1286
    },
    {
      "page_number": 8,
      "text": "VI. Procedural Irregularities in Recusal Proceedings  \n 16. The record reveals particularly troubling procedural irregularities in the \nhandling of Myers' recusal motion. Texas Rule of Civil Procedure 18a establishes \nmandatory procedures for recusal motions, which appear to have been disregarded in multiple ways:  \n i.  The court coordinator, rather than the clerk of the court,  \n  handled recusal documentation, despite Rule 18a(e)(1)'s  \n  explicit assignment of this duty to the clerk.  (25-0426)  \nii. Associate Judge Kaitcer issued an order referring himself for recusal despite not being named in Myers' recusal motion.  (25-0426)  \niii. The assigned judge summarily denied the recusal motion without a hearing, and also denied \"a motion that was never filed.\"  (25-0458)  \n 17. These procedural violations are significant because they directly affect \nthe integrity of the recusal process, which is designed to ensure judicial impartiality. The fact that the court coordinator \"serves at the pleasure of the judge being recused\" creates an inherent conflict of interest that undermines the independence of the recusal process.  \nCopy from re:SearchTX",
      "char_length": 1161
    },
    {
      "page_number": 9,
      "text": "18. Most concerning is that after Myers filed a mandamus petition \nchallenging these procedural irregularities, the assigned judge quickly issued \nsummary denials of the recusal motions, potentially to \"prevent mandamus adjudication.\" This timing suggests an att empt to evade appellate review rather \nthan a good- faith effort to ensure proper judicial process.  \nVII. Consolidation Order Violations  \n 19. The record also indicates that Judge Kenneth Newell of the 233\nrd District \nCourt granted a contested motion to consolidate in violation of Tarrant County Local Rule 4.01(8)(a), which explicitly requires that “ every motion to … \nconsolidate … shall be filed in the earliest -filed case and the motion shall be heard \nin the earliest -filed case. ” This order was issued sua sponte, without notice to \nMyers, without a hearing, and without addressing Myers ’ timely filed objections.  \nThis consolidation order represents another instance of a trial court disregarding clear procedural rules designed to ensure fairness and consistency. The timing of this order —issued “mere moments after Relator sought appellate oversight ” \nregarding the TRO denial —again suggests potential efforts to frustrate appellate \nreview rather than ensure proper judicial process.  \n \n \n \nCopy from re:SearchTX",
      "char_length": 1299
    },
    {
      "page_number": 10,
      "text": "VIII. Broader Implications and Consequences  \nA. Harm to Children  \n 20. The judicial failures in Myers' case have resulted in direct harm to his \nchildren. Most concretely, the refusal to hear the emergency TRO led to a \npreventable dental emergency for the youngest child. Beyond this specific incident, the ongoing procedural obstacles have prolonged the resolution of issues affecting the children's welfare, contrary to the statutory mandate to expedite such proceedings.  (25-0367)  \n 21. This prolonged uncertainty directly contradicts the legislative intent \nbehind provisions like  Tex. Fam. Code § 263.405 , which was designed to \"help to \nminimize the time that a child has to be subject to lengthy and distressing court proceedings.\" When courts at all levels fail to ensure expeditious proceedings, children remain in potentially harmful situations for extende d periods, suffering \nconsequences that may be irreversible.  \nIX. Undermining Public Confidence  \n 22. The pattern of judicial failures in Myers' case severely undermines \npublic confidence in the Texas judiciary. When trial courts refuse to hear properly filed motions, when appellate courts issue unexplained denials, and when procedural rules are selectivel y applied, the public reasonably questions the \nfairness and integrity of the judicial system.  \nCopy from re:SearchTX",
      "char_length": 1354
    },
    {
      "page_number": 11,
      "text": "23. This erosion of confidence is particularly concerning in family law cases, \nwhere the courts are entrusted with protecting society's most vulnerable members. \nAs noted in secondary literature, Texas courts have been criticized for \"failing to protect parents ' constitutional rights\" in a significant percentage of cases. When \nthese criticisms are reinforced by cases like Myers', where procedural safeguards appear to be disregarded at multiple levels, the damage to public trust becomes systemic.  \n 24. The case raises particular concerns about the treatment of self -\nrepresented litigants. The record suggests that Myers' pro se status may have influenced how his filings and arguments were treated, with the petition noting that \"each Respondent named in the se petitions has played their part in a broader \npattern of systemic failure that seems to be derived from one singular line of reasoning: the Relator is representing himself pro -se.\" If courts apply different \nstandards to represented versus self -represented litigants, this fundamentally \nundermines the promise of equal justice under law.  \nX. Creating Systemic Dysfunction  \n 25. Perhaps most concerning is how the Myers case illustrates a potential \nculture of systemic dysfunction within the Texas judiciary. When trial courts see that their procedural errors or refusals to act are not corrected on appeal, there is little incentive t o improve. When appellate courts see that their unexplained denials \nCopy from re:SearchTX",
      "char_length": 1504
    },
    {
      "page_number": 12,
      "text": "do not lead to Supreme Court intervention, they may continue issuing such \ndecisions. And when the Supreme Court fails to exercise its supervisory authority, the entire system lacks necessary accountability.  \n 26. This dysfunction is exacerbated by what appears to be a lack of \nengagement from other participants in the judicial process. The record indicates that the \"Real Party, and all Honorable Respondents collectively named herein have remained silent on the compounding issues before this Court,\" suggesting an environment where procedural irregularities are met with silence rather than correction.  \n 27. In family law cases specifically, this systemic dysfunction makes it \nvirtually impossible to fulfill the statutory mandate that \"[t]he best interest of the child shall always be the primary consideration of the court.\"  Tex. Fam. Code § \n153.002. When procedural obstacles prevent meaningful hearings, when decisions \nlack reasoned explanations, and when cases are allowed to languish, children's best interests inevitably suffer.  \nXI. Conclusion  \n 28. The case of Charles Dustin Myers and his children presents a disturbing \nportrait of judicial failure at multiple levels of the Texas court system. From trial courts that refuse to hear emergency motions, to appellate courts issuing unexplained denials, to apparent Supreme Court inaction, the case illustrates how \nCopy from re:SearchTX",
      "char_length": 1409
    },
    {
      "page_number": 13,
      "text": "breakdowns in judicial responsibility can lead to direct harm to children and \nerosion of public confidence in the judiciary.  \n 29. These failures violate specific statutory mandates, including the \nrequirements to prioritize children's best interests ( Tex. Fam. Code § 153.002), \nconduct proceedings expeditiously ( Tex. Gov't. Code § 21.001), and resolve \nappeals involving children with the least possible delay ( Tex. Fam. Code § \n263.405). They also undermine fundamental principles of judicial neutrality, transparency, and accountability.  \n 30. The systemic nature of these failures sends a dangerous message to the \nfuture of Texas: that procedural rules may be selectively applied, that self -\nrepresented litigants may receive less judicial protection, and that even clear statutory mandates regarding  children's welfare may be disregarded without \nconsequence. This message threatens not only the individuals directly affected but \nthe legitimacy of the judicial system itself.  \n 31. Addressing these failures requires action at all levels of the judiciary. \nTrial courts must fulfill their ministerial duty to hear and rule on properly filed motions, particularly those involving children's welfare. Appellate courts must provide reasoned e xplanations for their decisions that address the issues raised. \nAnd the Supreme Court must exercise its supervisory authority to correct clear errors and ensure compliance with statutory mandates.  \nCopy from re:SearchTX",
      "char_length": 1479
    },
    {
      "page_number": 14,
      "text": "Until such corrections occur, cases like Myers' will continue to erode public \nconfidence in the judiciary and, most tragically, fail to protect the children whose best interests should be the courts' primary consideration.  \n 32. Most importantly, the elephant in the room – the abuses of discretion that \ncontinue to be ignored at all levels of the judiciary – will only continue. There is no \npossible re solution to this case. Myers has no opponent other than the judiciary \nitself. Clearly , even when the law is on their side, politics trump the laws in Texas. \nOur children deserve better from  this State , and accountability cannot continue to \nbe placed second to politics.  \n 33. There is only one solution in this matter: exercise discretion rather than \ndeference. However, based on the history thus far, there is little to no indication that the right decisions will be made , perpetuating an unexplainable , unjustifiable , \nand disappointing display from our elected officials.  \n  Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  Pro Se Relator  \n  chuckdustin12@gmail.com  \n  817-546-3693  \n  Dated: Ju ly 11 , 2025 \n \nCopy from re:SearchTX",
      "char_length": 1191
    },
    {
      "page_number": 15,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below:\nEnvelope ID: 103044950\nFiling Code Description: Unlisted\nFiling Description: Relator's Statement\nStatus as of 7/11/2025 4:10 PM CST\nCase Contacts\nName\nCHARLES DMYERS\nMorgan MichelleMyers\nHonorable John H.Cayce\nHolly Hayes\nCOOPER CARTERBarNumber Email\nCHUCKDUSTIN12@GMAIL.COM\nmorganmw02@gmail.com\nthkemp@tarrantcounty.com\ncsd-legal-914@texasattorneygeneral.gov\nCOOPERCARTER@MAJADMIN.COMTimestampSubmitted\n7/11/2025 3:38:21 PM\n7/11/2025 3:38:21 PM\n7/11/2025 3:38:21 PM\n7/11/2025 3:38:21 PM\n7/11/2025 3:38:21 PMStatus\nSENT\nSENT\nSENT\nSENT\nSENT\nCopy from re:SearchTX",
      "char_length": 786
    }
  ]
}