{"id": "11ea5226834f5e07c7de0a2e62b7bce8a21b8e0b", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "1 \n NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \n \n \nTO THE HONORABLE JUDGE OF THE 322ND DISTRICT COURT OF TARRANT \nCOUNTY:  \n \n \nI. INTRODUCTION \n \n1. Movant respectfully submits this formal request for immediate rulings on multiple \npending motions and matters in the above- captioned case. These matters have been fully \nsubmitted and  have languished without action well beyond any reasonable timeframe. Each \ndelay is causing significant prejudice to Movant’s rights. Texas law makes clear that a court has a \nduty to rule on properly filed motions within a reasonable time, and that justice delayed is justice \ndenied . \nPending Matters Without Timely Rulings  Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. REQUEST FOR RULING   \n  \n  \nCharles Dustin Myers,   \n  \nRespondent   \n  \n2025 -02-28  322-744263-23\nFILED\nTARRANT COUNTY\n2/28/2025 12:59 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n\n2 \n 2. Ex Parte Emergency Motion for Contempt, Sanctions, Access to Residence, and \nCustody filed 02/10/2025 . This motion was filed ex parte  over two weeks ago, alleging \nimmediate harm and requesting urgent relief (enforcement of court orders via contempt, \nrestoration of access to the marital residence, and emergency custody orders). Despite the emergency nature of this motion, no hearing has been set and no ruling or temporary order has issued to date . The lack of action has left Movant without access to the home and children, and \nthe other party’s alleged contemptuous conduct (violating prior court orders , fraud , negligence ) \nremains unaddressed, to the detriment of the children’s welfare and Movant’s rights. Opposing counsel was served a copy of this motion and has chosen not to reply or argue against the relief sought .  \n3. Unopposed Motion for Summary Judgment (Filed on February 26, 2024 ). Sitting on \nthe docket now for over a year , the opposing party failed to file any response or opposing \nevidence by the deadline. Thus, the motion is unoppo"}
{"id": "a8bcc4b3311cb95bfea08c5ca634eb5486d091b7", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ry Judgment (Filed on February 26, 2024 ). Sitting on \nthe docket now for over a year , the opposing party failed to file any response or opposing \nevidence by the deadline. Thus, the motion is unopposed and the material facts presented are \nundisputed. Despite the passage of the hearing/submission date and the absence of any contest, the Court has not ruled on the motion. The case cannot progress to final resolution even though no genuine fact issues exist, due to the absence of a ruling. \n4. Unanswered Requests for Admissions (Served on 09/17/2024) and Motion to Compel \nDiscovery filed 11/15/ 2024. The opposing party did not answer or produce the requested \ndiscovery by the due date, greatly hampering Movant’s ability to prepare this case. Movant filed a Motion to Compel on [date], seeking an order forcing compliance with the overdue discovery and appropriate sanctions. To date, the Court has neither set a hearing nor ruled on the motion to compel.  The discovery period continues to elapse (or may have closed) without\n\n3 \n Movant receiving the basic information needed, and without the Court enforcing the rules. The \nlack of a ruling effectively rewards the other party’s non- compliance and prejudices Movant.  \nII. LEGAL ANALYSIS  \n5. It is well- settled under Texas law that a trial court has a duty to consider and rule on \nmotions that have been properly filed and brought to its attention. Once a motion is properly filed and pending, “the trial court’s act of considering the motion and ruling on it is ministerial” , \nnot discretionary . See Eli Lilly &Co. v. Marshall , 829 S.W.2d 157, 158 (Tex. 1992) (orig. \nproceeding) (per curiam) . \n6. Texas Supreme Court has held that a trial court abuses its discretion and may be \nmandamused if it fails or refuses to rule on a pending motion within a reasonable time after a proper request . See O'Connor v. First Court of Appeals,  837 S.W.2d 94, 97 (Tex. 1992) (orig. \nproceeding) . \n7. This is a forma l request to the court b"}
{"id": "8b402c385bd062309d9f2d430564f80da3248804", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "nding motion within a reasonable time after a proper request . See O'Connor v. First Court of Appeals,  837 S.W.2d 94, 97 (Tex. 1992) (orig. \nproceeding) . \n7. This is a forma l request to the court by Movant to issue a ruling on the above \nmentioned motions. In Eli Lilly & Co. v. Marshall , the Supreme Court made clear that a court \ncan be compelled by mandamus to issue a ruling when it fails to do so in a timely manner . Id. \n8. What constitutes a “reasonable time” depends on the circumstances of the case, \nhowever . However, when delays are extreme or unjustified, courts have not hesitated to find a \ndenial of justice. For example, the Corpus Christi Court of Appeals recently granted mandamus relief against a trial judge who waited three years  to rule on pending summary judgment \nmotions, calling the delay “clearly” unreasonable .  In re America First Lloyd’ s Insurance \nCompany  (No. 13- 24-00059- CV; February 22, 2024) .\n\n4 \n III. ARGUMENT  \n9. In the present case, each of the pending matters has been left unresolved beyond any \nreasonable time:  \ni. The ex parte emergency motion has been pending for over two weeks with no \naction, despite its urgent subject matter. In context, a two- week delay for an \nemergency child custody/home access issue is extraordinary – far more delay than \nis reasonable when immediate relief was requested  and when no opposit ion has \nbeen filed.  \nii. The summary judgment motion  has been ripe and unopposed since \n02/26/2024. Given that no opposition was filed, there is no reason for prolonged \nadvisement – the motion could have been decided promptly after the submission \ndate.  \niii. The unanswered admissions  were automatically admitted by rule 30 days \nafter service. See Tex. R. Civ. P. 198.2. Thus, they eliminated any factual dispute \non those points as of that date. No further delay is needed or justified regarding matters that the rules deem conclusively established . \niv. The motion to compel discovery has been awaiting a de"}
{"id": "5965e88dd42a83865e61566cf3b371eaf8960fec", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "te \non those points as of that date. No further delay is needed or justified regarding matters that the rules deem conclusively established . \niv. The motion to compel discovery has been awaiting a decision effectively \npermitting the opposing party to remain silent while damage accrues . \nv. The Rule 91a motion to dismiss  has a built -in 45- day decision deadline  which , \ngiven the failure of the  opposing side to reply thus far in the case , this deadline \nwill not be met, and the case will need to be dismis sed outright as a matter of law.\n\n5 \n IV . CONCLUSION \n10. Because these delays have become unreasonable, the Court’s duty to issue prompt \nrulings is invoked. Movant has taken appropriate steps to alert the Court  of the need for action \n(via filings, communications, and this Request) in compliance with the procedure outlined in \ncases like In re Dong Sheng Huang, 491 S.W.3d 383, 385 (Tex. App.—Houston [1st Dist.] 2016, orig. proc.) (simply filing a motion may not be enough; the party must set it for hearing or otherwise ensure the judge is aware of it)  \n11. This Request itself is a formal call to action . There can be no doubt that these matters \nare now squarely before the Court and awaiting immediate disposition. \nV . PRAYER FOR RELIEF AND JUDGEMENT  \nWHEREFORE, Movant, CHARLES DUSTIN MYE RS, respectfully request s the follow relief \nfrom the court:  \n1. Enter an order ruling on the Ex Parte Motion for Contempt, Sanctions, Access to House  at 6641 Anne C ourt, Wata uga, Texas 76148,  and Custody  orders naming \nMovant the primary conservator  immediately . Movant asks that the Court grant \nthe requested relief  in that motion (order the prompt return of the children to \nMovant’s custody as requested, grant Movant immediate access to the residence, and set the enforcement (contempt) issues for hearing or otherwise enforce them ).  \n2. Rule on Movant’s Motion for Summary Judgment without further delay. Movant requests that the Court GRANT  the motion, giv"}
{"id": "add2aad530422b38295511574f0b874a85bd32e8", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "he enforcement (contempt) issues for hearing or otherwise enforce them ).  \n2. Rule on Movant’s Motion for Summary Judgment without further delay. Movant requests that the Court GRANT  the motion, given that it is unopposed and supported \nby competent evidence (including deemed admissions), and enter a summary judgment in Movant’s favor on the claims at issue. If the Court for any reason\n\n6 \n declines to grant it, Movant requests an order denying the motion now, so that \nMovant may pursue appropriate next appellate steps.  \n3. Deemed Admissions  – Issue an order confirming that the Requests for Admissions \nserved on 09/17/2024 are deemed admitted  by the opposing party pursuant to Tex. \nR. Civ. P. 198.2(c)  \n4. Movant requests that the Court deem each matter admitted (to the extent a formal order is deemed necessary) and acknowledge that those admissions are conclusively established for purposes of this case . \n5. Movant also prays for such other and further relief  to which Movant may be justly \nentitled, at law or in equity, including any orders necessary to effectuate the prompt handling of these matters and to protect Movant’s rights. Movant emphasizes that time is of the essence. The Texas Constitution guarantees  that our courts shall be \nopen and that litigants shall have remedy by due course of law without unreasonable \ndelay. Movant simply asks that this Court uphold that guarantee by administering prompt justice in this case  and removing the cloud of uncertainty caused by the \noutstanding motions.  \n  Respectfully submitted,  \n /s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n817-546-3693  \n6641 Anne Court, Watauga TX 76148  \nPro-se\n\n7 \n CERTIFICATE OF SERVICE  \nRespondent, Charles Dustin Myers, hereby certif ies that a true and correct copy of the foregoing \nrequest for ruling was served on Petitioner’s counsel of record, Cooper L. Carter , via the via \nemail to clcarter@example.com  (email address on file) on this 2 8th day of "}
{"id": "be9d5e8d9962cd523eaef4a7911236bba6748400", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\02_28_25_request_for_ruling_1\\02_28_25_request_for_ruling_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\02.28.25 - REQUEST FOR RULING-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 1345, "text": "ect copy of the foregoing \nrequest for ruling was served on Petitioner’s counsel of record, Cooper L. Carter , via the via \nemail to clcarter@example.com  (email address on file) on this 2 8th day of February, 2025, in \naccordance with the Texas Rules of Civil Procedure and to Petitioner, MORGAN MICHELLE \nMYERS, through the Electronic Filing Manger in accordance with Texas Rules of Civil \nProcedure 21a.  \n \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \nPRO -SE \n6641 Anne Court  \nWatauga, Texas 76148  \nChuckDustin12@gmail.com  \n817-546-3693  \nPro Se\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 97927313\nFiling Code Description: Request\nFiling Description: Request for Immediate Ruling\nStatus as of 3/3/2025 9:16 AM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYESBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n2/28/2025 12:59:09 PM\n2/28/2025 12:59:09 PM\n2/28/2025 12:59:09 PMStatus\nSENT\nSENT\nSENT"}