{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\09.27.24 - First Amended Motion for Temporary Orders-1-1.pdf",
  "base_name": "09_27_24_first_amended_motion_for_temporary_orders_1_1",
  "page_count": 37,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322- 744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \nFOREWORD  \nOn January 16th, 2024, amid inclement weather, the Respondent was \nordered to vacate the residency at a show cause hearing for an order of protection \nwhere a continuance was granted, and cause number 322-744263-2 3 was \nconsolidated with cause number 322-744538- 23 on the court’s own motion, and \nthe case was reset to January 22nd, 2024, and then again for February 1st, 2024, \nwhere a settlement agreement was quickly drafted and Respondent was advised \nto sign it by his former counsel.  \nThis led to the subsequent termination of counsel, leaving Respondent to \nrequest an emergency hearing to vacate the associate judge’s report for temporary \norders, which was the only hearing to date in this case after eight months.  \nThe unusual circumstances surrounding the initiation of this case warrant \nthe court's reconsideration of the Respondent's original answer and subsequent \nbriefs1 filed before the initial setting. Given the evolving facts and the clear \nforesight demonstrated in these earlier submissions, Respondent respectfully \nurges the court to revisit these filings in the interest of ensuring a just resolution.   IN THE MATTER OF THE  \n MARRIAGE OF  \nMORGAN MICHELLE MYERS  \nAND CHARLES DUSTIN MYERS  \nAND IN THE\n INTEREST OF MARA \nMYERS AND CAROLINE MYERS, \nCHILDREN  First Amended Motion for \nTemporary Orders \nEXPEDITED RELI\nEF REQUESTED BY \nOCTOBER 1S T,  2024  \n09/27/2024 \n1  THIS PLEADING IS INTERACTIVE AND BOOKMARKED \nFOR THE COURT'S CONVENIENCE322-744263-23FILED\nTARRANT COUNTY\n9/27/2024 12:12 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1646
    },
    {
      "page_number": 2,
      "text": "2 FIRST AMENDED MOTION  FOR T EMPORARY ORDERS \nPursuant t o Texas F amily C ode §§  105.001(a)(3) an d \n(a)(4), R espondent r espectfully r equests t hat the court i ssue the \nfollowing t emporary or ders w ithout n otice or h earing t o the \nPetitioner, f or the safety a nd welfare of t he children a nd in t he \ninterest of j udicial e conomy: \n1. Tex Fam. C ode §§ 105.001(a)(3); (a)(4)\nTemporary O rders Before Final Order\nRespondent respectfully r equests t he court en ter temporary o rders:\nA. Prohibiting P etitioner, M ORGAN M ICHELLE MYERS , \nfrom removing t he children, MARA EVONNE MYERS and \nCAROLINE ROSE MYERS, beyond 6641 Anne Court, Watauga, \nTX 76148 while the case is  \npending, applied equally to Respondent.\nB. Prohibiting Pe titioner, M ORGAN M ICHELLE MYERS, or \nany t hird p arty a cting on her be half or w ith knowledge of t his \ncase, from disturbing t he peace a nd well -being of t he mi nor \nchildren , MARA EVONNE M YERS a nd CAROLINE R OSE MYERS \nand Respondent, CHARLES DUSTIN MYERS, during the \npendency of this\n case, applied equally to Respondent..  \n2. Tex Fam. Code §§ 6.501\nTemporary R estraining O rder\nRespondent respectfully r equests th at the c ourt g rant t he following\ntemporary r estraining or der w ithout n otice a gainst t he Petitioner in t his\nmatter:",
      "char_length": 1305
    },
    {
      "page_number": 3,
      "text": "3 C.Respondent, CH ARLES D USTIN M YERS, a sks the cou rt to grant\nthe following temporary re straining o rder against t he Petitioner, \nMORGAN M ICHELLE MYERS for the preservation o f the p roperty at 6 641 \nAnne Court, Watauga, TX 76148 and for the protection of the parties, \nprohibiting Petitioner, MORGAN AND CHARLES MYERS, from: \n(i)intentionally com municating in p erson or in a ny ot her m anne r,\nincluding by t elephone or a nother e lectronic voice t ransmission, v ideo chat, \nin writing, or e lectronic messaging, w ith the ot her p arty by u se of v ulgar, \nprofane, obs cene, or in decent l anguage or in a coa rse or of fensive m anne r, \nwith i ntent to a nnoy o r alarm th e other p arty; \n(ii)threatening t he other p arty i n person o r in any other ma nner,\nincluding by t elephone or a nother e lectronic voice t ransmission, v ideo chat, \nin writing, or e lectronic messaging, t o take u nlawful a ction a gainst a ny \nperson, in tending by t his action t o annoy or alarm t he other party;  \n(iii)placing a t elephone ca ll, anonymousl y, at an unreasonable h our,\nin an offensive a nd repetitious m anne r, or without a l egitimate p urpose of \ncommunication w ith the in tent t o annoy or a larm t he ot her p arty;  \n(iv) inte\nntionally , knowingly , or recklessly causing bodily injury to the\nother party or to a child of either party;",
      "char_length": 1364
    },
    {
      "page_number": 4,
      "text": "4 (v) threatening the other party or a child of either party with\nimminent bodily injury; \n(vi) intentionally , knowingly , or recklessly destroying, removing,\nconcealing, encumbering, transferring, or otherwise harming or reducing \nthe value of the property of the parties or either party with intent to obstruct the authority of the court to order a division of the estate of the \nparties in a manner that the court deems just and right, having due regard \nfor the rights of each party and any children of the marriage;  \n(vii) intentionally falsifying a writing or record, including an\nelectronic record, relating to the property of either party; \n(viii) intentionally misrepresenting or refusing to disclose to the\nother party or to the court, on proper request, the existence, amount, or location of any tangible or intellectual property of the parties or either party , including electronically stored or recorded information;  \n(xi) intentionally or knowingly damaging or destroying the tangible\nor intellectual property of the parties or either party , including electronically stored or recorded information;  \n(x) intentionally or knowingly tampering with the tangible or\nintellectual property of the parties or either party , including electronically",
      "char_length": 1261
    },
    {
      "page_number": 5,
      "text": "5 stored or recorded information, and causing pecuniary loss or substantial \ninconvenience to the other party;  \n(xi) destroying, disposing of, or altering any e -mail, text message,\nvideo message, or chat message or other electronic data or electronically stored information relevant to the subject matter of the suit for dissolution of marriage, regardless of whether the  information is stored on a hard \ndrive, in a removable storage device, in cloud storage, or in another electronic storage medium;  \n(xii) using any password or personal identification number to gain\naccess to the other party's e -mail account, bank account, social media \naccount, or any other electronic account;  \n(xiii) excluding the other party from the use and enjoyment of a\nspecifically identified residence of the other party;  \n3. Tex Fam. Code §§ 6.503\nAFFIDAVIT, VERIFIED PLEADING, AND BOND NOT REQUIRED\nD. Respondent, CHARLES DUSTIN MYERS requests the court issue\nthe above orders without n otice a nd hearing a nd in the a bsence of a \nverified pleading, affidavit, and dispense with the necessity of a bond on \nbehalf of the parties, their children, and the protection of their property in \nconnection\n with these orders p ursuant to the Texas Family Code, section \n6.503 w ithout notice and hearing.",
      "char_length": 1289
    },
    {
      "page_number": 6,
      "text": "6 4. Extra ordinary relief\nE. Given the extraordinary circumstances of this case, Respondent,\nCHARLES DUSTIN MYERS, requests that the court order his return to the \nresidency , where he will resume rent payments and begin transitioning and recovering from the ongoing deprivation that has lasted throughout the \ncase. The Respondent has attached a proposed parenting plan which was \noverlooked on January 16\nth, 2024, when this court decided to order him to \nvacate the residency which he requires to financially support the Children \nduring the pendency of the case.  \nF . Respondent, CHARLES DUSTIN MYERS further requests that the\ncourt vacate the orders currently in place sua sponte replacing them with \nthe current orders, which will allow him to withdraw his Motion for Rehearing in the Supreme Court of Texas. Cause no. 24 -0395.  \nG. The Respondent, CHARLES DUSTIN MYERS prays the Court will\ntake swift action and intends to demonstrate through his actions how these orders suit the best interests of the children in this case.  \nH. The Respondent respectfully requests expedited action on this\nmotion by October 1\nst, 2024, as he will be forced to temporarily relocate to \nDenton, Texas pending relief, which will further exacerbate the situation and will further separate him from his children.",
      "char_length": 1304
    },
    {
      "page_number": 7,
      "text": "7 CONCLUSION \ni. The P\netitioner appeared before this Court on December 14, 2023,\nrequesting an ex-p arte temporary order of protection, and subsequently filed a \nprotective order on December 22, 2023. The Respondent contends that the \nP\netitioner's narrative is an attempt to avoid accountability for her extramarital \naffairs\n which was discovered just prior to the initiation of her pleadings. \nii.While the Petitioner engaged in activities outside the marriage, the\nRespondent remained at home caring for the children. During the time the \nPetitioner pursued legal actions shortly before Christmas, the Respondent was \npreparing for the children's holiday. Since taking residence in the family home, \nt\nhe Petitioner has reportedly moved in her sister, reduced her employment to \nt\nhree hours per day, failed to complete the court-o rdered parenting course, and is \nnot contributing rent to her grandmother. The Respondent asserts that there is \nsufficient evidence on record to substantiate these claims, and predicted this exact \noutcome\n within his first pleadings within the clerk’s record, attached hereto. \niii.The Respondent believes that this case has been conducted in the best\ninterest of the Petitioner rather than the children, a concern that has been \nrepeatedly\n raised without response. The current orders in place are lack lawful \nfoundation,\n and there has been minimal meaningful engagement from the \nPetitioner's attorney. The Respondent is concerned about the ongoing financial",
      "char_length": 1501
    },
    {
      "page_number": 8,
      "text": "8 erosion a ffecting t he children's w ell-being a nd sees n o logical basis t o consider t he \nexisting arrangements as serving their best interests. \niv.Granting\n this motion would initiate a long-o verdue healing process. The\nPetitioner s hould be r equired t o explain h er actions a nd be h eld a ccountable. T he \nRespondent e mphasizes t he cr itical n eed f or access t o the r esidence t o provide f or \nthe children w hile seeking a lternative accommodations n ea rb y. This n eed is \nargued to t ake precedence over t he Petitioner's d esire to p rotect h erself f rom the \nconsequences of her own actions. \nv.The Respondent respectfully urges the Court to intervene and m ake a\ndecision that genuinely serves the best interests of the children. \nvi.If anything else – the orders currently in place show the truth. Mother\ncan’t\n pay rent, hasn’t completed her responsibilities for the Children, and has \nreduced h er employment. Father has followed all aspects of the orders that he is \nable to given the circumstances.  \nvii.So long as the Children are in Father’s care and he is given a fair\namount of time to transition from the residency to ensure that he may still provide \nfor his Children financially while the case is pending, the status quo will be \nmaintained. \nviii. Father has overwhelming evidence to support all claims herein, already\nserved to Petitioner, and without response, and already on the record. \nRespondent prays that this Court will consider the totality of the case, and grant \nthis motion to rightfully restore the status quo.",
      "char_length": 1565
    },
    {
      "page_number": 9,
      "text": "9 PRAYER FOR EXPEDITED RELIEF  \nRespondent  requests the following expedited relief:  \n1. Vacate the current orders, which were entered in violation of\nthe Respondent's right to due process and a fair hearing. These \norders were rendered as \"agreed\" without the Respondent's \nconsent and are unsupported by any motion that was properly served on him. \n2. Grant the Respondent's motion for temporary orders without\nnotice or hearing to the Petitioner, restoring the status quo for the children and enabling the Respondent to meet his financial obligations  related to the Children  and allow healing to begin.  \n3. Provide a provision allowing the Respondent to return to the\nresidence at 6641 Anne Court, Watauga, TX 76148 where he was \nwrongfully removed  including the option for Petitioner to reside \nthere as well if she so chooses.  \n4.Strike all pleadings from the Respondent other than the Rule 12\nmotion to show authority and the summary judgement motion in\nthe interest of judicial economy .\n5. Grant any further relief that this Court finds equitable, just,\nand appropriate  so that we may finally get this case headed \nin the right direction and in alignment with the Children’s \nbest interest.",
      "char_length": 1205
    },
    {
      "page_number": 10,
      "text": "10 Respectfully submitted,  \nCharles Dustin Myers  \nCHAR LES DUSTIN MYERS  \n6641 Anne Court \nWatauga, TX 76148  \nChuckdustin12@gmail.com  \n817-507-6562\nPRO-SE",
      "char_length": 158
    },
    {
      "page_number": 11,
      "text": "CERTIFICATE OF CONFERENCE \nPursuant to Tarrant County Local Rules 4.01(10)(a) & 4.01(10)(b), a \nconference w as not held with Morgan Michelle Myers due to her failure to \nrespond to email correspondence sent on 09/24/2024. However, \nRespondent certifies that the merits of this First Amended Motion for \nTemporary Orders was fully communicated to the Petitioner and would be \nin the best interests of the minor children.  \n/s/ Charles Dustin Myers  \nCHARLES D USTIN M YERS \n6641 Anne Court \nWatauga, TX 76148 \nChuckdustin12@gmail.com \n817-507-6562\nPRO-SE",
      "char_length": 554
    },
    {
      "page_number": 12,
      "text": "CERTIFIC ATE O F SERVICE \nRespondent hereby certifies that on 09/27/ 2024, a true and correct copy \nof this First Amended Motion for Temporary Orders was served on the \nfollowing\n parties via electronic service through the Electronic Filing Manager \n(EFM)\n and via email to t he email address on record, pursuant to Texas Rules of \nCivil\n Procedure 21(a):  \n Serve d to: \n1.Morgan Michelle Myers, Petitioner via electronic filing system.\n2.Cooper Carter  via electronic filing system.\nEma\nil Addresses for Service: \n1.coopercarter@majadmin.com\n2.morganmw02@gmail.com\n/s/ \nCharles Dustin Myers \nCharles Dustin Myers \n6641 Anne Court \nWatauga, TX 76148 \nchuckdustin12@gmail.com  \n817-507-6562",
      "char_length": 690
    },
    {
      "page_number": 13,
      "text": "EXHIBIT A - \nBACKGROUND REPORT FOR CASE \nCONSOLIDATION\n01/03/24",
      "char_length": 63
    },
    {
      "page_number": 14,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 15,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n  TARRANT COUNTY, TEXAS \n   BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 139
    },
    {
      "page_number": 16,
      "text": "EXHIBIT B - \nPROPOSED PARENTING PLAN\n01/07/24",
      "char_length": 45
    },
    {
      "page_number": 17,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER      DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 152
    },
    {
      "page_number": 18,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER      DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 152
    },
    {
      "page_number": 19,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER      DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 152
    },
    {
      "page_number": 20,
      "text": "EXHIBIT C\nAFFIDAVITS\nCharacter and business witnesses willing to testify on Respondent's behalf",
      "char_length": 95
    },
    {
      "page_number": 21,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 22,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 23,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 24,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 25,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 26,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 27,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 28,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 29,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 30,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 31,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 32,
      "text": "322-744263-23\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 170
    },
    {
      "page_number": 33,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 34,
      "text": "322-744263-23\n    A CERTIFIED COPY  \n   ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n \n         \n04/16/2024\nCatherine Saenz",
      "char_length": 184
    },
    {
      "page_number": 35,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 153
    },
    {
      "page_number": 36,
      "text": "A CERTIFIED COPY  \n  ATTEST:   \nTHOMAS A. WILDER \nDISTRICT CLERK \nTARRANT COUNTY, TEXAS \nBY: /s/  \n04/16/2024\nCatherine Saenz",
      "char_length": 125
    },
    {
      "page_number": 37,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 92536276\nFiling Code Description: Amended Filing\nFiling Description: First Amended Motion for Temporary Orders\nStatus as of 9/27/2024 12:28 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n9/27/2024 12:12:51 PM\n9/27/2024 12:12:51 PMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n9/27/2024 12:12:51 PMStatus\nSENT",
      "char_length": 914
    }
  ]
}