{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\09.08.25 - NOTICE TO THE HONORABLE DAVID EVANS-1.pdf",
  "base_name": "09_08_25_notice_to_the_honorable_david_evans_1",
  "page_count": 7,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n 322-744263 -23 \nIN THE 322ND DISTRICT COURT  \nOF TARRANT COUNTY, TEXAS  \n \nMorgan Michelle Myers,  \n \n                                   Petitioner,  \n               v.  \n \nCharles Dustin Myers,  \n   \n                     Respondent.  \n \nAnd In the interest of M.E.M. and \nC.R.M., two children.  § \n§ \n§ \n§ \n§             NOTICE TO THE  \n§ \n§       HONORABLE   \n§ \n§     DAVID L. EVANS  \n§ \n§ \n \n Fundamental judicial ethics demand that judges act with independence, integrity, and \nimpartiality, and that they comply with the law and avoid any conduct that could undermine \npublic confidence in the judiciary. Lawyers, in turn, are required to act honest ly, avoid \nmisconduct, and not engage in actions prejudicial to the administration of justice, with violations subject to disciplinary action.  \n When criminal activity by a judge is brought to the attention of judicial administration —\nsuch as a regional judge or judicial council —there are established processes for investigation and \ndiscipline, which may include censure, suspension, or removal, depending on the severity and \nnature of the misconduct. These processes are governed by statut ory authority, codes of conduct, \nand the inherent powers of the judiciary, with oversight mechanisms in place at both the state and \nfederal levels to ensure accountability and the proper functioning of the justice system.  \n While judicial im munity is  a broad doctrine , it does not apply here , as explained below .",
      "char_length": 1477
    },
    {
      "page_number": 2,
      "text": "2 \n I. Texas RICO Statutes and Judicial Authority \n 1. Texas law criminalizes participation in an enterprise through a pattern of racketeering \nor unlawful debt collection, making such conduct a second-degree felony (Tex. Pen. Code § \n72.04). The law also prohibits acquiring or maintaining an interest in property or control of an \nenterprise through racketeering or unlawful debt collection (Tex. Pen. Code § 72.03 ). These \nstatutes are directly implicated by the conduct described, which includes coordinated fraudulent filings, tampering with court records, and the collection of unlawful debt.  \n 2. Texas courts are empowered to prevent, restrain, and remedy racketeering by issuing \nappropriate orders, including injunctions, receiverships, constructive trusts, and other remedies as necessary to halt ongoing criminal activity and protect affected parties ( Tex. Civ. Prac. and \nRem. Code § 140A.102). This broad remedial authority is specifically designed to address situations where judicial processes are being abused as part of a racketeering enterprise.  \n 3. When a district judge has probable cause to believe that an offense has been committed \nagainst the laws of Texas, the judge may request the presiding judge of the administrative judicial district to appoint a district judge to commence a Court of Inquiry, which allows for the summoning and examination of witnesses in relation to the offense ( Tex. Code Crim. Proc. § \n52.01). This mechanism is particularly relevant where the alleged criminal activity involves court officials or the integrity of the judicial process itself.  \n 4. The Regional Presiding Judge has supervisory authority over the administration of \njustice within the region and is responsible for ensuring that courts operate with integrity and in \ncompliance with procedural rules ( Tex. Gov't. Code § 74.058).",
      "char_length": 1855
    },
    {
      "page_number": 3,
      "text": "3 \n II. RICO Enterprise and Pattern Requirements  \n 5. A RICO enterprise is broadly defined to include any group of individuals associated in \nfact, whether or not a legal entity, and can encompass both legitimate and illegitimate enterprises \n(RICO: A Primer (2022-01-31)). The pattern requirement is satisfied by at least two predicate \nacts that are related and pose a threat of continued criminal activity, with continuity and \nrelationship being key elements (RICO: A Primer (2022-01-31); Racketeer influenced and \ncorrupt organizations. (2008-03-22)). Predicate acts  may include mail and wire fraud, extortion, \nand the collection of unlawful debt.  \n 6. RICO can be applied in civil actions, including in the context of divorce proceedings, \nwhere the plaintiff can show injury to business or property as a result of the enterprise’s actions . \nThe definition of “enterprise” is interpreted broadly and does not require infiltration of a legitimate business; it can consist solely of illegal acts . \nIII. Analysis  \nA. Existence of a RICO Enterprise and Pattern of Racketeering  \n 7. The facts establish the existence of an ongoing enterprise involving multiple actors —\nPetitioner, her co -conspirator, attorneys, and court staff—who have coordinated to achieve the \nbroader objective of depriving the Respondent of property, business interest s, and parental rights. \nThe enterprise’s activities include:  \ni. Preparation and filing of fraudulent court documents containing material misrepresentations.",
      "char_length": 1512
    },
    {
      "page_number": 4,
      "text": "4 \n ii. Tampering with official court filings, including the unauthorized alteration and removal \nof exhibits and affidavits from a recusal motion.  \niii. Compelling execution of fraudulent court orders, including orders prepared by unauthorized individuals and containing false statements.  \niv. Collection of unlawful debt through the use of documents with questionable or fraudulent attorney signatures.  \nv. Ongoing threats, intimidation, and interstate communications designed to further the scheme and suppress the Respondent’s efforts to seek relief.  \n 8. These acts are not isolated; they are related by purpose (depriving Respondent of \nproperty and business interests), participants (the same group of individuals), victims (Respondent), and methods (fraudulent documents, abuse of court processes, and misuse of official positions). The continuity element is satisfied by the ongoing nature of the conduct, which has persisted for at least 18 months and continues to produce new predicate acts , creating \na future threat of criminal ac tivity.  \nB. Predicate Acts and Statutory Violations  \n 9. The conduct described constitutes multiple predicate acts under both Texas and federal \nlaw: \n i. The use of electronic filing systems and email to transmit fraudulent documents \nand altered court filings .",
      "char_length": 1314
    },
    {
      "page_number": 5,
      "text": "5 \n  ii. Compelling compliance with fraudulent court orders, especially where judicial \nauthority is used to obtain property or business interests, constitutes extortion under color \nof official right (Tex. Pen. Code § 72.04).  \n iii. The collection of child support not legally owed, using documents with \nquestionable authenticity, constitutes the collection of an unlawful debt, which is independently actionable under RICO (Tex. Pen. Code § 72.03). \n iv. The unauthorized alteration of court filings, particularly in the context of a \nrecusal motion, directly undermines the integrity of the judicial process and constitutes a \nfurther predicate act in support of the enterprise’s objectives.  \n 10. These acts have directly injured the Respondent’s business and property interests, \nincluding loss of home, business operations, and the ability to serve interstate clients, as well as deprivation of fair court proceeding, which undermines public trust  in the judiciary.  \n 11. These allegations , which Respondent argues he can substantia te in a Federal Court of \nLaw, are facially established and amount to:  \n  i. A violation of the T ravel Act: Morgan Michelle Myers on December 1 7, 2023 ; \n  ii. Morgan Mic helle Myers, Cooper L. Carter, and Jeffrey N . Kaitcer on   \n      March 14, 2024, committed  extortion and conspiracy to commit extortion\n1;  \n             i ii. Morgan Michelle Myers on December 15, 2023 ; Cooper L. Carter   \n          on May 19, 2024, each committed induvial  predicate acts of wire fraud;  \n \n1 Jeffrey Kaitcer cannot rely on judicial immunity be cause he had no  subject matter jurisdiction  \nto preside over a de novo request  of his own prior order , and the act of extortion is not a judicial \nact.",
      "char_length": 1742
    },
    {
      "page_number": 6,
      "text": "6 \n   iv. James Munford, a nd Lindsey baker each committed induvial acts of wire fraud \n       and conspiracy to commit wire frau d on October 8, 2024.2  \n    12. While judicial immunity generally protects judges for acts performed in their judicial \ncapacity, this immunity does not extend to acts taken in the clear absence of all jurisdiction or to \nnonjudicial acts. Altering a recusal motion after it has been filed,  or taking further action in a \ncase after a recusal motion has been submitted, may fall outside the scope of judicial immunity \n(Tex. Civ. Prac. and Rem. Code § 140A.102). Attorneys, private parties, and government \nofficials do not enjoy judicial immunity for predicate acts under RICO.  \n 13. It is important to note that the ultimate determination of criminal liability or civil \nRICO liability will depend on the outcome of a full investigation and, if necessary, judicial \nproceedings. However, the facts as presented are sufficient to trigger the Regional Presiding Judge’s duty to investigate and take corrective action.  \n              14. The Regional Presiding Judge’s supervisory authority under Texas Government \nCode § 74.058 includes ensuring that all courts within the region operate with integrity and in \ncompliance with procedural rules. When credible allegations of criminal activity and  abuse of \nprocess are presented, the judge must act to restore the integrity of the judicial process and \nprotect the rights of the parties.  \n 15. Failure to intervene in the face of such allegat ions would not only perpetuate the harm \nto the Respondent but would also undermine public confidence in the judiciary and the rule of \nlaw and create further litigation efforts.  \n \n2 Judicial immunity will fail here. This act was done outside of the presence of the parties, it is  not an official setting , \nand is not a normal judicial function to manipulate pleadings from their original form.",
      "char_length": 1926
    },
    {
      "page_number": 7,
      "text": "7 \n  16. Re spondent  will have no choice but to init iate a federal action against t he individuals \nnamed above to protect his interests  in the absence of corrective measures . \n 17. Respondent reminds this Court that this notice comes in good faith, and is an attempt \nto prevent  any inadvertent actions in  furtherance of the initial  RICO enterprise  form ed prior to \nthis litigation. See Myers v. Branthoover (W.D. Okla. Sept. 2025).  \n Respectfully submitted,  \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  6641 ANNE COURT  \n  WATAUGA, TEXAS  76148  \n  CHUCKDUSTIN12@GMAIL.COM  \n  817-546-3693 \n  PRO -SE RESPONDENT  \n \n \nCERTIFICATE OF SERVICE  \n \n Pursuant to Tex. R. Civ. P. 21a, a true and accurate copy of this noti ce was served upon \nall parties of record on this 8th day of September , 2025.  \n   /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS",
      "char_length": 875
    }
  ]
}