{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\03.14.25 - Notice of UNOPPOSED DWOP-1.pdf",
  "base_name": "03_14_25_notice_of_unopposed_dwop_1",
  "page_count": 8,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n NO. 322 -744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY, TEXAS  \n \n \n \nTO THE HONORABLE 322ND DISTRICT COURT  OF TARRANT COUNTY : \n \nRespondent, CHARLES DUSTIN MYERS, respectfully submits this notice of \nunopposed motion to dismiss for want of prosecution and concurrently filed PROPOSED \nORDER and formally requests a certified copy of the docket sheet at the court’s earliest convenience. Respondent further requests that the Court take judicial notice of the lack of opposition and expedite ruling on this matter, and in support thereof, shows the following: \nI. INTRODUCTION Morgan Michelle Myers,   \n  \n  \nPetitioner,   \n  \nv. NOTICE OF UN-OPPOSED MOTI ON \nTO DISMISS FOR WANT OF \nPROSECUTION, PROPOSED ORDER, \nAND RE QUEST F OR DOC KET \nSHEET \n  \n  \nCharle s Dustin Myers,   \n  \nRespondent  \n \nAND IN THE INTEREST OF  \nM.E.M and C.R.M., two minor children   \n  \n2025 -03-14",
      "char_length": 894
    },
    {
      "page_number": 2,
      "text": "2 \n 1. On January 24, 2025, Respondent, CHARLES DUSTIN MYERS, filed a Motion to \nDismiss, setting forth that Petitioner, by way of her attorney, COOPER L. CARTER, had \nabandoned the case in all but name. \n2. Now, on March 14, 2025, the record remains as still as a pond at dawn— untouched, \nundisturbed, and left to gather dust by the opposing side, with not so much as a word filed in response.  \n3. Pursuant to Rule 165a of the Texas Rules of Civil Procedure, any case not disposed of \nwithin the time standards promulgated by the S upreme Court may be put on the dismissal docket. \nThis give s the court under the present circumstances the discretion to act.  \nII. COUNSEL ’S INABILITY TO FILE AND IMPROPER EMAIL REGISTRATION  \n 4. Beyond mere inaction, Petitioner faces a more fundamental obstacle —she lacks the \nability to electronically file anything at all. Her registered e -filing credentials remain tied to an \nemail address belonging to her prior employer, an entity with no involvem ent in these \nproceedings.  \n5. As a result, Counsel ’s ability to prosecute this case is not only absent by choice but \nalso by circumstance. Without proper access to the court’s electronic filing system, she cannot submit pleadings, motions, or responses in accordance with Texas filing requirements  – as \nevidence by her participation in the case thus far. See Exhibit 1  \n6. This procedural defect is not some minor inconvenience —it renders Petitioner unable \nto engage in the litigation she initiated. The court, recognizing both her failure to prosecute and her procedural incapacity, has every reason to dismiss this case under R ule 165a .",
      "char_length": 1645
    },
    {
      "page_number": 3,
      "text": "3 \n III. RULE 12 MOTION STILL  UNADDRESSED \n 7. On September 20th, 2024, Respondent, CHARLES  DUSTIN MYERS, moved for Rule \n12 against COOPER L. CARTER  challenging her authority. To date, no response has been filed, \nno authority has been proven, and this gives the court one more reason to either dismiss this case \noutright, grant summary judgement in favor of t he Respondent, or disqualify Ms. Carter for her \ninability to properly represent her client. \nIV . PROPOSED ORDER  \n 8. Filed alongside this notice is a proposed order, prepared for the court’s immediate \nconsideration and submission to the judge upon receipt by the clerk.  \n9. The court holds in its hands multiple clear and just paths to resolution—dismissal for \nwant of prosecution, summary judgment in Respondent’s favor, or disqualification of Petitioner’s counsel. Yet, despite the passage of time and the weight of unaddressed filings, no action has been taken. The absence of opposition, the procedural failures of Petitioner, and the unchallenged Rule 12 motion leave no reasonable basis for further delay.  \nV . REQUEST FOR DOCKET SHEET  \n 10. Respondent, CHARLES DUSTIN MYERS, has e mailed the dis trict clerk requesting  a \ndocket sheet, but as is the case with everything else in this matter, no response or acknowledgement has been received  considering th ese requests.  \n 11. Respondent hereby requests a copy of the docket sheet for cause numbe r 322- 744263-\n23 at the court ’s earliest convenience . \nVI. CONCLUSION \n12. Justice is not served by silence, nor is due process upheld through inaction. The \nrecord stands as a testament to delay, neglect, and procedural failure—failures not of",
      "char_length": 1677
    },
    {
      "page_number": 4,
      "text": "4 \n Respondent, but of Petitioner, her counsel, and the system meant to ensure fair and timely \nresolution. \n13. The law provides remedies for such disregard. Rule 165a permits dismissal when a \ncase stagnates beyond reason. Rule 12 demands proof of counsel’s authority, and when none is given, disqualification is required. Petitioner has failed to prosecute, failed to respond, and failed to even maintain the ability to file, leaving this case as little more than a ghost in the docket.  \n14. The time for waiting has long passed. The court has before it everything needed to \nact—an unopposed Motion to Dismiss, an unanswered Rule 12 challenge, and a record devoid of \nmeaningful participation from the Petitioner. Respondent has upheld his duty before this court at every turn; Petitioner has not. \n15. Therefore, Respondent respectfully requests that the court dismiss this case for want \nof prosecution, grant summary judgment in Respondent’s favor, or take any other appropriate action to resolve this matter without further delay . \n Respectfully Submitted,  \n /s/ Charles Dustin Myers \n CHARLES DUSTIN MYERS  \n 6641 ANNE COURT , WATAUGA TX 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693  \n PRO -SE",
      "char_length": 1209
    },
    {
      "page_number": 5,
      "text": "5 \n CERTIFICATE OF SERVICE  \n \nPursuant to Rule 21 of the Texas Rules of Civil Procedure, Respondent, CHARLES \nDUSTIN MYERS, certifies that this NOTICE OF UN-O PPOSED MOTION TO \nDISMISS FOR WANT OF PROSECUTION, PROPOSED ORDER,  AND \nREQUEST F OR DOCKET S HEET  has been filed with the electronic filing manager and \nserved on t he parties of  record on this 14th day of March 2025, including: \nC\nOOPER L. CARTER, counsel for petitioner, at the email address \nCOOPERCARTER@MAJADMIN.COM  \nMORGAN MICHELLE MYERS, petitioner, at the email address \nMORGANMW02@GMAIL.COM  \nHOLLY HAYES, intervenor, at the email address  \ncsd-legal -914@oag.texas.gov \n \n \nRespectfully submitted,  \n/s/ Charles Dustin Myers \nCHARLES DUSTIN MYERS  \nCHUCKDUSTIN12@GMAIL.COM  \n6641 Anne Court, Watauga, Texas 76148 \n817-546-3693 PRO SE",
      "char_length": 808
    },
    {
      "page_number": 6,
      "text": "EXHIBIT 1  \nPROPOSED \nORDER FOR  \nUNOPPOSED  \nMOTION TO \nDISMISSEXHIBIT 1  EXHIBIT 1",
      "char_length": 84
    },
    {
      "page_number": 7,
      "text": "",
      "char_length": 0
    },
    {
      "page_number": 8,
      "text": "",
      "char_length": 0
    }
  ]
}