{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\04.29.25 - OBJECTION RECUSAL HANDLING-1.pdf",
  "base_name": "04_29_25_objection_recusal_handling_1",
  "page_count": 5,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HONORABLE DA VID L. EV ANS OF THE 8TH ADMINISTRATIVE \nREGION OF TEXAS:  \nThe undersigned, CHARLES DUSTIN MYERS, hereby OBJECTS to the handling of \nthese recusal matters, and in support thereof, shows  the following: \nI. THE CORRECT RECUSAL PROCEDURE\nT he Texas Rules of Civil Procedure are clear . Tex. R. Civ. P. 18a lays out the proper  \nprocedure that shall be followed when a motion to recuse is filed. Id. (e) sets forth the Duties of \nthe Clerk, which amount to delivering the motion or response Id. (e)(1), and the delivery of the  \norder of recusal or referral. Id. (e)(2).  IN THE INTEREST OF M.E.M., C.R.M., two \nchildren) MORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , OBJECTION – RECUSAL PROCEDURE  \nRespondent.  \n2025 -04-29",
      "char_length": 833
    },
    {
      "page_number": 2,
      "text": "II. ISSUE  \n There are two significant procedural errors that must be immediately addressed.  \nFirst , Rule 18a of the Texas Rules of Civil Procedure does not authorize or delegate any \nresponsibility for handling recusal matters to the court coordinator. Despite an explicit and timely \nobjection to the coordinator's involvement outlined within the pending recusal motion itself, the coordinator continues to improperly manage and influence the referral process. This unauthorized participation represents a fundamental procedural violation that undermines the neutrality and integrity of the recusal proceedings.  \nSecond, the involvement of Hon. Jeffrey Kaitcer in the current referral is entirely \nimproper and unnecessary, as the current motion for recusal specifically and explicitly names only Hon. James Munford as the respondent judge. While the current motion does refer ence a \nprior joint recusal motion historically —where Hon. Kaitcer was previously named —that \nreference is strictly contextual and does not constitute a renewed or active request for his recusal at this juncture. The plain language and explicit identification in the current motion leave no \nreasonable ambiguity that the recusal sought at present involves only Judge Munford. Therefore, Judge Kaitcer’s unilateral decision to decline recusal and issue a referral, despite no pending recusal against him, is procedu rally incorrect and strongly suggests the motion itself was not \nreviewed substantively before action was taken.  \nThese procedural missteps —the continued improper involvement of the court coordinator \nand the erroneous implication of a second judge —constitute clear violations of Rule 18a, \ncompromise the impartiality required by judicial ethics, and further evidence tha t due diligence \nwas not exercised in considering the motion as filed .",
      "char_length": 1847
    },
    {
      "page_number": 3,
      "text": "III. APPLICATION OF LAW  \n A trial court has no discretion in determining what the law is or applying the law to the \nfacts even when the law is unsettled.  In re Prudential, 148 S.W.3d at 135. Consequently, a clear \nfailure by  the trial court to analyze or apply the law correctly will constitute an abuse of \ndiscretion.  Walker v Packer , 827 S.W.2d at 840 (Tex.1992). Here, the continuous disregard for \nthe undersigned’s pleadings, the Texas Constitution, the Texas Rules of Civil Procedure, and the \nTexas Family Code has resulted in cumulative and severe harm: a minor child has sustained preventable injury due solely to j udicial inaction; the Petitioner continues to evade adjudication \ndespite credible, unrefuted, and well -documented allegations of fraud; and opposing counsel —\nwho has never substantively responded to any pleading nor demonstrated her authority to act pursuant to Rule 12—continues to receive judicial favor, undermining fundamental due process protections. This persistent tolerance for procedural irregularities denies the undersigned equal protection under law and creates a significant risk of ongoing and futur e delays, as every action \nundertaken by this unauthorized attorney remains vulnerable to being stricken or invalidated. \nConsequently, the judicial process has become one that incentivizes silence, penalizes diligence, and leaves vulnerable children exposed  to avoidable and foreseeable harm. Moreover, this \nconduct demonstrates an unacceptable level of bias: a judge who was never implicated in the present recusal motion has inexplicably involved himself without justification, the court coordinator improperly continues to perform roles for which she has no lawful authority, and Texas law is repeatedly misapplied, consistently to the detriment of the undersigned and his children. This troubling pattern of behavior erodes public trust, compromises judicial integr ity, \nand necessitates immediate corrective action .",
      "char_length": 1974
    },
    {
      "page_number": 4,
      "text": "IV . CONCLUSION \nThe issues necessitating this recusal  are precisely the errors and procedural misconduct \noutlined herein. The Court has repeatedly issued perfunctory orders lacking any substantive legal \nexplanation, mirroring the persistent silence and inaction of the opposing counsel. No valid legal justifi cation has been offered to explain the sustained disregard for the Texas Rules of Civil \nProcedure, the Texas Family Code, and fundamental principles of due process. The undersigned respectfully reiterates that this is a  Family Law proceeding —one that profoundly impacts \nchildren and families —not a venue for procedural indifference or selective enforcement. At a \nminimum, the Court must adhere strictly and impartially to the established rules and procedural requirements. Un less and until there is clear evidence that the pending Motion to Recuse has \nbeen properly and substantively reviewed and considered, the undersigned expressly objects to any scheduling of further hearings or proceedings in this matter. This objection is f iled not out of \ndisrespect, but rather out of necessity and urgency, to document and bring attention to continued procedural irregularities and judicial oversights that have compromised the fairness and integrity \nof this case. The undersigned seeks only the due process and equal protection to which all litigants are entitled, and which the record thus far has conspicuously failed to reflect.   \n \nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 6641 Anne Court  \n Watauga, Texas 76148 \n 817-546-3693 \n CHUCKDUSTIN12@GMAIL.COM",
      "char_length": 1615
    },
    {
      "page_number": 5,
      "text": "CERTIFICATE OF SERVICE  \nRelator c\nertifies that on April 29, 2025, a true and correct copy of the \nforegoing OBJECTION - RECUSAL PROCEDURE was served on all parties \nand counsel of record as follows pursuant to Rule 21a of the Texas Rules of \nCivil Procedure: PETITIONER\nMorgan Michelle Myers \nReal Pa rty in Interest \nMOR\nGANMW02@GMAIL.COM \nINT\nERVENOR \nHolly Hayes  \n2001 Beach St  \nFort Worth, TX 76103- 2308  \n817-459-6878\nCSD -Legal -914@oag.texas.govCOUNSEL FOR PETITIONER\nCooper L. Carter  \nMarx, Altman & Johnson  \n2905 Lackland Road \nFort \nWorth, TX 76116  \ncoopercarter@majadmin.com",
      "char_length": 593
    }
  ]
}