{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\08.20.25 - Objection to Final Trial Setting-1.pdf",
  "base_name": "08_20_25_objection_to_final_trial_setting_1",
  "page_count": 9,
  "pages": [
    {
      "page_number": 1,
      "text": "1 \n 322- 744263- 23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \nITMOMO,  \n    Morgan Michelle Myers  \n                                   Petitioner,  \n               v.  \n Charles Dustin Myers,  \n                         Respondent  \n& in the interest of  \nM.E.M. & C.R.M., \nTwo minor children.  \n § \n§ \n§ \n§ \n§         Objection to Notice Setting A   \n§         Court Proceeding and Docket    \n§                    Control Order  \n§ \n§ \n§ \n \nMEMORANDUM OF LA W  \n Petitioner , Morgan Michelle Myers, initiated this action on December 18, 2023. She \nallegedly retained the services of Cooper L. Carter on January 22, 2024. Today is August 18, \n2025, and there exists no plausible explanation found within th is record  as to the series of \nunlawful, unethical, and unprecedented events that have transpired since this matter’s inception.  \n Now, before any official reinstatement by the Regional Presiding Judge , and a pending \nrule 12 motion against the opposing counsel , a pending DWOP motion, a pending mandamus in \nthe Texas Supreme Court , a pending disqualification motion against opposing counsel , an \nunopposed summary judgment, and a plea to the jurisdiction, all of which have gone unanswered \nby our friends on the other side, this court – once again – seeks to act sua sponte  in an attempt to  \nset this matter for final trial, thereby attempting to cement the unlawful deprivation suffered by \nthe Respondent  over the past two years. For the forthcoming reasons, the Respondent OBJECTS \nto the notice setting a court proceeding and docket control order, and in support thereof, shows \nthe following:",
      "char_length": 1632
    },
    {
      "page_number": 2,
      "text": "2 \n I. INTRODUCTION \n 1. The record demonstrates pervasive violations of due process, statutory requirements, \nand local rules, rendering the setting of a final trial improper and constitutionally infirm. Under \nTexas law and binding precedent, the cumulative procedural and jurisdic tional defects in this \nmatter mandate that the final trial setting be vacated until the Respondent ’s rights to notice, \nhearing, a  fair process is fully restored  and the best interests of the children become priority.  \n 2. The Respondent’s  objection to the final trial setting is firmly grounded in both \nstatutory and constitutional law. The deprivation of his residence and property rights without an evidentiary hearing, which occurred on January 16, 2024, the lack of  findings of fact, or \nopportunity to be heard, combined with irregularities such as fraudulent orders  falsely claiming \nconsent , unauthorized practice  of law , recusal tampering, and dormant prosecution, collectively \namount to a systemic denial of due process and judicial integrity. \n 3. This court only seems to act upon receiving notice that the Respondent’s appellate \nefforts were denied – which changes nothing regarding the substantive issues herein that \ncontinue to be ignored.  A denial of a mandamus petition without any written opinion does not \nabsolve this court of  its responsibility  to address the se issues. Until these issues are adjudicated \nby this court – fairly and impartially – more mandamus petitions will follow, and more recusal \nproceedings will be initiated to receive  a lawful explanation  for the cumulative and compounding \nissues that continue to accu mulate . \n 4. Until an expla nation is handed down by a lawful authority or the Respondent is la beled \nas a vexatious litigant, he will c ontinue to seek justice for his children, himself, and will continue \nto utilize the appropriate legal channels  to seek answers  for the cumulative actions described in \nmore detail below.",
      "char_length": 1983
    },
    {
      "page_number": 3,
      "text": "3 \n II. ANAL YSIS  OF THE  ISSUES \nA. Deprivation of Residence and Property Without Hearing or Findings  \n 5. The Respondent  was ordered to vacate his home based solely on unsubstantiated \nallegations of family violence, without any evidentiary hearing, findings of fact, or opportunity \nto be heard  on January 16, 2024. This directly contravenes Texas Family Code § 85.001, which \nrequires both a hearing and an affirmative finding of family violence before a protective order may issue. Outside of this requirement, this Court exceeded its’ statutory authority when \nordering the Respondent to vacate . The absence of the  statutory prerequisites renders the order \nvoid and a violation of due process (Tex. Fam. Code § 85.001;  In re A.D.A ., 287 S.W.3d 382, 384 \n(Tex. App. 2009)).  6. A Texas district court cannot order a respondent to vacate his home based solely on \nunsubstantiated allegations of family violence without holding a hearing or making the required \nstatutory findings; such an order exceeds the court’s statutory authority under Texas Family Code \n§ 85.001 and is void. Requiring the respondent to show cause or prove why relief should not be \ngranted improperly shifts the burden of proof and further violates due process.  7. The Texas Family Code is unequivocal: a court may not issue a protective order, or any \norder excluding a person from their residence, without first conducting a hearing and making explicit findings that family violence has occurred. Section 85.001(a) requi res a hearing and a \nfinding of family violence as a condition precedent to any such order ( Tex. Fam. Code § 85.001). \nSection 83.006 imposes even stricter requirements for temporary ex parte exclusion orders, mandating a sworn affidavit, in- person testimony, and specific findings of recent violence and \nongoing danger ( Tex. Fam. Code § 83.006).  \n 8. Here, these requirement s were ignored, and the court acted ultra-vires from the onset.",
      "char_length": 1955
    },
    {
      "page_number": 4,
      "text": "4 \n B. Right to De Novo Review and Failure to Provide Relief  \n 7. The associate judge’s order signed on March 14, 2024, was subject to the Respondent ’s \nright to request a de novo hearing before the referring court under Texas Family Code § 201.015, \nhad spe cific procedural requirements which were not met, and t he record indicates that th is \nhearing was the result  of a timely filed e mergency motion to vacate and request for de novo \nreview, which ultimately denied without explanation. This failure to provide a written rationale \nfurther violated the Respondent ’s statutory and constitutional rights ( Tex. Fam. Code § 201.015).   \nC. Fraudulent Agreed Orders and Ineffective Assistance  \n 8. This court signed a unilateral ‘agreement’ containing only one side’s signature when \nthe signature page itself expressly states “AGREED AND CONSENTED TO BY:”. The per \ncuriam denials from the Second Court of Appeals regarding these issues does not absolve this court of the responsibility to address them, especially prior to moving this matter towards a final \nsetting sua sponte . \n 9. The associate judge compelled the Respondent  to sign an “agreed order” that falsely \nrecited universal consent, despite his express objection and lack of signature. This constitutes a fraudulent order and deprives the Respondent  of the right to contest property and parental issues \non the merits. Such conduct, especially when facilitated by the Respondent ’s own counsel acting \nagainst his interests, raises serious concerns of ineffective assistance and collusion, which are \nrecognized grounds for relief . \n 10. Now, this court seeks to move this matter to final  trial, requ iring the parties  “shall \nprovide the Court a written proposed property division at the time  of trial” , when the current \norders state that the property has already been divided in a “just in right manner .” The \nRespondent ’s property has been destroyed by the Petitioner, leaving no property to divide.",
      "char_length": 1986
    },
    {
      "page_number": 5,
      "text": "5 \n C. Dormant Prosecution and Bad Faith  \n 10. The M other, as movant, failed to diligently prosecute her claims, obtaining repeated \ncontinuances without substantive filings for over 18 months. Texas law and local rules support \ndismissal for want of prosecution in such circumstances, as the case was effectiv ely dormant and \nthe Respondent  deprivation was prolonged without justification ( In re Garcia , No. 02- 20-00161-\nCV , 2020 WL 4812632, at *1 (Tex. App. Aug. 20, 2020)). In fact, the only recent action taken by \nthe opposing side was to suddenly prevent relief in the 233rd district court, which ultimately \nresulted in two additional mandamus petitions  that received no participation or input . \nD. Judicial and Staff Misconduct  \n 11. The record details multiple instances of judicial officers acting ultra vires —issuing \norders while recusal or mandamus proceedings were pending, consolidating cases sua sponte in violation of local rules, and issuing orders without proper reinstatement. Court staff tampered with recusal motions by removing exhibits and altering submissions, which is not authorized \nunder Rule 18a and undermines the integrity of the judicial process . \n 12. Such conduct not only violates procedural rules but also implicates due process and \nthe right to a fair tribunal. The Texas Supreme Court has held that due process violations render \njudgments void and subject to collateral attack, regardless of procedural deadlines ( In re E.R ., \n385 S.W.3d 552, 555 (Tex. 2012)). \n 13. Regarding staff misconduct – this court has yet to explain why on October 8, 2024, a \nmodified version of a joint motion to recuse was forwarded to the Regional Presiding Judge with \nmissing exhibits and without the attached affidavit. The reasons given by the Court Coordinator – Lindsey Baker – contradict Tarrant County e -filing procedures, and directly contradicts the \nFrequently Asked Questions section of the court’s website.",
      "char_length": 1956
    },
    {
      "page_number": 6,
      "text": "6 \n  14. The Court Coordinator’s continued involvement in recusal proceedings showcases a \ndeeper level of judicial bias and impartiality, as the Texas Rules of Civil Procedure have no \ndesignation of responsibility for a court coordinator regarding recusal – likely intended given the \nfact that coordinators are appointed by the district judge’s whom they serve. By facilitating actions that are otherwise reserved for court clerks, the Court Coordinator continues to act outside of her role, and furthers the one -sided favoritism displayed by the Court , and raises a \nreasonable concern that the court is not acting impartially.  \nE. Unauthorized Practice and Void Filings  \n 15. Opposing counsel has filed two motions in this case. One came on April 24, 2024, \nseeking to set this matter for a pre -trial conference, and a motion to consolidate – which was \ngranted sua sponte by the District Judge of the 233\nrd District Court in violation of local rules  and \nin the face of a n objection. \n 16. The record also shows that opposing counsel lacks  authority to act, with e -filing \ncredentials tied to a prior employer and later filings made by another firm without substitution of counsel. Filings by unauthorized persons are void and further undermine the legitimacy of the proceedings ( In re Garcia , No. 02- 20-00161- CV , 2020 WL 4812632, at *1 (Tex. App. Aug. 20, \n2020)). F. Orders by Non -Reinstated Judges  \n 17. Orders issued by this Court  without official reinstatement by the regional presiding \njudge are void ab initio, as a judge lacks authority to act while recusal is pending or before reinstatement. Such ultra vires  acts are subject to mandamus or other extraordinary relief ( In re \nGarcia , No. 02- 20-00161- CV , 2020 WL 4812632, at *1 (Tex. App. Aug. 20, 2020)).",
      "char_length": 1795
    },
    {
      "page_number": 7,
      "text": "7 \n  18. Furthermore, this Court continues to avoid the issues, and chose to set this matter for \nfinal trial immediately after the Supreme Court denied four of five pending mandamus petitions, \nshowing a clear effort to avoid the issues despite being fully aware of them. \nIII. Cumulative Denial of Due Process  \n 19. The cumulative effect of these irregularities —fraudulent orders, unauthorized \npractice, recusal tampering, dormant prosecution, ultra vires judicial acts, and denial of notice and hearing—amounts to a systemic denial of due process and judicial integrity. The Texas \nSupreme Court has recognized that such violations render judgments void and subject to \ncollateral attack, and that constitutional demands of due process override statutory requirements \n(In re E.R ., 385 S.W.3d 552, 555 (Tex. 2012)).  \n 20. The repeated denials by the appellate courts do not alter the facts of this matter and \nsupporting law. The c ontinued disregard is not the answer, and will only lead to more recusal \nproceedings and mandamus petitions until a lawful explanation is handed down by a fair and \nimpartial judge, regardless of which level of the judiciary it comes from.   \nI V.  Conclusion  \n 21. The setting of a final trial under these circumstances would perpetuate and compound \nthe denial of the Respondent ’s constitutional and statutory rights. The record demonstrates a \npattern of procedural and jurisdictional defects, including deprivation of residence and property without hearing or findings, lack of diligence by the movant, ineffective assistance of counse l, \nfraudulent orders, unauthorized practice, judicial and staff misconduct, and denial of notice and \nopportunity to be heard, and continued disregard for the best interests of the children.  22. Texas law, as reflected in the Family Code and binding precedent, requires that these \ndefects be remedied before any final trial may proceed. The only appropriate course is to vacate",
      "char_length": 1963
    },
    {
      "page_number": 8,
      "text": "8 \n the final trial setting, restore the Respondent ’s rights to due process, and ensure that all future \nproceedings comply strictly with statutory and constitutional requirements. Failure to do so \nwould result in irreparable harm and a breakdown of judicial integrity, warranting extraordinary \nrelief  through additional recusal proceedings and mandamus petitions. \n 23. For all these reasons, the Respondent OBJECTS to notice of trial setting, and reserves \nthe right to seek additional relief through the appropriate legal channels, including but not \nlimited to further recusal proceedings, mandamus proce edings, and claims brought in federal \ncourt for the willful deprivation of constitutionally protected rights and through actions taken \nultra vires by multiple judges who have yet to provide any substantive explanation for the \nconduct alleged herein. \n 24. Therefore, the Court should V ACATE this order, the current temporary or ders signed \non March 14, 2024, and address the substantive issues as a priority and in accordance with Texas \nLaw at the first possibly opportunity. \n 25.  The Respondent’s objection to the final trial setting is well- founded in law, and the \ncourt is obligated to remedy the procedural and jurisdictional defects before proceeding. Failure to do so risks further mandamus proceedings, reversal on appeal, and potential federal claims for deprivation of rights.  \n 26. The Respondent puts the court on noti ce that  he will be  seeking prospective \ndeclaratory and injunctive relief through an ultra-vires claim shall these issues not be addresse d \nat the earliest opportunity.  The only appropriate course is to vacate the trial setting, address the \nunderlying due process violations,  restore the R espondent ’s rights, ensure strict compliance with \nstatutory and constitutional requirements in all future proceedings , and require the opposing \nparty to show cause for the l ack of participation in this matter.",
      "char_length": 1964
    },
    {
      "page_number": 9,
      "text": "9 \n  Respectfully Submitted,  \n \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  817-546-3693 \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE RESPONDENT  \n \n \nCERTIFICATE OF SERVICE  \n I hereby certify that on August 20, 2025, this OBJECTION was served in accordance \nwith Texas Rules of Civil Procedure 21a  to all parties of record.  \n  Respectfully Submitted,  \n \n  /s/ Charles Dustin Myers  \n  CHARLES DUSTIN MYERS  \n  817-546-3693 \n  CHUCKDUSTIN12@GMAIL.COM  \n  PRO -SE RESPONDENT",
      "char_length": 484
    }
  ]
}