{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\OFFICE OF THE ATTORNEY GENERAL\\06.28.24 - Intervention Pleading-7d5337b5-1.pdf",
  "base_name": "06_28_24_intervention_pleading_7d5337b5_1",
  "page_count": 6,
  "pages": [
    {
      "page_number": 1,
      "text": "MYERS_0014563904_INTE_TARRANT:\nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA\nNCP Name: CHARLES D MYERS\nCP Name: MORGAN MYERS\nOAG Number: 0014563904\nLAC: INTE\nCAUSE NUMBER 322-744263-23\nIN THE INTEREST OF §IN THE 322ND DISTRICT COURT\nMARA MYERS §\nCAROLINE MYERS §OF\nCHILDREN § TARRANT  COUNTY, TEXAS\nINTERVENTION\n1. The OFFICE OF THE ATTORNEY GENERAL, representing the State of Texas, files this pleading pursuant to\nTexas Family Code Chapter 231 for which discovery is intended to be conducted under Level 2 of Rule 190, Texas Rules\nof Civil Procedure.  The OFFICE OF THE ATTORNEY GENERAL is assigned the support and enforcement rights in\nthis case.\nTHE ATTORNEY GENERAL'S RIGHT TO INTERVENE\n2. The OFFICE OF THE ATTORNEY GENERAL, pursuant to Texas Family Code §§ 102.007 and 102.009 (d), is\na necessary party because this is an action to establish, modify, or enforce a support right assigned to the OFFICE OF\nTHE ATTORNEY GENERAL pursuant to Texas Family Code Chapter 231.\nJURISDICTION\n3. This Court has continuing jurisdiction of the children the subject of this suit because of prior proceedings.\nCHILDREN\n4. The following children  are the subject of this suit:\nName Sex DOB\nMARA MYERS\nCAROLINE MYERSF\nF6/20/2016\n4/12/2018\nNo property, other than personal effects, is owned by any child the subject of this suit.\nPERSONS ENTITLED TO NOTICE\n5. The children reside with MORGAN MYERS , the mother  of the children.  The OFFICE OF THE ATTORNEY\nGENERAL will serve MORGAN MYERS  with this pleading, by and through her attorney of record, pursuant to Rule 21a,\nTexas Rules of Civil Procedure.\n6. CHARLES D MYERS , is the father  of the children.   The OFFICE OF THE ATTORNEY GENERAL will serve\nCHARLES D MYERS  with this pleading pursuant to Rule 21a, Texas Rules of Civil Procedure.322-744263-23 FILED\nTARRANT COUNTY\n6/28/2024 12:35 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1866
    },
    {
      "page_number": 2,
      "text": "DETERM INATIO N OF DISCLO SURE O F ADDRESS\n7. The Cour t shoul d ent er appr opriate orders concer ning the di sclosure of the addr esses of  the par ties.\nPRIO R CH ILD SUP PORT O RDER\n8. On 3/14/2024  the Cour t ordered CHARLES D M YERS to pay  current child suppor t of $973.19  mont hly, beg inning\n4/1/2024 , and mont hly thereafter.  The am ount and f requency  of CHARLES D M YERS's chi ld suppor t obligation remains\nunchang ed.\nCHILD SUP PORT ARREARAGE\n9. CHARLES D M YERS failed to pay  cour t ordered chi ld suppor t as follows:\n a.  Chi ld suppor t accr ued si nce 4/1/2024 $2,919.57\n b.  Interest accr ued si nce 4/1/2024 $0.00\n c.  Chi ld suppor t paid since 4/1/2024 $0.00\n d.  T otal child suppor t arrearage as of  6/18/2024 $2,919.57\nEXH IBIT A , whi ch is attached and i ncorporated by  reference, i s a true and cor rect copy  of a pay ment record\nindicating the occasi ons Obl igor violated the abov e-referenced or der.\nJUDGM ENT O N ARREARS\n10. The Cour t shoul d conf irm and ent er judgment for all suppor t arrearage and accr ued i nterest as of  the cour t\nproceedi ng date.  The Cour t shoul d order payment and i ncom e withholding to liquidate the judgment pursuant  to Texas\nFamily Code Chapt ers 157 and 158.\nSUP PORT\n11. The OFFI CE OF T HE AT TORNEY GENERAL, r epresent ing only the interests of the St ate of Texas, r equest s\nthe Cour t make appr opriate orders for current child suppor t, medical suppor t, and dent al suppor t for the chi ldren,\nincluding temporary suppor t pursuant  to Texas Fam ily Code § 105.001.  I n det ermining the am ount of suppor t the Cour t\nshoul d consi der the dut y of parents to suppor t their minor children, and al l appl icabl e provisions of  the Texas Fam ily\nCode.\nWITHHOLDING F ROM EARNINGS F OR SUP PORT\n12. The Cour t shoul d order all suppor t withheld from disposabl e ear nings pur suant  to Texas Fam ily Code § 158.006. \nThe Cour t shoul d order all payments of suppor t processed pur suant  to Texas Fam ily Code Chapt er 231 f or distribution\naccor ding to law.  I f appr opriate, the Cour t shoul d order CHARLES D M YERS to post  a bond or  secur ity.\nREQ UEST F OR PRODUCTIO N OF DOCUM ENTS\n13. CHARLES D M YERS has i n his possessi on docum ents that will show t he nat ure and ext ent of his abi lity to pay\nchild suppor t.  The OFFI CE OF T HE AT TORNEY GENERAL, pur suant  to Rul e 196, T exas Rul es of  Civil Procedur e,\nrequest s him to produce and per mit the OFFI CE OF T HE AT TORNEY GENERAL t o inspect  and copy  the or iginals, or\ntrue copi es, of  the following docum ents in his possessi on, cust ody or cont rol:  (a) his IRS federal tax returns for the past\ntwo y ears with all schedul es included wi th the returns and al l W-2s and 1099s at tached t o such r eturns, (b) any and al l W-\n2 statements, all 1099s, and al l docum ents showi ng incom e received by  Respondent  from any sour ce for the two tax years\nprecedi ng the dat e of filing of this action, (c) all payroll stubs, v oucher s, records of  com missions and al l other written",
      "char_length": 3052
    },
    {
      "page_number": 3,
      "text": "records or evidence of income received by him within the last six months, (d) the most recent Social Security\nAdministration Form SSA-7005, showing his income history, sent to him three  months before his last birthday,(e)\nstatements of accounts for all checking or saving accounts in which he has held an interest within the last six months, (f)\nall evidence (policies, premium schedules, records of premiums paid, etc.) of health and/or dental insurance available at\nhis place of employment that may provide coverage for dependent children, (g) copies of loan applications made within\nthe last six months, (h) current statement of benefits and account balances for all retirement, pension, or profit-sharing\nplans in which the respondent has accrued or may accrue benefits, regardless if such benefits have vested, including but\nnot limited to employer- or union-sponsored defined benefit or defined contribution plans and individual retirement\naccounts (IRAs), and (i) summary plan description of all retirement, pension, or profit-sharing plans in which the\nrespondent has accrued or may accrue benefits, regardless if such benefits have vested.  The OFFICE OF THE\nATTORNEY GENERAL requests production of the specified documents at:\nThe Office of the Attorney General\nCHILD SUPPORT OFFICE\n2001 BEACH ST STE 700\nFT WORTH, TX 76103-2300\non or before 3:00 p.m. on the 30th day following the date of service of this request.\nPRAYER\nThe OFFICE OF THE ATTORNEY GENERAL prays that the Court grant all relief requested herein.  The\nOFFICE OF THE ATTORNEY GENERAL prays for general relief.\nRespectfully submitted,\nKen Paxton\nAttorney General of Texas\nBrent Webster\nFirst Assistant Attorney General\n                                                     \nTAMEKA D BOYD - SBN: 24027406\nCHOYA BURKLEY - SBN: 24012361\nKARLA BYRD - SBN: 24097445\nSTEPHEN E HAMMEL - SBN: 24043710\nMADISON LEDOUX - SBN: 24131449\nPAULA CROCKETT - SBN: 00798123\nJOHN CASHMAN - SBN: 24038807\nHOLLY L HAYES - SBN : 24110698\nATTORNEY OF RECORD\nCHILD SUPPORT ENFORCEMENT\nCHILD SUPPORT OFFICE\n2001 BEACH ST STE 700\nFT WORTH  TX 76103-2300\nEmail CSD-legal-914@oag.texas.gov\nTelephone No. (817)926-7197\nToll Free 1(800)252-8014\nFax No. (817)926-0522",
      "char_length": 2209
    },
    {
      "page_number": 4,
      "text": "CERTIFICATE OF SERVICE\nI certify that a true and correct copy of the foregoing has been served on the below listed parties or their representatives pursuant to Rule\n21a, Texas Rules of Civil Procedure, on the ______ day of __________________, 20_____.\n___________________________________\nCHOYA BURKLEY\nATTORNEY OF RECORD\nParty: Attorney for Party:\nMORGAN MYERS COOPER L CARTER\n2905 LACKLAND RD. \nFORT WORTH, TX 76116\nCOOPERCARTER@MAJADMIN.COM\nCHARLES D MYERS\n28th\nJune\n24",
      "char_length": 471
    },
    {
      "page_number": 5,
      "text": "FEDERAL OFFSET (FO) receipts are subject to future adjustments by the Federal Government.CV - FQ1059R2 Attorney General of Texas - Child Support Division Page 1\nFinancial Activity Report as of 06/19/2024 Date: 06/19/2024\nCase ID: 0014563904 Cause Number: 322-744263-23\nNCP: MYERS, CHARLES D CP: MYERS, MORGAN\nChild Support\nTrans\nDateActivity\nTypeTransaction\nAmountAmount\nDueAmount\nApplied Balance\n04/01/2024 Amount Due 973.19 973.19 973.19\n05/01/2024 Amount Due 973.19 973.19 1,946.38\n06/01/2024 Amount Due 973.19 973.19 2,919.57\nSummary\nTotals: 2,919.57 0.00 2,919.57",
      "char_length": 568
    },
    {
      "page_number": 6,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nOfficer Filer 914 on behalf of Holly Hayes\nBar No. 24110698\ncsd-filer-914@texasattorneygeneral.gov\nEnvelope ID: 89311887\nFiling Code Description: (Title IV-D OAG Use Only)Intervention\nFiling Description: INTE\nStatus as of 6/28/2024 2:16 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nCooper L.CarterBarNumber Email\ncoopercarter@majadmin.comTimestampSubmitted\n6/28/2024 12:35:54 PMStatus\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n6/28/2024 12:35:54 PMStatus\nSENT",
      "char_length": 929
    }
  ]
}