{
  "source": "C:\\code\\LEGAL_DESTROYER\\INCONSISTENCIES\\12.08.25 - RESPONDENT'S ANSWER TO PETITIONER'S SECOND AMENDED PETITION.pdf",
  "base_name": "12_08_25_respondent_s_answer_to_petitioner_s_second_amended_petition",
  "page_count": 18,
  "pages": [
    {
      "page_number": 1,
      "text": "1 NO. 322-744263-23 \nIN THE MATTER OF    IN THE DISTRICT COURT \nTHE MARRIAGE OF                  \nMORGAN MICHELLE MYERS  \nAND 322ND JUDICIAL DISTRICT \nCHARLES DUSTIN MYERS  \nAND IN THE INTEREST OF  \nM.E.M. AND C.R.M.,\nCHILDREN TARRANT COUNTY, TEXAS  \nRespondent's Answer to Second Amended Petition for Divorce \nTO THE HONORA BLE JAMES B. MUNFORD OF THE 322ND DISTRICT C OUR T: \nOn November 24, 2025, the Petitioner, Morgan Michelle Myers (“Mother” or \n“Petitioner”), filed a “Second Amended Petition for Divorce” one d a y prior t o the res ponse \ndeadline for  th e summary judgment pr oceedings  that ar e currently aw ai ting  this C ourt’s r uling. \nDespite not  participating  in this m atter f or nearly t wo ye ar s, P etitioner now  seeks to  deny  \nR\nespondent’s ac cess t o the Children,  alleges a pattern of  chi ld abus e and  negl ect d ating  back to \n2021,  and at tempts onc e again t o manufacture an “ em ergency” narrative to avo id an adverse \nruling on the pending no-e vidence summary j udgm ent  and the  unrebutted mandamus record.\nNot only has Mother’s conduct directly contravene d the be st interests of the minor \nchildren, but she continues to litigate in bad faith, continues to submit know ingly false \ninformation to this Court, and now shows a pattern of inconsistency fatal to her credibility. For \nthe following reasons, the Respondent points the Court to the following inconsistencies and \nunrebutted allegations that Petitioner has failed to answer or defend:§ \n§ \n§ \n§ \n§ \n§ \n§ \n§ \n§\n§ 322-744263-23 FILED\nTARRANT COUNTY\n12/8/2025 6:37 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1609
    },
    {
      "page_number": 2,
      "text": "2 I. INCONSISTENCIES\n1. Petitioner’s renewed pleading functions as an attempt to escape summary judgment rather\nthan a good-faith effort to correct the record. Her newfound allegations of child abuse cannot be \nreconciled with her failure to offer any new sworn evidence and with the contrary proof already contained in the 3,900-page Mandamus Record. 2. Petitioner filed: (a) an Original Petition for Divorce under an Affidavit of Inability to Pay\non December 18, 2023; (b) a First Amended Petition filed “on her behalf” by RODERICK D. MARX, a party not named in this suit, on January 31, 2024; and (c) the Sec ond Amended \nPetition filed on November 24, 2025, again signed and filed by RODERICK D. MARX, still not named as counsel of record in this cause. 3. All three petitions contain statements known to be false, misrepresent the children’s\ncircumstances, and facially call into question the authority of Cooper L. Carter, Petitioner’s alleged counsel, as alleged throughout this case and in Respondent’s Rule 12 challenge.  \n4. The Second Amended Petition for Divorce does not correct the misstatements identified\nin Respondent’s prior pleadings; it compounds them. Petitioner continues to allege a “history or pattern of family violence, child abuse, and child neglect” and seeks to deny Respondent access to his children even though: (1) the Title 4 protective-order proceeding was nonsuited and produced no finding of family violence ( M.3457; see also M.1346, M.2858), (2) Petitioner’s \nsworn claim of an “active protective order” with a prior finding of family violence is demonstrably false ( M.78; see also M.2858, M.3784), (3) Petitioner’s sworn separation date of \nDecember 1, 2023 is contradicted by photographic and documentary evidence of cohabitation through late December and January (M.210, M.1714, M.1346, M.2858), and (4) Petitioner’s",
      "char_length": 1858
    },
    {
      "page_number": 3,
      "text": "3 \n assertion that “there are no court -ordered relationships affecting the children” is irreconcilable \nwith the temporary orders already signed in this cause ( M.210, M.1576). \n5. These misstatements are not isolated; they appear across multiple filings, including \nPetitioner’s divorce petitions and her protective-order application, and are exposed by \nRespondent’s mandamus materials. Each time Respondent exposes a falsehood —by providing \ntext-message logs, third-party affidavits, bank and PayPal records, and court orders —Petitioner \nand her counsel do not correct the record. They instead file another amended petition repeating and amplifying the same accusations, without engaging wit h the 3,900-page mandamus record \nthat refutes them (see, e.g.,  M.3 , M.245, M.2536, M.2538, M.2858, M.3457, M.3762, M.3784). \n6. Under these circumstances, the Court may reasonably find that the Second Amended \nPetition is not the product of an honest mistake but of a deliberate strategy to maintain control of the residence and the children through inflammatory but unsubstantiated al legations ( M.1346, \nM.245, M.2536, M.2858, M.3457, M.3762, M.3784). The pattern satisfies the standard for bad-\nfaith pleadings and sanctions under Texas Rule of Civil Procedure 13 and Chapter 10 of the Texas Civil Practice and Remedies Code, or dismiss the case outright as requested in the prayer for relief within the Respondent’s No-Evidence Summary Judgement awaiting adjudication from this Court.  \nII. UNREBUTTED ALLEGATIONS SHOULD BE DEEMED ADMITTED  \n7. Petitioner never addresses the financial misconduct that triggered this litigation. The \nmandamus record documents that on December 15, 2023, Petitioner caused $1,576 from the marital estate to be transferred using a third party’s PayPal account in order to  conceal marital \nfunds from the Court (M.1688). Respondent’s narrative in the mandamus record further explains \nthat Petitioner then immediately proceeded to file for divorce claiming indigency and seeking to",
      "char_length": 2018
    },
    {
      "page_number": 4,
      "text": "4 \n proceed under a Statement of Inability to Afford Court Costs (M.1688, M.85). In separate \ncorrespondence, Respondent expressly identifies the same December 15, 2023 conversion and \ndemands that the $1,576 “you converted on December 15, 2023” be returned, tying it directly to Petitioner’s and Mr. Branthoover’s coordinated conduct (M.1760). Petitioner has never filed any \nresponse, affidavit, or amended pleading that denies, explains, or corrects this sequence of events, despite clear notice of the allegation and the supporting transaction records (M.1692, \nM.3457–3458). \n8. Similarly, Petitioner has never attempted to reconcile her sworn claim of an “active \nprotective order” with a prior finding of family violence with the actual procedural history. In the materials filed contemporaneously with the divorce, Petitioner affirmatively states that she “ha[s] an active protective order or an active magistrate's order for emergency protection against my spouse… [and] [t]he order includes a finding that my spouse committed family violence” (M.78). Respondent’s mandamus narrative and exhibits show that no such prior finding exists, \nthat the protective-order proceeding was later nonsuited or otherwise resolved without any adverse finding against Respondent, and that Petitioner used the supposed “existing” order to waive the sixty -day waiting period and to justify ex parte relief ( M.1692, M.1759, M.3457–\n3458). Even after Respondent repeatedly exposed this falsehood in detailed filings, Petitioner’s \nSecond Amended Petition simply repeats the “history or pattern” language and never confronts the fact that her original “active protective order” representation was materially untrue ( M.210, \nM.1759). \n9. Petitioner and her counsel likewise ignore the long -standing challenge to Cooper L. \nCarter’s authority and the undisputed involvement of Roderick D. Marx, who is not named as counsel of record in this cause. The mandamus record recites that M s. Carter “has been under",
      "char_length": 1999
    },
    {
      "page_number": 5,
      "text": "5 \n challenge via Rule 12 since September 20, 2024” and that he “has not filed any pleadings in this \nmatter,” while pleadings purporting to be “on behalf of” Petitioner are filed and signed by Roderick Marx, founder of Marx, Altman & Johnson (M.1688). Respondent’s materials quote \nMs. Carter’s own language that “It was necessary for Petitioner to acquire the services of \nCOOPER L. CARTER” and set that assertion against the reality that Marx —who lacks any \nappearance in this case—continues  to submit critical pleadings, including the First and Second \nAmended Petitions ( M.1688, M.210). Petitioner offers no explanation for this discrepancy, no \nsworn clarification of who actually represents her, and no response to the Rule 12 challenge, yet continues to seek extraordinary relief based on pleadings filed under this clouded authority (M.1688). \n10. Finally, Petitioner has never made a credible, evidence-based showing that the children \nare presently in danger , have ever been in danger, or that the existing orders serve their best \ninterests , which they claim do not exist at all in the live pleading ; instead, she relies on escalating \nrhetoric untethered to new facts. Respondent’s mandamus exhibits include images and  \ndescriptions of Mother and the children together at the home after the alleged “emergency” and after the filing of the protective-order application, depicting normal, playful interactions rather than any imminent threat ( M.1713–1714). Respondent’s correspondence to Mr. Branthoover \nexpressly pleads for “stability to my children’s lives and my life” and ties the instability directly to the fraudulent filings and misuse of protective-order and divorce procedures (M.1760). The \nmandamus narrative also details the impact of Petitioner’s actions on the children’s housing and access to their father, while the Second Amended Petition offers no new sworn evidence that the current orders are harming the children or that a furthe r restriction on Respondent’s access is \nnecessary ( M.3457–3458, M.1576–1577). Taken together, the unrebutted evidence of financial",
      "char_length": 2103
    },
    {
      "page_number": 6,
      "text": "6 \n deception, false protective-order claims, improper attorney involvement, and disregard for the \nchildren’s actual circumstances underscores that Petitioner’s shifting allegations serve primarily to avoid an adverse judgment rather than to protect the childr en, and that this pattern of litigation \nconduct has concrete, harmful consequences for them.  \n11. The mandamus record also details concrete economic and emotional damages flowing \ndirectly from Petitioner’s conduct. In discovery responses, Respondent identifies “economic damages claimed by the Respondent” and specifically lists “attorney fees [and] unau thorized \ntransfer of funds from a third party on December 15th, 2023, for the amount of $1,560” as part of the harm for which he seeks recovery (M.789). In his counterpetition, Respondent further asserts \na claim for conversion of community property “amounting to $1,576 on December 15th, 2023,” as well as intentional infliction of emotional distress and civil conspiracy against Petitioner’s agents for “planning, meeting, and filing of three concurrent lawsuits for the sole intention of having the Counter -petitioner removed from the residency and interfering with his constitutional \nrights of the care, control, and custody of his Children” (M.1126). Petitioner has never \ncontroverted these specific damages allegations or offered any innocent explanation for the coordinated eviction and conversion described in those pleadings. 12. Respondent likewise explains to law enforcement that the loss of the residence is not \nmerely symbolic, but directly tied to his ability to work and support the children. In his detailed letter to the Watauga Police Department, Respondent states that “signi ficant damages… have \noccurred from being unable to work from out of the home which has directly impacted [the children’s] financial livelihood,” making clear that the home functions as both residence and place of business ( M.1694). In the same closing paragraph, he identifies Petitioner’s motive as \n“an attempt by my wife to cover -up an affair that took place between October 2022 and the",
      "char_length": 2114
    },
    {
      "page_number": 7,
      "text": "7 \n present day” (M.1694). Those statements link (a) the economic and professional harm from \nbeing forced out of the residence, (b) the resulting impact on the children’s financial stability, \nand (c) the underlying motive of covering up an extramarital affair—none of which Petiti oner \naddresses or denies in her Second Amended Petition, even as she escalates her accusations against Respondent.  \n13. From the outset of this litigation, Respondent has consistently framed Petitioner’s \nconduct in terms of fraud and civil conspiracy, not mere mistake. In his counter -petition section \ntitled “CIVIL CONSPIRACY AND FRAUD,”  Respondent pleads that the record “proves civil \nconspiracy on its face” through text evidence and other materials already on file with the clerk (M.1083). He alleges that Petitioner, acting in concert with Daniel Kenneth Branthoover, \n“knowingly and willingly filed fraudulent divorce paperwork” by claiming an active order of protection existed against Respondent, “with intent to deceive and with knowledge of the statement's meaning,” for the purpose of acquiring property and gaining an advantage in the divorce (M.1085). Respondent further requests relief that includes damages for the “fraudulent \ntransfer of marital assets,” expressly tying Branthoover’s and Petitioner’s conduct to a scheme to remove Respondent from the residence and strip him of access to community fun ds (M.1085, \nM.1088). He also characterizes the temporary orders as “erroneous and fraudulently rendered,” \nexplaining that a Title IV intervention rests on those defective orders rather than on any independent factual understanding of the case (M.1111 ). \n14. Respondent’s later filings reinforce that same fraud theory with specific factual detail. In \nhis March 4, 2025 cover letter to the Watauga Police Department, he describes “fraudulent documents that were prepared and presented” on December 18, 2023, leading to his “unjust removal” from the residence and asks the department to acknowledge that “the court orders",
      "char_length": 2033
    },
    {
      "page_number": 8,
      "text": "8 \n removing me were obtained through fraud and due process violations” (M.1692–1693). He \nrequests an investigation into “fraudulent filings made by Petitioner” and into Branthoover’s role \nin “facilitating perjury and financial deception,” and notes that Petitioner “obtained the house through fraudulent court orders” (M.1692 –1693). In a separate motion to compel and deem \nadmissions, Respondent states plainly that, “On December 15, 2023, Petitioner defrauded the marital estate by transferring $1,576 to a third party without Respondent’s consent,” and he explains that she then refus ed to answer Requests for Admission that would have required her to \nadmit this fraudulent transfer and the related eviction tactic ( M.2855–2856). In his mandamus \nnarrative, Respondent recounts that he asserted affirmative defenses of “fraud, illegality, and duress,” supported by his TxDPS record and exhibits highlighting inconsistencies in Petitioner’s petition ( M.3455). Petitioner never confronts any of these fraud allegations on the merits, never \nexplains why these orders and filings are not fraudulent, and instead files a Second Amended Petition that ignores this history while escalating accusations against Responden t—further \nconfirming the bad- faith, damage -causing pattern already documented in the mandamus record.  \nIII. LEVEL OF EGREGIOUSNESS AND IMPACT ON THE CHILDREN  \n15. The egregiousness of Petitioner’s conduct lies not only in the sheer number of false \nstatements, but in the way those statements have been used to separate two young children from their father and then left unprosecuted once they achieved that result. Peti tioner obtained \npossession of the residence and effective control of the children by claiming an active protective order with a prior finding of family violence that never existed (M.78, M.1692–1693, M.3457–\n3458), by converting community funds on December 15, 2023 (M.1688, M.1760), and by \npushing through temporary orders that are  later described as “erroneous and fraudulently \nrendered” in light of the record (M.1111 ). After those tactics succeeded in removing Respondent",
      "char_length": 2131
    },
    {
      "page_number": 9,
      "text": "9 from the home and restricting his contact with the children, Petitioner largely stopped \nprosecuting the underlying allegations and only resurfaced with new, broader accusations when an adverse judgment loomed ( M.2855–2856, M.3455–3458). \n16. This pattern has real, tangible consequences for the children. Respondent’s mandamusfilings explain that the residence functioned as both family home and workplace, and that “significant damages… have occurred from being unable to work from out of the hom e which \nhas directly impacted [the children’s] financial livelihood” ( M.1694). The forced lockout and \nloss of the residence on March 6, 2024 flowed from fraudulent filings and misrepresentations, not from any adjudicated finding of danger to the children (M.1076, M.1692–1694, M.3457). At \nthe same time, Petitioner exposed the children to a new boyfriend, attempted to install a replacement father figure, and refused to foster normal communication between the children and Respondent, all while insisting in pleadings that the existing or ders either do not exist or do not \ngo far enough (M.1694, M.1713–1714, M.1576–1577). \n17. Respondent’s damages claims underscore that this is not a victimless paperwork dispute.\nHe pleads economic losses in the form of attorney’s fees and the unauthorized $1,576 transfer from the marital estate ( M.789, M.1126, M.2855–2856), and he alleges intentional infliction of \nemotional distress and civil conspiracy based on “planning, meeting, and filing of three concurrent lawsuits for the sole intention of having the Counter-petitioner removed from the residency and interfering with his constitutional rights of the care, control, and custody of his Children” (M.1126). Petitioner never offers a good-faith rebuttal to these allegations, never \nexplains the transfer, never explains the fraudulent protective-order claim, and never explains why the children’s stability and financial security had to be sacrificed in service of her shifting narratives.",
      "char_length": 1998
    },
    {
      "page_number": 10,
      "text": "10 \n 18. In essence, Petitioner’s conduct reflects a litigation strategy that uses the children as \nleverage: remove their father through lies; secure the house and a new relationship; ignore the \nrecord that exposes the fraud; and, when the Court approaches the meri ts, file a new round of \nunsubstantiated abuse allegations to avoid an adverse judgment. That level of bad faith —\nsustained over years, in multiple courts, and at the direct expense of the children’s relationship with their father and their financial stability —strongly supports striking the Second Amended \nPetition and imposing sanctions under Rule 13 and Chapter 10, rather than rewarding a strategy that treats perjury and fraud on the court as acceptable tools of custody litigation ( M.1083, \nM.1085, M.1088, M.1692–1694, M.2855– 2856, M.3455–3458). \nIV. LEGAL STANDARDS SUPPORT STRIKING THE SECOND AMENDED PETITION \nA. Best-Interest Mandate and Misuse of Protective -Order Allegations  \n19. Texas Family Code § 153.002 makes the child’s best interest the primary consideration  \nin decisions concerning conservatorship and possession. Appellate courts repeatedly apply Holley v. Adams, 544 S.W.2d 367 (Tex. 1976), and related authorities to emphasize factors such as stability of the home, the acts or omissions of each parent, and wh ether a parent fosters or \nundermines the child’s relationship with the other parent . \n20. Cases such as Brandon v. Rudisel, In re A.L.E., In re B.O., In re R.M., and Holley hold \nthat: \ni. the best -interest standard and public policy (§§ 153.001, 153.002) favor frequent and \ncontinuing contact with fit parents;  \nii. there is a rebuttable presumption that a standard possession order serves the child’s best interest; and",
      "char_length": 1738
    },
    {
      "page_number": 11,
      "text": "11 \n iii. any denial or severe restriction of access may not exceed what is required to protect the \nchild and must be supported by specific, credible evidence —not speculation.  \n21. Other authorities expressly condemn conduct that obstructs a child’s relationship with the \nother parent. In Cox v. Cox, the court treated a mother’s false sexual -abuse reports, interference \nwith the father’s employment, and instability as evidence contrary  to the children’s best interests \nand as grounds for altering conservatorship.  22. In Marriage of Chandler and Gunther v. Gunther , the courts described unjustified \ninterference with a parent -child relationship as legally “reprehensible” and affirmed modification \nwhere one parent deliberately hindered the children’s ability to know, love, and be with the other parent.  \n23. Petitioner’s course of conduct —false protective-order claims, self -help eviction, blocking \ncommunication, and repeated efforts to deny Respondent access without credible danger evidence —tracks precisely the type of behavior Texas courts treat as contrary t o § 153.002. The \nmandamus record documents that the Court removed Respondent from the home “without any factual basis, without holding an evidentiary hearing, and without eliciting any testimony from the Petitioner,” and that no protective order or fam ily-violence findings exist despite Petitioner’s \nsworn assertions to the contrary. Rather than protect the children, the Second Amended Petition attempts to entrench the very instability and severed relationship that § 153.002 and the Holley factors reject . \nB. Rule 13 and Chapter 10: Groundless, Bad -Faith Pleadings  \n24. Texas Rule of Civil Procedure 13 and Chapter 10 of the Civil Practice and Remedies \nCode require that every pleading be:  \ni. based on fact and law (or a good-faith argument for change),",
      "char_length": 1854
    },
    {
      "page_number": 12,
      "text": "12 \n ii. not groundless, and  \niii. not interposed for harassment, delay, or other improper purpose.  \n25. Texas appellate courts, including in Low v. Henry and Nath v. Texas Children’ s Hospital , \nuphold sanctions where litigants persist in refuted narratives or file serial amended pleadings that \nignore the record and continue to accuse the opposing party of serious misconduct without evidentiary support. Remedies under Rule 13 and Chapter 10 incl ude monetary sanctions, issue \nsanctions, and striking of pleadings or dismissal.  \nrule 13 and rule 10.  \n26. Here, Petitioner’s Second Amended Petition reasserts and expands allegations of “history \nor pattern of family violence, child abuse, and neglect” after:  \ni. the protective-order case ended without any finding of family violence;  \nii. Respondent’s mandamus filings exposed the falsity of her sworn claim of an “active protective order” containing such a finding; and  \niii. she refused to respond to discovery and motions to compel that squarely challenged those narratives.  \n27. This pattern fits Rule 13’s definition of a groundless, bad-faith pleading and satisfies \nChapter 10’s standard for pleadings brought for an improper purpose —namely, to maintain \ncontrol of the residence and children and to avoid a merits -based resolution. S triking the Second \nAmended Petition aligns with how Texas courts use sanctions to deter such abuse.  \nrule 13 and rule 10  \nC. Rule 12: Lack of Authority and Striking Pleadings  \n28. Texas Rule of Civil Procedure 12 places the burden on a challenged attorney to show \n“sufficient authority to prosecute or defend the suit.” If the attorney fails, “the court shall refuse",
      "char_length": 1681
    },
    {
      "page_number": 13,
      "text": "13 \n to permit the attorney to appear in the cause, and shall strike the pleadings if no person who is \nauthorized to prosecute or defend appears.”  \n29. The mandamus record establishes that Respondent filed a Rule 12 motion challenging \nMs. Carter’s authority, that M s. Carter has never meaningfully responded, and that key \npleadings —including the First and Second Amended Petitions —are in fact drafted and signed by \nan entirely different lawyer, Mr. Marx, who never appears of record. Under Rule 12 and the authorities coll ected in the Rule 12 research memorandum, pleadings filed by an attorney who \nfails to carry this burden are subject to being struck.  30. The Second Amended Petition therefore stands on procedurally defective ground and is \nindependently subject to being struck on that basis.  \nD. Deemed Admissions and Failure to Respond  \n31. Texas Rule of Civil Procedure 198.2(c) provides that a party’s failure to timely answer \nrequests for admission results in those requests being deemed admitted without a court order , \nand those deemed admissions have substantive effect, conclusively establishing the admitted matters for summary judgment and trial. Texas authorities and practice materials echo that each matter requested “shall be deemed admitted” absent a sworn respons e within thirty days, and that \nsuch admissions are binding in later stag es. \n32. The “Failure to Respond” research memorandum compiles cases such as CherCo \nProperties, Inc. v. Law, Snakard & Gambill, P .C., and Texaco, Inc. v. Phan, which confirm that failure to respond to serious, documented allegations and requests for admissions justifies treating those matters as conclusively proven and supports sanctions. The same materials recognize that when serious factual allegations are made and circumstances call for a reply, a",
      "char_length": 1831
    },
    {
      "page_number": 14,
      "text": "14 total failure to respond permits the court to presume the truth of the allegations and to draw \nadverse inferences.  33. The mandamus record shows that Respondent served Requests for Admissions andRequests for Production on September 17, 2024, that Petitioner never answered, and that she did not oppose the motion to compel. Under Rules 198.2(c) and 215.2(b), the admissions are deemed and sanctions up to striking pleadings are available. Petitioner’s Second Amended Petition therefore directly conflicts with deemed admissions that no family violence occurred, that Respondent contributed to the family’s stability through his work-from-home employment, and that Petitioner engaged in financial misconduct and self -help eviction. A pleading that contradicts \ndeemed admissions and the unrefuted record sits on legally untenable ground and is subject to being struck.  \nE. Rule 193.6 and Failure to Disclose Evidence or Testimony34. Texas Rule of Civil Procedure 193.6 mandates exclusion of untimely disclosed evidenceand witnesses unless the offering party proves good cause or lack of unfair surprise or prejudice. The Texas Supreme Court in Fort Brown Villas III Condo. v. Gillenwater holds that Rule 193.6 applies in summary -judgment proceedings and that a party who fails to timely disclose evidence \nor witnesses may not introduce them absent the rule’s narrow exceptions.  35. The “No Disclosure of Testimony” memorandum explains that, while a named party\ngenerally may testify as a witness, Rule 193.6 still limits the scope of undisclosed subject matter and places the burden on the offering party to show good cause or lack of unfair surprise or prejudice, with the default remedy being exclusion of undisclosed evidence or a continuance.  \n36. Here, Petitioner has not disclosed any witness list, exhibit list, or responsive documents\ndespite Respondent’s targeted discovery requests, including requests for financial records,",
      "char_length": 1944
    },
    {
      "page_number": 15,
      "text": "15 health -care information for the children, parenting- course completion, and witness identities. \nRule 193.6 therefore bars her from introducing undisclosed evidence to support the new abuse \nnarrative in the Second Amended Petition. A pleading that rests on allegations which the proponent cannot support with admissible evidence because of her own discovery violations is precisely the type of pleading Texas courts strike under Rules 193.6, 215, 13, and Chapter 10.  \nV\n. APPLICATION AND REQUESTED RELIEF\n37. The Mandamus Record supplies a comprehensive evidentiary backdrop: it documents thelack of any protective-order findings, the removal of Respondent without testimony in violation of Tex. Fam. Code §§ 83.006 and 85.001, the self-help eviction and financial conversion, the unanswered discovery, and the Court’s own obligation to apply the Holley factors and § 153.002 best-interest mandate. Petitioner’s Second Amended Petition simply repackages and expands \naccusations already exposed as false in that record, ignores deemed admissions, and attempts to leverage the children to avoid a merits -based reckoning.  \n38. Under:\ni.Texas Rules of Civil Procedure 12, 13, 193.6, 198.2(c), and 215;\nii.Texas Civil Practice and Remedies Code Chapter 10; and\niii.Texas Family Code §§ 153.001, 153.002, and 153.193,\nthe Court has both the authority and the duty to prevent further abuse of process and to protect the children’s best interests by refusing to credit, or even entertain, a pleading that:  \ni.rests on discredited protective-order narratives;\nii.conflicts with deemed admissions and unrefuted evidence;\niii.emanates from counsel whose authority remains unproven; and",
      "char_length": 1684
    },
    {
      "page_number": 16,
      "text": "16 iv.seeks to deny a fit parent access without credible evidence of danger.\n36.Allowing the Second Amended Petition to stand would reward a pattern that Texas courts\nand statutes expr essly cond emn:  using unsubstantiated,  escalating  abuse allegations, \ndiscovery non-c ompliance, and  procedural ga mesmanship to sever a parent -child \nrelati onship and to secure property and possession of the home, rather than to protect \nchildren from actual harm. In light of the nuclea r evidentiary rec ord already before the \nCourt and the unrebutted nature of Respondent’s factual allegations, the only remedy  \nconsistent with Texas law and the best interests of  the children is to grant \nRespondent's summary judgment and proceed on his third amended counter-petition .\nVI. PRAYER \nWHEREFORE, PREMISES CONSIDERED, Respondent CHARLES DUSTIN MYERS \nrespectfully prays that the Court : \ni.Disregard the Second Amended Petition for Divo rce in its entir ety and sanction under \nTexas Rules of Civil Procedure 12, 13, 193.6, 198.2(c), and 215, and under Chapter  10 of \nthe Texas Civil Practice and Remedies Code;\nii.Confirm that Petitioner’s failure to answer Respondent’s Requests for Admissions renders \nthose matters deem ed admitted and conclusively established for purposes of all pending \nand future proceedings;\niii.Preclude Petitioner, under Rule 193.6, from introducing any evidence, witnesses, or  \ntestimony not timely disclosed in discovery, ex cept to the limited extent per mitted for a  \nnamed party’s own testimony and subject to proper objection and limitation of scope ;",
      "char_length": 1584
    },
    {
      "page_number": 17,
      "text": "17 \n iv. Take judicial notice of, and rely upon, the Mandamus Record as part of the evidentiary \nfoundation for these rulings;  \nv. Grant Respondent such additional sanctions as the Court deems just, including but not \nlimited to attorney’s fees, costs, issue sanctions, and such other relief as necessary to deter further abuse of process; and  \nvi. Grant Respondent all other relief, at law or in equity, to which he shows himself justly entitled.  \n Respectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n PRO -SE RESPONDENT  \n 817-546-3693 \n \n \nCERTIFICATE OF SERVICE  \n Respondent, CHARLES DUSTIN MYERS, certifies that pursuant to § 21a of the Texas \nRules of Civil Procedure, a true and accurate copy of this “Respondent’s Answer to Second \nAmended Petition for Divorce and Motion to Strike” has been served on all parties of record via the EFM  on this 8\nth Day of December , 2025. \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n PRO -SE RESPONDENT  \n 817-546-3693",
      "char_length": 1000
    },
    {
      "page_number": 18,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 108812760\nFiling Code Description: Answer/Contest/Response/Waiver\nFiling Description: Respondent's Answer to Petitioner's Second Amended\nPetition for Divorce\nStatus as of 12/8/2025 8:29 AM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n12/8/2025 6:37:06 AM\n12/8/2025 6:37:06 AM\n12/8/2025 6:37:06 AM\n12/8/2025 6:37:06 AMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 919
    }
  ]
}