{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\11.04.24 - PT MOTION IN LIMINE-1.pdf",
  "base_name": "11_04_24_pt_motion_in_limine_1",
  "page_count": 6,
  "pages": [
    {
      "page_number": 1,
      "text": "1 NO. 322 -744263 -23 & NO. 322 -744538 -23 \nIn the Matter of the Marriage of \n Morgan Michelle Myers & Charles Dustin Myers  \nand in the Interest of \nMara Evonne Myers & Caroline Rose Myers, \nMinor Children.  \nPRE-TRIAL MOTION \nIN \n LIMINE \nIn the 322nd District Court. \nTarrant County, Texas  \nIN R\nEGARD TO: \nJOINT \nMOTION TO RECUSE \nTO BE\n PRESIDED BY JUSTICE LEE GABRIEL  \nON NOVEMBER 7TH, 2024 322-744263-23FILED\nTARRANT COUNTY\n11/4/2024 8:51 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 483
    },
    {
      "page_number": 2,
      "text": "2 \n I. INTRODUCTION \nRelevant evidence is defined by Texas Rule of Evidence 401 as \"having any \ntendency to make the existence of any fact that is of consequence to the determination of \nthe action more probable or less probable than it would be without the evidence.\" Tex. R. Evid. 401; See Morale v. State , 557 S.W.3d 569, 573 (Tex. 2018).  \nThis Pre-Trial Motion in Limine , respectfully brought forth by CHARLES \nDUSTIN MYERS, Respondent, seeks to preclude the use of unsupported, general \nobjections as a tactic to hinder the presentation of valid arguments or evidence central to \nthe matter at hand, specifically in the context of the Joint Motion to Recuse  and pending \nRule 12 motion . The use of an unsubstantiated objection to “relevance ” without a \nsupporting argument explaining how the evidence is irrelevant under Rule 401  of the \nTexas Rules of Evidence  serves to stifle the fair examination of pertinent facts and \nprevent the Court from fully considering matters critical to its determination.  \nII. STATEMENT OF  FACTS  \n1. The Rule 12 motion is specifically mentioned within the unaltered  and fully \nhyperlinked Joint Motion to Recuse originally filed and served on all parties of \nrecord via the Electronic Filing Manager as required by Tex. R. Civ. P. 21(a)(1)  on \nSeptember 20, 2024 , where  on page 14  it reads:  \n“Attorney Cooper Carter’s authority to represent the petitioner, currently \nbeing challenged through a Rule 12 motion, further deepens concerns about \nthe integrity and fairness of these proceedings .”",
      "char_length": 1547
    },
    {
      "page_number": 3,
      "text": "3 \n 2. There have not been any  pleadings filed on behalf of the Petitioner by her legal \ncounsel in this matter.  \n3. There exists no response to any pleadings filed by the Respondent in his own \ndefense in this matter, including a partial summary judgment filed on February \n28th, 2024, which was acknowledged by the court on March 14th, 2024.  \n \n4. There have been no pleadings served on the Respondent in this matter through the \nElectronic Filing Manager from Cooper L. Carter as required by Tex. R. Civ. P. \nRule 21(a)(1). \n \n5. Between April 14th, 2024, and September 30th, 2024, the Respondent sought relief \nvia a Petition for Writ of Mandamus in the Second Court of Appeals and the Texas Supreme Court.  \n \n6. The only effort to move the case forward during the appeal process was via a motion for pre -trial conference filed on April 24, 2024, on Cooper Carter’s behalf \nby Roderick Marx, her former employer and founder of Marx Altman and Johson.  \n \n7. The Texas OAG attempted to intervene into the case on June 28\nth, 2024, was \npromptly objected to, and has since vanished. \n \n8. It wasn’t until the denial of the Respondent’s Mandamus petition in the Supreme \nCourt of Texas on August 30th, 2024, that the court  began attempting to  set a status \nconference informally through the Court Coordinator.  \n \n9. Cooper Carter’s authority was challenged via a Rule 12 Motion on September 20, \n2024, and remains unresponded to.  \n \n10. The Respondent, representing himself pro -se, has not been labeled a vexatious \nlitigant. CHARLES DUSTIN MYERS respectfully moves the court  \n \nFor the reasons stated above, Respondent respectfully requests that the Court disallow \nany unsupported objections to the relevance of evidence by either party, unless the \nobjecting party provides a substantive argument or legal authority in support of thei r \nobjection. The Court should permit the admission of evidence concerning the undisputed",
      "char_length": 1939
    },
    {
      "page_number": 4,
      "text": "4 \n facts outlined herein during the hearing scheduled for November 7, 2024, at 11:00 A.M. \nin the 322nd District Court of Tarrant County.  \nPRAYER \nRespondent, CHARLES DUSTIN MYERS, prays for the following relief from the \nCourt in regard to this Motion in Limine:  \n1. That this Pre -Trial Motion in Limine be granted if no timely response in \nopposition is filed by 11:00 A.M. on November 7, 2024.  \n2. That the Court order all parties to refrain from making objections regarding the relevance of evidence without providing supporting legal arguments or citing \napplicable authority, ensuring that the hearing proceeds in a fair and equitable \nmanner.  \n3. Any other relief that the Court deems just and equitable under the \ncircumstances.  \nRespectfully submitted, \n \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS \nPRO SE \n817-507-6562 \nCHUCKDUSTIN12@GMAIL.COM  \n6641 ANNE COURT \nWATAUGA, TX 76148",
      "char_length": 903
    },
    {
      "page_number": 5,
      "text": "5 CERTIFICATE OF SERVICE \nRespondent  certifies  that a true copy of this pre-trial motion in limine was served \nin accordance with Rule 21a of the Texas Rules of Civil Procedure on the \nfollowing on 11/04/2024 : \nC\nooper L. Carter (Counsel for petitioner) \nby EFM/ESERVE  at COOPERCARTER@MAJADMIN@COM  \nM\norgan Michelle Myers (real party in interest)  \n by EFM/ESERVE at MORGANMW02@GMAIL.COM  \n   \nHolly L. Hayes, Texas Office of the Attorney General \n   By EFM/ESERVE at 914 -filer@texas.oag.gov  \n   \nThe Honorable Justice Lee Gabriel  \n   By EFM/ESERVE at LGabriel@tarrantcountytx.gov  \n/s/ Charles Dustin Myers  \nCharles Dustin Myers  \nChuckdustin12@gmail.com  \n6641 Anne Court  \nWatauga, TX 76148  \nTel: 1 -817-507-6562 \nPro-se",
      "char_length": 733
    },
    {
      "page_number": 6,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 93873858\nFiling Code Description: Motion (No Fee)\nFiling Description: Pre-Trial Motion in Limine\nStatus as of 11/4/2024 8:56 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n11/4/2024 8:51:09 AM\n11/4/2024 8:51:09 AMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n11/4/2024 8:51:09 AMStatus\nSENT\nAssociated Case Party: ATTORNEY GENERAL OF TEXAS\nName\nHOLLY HAYESBarNumber Email\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n11/4/2024 8:51:09 AMStatus\nSENT",
      "char_length": 1066
    }
  ]
}