{"id": "9863b813881052e12bff06ec490192366b0d8716", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "322-744263-23\nMOTION TO DISQUALIFY COUNSEL\n05.05.25M.3119 M.3119\nM.3119 M.3119 M.3119 M.3119\n\nNO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HONORABLE COURT:  \nRespondent, CHARLES DUSTIN MYERS, hereby moves to disqualify COOPER L.  \nCARTER, opposing counsel for Petitioner, MORGAN MICHELLE MYERS, from this matter, \nand in support thereof, shows the court the following: \nI. INTRODUCTION\n1. Cooper L. Carter was allegedly retained on January 22, 2024, in the lobby of the\ncourtroom minutes before a scheduled reset hearing regarding a protective order originally  filed \non December 22, 2023. This hearing was due to begin in front of Associate Judge Jeff Kaitcer . IN THE INTEREST OF M.E.M., C.R.M., two \nchildren) MORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , MOTION TO DISQUALIFY COUNSEL  \nRespondent.  \n2025 -05-05 \n1322-744263-23 FILED\nTARRANT COUNTY\n5/5/2025 2:55 PM\nTHOMAS A. WILDER\nDISTRICT CLERKM.3120 M.3120\nM.3120 M.3120 M.3120 M.3120\n\nand her initial retainment led to the rescheduli ng of the matter for February 1, 2024. Her \nsignature first appears on the document entitled “322ND FAMILY DISTRICT COURT \nASSOCIATE JUDGE'S REPORT”. This initial pleading signed by Ms. Carter indicates that \nshe was retained in her individual capacity, further reiterated in the FIRST AMENDED \nPETITION FOR DIVORCE, filed on January 30, 2024.  Specifically, she states: “It was necessary \nfor Petitioner  to secure th e services of Cooper L. Carter, a licensed attorney, to prepare and \nprosecute this suit.” (page 9) \n2. Directly below this statement appears the letterhead MARX, ALTMAN & JOHNSON,  \na law firm operated by RODERICK D. MARX, the founder. To date, Mr. Marx’s signature does \nnot appear on any pleadings filed in this matter. Notably, every pleading filed for the petitioner \nhas been “On Behalf of Cooper Carter by Roderick Marx.” (page 11, Exhibit 4) In total, after \nfourteen months of litigation, Ms. Carter has had the Amended Petiti"}
{"id": "6729c08f7dc6b91a5771bb479f3cbfa27b9e8a9e", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "ry pleading filed for the petitioner \nhas been “On Behalf of Cooper Carter by Roderick Marx.” (page 11, Exhibit 4) In total, after \nfourteen months of litigation, Ms. Carter has had the Amended Petition for Divorce, a Motion for \nPre-T rial Conference5, and a Motion to Consolidate filed on her behalf by Mr. Marx.6 \nII. AMBIGUITY\n3. When turning to Ms. Carter’s public social media, the ambiguity becomes apparent. On  \nher Facebook page, she claims to be a “Former Attorney at Marx, Altman & Johnson”.1 On her \nLinkedIn profile, this is reiterated, where she claims to have worked for Mar x, Altman & \nJohnson from December of 2020 until July of 2022, and claims to currently be employed with \nCantey Hangar LLP as well as with ‘Associate Attorney’2. Finally, when viewing her Texas State \nBar profile, she claims to be employed with Mar x Altma n & Johnson, with the last update being \n1 https://www.facebook.com/cooper.carter.94/  \n2 https://www.linkedin.com/in/cooper-c arter-5 01888150/  \n2M.3121 M.3121\nM.3121 M.3121 M.3121 M.3121\n\non November 5th, 2023. It’s important to note that “Marx Altman & Johnson” is not the same as \n“Marx, Altman & Johnson”, the comma being the differentiator. These points were discussed in \nthe Rule 12 Motion to Show Authority filed and served to Ms. Carter on September 20, 2024, which remains unresolved. It’s further concerning that Ms. Carter is unable to file documents herself using the Electronic Filing Manager as required by Rule 21a of the Texas Rules of Civil Procedure, as it is registered under her prior employer’s email address under Cantey Hanger. \nIII. GROUNDS FOR DISQUALIFICATION \n4. A trial court has broad discretion to determine the consequences of professional \nmisconduct. State Bar of Texas v. Kilpatrick , 874 S.W.2d 656, 659 (Tex.1994). There is a strong \npresumption in favor of a party’s right to counsel of choice, but this presumption can be overridden by considerations relating to the integrity of the judicial process and the fa"}
{"id": "caa214d3b74bd3b6ed22c00170cc403bede69c78", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": ". There is a strong \npresumption in favor of a party’s right to counsel of choice, but this presumption can be overridden by considerations relating to the integrity of the judicial process and the fair administration of just ice Gonzalez v. State , 117 S.W.3d 831 (Tex. Crim. App. 2003). If an \nattorney’s dishonesty threatens the fairness of the proceedings or the public’s confidence in the \nlegal system, disqualification may be justified to preserve the integrity of the process.  \n 5. However, disqualification is not automatic upon a finding of dishonesty. The court \nmust find that the conduct has materially affected the proceedings or the rights of the parties. In other words, disqualification is considered a severe remedy and is reserved for cases where lesser sanctions would be inadequate to address the harm or protect the integrity of the proceedings. Courts are also mindful of the potential for disqualification motions to be used as tactical weapons and require a high standard of proof before granting such relief. See Spears v. Fourth Court of Appeals , 797 S.W.2d 654 (Tex. 1990). The courts also consider the severity and \ncircumstances of the misconduct, the harm caused to clients or the profession, and the need to deter future misconduct. See Kilpatrick . In family law matters, where the stakes are often \n3M.3122 M.3122\nM.3122 M.3122 M.3122 M.3122\n\npersonal and the proceedings can be contentious, the court’s primary concern is to ensure \nfairness and the proper administration of justice.   \n6. On May 9th, 2024, Ms. Carter reached out via email correspondence and requested that \nthe Respondent fill out and sign an Income Withholding Order.  After inspection, the Respondent determined that it was defective and requested that the document be corrected. No further correspondence came from Ms. Carter regarding the IWO.  \n7. The attached signature blocks raise serious doubts about their authenticity. In one \nversion, the cursive signature “Holly L. Hayes” appears "}
{"id": "d29577d8d2e6f00c430d8dffd1f61522c7f58ed9", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "orrespondence came from Ms. Carter regarding the IWO.  \n7. The attached signature blocks raise serious doubts about their authenticity. In one \nversion, the cursive signature “Holly L. Hayes” appears above a typed line, followed by a long list of attorneys (with State Bar numbers) ending in “ATTORNEY OF RECORD.” In  the other \nversion, the same cursive “Holly L. Hayes” signature appears above the line, but the typed block below shows only “CHOYA BURKLEY” labeled as “ATTORNEY OF RECORD.” These two versions cannot both be true. A single pleading cannot logically have two different attorneys designated as “Attorney of Record,” nor can one attorney’s handwritten signature be grafted onto \na block naming another attorney. The inconsistencies strongly indicate that the signature block \nwas manually altered or copied between  documents, constituting a likely forgery.  \n8. Furthermore, upon inspection of the Certificate of Service, the font sizes are different, \nand it further points to the real possibility that this document was indeed forged. The timing of the document’s service and the appearance of the signatures themselv es also raise concern. In \nshort, these discrepancies, while by themselves may not seem significant – when added into the mix of issues within this case – it answers more questions than it creates.\n \n   \n4M.3123 M.3123\nM.3123 M.3123 M.3123 M.3123\n\nANALYSIS  \nFIGURE 1  \nFIGURE 2  \n9. The screenshots above are true and accurate depictions of the OAG Intervention  \npleading filed in this case on June 28, 2025.3 \n3 See Exhibit.1  \n5M.3124 M.3124\nM.3124 M.3124 M.3124 M.3124\n\nWhen examining FIGURE 1 and FIGURE 2 above, key irregularities include:  \ni. Multiple Names vs. Single Signatory\n10.In the first image, eight attorney names (with SBNs) are listed under one signature\nline, whereas the second image shows only one name under the same signature. This suggests \nthat an attorney’s signature was replicated on two different sets of printed names. Under Texas l"}
{"id": "8a35d24f280483d537c01b002114a4406dd4704a", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": " signature\nline, whereas the second image shows only one name under the same signature. This suggests \nthat an attorney’s signature was replicated on two different sets of printed names. Under Texas law, every pleading “shall be signed by at least one attorney of record in his individual name”. See Tex. R. Civ. P. 57. It is improper to list multiple attorneys under a single signature or to designate more than one attorney as the att orney of record.  \nii. Duplicate and Conflicting Names\n11. The name Holly L. Hayes  appears twice in the first block (once in script as the\nsignature and again in print as one of the listed attorneys). In the second block, Holly L. \nHayes appears only as the script signature, while CHOYA BURKLEY is the sole printed name \nwith the title “Attorney of Record.” Thus , one version implies Hayes is attorney of record and \nthe other implies Burkley is. This direct contradiction – the same signature line paired with two \ndifferent names – could only happen if the signature was misappropriated. No valid pleading would have one attorney sign their name while identifying another attorney as counsel. \niii. Inconsistent Formatting and Fonts\n12. The mixture of cursive and all-caps text, the placement of underlines, and the\nalignment of titles differ markedly between the two blocks. For example, one shows an ornate underline beneath “Holly L. Hayes” and then a column of names, while the other has a plain signature line and only “CHOYA BURKLEY” below it. These typographical inconsistencies are not found in standard OAG filings. Legitimate Texas OAG child- support pleadings use a single, \nuniform signature block: one typed attorney name (with SBN and contact info) and the title \n6M.3125 M.3125\nM.3125 M.3125 M.3125 M.3125\n\n“Attorney o f Record,” all aligned consistentl y. None of  the OAG’s official pleadings include a \nhandwritte n signature of one lawyer placed over the typed name of another. \n13. Taken together , the two images show a signature block t"}
{"id": "5cf5d3edee9afbcbe24a84f3810a674ea0b91746", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "onsistentl y. None of  the OAG’s official pleadings include a \nhandwritte n signature of one lawyer placed over the typed name of another. \n13. Taken together , the two images show a signature block that appears to have been \ncopied or tampered with . The same handwriting is used in both, but the printed names and \n“Attorney of Record” designation do not match. This strongly suggests that an attorney’ s actual \nsignature (Holly Hayes’s) was duplicated ont o a document that falsely names Choya Burkley as \nthe attorne y of record, or vice versa. Such conduct amounts to forgery or impersonation, \nmisleading the court about who is actually representing the state. \nIV. LEGAL STANDARD  \ni. Single Attorney Signature Required (Tex. R. Civ. P. 57)\n14.Texas Rule of Civil Procedure 57 mandates that  “Every pleading of a party\nrepresented by an attorney shall be signed by at least one attorney of record in his individual \nname, with his State Bar of Texas identification number…”  By its plain terms, an attorney must \npersonally sign pleadings. Listing multiple attorneys under one signature line, or having two different attorneys labeled as counsel on the same document, violates this rule. In a proper signature block, the printed na me next to the SBN must match the person who signed. \nii. One Designated Attorney (Tex. Gov’t Code §402.029(b))\n15. In child- support cases, the Attorney General must notify the parties of the specific\n“assistant attorney general who is the attorney of record in the case”. This statute assumes only one attorney-of- record at a time. The conflicting blocks here – one identifying Hayes and the \nother identifying Burkley as attorney-of-record – directly contravene this requirement. They \nfalsely present two different individuals as the State’s attorney of record in the same case, which is impossible under §402.029. \n7M.3126 M.3126\nM.3126 M.3126 M.3126 M.3126\n\niii. Standard OAG Practice\n16.The OAG’s usual practice is to have a single attorney’s name and "}
{"id": "c023d0cd3a547ff1935e6ee064546c7910142efe", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "ecord in the same case, which is impossible under §402.029. \n7M.3126 M.3126\nM.3126 M.3126 M.3126 M.3126\n\niii. Standard OAG Practice\n16.The OAG’s usual practice is to have a single attorney’s name and signature per\npleading, with all contact information in one consistent block. Attorneys do not co-sign a single \ndocument by listing a group of names; rather , if multiple lawyers work on a case they each f ile \nseparate notices or  appearanc e forms. The aberrant f ormat shown i n the images has never be en \nused in valid OAG submissions. \n17. Becaus e Texas law a nd OAG p rocedur e require a single attorney of  record t o sign \npleadings in his or her own name, the above anomalies strongly suggest fraud. If Ms . Hayes did \nnot actuall y sign on behalf of M s. Burkley (or vice versa), then the signature block i s a \nfabrication: a signature was copied and paire d with a false printed name . This unde rmines the \nintegrity o f the pleading  and violates the  attorney -signature rules. See Te x. R. Ci v. P. 57. See also \nTex. Gov’t. Code 402.029. \nV. STANDARD FOR DISQUALIFICATION  \n18. Texas courts regard a motion to disqualify counsel as an “extraordinary remedy” that \nshould be granted onl y for “compelling reasons.” Disqualificati on impinges on a litigant’s right \nto chosen counsel, so courts apply an “exacti ng standard” before ordering. As our Supreme Court \nexplained in In re Sande rs, 153 S. W.3d 54, 57 ( Tex. 2004), quoting Spears v. Fourt h Court , 797 \nS.W.2d 654, 656 ( Tex. 1990), “[m]ere allegations of unethical conduct or evidence showing a \nremote pos sibility of  a violation  of the di sciplinary rul es will not suffice” to di squalify a n \nattorne y. \n19. Nonetheless, where true misconduct has occurred – e specially misconduct directly  \naffecting the integrity of the proceeding – courts will act. As one court put it, “[t]o protect the \nintegrity of the judicial system, a trial court must disqualify counsel whe n continuing \n8M.3127 M.3127\nM.3127 M.3127 "}
{"id": "736b3dd4c5042f5037dd417bfcbb1fd3f2c3f931", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "ity of the proceeding – courts will act. As one court put it, “[t]o protect the \nintegrity of the judicial system, a trial court must disqualify counsel whe n continuing \n8M.3127 M.3127\nM.3127 M.3127 M.3127 M.3127\n\nrepresentation will taint the trial.” In re Sanders, 153 S.W.3d 54, 57 (Tex. 2004). The moving \nparty bears the heavy burden of proving disqualification is warranted . Id. Respondent readily \nmeets that burden here, given Carter’s admitted violations of the Rules. \n20. In disqualification motions, Texas courts consider all relevant rules: the Texas Rules \nof Civil Procedure, statutory provisions, and the Texas Disciplinary Rules of Professional Conduct. Under Tex. R. Civ. P. 13, an attorney’s  signature certifies that the pleading is not \ngroundless or filed for any improper purpose. Rule 13 further provides that making “statements in pleading which [the signer] know[s] to be ... false, for the purpose of securing a delay” is contemptible. Similarly, Rule 57 requires eac h attorney- of-record to sign pleadings with their \nown name and bar number. Violation of these procedural rules subjects the offending attorney to sanction. Tex. R. Civ. P. 215 authorizes a court to punish contempt or sanction parties for misconduct. Additi onally, courts have inherent authority to enforce ethical standards: the Texas \nSupreme Court has instructed that trial judges have a duty “to regulate the legal profession when \nappropriate via the Texas Disciplinary Rules of Professional Conduct,” which ar e a “preeminent \nsource for attorney disqualification” even though the Rules themselves are not. \niv. Carter’s actions warranting disqualification \n21. Under the Disciplinary Rules, Carter’s actions are manifestly prohibited. Rule 3.03(a) \n(“Candor Toward the Tribunal”) forbids a lawyer from knowingly making false statements of \nmaterial fact to a court or offering evidence the lawyer knows to be false.” Tex. Disciplinary R. Prof. Conduct 3.03(a).  It also requires a lawyer to cor"}
{"id": "24dd2b257846e75d9c3e37f6e988901088efc298", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "er from knowingly making false statements of \nmaterial fact to a court or offering evidence the lawyer knows to be false.” Tex. Disciplinary R. Prof. Conduct 3.03(a).  It also requires a lawyer to correct any previous material misstatement to the court. Rule 8.04(a)(3) classifies engaging in “dishonesty, fraud, deceit or misrepresentation” as professional misconduct . See  Tex. Di sciplinary R. Prof. Conduct 8.04(a)(3).  Rule 1.03 \n(Diligence) obligates a lawyer to pursue matters zealously and not neglect a client’s case. Here, \n9M.3128 M.3128\nM.3128 M.3128 M.3128 M.3128\n\nCarter’ s deliberate lies (March 14 or ders), failure t o correct them, and long-term ne glect cl early \nviolate the se dut ies. \n22. Becaus e Carter’ s misconduct di rectly taints the proceedings, the Court ne ed not  wait \nfor a di sciplinary c omplaint. Ins tead,  it may di squalify c ounsel in th e interest of  justice. Texas \ncourts hav e done so w hen co unsel’ s actions “prejudice[d] the  fairness of  the proceedings” or \n“violate[d] professiona l standards”. While w e respec t the hi gh standard for disqualification,  \nCarter’ s admitted m isdeeds are not  “mere allegations” – they are proven by the record itself – \nand they strike at the he art of a fair trial.  \n23. Carter ’s conduct on March 14, 2024, is particularly egregious and independently \njustifies di squalification.  Carter secretly dr afted a nd fil ed te mporary or ders falsely c haracterizing  \nthem as “Agreed” by Respondent, even though Respondent was present and obj ecting  at a \nhearing purposed to challenge them. This is a knowing misrepresentation of material fact to the \ncourt , in direct violation of Tex. Disc. R. Prof. Conduct 3.03( a)(1) and 8.04(a)(3). It also \nbreaches her Rule 13 certification: by signing and presenting those orders, Carter certified the y \nwere not filed for an improper purpose or in bad faith, whic h they clearl y were. Rule 13 \nexplicitly punishes filing pleadings “which [the signer] know [s] to"}
{"id": "06dcbb4da72dc31d6875d09dfd7d87d4cb66711d", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "g those orders, Carter certified the y \nwere not filed for an improper purpose or in bad faith, whic h they clearl y were. Rule 13 \nexplicitly punishes filing pleadings “which [the signer] know [s] to be groundless and false” with \ncontempt. This rule was violated here. \nVI. CONCLUSION  \nIn totalit y, Ms. Carter’s conduct mirrors not that of a zealous advocate, but rather that of \nan attorne y who has know ingly misled the tribunal, neglected her duties, and corrupted the \nprocedural integrity of these proceedings. Her submission of fabricate d “agreed” orders on  \nMarch 14, 2024 — a t a hearing  specifically sche duled t o challenge  thos e very order s — is not \nonly unethical, it is a knowing misrepresentati on of material fact, in direct violation of Rule \n10M.3129 M.3129\nM.3129 M.3129 M.3129 M.3129\n\n3.03(a)(1)  and Rule 8.04(a)(3)  of the Texas Disciplinary Rules of Professional Conduct . See \nIn re Meador , 968 S.W.2d 346, 351 (Tex. 1998) (noting that \"lawyers must be held to the highest \nstandards of honesty and candor when dealing with the courts\").  \nAdditionally, Ms. Carter’s failure to appear at the March 14 hearing, failure to respond to \nchallenges, her repeated use of defective or unauthorized signature blocks, and failure to comply \nwith Rule 57 of the Texas Rules of Civil Procedure, collectively e vidence a pattern of \nmisconduct that is not merely negligent — it is willful, strategic, and fundamentally \nprejudicial . Courts have long held that when counsel's conduct \"taints the trial,\" disqualification \nis not only permitted — it is required. In re Sanders, 153 S.W.3d 54, 57 (Tex. 2004); Spears v. Fourth Ct. of Appeals , 797 S.W.2d 654, 656 (Tex. 1990). \nUnder Rule 13  of the Texas Rules of Civil Procedure , an attorney's signature certifies \nthat pleadings are grounded in fact and law and are not brought for any improper purpose. Filing knowingly false temporary orders without a Motion to Sign, and misrepresenting an agreement \nnever made, constitu"}
{"id": "82e410452dd917914c4ec06c1524d835a90ba0f3", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "ings are grounded in fact and law and are not brought for any improper purpose. Filing knowingly false temporary orders without a Motion to Sign, and misrepresenting an agreement \nnever made, constitutes sanctio nable conduct. See  Nath v. Tex. Children's Hosp., 446 S.W.3d \n355, 361 (Tex. 2014) (reiterating that sanctions are appropriate where pleadings are made in bad \nfaith and lack evidentiary support). \nFurthermore, the potential forgery or misappropriation of the OAG attorney’s signature \nconstitutes a separate and grave violation of Rule 57 and Texas Gov’t Code § 402.029. Courts have the inherent authority to sanction and disqualify attorneys for forging or misusing names to file official pleadings. State Bar of Tex. v. Kilpatrick , 874 S.W.2d 656, 659 (Tex. 1994); In re \nC.F ., Jr., 141 S.W.3d 907, 913 (Tex. App.—San Antonio 2004, no pet.) (affirming sanctionswhere a party filed enforcement pleadings based  on fictitious orders and failed to appear for \nhearing).  \n11M.3130 M.3130\nM.3130 M.3130 M.3130 M.3130\n\nFinally, even if Ms. Carter’s conduct did not amount to outright fraud, disqualification \nwould still be proper  given her ongoing dereliction of duty — a year of non-prosecution, \nprocedural noncompliance, and abandonment of her responsibility to inform the Court of her role \nand authority. The continued presence of such an attorney in this proceeding actively prejud ices \nRespondent, impairs the integrity of the record, and casts a shadow over every action taken in the case. See  In re S.G.B., No. 05-23-00684- CV, 2025 WL 1632427, at *5 (Tex. App.—Dallas Mar. \n13, 2025) (mem. op.) (“Bad faith conduct that disrupts core judicial functions warrants sanction and potential disqualification”). \nVII. PRA YER  \nRespondent respectfull y requests that this court: \n1.Immediately set this matter for a hearing following the current recusalproceedings at the earliest opportunity and ORDER Holly Hayes to appear tosubstantiate the intervention pleading ;\n2.Require th"}
{"id": "9214d4eeadfeafe455fe4df24ed52011323563a8", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "1.Immediately set this matter for a hearing following the current recusalproceedings at the earliest opportunity and ORDER Holly Hayes to appear tosubstantiate the intervention pleading ;\n2.Require that COOPER L. CARTER prove  her authority to represent\nPetitioner, MORGAN MICHELLE MYERS, in this matter.\n3. If the court finds the Intervention Pleading to be fraudulent, disqualify\nCOOPER L. CARTER from the case  without reaching the other points raised\nin this brief for fraud upon the court;\n4. If the court finds that COOPER L. CARTER cannot show her authority and no\none else appears to represent MORGAN MICHELLE MYERS, strike herpleadings from the record, including the March 14, 2024, temporary orders;\n5.Issue any further relief the court deems equitable given the circumstances.\n12M.3131 M.3131\nM.3131 M.3131 M.3131 M.3131\n\nRespectfully submitted,  \n /s/ Charles Dustin Myers  \n CHARLES DUSTIN MYERS  \n 817-546-3693 \n CHUCKDUSTIN12@GMAIL.COM  \n PRO- SE RESPONDENT \n \nCERTIFICATE OF SERVICE  \n \n I certify that a true and accurate copy of this MOTION TO DISQUALIFY was served on \nall parties of record pursuant to Rule 21a of the Texas Rules of Civil Procedure on 05/05/2025 \nthrough the following:  \n MORGAN MICHELLE MYERS @ MORGANMW02@GMAIL.COM  \nthrough the electronic filing manager.  \nCOOPER CARTER @ COOPERCARTER@MAJADMIN.COM  \nThrough email. \n/s/Charles Dustin Myers  \nCHARLES DUSTIN \nMYERS  \n \nCERTIFICATE OF CONFERENCE  \n Ms. Carter has not responded to any correspondence regarding any motion filed in this \nmatter . No input regarding this information was received from Ms. Carter regarding this motion. \n/s/ Charles Dustin Myers  \nCHARLES DUSTIN MYERS  \n \n13M.3132 M.3132\nM.3132 M.3132 M.3132 M.3132\n\nEXHIBIT 1\n14M.3133 M.3133\nM.3133 M.3133 M.3133 M.3133\n\nMYERS_0014563904_INTE_TARRANT:\nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA\nNCP Name: CHARLES D MYERS\nCP Name: MORGAN MYERS\nOAG Number: 0014563904\nLAC: INTE\nCAUSE NUMBER 322-744263-23\nIN THE INTEREST OF §IN THE 322ND DISTRI"}
{"id": "c92977042570f469ca4c8f9272fe60bbb7805267", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "RRANT:\nNOTICE: THIS DOCUMENT CONTAINS SENSITIVE DATA\nNCP Name: CHARLES D MYERS\nCP Name: MORGAN MYERS\nOAG Number: 0014563904\nLAC: INTE\nCAUSE NUMBER 322-744263-23\nIN THE INTEREST OF §IN THE 322ND DISTRICT COURT\nMARA MYERS §\nCAROLINE MYERS §OF\nCHILDREN § TARRANT  COUNTY, TEXAS\nINTERVENTION\n1. The OFFICE OF THE ATTORNEY GENERAL, representing the State of Texas, files this pleading pursuant to\nTexas Family Code Chapter 231 for which discovery is intended to be conducted under Level 2 of Rule 190, Texas Rules\nof Civil Procedure.  The OFFICE OF THE ATTORNEY GENERAL is assigned the support and enforcement rights in\nthis case.\nTHE ATTORNEY GENERAL'S RIGHT TO INTERVENE\n2. The OFFICE OF THE ATTORNEY GENERAL, pursuant to Texas Family Code §§ 102.007 and 102.009 (d), is\na necessary party because this is an action to establish, modify, or enforce a support right assigned to the OFFICE OF\nTHE ATTORNEY GENERAL pursuant to Texas Family Code Chapter 231.\nJURISDICTION\n3. This Court has continuing jurisdiction of the children the subject of this suit because of prior proceedings.\nCHILDREN\n4. The following children  are the subject of this suit:\nName Sex DOB\nMARA MYERS\nCAROLINE MYERSF\nF6/20/2016\n4/12/2018\nNo property, other than personal effects, is owned by any child the subject of this suit.\nPERSONS ENTITLED TO NOTICE\n5. The children reside with MORGAN MYERS , the mother  of the children.  The OFFICE OF THE ATTORNEY\nGENERAL will serve MORGAN MYERS  with this pleading, by and through her attorney of record, pursuant to Rule 21a,\nTexas Rules of Civil Procedure.\n6. CHARLES D MYERS , is the father  of the children.   The OFFICE OF THE ATTORNEY GENERAL will serve\nCHARLES D MYERS  with this pleading pursuant to Rule 21a, Texas Rules of Civil Procedure.322-744263-23 FILED\nTARRANT COUNTY\n6/28/2024 12:35 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\nCopy from re:SearchTX\n15M.3134 M.3134\nM.3134 M.3134 M.3134 M.3134\n\nDETERMINATION OF DISCLOSURE OF ADDRESS\n7. The Court should enter appropriate orders concer"}
{"id": "99a9626a3582690d748def27d3ec51650b132e37", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "4 12:35 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\nCopy from re:SearchTX\n15M.3134 M.3134\nM.3134 M.3134 M.3134 M.3134\n\nDETERMINATION OF DISCLOSURE OF ADDRESS\n7. The Court should enter appropriate orders concerning the disclosure of the addresses of the parties.\nPRIOR CHILD SUPPORT ORDER\n8. On 3/14/2024  the Court ordered CHARLES D MYERS  to pay current child support of $ 973.19  monthly , beginning\n4/1/2024 , and monthly  thereafter.  The amount and frequency of CHARLES D MYERS 's child support obligation remains\nunchanged.\nCHILD SUPPORT ARREARAGE\n9. CHARLES D MYERS  failed to pay court ordered child support as follows:\n a.  Child support accrued since 4/1/2024 $2,919.57\n b.  Interest accrued since 4/1/2024 $0.00\n c.  Child support paid since 4/1/2024 $0.00\n d.  Total child support arrearage as of 6/18/2024 $2,919.57\nEXHIBIT A , which is attached and incorporated by reference, is a true and correct copy of a payment record\nindicating the occasions Obligor violated the above-referenced order.\nJUDGMENT ON ARREARS\n10. The Court should confirm and enter judgment for all support arrearage and accrued interest as of the court\nproceeding date.  The Court should order payment and income withholding to liquidate the judgment pursuant to Texas\nFamily Code Chapters 157 and 158.\nSUPPORT\n11. The OFFICE OF THE ATTORNEY GENERAL, representing only the interests of the State of Texas, requests\nthe Court make appropriate orders for current child support, medical support, and dental support for the children,\nincluding temporary support pursuant to Texas Family Code § 105.001.  In determining the amount of support the Court\nshould consider the duty of parents to support their minor children, and all applicable provisions of the Texas Family\nCode.\nWITHHOLDING FROM EARNINGS FOR SUPPORT\n12. The Court should order all support withheld from disposable earnings pursuant to Texas Family Code § 158.006. \nThe Court should order all payments of support processed pursuant to Texas Family Code Chapter 231 "}
{"id": "205c54a631d989a7874988b10c16d61814a56a49", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": "should order all support withheld from disposable earnings pursuant to Texas Family Code § 158.006. \nThe Court should order all payments of support processed pursuant to Texas Family Code Chapter 231 for distribution\naccording to law.  If appropriate, the Court should order CHARLES D MYERS  to post a bond or security.\nREQUEST FOR PRODUCTION OF DOCUMENTS\n13. CHARLES D MYERS  has in his possession documents that will show the nature and extent of his ability to pay\nchild support.  The OFFICE OF THE ATTORNEY GENERAL, pursuant to Rule 196, Texas Rules of Civil Procedure,\nrequests him to produce and permit the OFFICE OF THE ATTORNEY GENERAL to inspect and copy the originals, or\ntrue copies, of the following documents in his possession, custody or control:  (a) his IRS federal tax returns for the past\ntwo years with all schedules included with the returns and all W-2s and 1099s attached to such returns, (b) any and all W-\n2 statements, all 1099s, and all documents showing income received by Respondent from any source for the two tax years\npreceding the date of filing of this action, (c) all payroll stubs, vouchers, records of commissions and all other written\nCopy from re:SearchTX\n16M.3135 M.3135\nM.3135 M.3135 M.3135 M.3135\n\nrecords or evidence of income received by him within the last six months, (d) the most recent Social Security\nAdministration Form SSA-7005, showing his income history, sent to him three  months before his last birthday,(e)\nstatements of accounts for all checking or saving accounts in which he has held an interest within the last six months, (f)\nall evidence (policies, premium schedules, records of premiums paid, etc.) of health and/or dental insurance available at\nhis place of employment that may provide coverage for dependent children, (g) copies of loan applications made within\nthe last six months, (h) current statement of benefits and account balances for all retirement, pension, or profit-sharing\nplans in which the respondent has accrued or may ac"}
{"id": "bdc1785a5fd24a8a5e388ae4656e07c90228c59f", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": " applications made within\nthe last six months, (h) current statement of benefits and account balances for all retirement, pension, or profit-sharing\nplans in which the respondent has accrued or may accrue benefits, regardless if such benefits have vested, including but\nnot limited to employer- or union-sponsored defined benefit or defined contribution plans and individual retirement\naccounts (IRAs), and (i) summary plan description of all retirement, pension, or profit-sharing plans in which the\nrespondent has accrued or may accrue benefits, regardless if such benefits have vested.  The OFFICE OF THE\nATTORNEY GENERAL requests production of the specified documents at:\nThe Office of the Attorney General\nCHILD SUPPORT OFFICE\n2001 BEACH ST STE 700\nFT WORTH, TX 76103-2300\non or before 3:00 p.m. on the 30th day following the date of service of this request.\nPRAYER\nThe OFFICE OF THE ATTORNEY GENERAL prays that the Court grant all relief requested herein.  The\nOFFICE OF THE ATTORNEY GENERAL prays for general relief.\nRespectfully submitted,\nKen Paxton\nAttorney General of Texas\nBrent Webster\nFirst Assistant Attorney General\n                                                     \nTAMEKA D BOYD - SBN: 24027406\nCHOYA BURKLEY - SBN: 24012361\nKARLA BYRD - SBN: 24097445\nSTEPHEN E HAMMEL - SBN: 24043710\nMADISON LEDOUX - SBN: 24131449\nPAULA CROCKETT - SBN: 00798123\nJOHN CASHMAN - SBN: 24038807\nHOLLY L HAYES - SBN : 24110698\nATTORNEY OF RECORD\nCHILD SUPPORT ENFORCEMENT\nCHILD SUPPORT OFFICE\n2001 BEACH ST STE 700\nFT WORTH  TX 76103-2300\nEmail CSD-legal-914@oag.texas.gov\nTelephone No. (817)926-7197\nToll Free 1(800)252-8014\nFax No. (817)926-0522\nCopy from re:SearchTX\n17M.3136 M.3136\nM.3136 M.3136 M.3136 M.3136\n\nCERTIFICATE OF SERVICE\nI certify that a true and correct copy of the foregoing has been served on the below listed parties or their representatives pursuant to Rule\n21a, Texas Rules of Civil Procedure, on the ______ day of __________________, 20_____.\n________________________________"}
{"id": "6f7afd4c02ab1fa2c9b952933470390fc7977777", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "een served on the below listed parties or their representatives pursuant to Rule\n21a, Texas Rules of Civil Procedure, on the ______ day of __________________, 20_____.\n___________________________________\nCHOYA BURKLEY\nATTORNEY OF RECORD\nParty: Attorney for Party:\nMORGAN MYERS COOPER L CARTER\n2905 LACKLAND RD. \nFORT WORTH, TX 76116\nCOOPERCARTER@MAJADMIN.COM\nCHARLES D MYERS\n28th\nJune\n24\nCopy from re:SearchTX\n18M.3137 M.3137\nM.3137 M.3137 M.3137 M.3137\n\nFEDERAL OFFSET (FO) receipts are subject to future adjustments by the Federal Government.CV - FQ1059R2 Attorney General of Texas - Child Support Division Page 1\nFinancial Activity Report as of 06/19/2024 Date: 06/19/2024\nCase ID: 0014563904 Cause Number: 322-744263-23\nNCP: MYERS, CHARLES D CP: MYERS, MORGAN\nChild Support\nTrans\nDateActivity\nTypeTransaction\nAmountAmount\nDueAmount\nApplied Balance\n04/01/2024 Amount Due 973.19 973.19 973.19\n05/01/2024 Amount Due 973.19 973.19 1,946.38\n06/01/2024 Amount Due 973.19 973.19 2,919.57\nSummary\nTotals: 2,919.57 0.00 2,919.57\nCopy from re:SearchTX\n19M.3138 M.3138\nM.3138 M.3138 M.3138 M.3138\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nOfficer Filer 914 on behalf of Holly Hayes\nBar No. 24110698\ncsd-filer-914@texasattorneygeneral.gov\nEnvelope ID: 89311887\nFiling Code Description: (Title IV-D OAG Use Only)Intervention\nFiling Description: INTE\nStatus as of 6/28/2024 2:16 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nCooper L.CarterBarNumber Email\ncoopercarter@majadmin.comTimestampSubmitted\n6/28/2024 12:35:54 PMStatus\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n6/28/2024 12"}
{"id": "f611ea53971b039634b7ece89693c2804286fe83", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\05_05_25_motion_to_disqualify_carter_1\\05_05_25_motion_to_disqualify_carter_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\05.05.25 - Motion to Disqualify (CARTER)-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 1110, "text": "arter@majadmin.comTimestampSubmitted\n6/28/2024 12:35:54 PMStatus\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n6/28/2024 12:35:54 PMStatus\nSENT\nCopy from re:SearchTX\n20M.3139 M.3139\nM.3139 M.3139 M.3139 M.3139\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 100449540\nFiling Code Description: Motion (No Fee)\nFiling Description: Motion to Disqualify\nStatus as of 5/5/2025 3:01 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYESBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-legal-914@texasattorneygeneral.govTimestampSubmitted\n5/5/2025 2:55:49 PM\n5/5/2025 2:55:49 PM\n5/5/2025 2:55:49 PMStatus\nSENT\nSENT\nSENTM.3140 M.3140\nM.3140 M.3140 M.3140 M.3140"}