{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\07.05.24 - SECOND AMENDED COUNTERPETITION FOR DIVORCE (2)-1.pdf",
  "base_name": "07_05_24_second_amended_counterpetition_for_divorce_2_1",
  "page_count": 12,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263 -23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE JAMES MUNFORD OF THE 322ND DISTRICT \nCOURT OF TARRANT COUNTY, TEXAS:  \nDiscovery Control Plan \n1. Pursuant to Rule 190 of the Texas Rules of Civil Procedure, discovery is intended to  \nbe conducted in this suit under Level 2.  \nObjection to Associate Judge  \n2. CHARLES DUSTIN MYERS, Counter -petitioner, objects to an associate judge  \nhearing a trial on the merits or presiding at a jury trial due to conflict of interest with the \nopposing counsel  in this case . \nNature of the Suit  \n3. This suit is brought by CHARLES DUSTIN MYERS, Counter -petitioner, against  \nMORGAN MICHELLE MYERS, Counter -respondent, seeking dissolution of their marriage and  \nresolution of issues affecting the parent -child relationship. This suit is also brought against the \nfollowing responsible third parties:  Morgan Michelle Myers,   \n  \nPetitioner,   \n  \n                 v. \n SECOND AMENDED \nCOUNTERPETITION FOR DIVORCE  \n \nCharles Dustin Myers,   \nRespondent   \n  \n2024 -07-05  322-744263-23FILED\nTARRANT COUNTY\n7/5/2024 10:12 AM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 1150
    },
    {
      "page_number": 2,
      "text": "i. Daniel Kenneth Branthoover –  For impersonation of an attorney, fraud, \nconversion, intentional infliction of emotional distress, and civil \nconspiracy, as well as monetary damages.  \nii. Margie Evonne Wilson –  For civil conspiracy.  \n \nFraud \n4. The Counter -petitioner asserts a claim for fraud against the Counter -respondent and \nDaniel Kenneth Branthoover. The fraudulent actions include the filing of false court documents \nalleging family violence  which lead to the disruption of the Counter -petitioner’s relationship \nwith his Children . These actions were intended to deceive the court and provide the Counter -\nrespondent with an advantage  property division . The Counter -respondent also filed suit under \naffidavit of inability to pay  despite just transferring money to herself.   \n5. The Counter -petitioner asserts a claim for civil conspiracy against Margie Evonne \nWilson , who filed for eviction  citing two concurrent lawsuits that had not yet been filed as the \nalleged lease violation. The Counter -petitioner prevailed in this suit on January 17th, 2024,  in the \nJustice of the Peace Precinct 1.  \nImpersonation of an Attorney  \n 6. The Counter -petitioner asserts a claim against Daniel Kenneth Branthoover for \nimpersonation of an attorney, where he first  admittedly  influenced the divorce paperwork and \nthen proceeded to reference the Counter -respondent as his client once the divorce had been filed \nwith the Court. Daniel Branthoover also assisted the Counter -respondent in requesting discovery.  \nConversion",
      "char_length": 1548
    },
    {
      "page_number": 3,
      "text": "7. The Counter -petitioner asserts a claim against the Counter -respondent and Daniel \nKenneth Branthoover for conversion of community property amounting to $1,576 on December \n15th, 2023.  \nIntentional Infliction of Emotional Distress  \n8. The Counter -petitioner asserts a claim against the Counter -respondent, Daniel Kenneth \nBranthoover, and Margie Evonne Wilson for intentional infliction of emotional distress , where \neach played a role in the planning, meeting, and  filing of three concurrent lawsuits for the sole \nintention of having the Counter -petitioner removed from the residency and interfering with his \nconstitutional rights of the care, control, and custody of his Children.  \nCivil Conspiracy  \n9. The Counter -petitioner asserts a claim against the Counter -respondent, Daniel Kenneth \nBranthoover, and Margie Evonne Wilson for civil conspiracy, where a meeting of the minds occurred between both the Counter -respondent and Margie Evonne Wilson on Decem ber 13\nth, \n2023, and the Counter -respondent and Daniel Kenneth Branthoover between  on December 14th, \n2023,  and December 17th, 2023, with the sole intent to deprive the Counter -petitioner of his \nconstitutional rights , access to the residency, and custody of his Children.  \n10. The Counter -petitioner requests that the court, under its discretion provided by Rule \n39(a)(1) of the Texas Rules of Civil Procedure, consider the involvement of Debbie M. Price and Damen Kazlauskas  after a hearing on the merits . \nCHARLES DUSTIN MYERS’s Information \n11. The last three numbers of CHARLES DUSTIN MYERS's Texas driver’s license  \nnumber  is 608. The last three numbers of CHARLES DUSTIN MYERS's Social Security  \nnumber is 963.",
      "char_length": 1709
    },
    {
      "page_number": 4,
      "text": "Service of Citation  \n12. Service of citation is requested on Daniel Kenneth Branthoover, whose last known \naddress is 3100 Copan Ct, Yukon, OK 73099 . \n13. Service of citation is requested on Margie Evonne Wilson, who resides at 6640 Anne \nCourt, Watauga, TX 76148.  \nDivorce Jurisdiction  \n14. MORGAN MICHELLE MYERS and CHARLES DUSTIN MYERS have been  \ndomiciliary of this state for the preceding six -month period. MORGAN MICHELLE MYERS  \nhas been a resident of Tarrant County for the preceding ninety- day period. CHARLES DUSTIN  \nMYERS has been a resident of Tarrant County for the preceding ninety- day period.  \n15. DANIEL BRANTHOOVER, who has relevant involvement in the matters of this \ncase, is a resident of Yukon, Oklahoma. Texas courts have jurisdiction over DANIEL \nBRANTHOOVER due to his substantial and purposeful actions directed towards residents of Texas, which are dir ectly related to the issues in this case  and satisfy the sufficient minimum \ncontacts with Texas  to exercise jurisdiction.  \n16. MARGIE WILSON, who has relevant involvement in the matters of this case, has \nbeen a domiciliary of this state for the preceding six -month period. MARGIE WILSON was  a \nresident of Tarrant County for the preceding ninety -day period.  \nDates of Marriage  and Separation \n17. MORGAN MICHELLE MYERS and CHARLES DUSTIN MYERS married on or",
      "char_length": 1356
    },
    {
      "page_number": 5,
      "text": "about June 20, 2015, in Watauga, Texas and stopped living together on January 16th, 2024.  \nGrounds for Divorce  \n18. The marriage has become insupportable because of discord or a conflict of  \npersonalities between MORGAN MICHELLE MYERS and CHARLES DUSTIN MYERS that  \ndestroys the legitimate ends of the marriage relationship and prevents any reasonable expectation \nof reconciliation.  \nChildren of the Marriage  \n \n19. MORGAN MICHELLE MYERS and CHARLES DUSTIN MYERS are parents of \nthe following children born or adopted of this marriage who are under 18 years of age or who are  \notherwise entitled to support as provided by Chapter 154 of the Texas Family Code:  \nName: MARA EVONNE MYERS  \nGender: Female \nSSN (last 3): XXX  \nBirth Date: 06/20/2016  \nHome State: Texas  \n Name: CAROLINE ROSE MYERS  \nGender: Female \nSSN (last 3): XXX  \nBirth Date: 04/12/2018  \nHome State: Texas  \n \nContinuing Jurisdiction \n20. No court has continuing jurisdiction of the suit affecting the parent -child  \nrelationship.  \nPriority  \n 21. CHARLES DUSTIN MYERS raises a question of jurisdictional existence regarding  \n \npersonal jurisdiction for the significant decisions made on January 16\nth, 2024.",
      "char_length": 1190
    },
    {
      "page_number": 6,
      "text": "No Court -Ordered Relationships  \n22. There are no court -ordered relationships for the children of this suit.  \nUCCJEA Statement  \n23. Each party in this suit resides in Texas. However, because the Counter -petitioner is \nrequesting the court to serve Daniel  Branthoover, who resides in Oklahoma, the information \nrequired under Section 152.209 of the Texas Family Code is applicable.  \n24. The information required under Section 152.209 of the Texas Family Code, including \nthe child's present address or whereabouts, the places where the child has lived during the last \nfive years, and the names and present addresses of the persons with whom the  child has lived \nduring that period can be discerned from sworn and certified appendix filed with the Second \nCourt of Appeals and the Supreme Court of Texas . \n25. The Counter -petitioner acknowledges the continuing duty to inform the court of any \nproceeding in this or any other state that could affect the current proceeding. Currently, the case is pending a decision from the Supreme Court of Texas regarding a Petition for Review / Mandamus. Case No. 24 -0395 \nChildren’s Property  \n26. CHARLES DUSTIN MYERS states that there is no property of value owned or  \npossessed by the children the subject of the suit.  \nNo Protective Order  \n27. No protective order under Title 4 of the Texas Family Code or order for emergency \nprotection under Article 17.292 of the Texas Code of Criminal Procedure is currently in effect in regard to a party to this suit or a child of a party to this suit, and no applications for such orders are pending before the Court.",
      "char_length": 1612
    },
    {
      "page_number": 7,
      "text": "28. An ex -parte temporary order of protection was requested on December 14th, 2023,  by \nthe Counter -respondent,  which was denied.  \n29. The Counter -petitioner was required to show cause as to why a Protective Order \nshould not be issued against him on January 16th, 202 4, where his parental rights were \ntemporarily terminated prior to any hearing  and without a reporter’s record, a direct violation of \nhis 14th Amendment rights under the United States Constitution to the care, custody, and control \nof his children and his right to property .  \nAppointment of Joint Managing Conservators  \n30. It is in the best interest of the children that CHARLES DUSTIN MYERS and  \nMORGAN MICHELLE MYERS be appointed as joint managing conservators of the children.  \nCHARLES DUSTIN MYERS petitions the Court to appoint CHARLES DUSTIN MYERS and  \nMORGAN MICHELLE MYERS as joint managing conservators of MARA EVONNE MYERS  \nand CAROLINE ROSE MYERS with all the rights and duties of a parent appointed as a  \nconservator of a child.  \nPrimary Residence Designation  \n31. CHARLES DUSTIN MYERS petitions this Court to designate him the conservator  \nwho has the exclusive right to determine the primary residence of the children within Tarrant and  \ncontiguous counties, Texas.  \nProperty of the Parties  \nDivision of Marital Estate  \n32. CHARLES DUSTIN MYERS Petitions the court to divide the community estate \nwhere he may transition out of the home given his integral role in his Children’s daily lives . He",
      "char_length": 1502
    },
    {
      "page_number": 8,
      "text": "requests a transition period be set equal to the number  of days lapsed since the Original Petition \nfor Divorce was served to him, which was on December 27th, 2023.   \n33. The current division is not in the best interest of the children, the Counter -respondent, \nor Margie Wils on. The Counter -petitioner requests an equitable division of community property \nafter notice and hearing regarding any monthly expenses regarding vehicles acquired during the \nmarriage.  \nDismissal for Want of Prosecution \n34. Given the fatal error in the Counter -respondent’s Original Petition, the court should \nconsider exercis ing its discretio n sua  sponte under Section 160.635  of the Texas Family Code \nand dismiss the case for Want of Prosecution and proceed with this Counter -petition . \nConstitutional Restoration and Best Interest of the Child \n 35. Restore the Counter -petitioner’s constitutional parental rights to the care, custody, \nand  control of his Children under the 14th Amendment of the United States Constitution and \nrestore his right to property and to perform his normal business occupation.  \n 36. By order of this court, order the Counter -petitioner’s immediate re -entry to his home \nso that the transitionary period may begin and vacate the custodial arrangements that were made \nwithout any due diligence into the best interests of the Children.  \nInjunctive Relief  \n 37. Grant the Counter -petitioner a transition period to establish an alternative residency \nwhere he may continue to support his Children financially and emotionally for no less than the \nequal number of days lapsed since service of the Original Petition for D ivorce on December \n27th, 2023, to provide the Children for a smooth transitionary period that serves their best \ninterests.",
      "char_length": 1774
    },
    {
      "page_number": 9,
      "text": "Temporary Restraining Order \n 38. Under Section 6.502 of the Texas Family Code, grant the Counter -petitioner a \ntemporary injunction for the preservation of the  property and protection of the parties as deemed \nnecessary and  equitable and including an order  to: \ni. Require the production of bank statements from Daniel Branthoover, \nMargie Wilson, and Morgan Myers for the sole month of December 2023 relevant \nto court -related expenses and transfers  of funds.  \nii. Require the production of Daniel Branthoover’s PayPal transaction \nhistory between December 14th, 2023, and December 22nd, 2023.  \niii. Prohibit Damen Kazlauskas, Debbie M. Price, and Daniel Branthoover \nfrom having any contact with the children while the case is pending to safeguard \ntheir stability and to serve their best interests . \niv. Prevent harassment from Margie Wilson and from performing any acts \nthat would jeopardize the stability of the Children during the transitionary period.  \nOther Temporary Orders  \n 39. Grant the Counter -petitioner sole use of the residency while the case is pending, \nwhich also satisfies Texas Family Code Section 6.502(a)(8) and is in the best interest of the Children.  \nTemporary Orders Regarding Children  \n40. CHARLES DUSTIN MYERS petitions this Court, after notice and hearing, to render \ntemporary orders including, but not limited to, the following:  \na. appointing CHARLES DUSTIN MYERS and MORGAN MICHELLE MYERS as  \ntemporary joint managing conservators of the children;",
      "char_length": 1499
    },
    {
      "page_number": 10,
      "text": "b. designating CHARLES DUSTIN MYERS as the conservator who has the temporary  \nexclusive right to determine the primary residence of MARA EVONNE MYERS and \nCAROLINE ROSE MYERS; and  \nc. restricting the area within which the children’s primary residence shall be maintained  \nto Tarrant and contiguous counties, Texas.  \nPrayer \n \nCHARLES DUSTIN MYERS prays the Court to grant a divorce and all other relief  \nrequested in this Counterpetition.  \nCHARLES DUSTIN MYERS prays that this Court immediately grant a temporary  \nrestraining order restraining MORGAN MICHELLE MYERS, DANIEL BRANTHOOVER, MARGIE WILSON in conformity with the allegations  of this Counterpetition, from the acts set \nforth above, and that, upon notice and hearing, this  temporary restraining order be made a \ntemporary injunction  that shall serve the best interests of the Children . \n CHARLES DUSTIN MYERS prays that this Court serve the additional parties named to \nthis suit.   \n Respectfully submitted,  \n \n   /s/ Charles Dustin Myers  \n   Charles Dustin Myers  \n   Chuckdustin12@gmail.com  \n   817-507-6562",
      "char_length": 1084
    },
    {
      "page_number": 11,
      "text": "Certificate of Service \n \nI certify that a true copy of this document was served in accordance with Rule 21a of the  \nTexas Rules of Civil Procedure on the following on July 5th, 2024  \nMorgan Michelle Myers by electronic filing manager at morganmw02@gmail.com . \nCooper L. Carter by electronic filing manager at coopercarter@majadmin.com   \n   /s/ Charles Dustin Myers  \n   Charles Dustin Myers  \n   Chuckdustin12@gmail.com  \n   817-507-6562",
      "char_length": 442
    },
    {
      "page_number": 12,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 89507709\nFiling Code Description: Amended Filing\nFiling Description: Second Amended Counterpetition for Divorce\nStatus as of 7/5/2024 10:32 AM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nMORGAN MICHELLEMYERS\nCooper L.CarterBarNumber Email\nmorganmw02@gmail.com\ncoopercarter@majadmin.comTimestampSubmitted\n7/5/2024 10:12:38 AM\n7/5/2024 10:12:38 AMStatus\nSENT\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nCHARLES MYERSBarNumber Email\nchuckdustin12@gmail.comTimestampSubmitted\n7/5/2024 10:12:38 AMStatus\nSENT\nAssociated Case Party: ATTORNEY GENERAL OF TEXAS\nName\nHOLLY HAYESBarNumber Email\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n7/5/2024 10:12:38 AMStatus\nSENT",
      "char_length": 1081
    }
  ]
}