{"id": "8129ab759ab827c0d56434cc375cf0772f3f1936", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - PETITIONER'S REQUEST FOR DECLARATORY JUDGMENT (2)-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322- 744263- 23 \n \nIN THE 233RD DISTRICT COURT OF TARRANT COUNTY , TEXAS  \n \n \nTO THE HONORABLE COURT:  \n \nCHARLES DUSTIN MYERS, Re spondent in the above filed case, files this  \n \nRequest  for Declaratory Judgement, and in support thereof shows the following:  \nI. STATEMENT OF FACTS  \n \n1. Petitioner , representing himself pro- se, removed cause number  322-744263 -23 to the  \nNorthern District of Texas on December 6, 2024.  \n2. The case was remanded on December 8, 2024, for lack of subject matter jurisdiction.  \n3. Rule 237a of the Texas Rules of C ivil Procedure states : \n“When any cause is removed to the Federal Court and is afterwards remanded to the state \ncourt, the plaintiff  shall file  a certified copy of the order of remand with the clerk of the \nstate court and shall forthwith give written notice of such filing to the attorneys of record \nfor all adverse par ties.”  \n(emphasis added)   \nIN RE: M.E.M., ET AL.    \n**CHARLES DUSTIN MYERS, **   \n  \nPetitioner,   \n  \n Petitioner ’s Request for Declaratory Judgement  \nMORGAN MICHELLE MYERS,   \n  \nRespondent.   \n  \n2025 -03-31\n\n4. This places the obligation on COOPER L. CARTER to file with the clerk of the state court a \ncertified notice of remand , which she has failed to do as of March 31 , 2025, nearly three months \nlater.  \n5. COOPER L. CARTER ’s authority to represent MORGAN MICHELLE MYERS has been in question  \nsince September 20, 2024, over six months ago and is in que stion in this matter.  \n6. COOPER L. CARTER has never filed a pleading on  MORGAN MICHELLE MYER S’ behalf in either \nthis court or the 322nd district court since she was allegedly retained on January 22, 2024, over fourteen \nmonths ago.  \n7. ROD ERICK D. MARX has filed every pleading on behalf of COOPER L. CARTER in both  this matter  \nand the divorce matter . \n8. RODERICK D. MARX has not  made an appearance or otherwise been named as a party  in either suit.  \n9. Ne ither RODERICK D. MARX nor  COOPER L. CARTER have  filed any response"}
{"id": "0a7c22422cf8e5685b768938e6bbebcbb9097f5d", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - PETITIONER'S REQUEST FOR DECLARATORY JUDGMENT (2)-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": " the divorce matter . \n8. RODERICK D. MARX has not  made an appearance or otherwise been named as a party  in either suit.  \n9. Ne ither RODERICK D. MARX nor  COOPER L. CARTER have  filed any response to any pleadings \nserved to them by CHARLES DUSTIN MYERS . \n10. Neither RO DERICK D. MARX nor COOPER L. CARTER h ave filed any pleading since April 24, \n2024 in the divorce m atter, nearly twelve months ago.  \n11. C OOPER L. CARTER has left the 322nd District Cou rt without jurisdiction and has no ability \nto reinstate it, thereby resulting in an inevitable dismissal for want of prosecution. \n12. COOPER L. CARTER cannot reinstate jurisdiction because her EFM is registered to her prior employer ’s email address, which has been pointed out several t imes by Petitioner . \n13. Therefore , the 322\nnd District Court of Tarrant County has lost continuous exclusive \njurisdiction of the minor children in this suit and t his SAPCR is properly before this  court.  \n14. On March 28, 2025, the Petitioner arrived at the 233rd District Court to present his \nemergency TRO as s cheduled with the Court Coordinator  on March 27, 2025.\n\n15. The Petitioner was then told to contact COOPER L. CARTER by the Court Coordinator to \nselect dates for the TRO hearing  prior to his presentation once he arrive d at the court . \n16. The parties selected April 10, 2025, to have the hearing, and the Petitioner went before the \nAssociate Judge to present his emergenc y TRO.  \n17. Prior to being called up to present, the Associate Judge left the room and conversed with the \ncourt coordinator.  \n18. When she returned , Petitioner was called up to present the emergency TRO.  \n19. Before getting a chance to speak, th e Associate Judge informed the Petitioner that COOPER  \nL. CARTER had filed the consolidation motion in the wrong court and would be filing one with the 322\nnd District Court.  \n20. The Petitioner was denied an opportunity to present his emergency TRO and  was told to \ninstead file the pleading "}
{"id": "9a996ed56e2102c4732a4f58da4e2506c8ceb91c", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - PETITIONER'S REQUEST FOR DECLARATORY JUDGMENT (2)-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "tion in the wrong court and would be filing one with the 322\nnd District Court.  \n20. The Petitioner was denied an opportunity to present his emergency TRO and  was told to \ninstead file the pleading with the 322nd District Court.  \n21. The Petitioner then reminded the Associate Judge that the 322nd District Court does not have \njurisdiction over the matter of divorce  due to Rule 237a ’s requirements not being met. \n22. The Associate Judge disagreed and  refused  to hear the emergency TRO.  \n23. At the close of business on March 28, 2025, no thing was ever filed with the 322nd District \nCourt  by COOPER L. CARTER . \n24. Petitioner  and the children in this suit were denied due process outright  despite being correct \nin his legal position.  \n25. Petitioner ’s detriment to his position is the fact that he is self -represented . \n26. Respondent ’s detriment to her position is the lack o f prosecution or defense.\n\nII. ARGUMENT  \nThe statement of facts , unless  promptly rebutted by COOPER L. CARTER, warrant \nimmediate relief as duly requested in the emergency TRO th rough a declarator y \njudgement , and this cour t should proceed with the hearing date originally set for April \n10th, 2025, and the  emergency TRO should be GRANTED  without further delay . \nCOOPER L. CARTER disrupte d much needed relief for the minor  children in this \ncase with false promises delivered to the tribunal  that directly undermined the \nPetitioner ’s due process rights .  \nPetitioner reasserts  his pos ition th at COOPER L. CARTER is acting without \nauthority, has no ability to reinstate jurisdiction to the 322nd District Court of Tarrant \nCounty, and cannot explain how she is able to abandon a case for nearly a full calendar \nyear,  yet can suddenly show up to defend before this court  for the sole purpose to  \nprevent Petitioner ’s emergency TRO from being h eard.  \nIt may be a needle in the haystack, but this case defies the initial presumption that \npro-se litig ants are not as equipped "}
{"id": "47978cb072ae72d975746d2fcc613949d81bda95", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1\\03_31_25_petitioner_s_request_for_declaratory_judgment_2_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\03.31.25 - PETITIONER'S REQUEST FOR DECLARATORY JUDGMENT (2)-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 1963, "text": "sole purpose to  \nprevent Petitioner ’s emergency TRO from being h eard.  \nIt may be a needle in the haystack, but this case defies the initial presumption that \npro-se litig ants are not as equipped or as capable as licensed attorneys , and it is no fault \nof COOPER L. CARTER. The Petitioner reminds the court that the true culprit \nresponsible for this remains the puppet master hiding in the background – the \nRespondent  – and yet Petitioner  wishes no harm to her because this litigation is about \nthe children. The children need their mother, but they also need their father.  \nPerhaps the zealous passion has been misunderstood for contempt by the tribunal, \nbut Petitioner ’s motive runs parallel  to that set forth in the Texas Family Code. \nHowever, despite the procedural quagmire, the anomalies, the pro- se status, the \nsolution remains simple :\n\nGrant  the relief. Nobody has argued against it, Texas law allows it, and the \nbest interest s of the Children encour age it  and depend on it. I welcome any response \nfrom COOPER L. CARTER to the contrary. \n If approache d from a logical standpoint, the situation can be inter preted as \nsuch:  \ni. COOPER L. CARTER is sh ackled by Rule 12 and Rule 237a of the \nTexas Rules of Civil Procedure.  \nii. The 322nd District Court is shackled from proceeding  due to never \nbeing reinstated jur isdiction . \niii. The Petitioner is sh ackled from his home, his children’ s daily liv es, \nand his place of business under facially void orders. \niv. Most critically, the children are sh ackled in a situation that is not in \ntheir best interests and  continue to suffer irreparable harm  without \nany opportunity for relief. \n \nIndeed, that leaves just one party un- chained from this situation:  \nthe Respondent.  Petitioner rests his case . \n \n \nRespectfully  submitted , \n   /s/ Charle s Dustin Myers \n CHARLES DUSTIN MYERS  \n 6641 Anne Court, Watau ga, Texas 76148  \n CHUCKDUSTIN12@GMAIL.COM  \n 817-546-3693"}