{
  "source": "C:\\code\\LEGAL_DESTROYER\\INCONSISTENCIES\\11.25.25 - EXHIBIT 1.pdf",
  "base_name": "11_25_25_exhibit_1",
  "page_count": 73,
  "ocr": {
    "dpi": 300,
    "lang": "eng",
    "created_at": "2025-12-25 17:04:18"
  },
  "pages": [
    {
      "page_number": 1,
      "text": "subject: Re: Mara\n\n?\n\nFUDSTOP <chuckdustin12@gmail.com> Thu, Dec 19, 2024, 9:40 PA\n\nto Morgan Myers + 322-744263-23\nMorgan.\n\nIt's extremely concerning that you continue to hide behind these orders. yet only seem to selectively follow them based on what's convenient for you.\n\nWhile | appreciate your efforts to communicate Mara's medical information, your efforts are pointless, as this information could have been given by Mara as she is 8 and a half years old tomorrow and is old enough to explain her\nmedical procedure regarding her eye to me.\n\nIf you want to actually be helpful and fulfill your role in the one-sided temporary orders, you'll need to actually follow them. Otherwise. please don't contact me again while | pursue litigation against you and your family that decided to\nimplicate themselves in this disaster you've created.\n\nAlso - Caroline is nearly 7 years old, lives with all women, yet she comes to me every night she's here asking for a diaper as if there's no effort whatsoever to potty train her.\n\nIn the future, you'll need to contact me through an attorney - no - not Cooper Carter, an actual attorney. What you've done over the last year is unacceptable and will be resolved in accordance with the law. The divorce will likely be\ndismissed for DWOP given your representation has no ability to prosecute the case.\n\nEven if she did - the blatant fabrication of the IFP you filled out with the assistance of Mr. Branthoover is grounds in and of itself to dismiss the case.\nSo while you're making your record for trying to be “helpful”, you haven't been. You've been destructive, careless, and reckless, and will have to answer for your actions at some point.\n\nIf you're going to use the orders to prevent the girls from talking to their own family and father when requested, then the least you can do is follow the rest of the orders since that seems to be what you live by, as sad as that is given\nthey were procured by deceit and fraud.\n\n| had my childhood taken from me, and | will not let you get away with what you've done by taking advantage of the hard work | put in for your benefit and my detriment.\n\n| told you in the beginning you would hurt more than just me and the girls, and you've done it. By involving Dan, Meme, and Caitlin, and by showing no remorse or efforts to realize the actual damage you've caused - | hope you\nunderstand that I've been put in a position to ensure everyone is properly adjudicated for their role in the destruction of the girls' status quo.\n\nMy mission is clear: shed light on what has happened, and seek damages from those responsible to ensure the girls’ future remains stable.\nDon't message me again unless it's an emergency related to the girls.\n\nCharlie\n\nOn Thu, Dec 19, 2024 at 2:59 PM Morgan Myers <morganmw02@gmail.com> wrote:\nFor Mara’s eye drops, she needs one drop 4x a day. She'll need to have one as soon as you get back to your place, and again at bedtime for today. Bottle is in her white bag.\n\nOn Tue, Dec 17, 2024 at 12:22 PM Morgan Myers <morganmw02@gmail.com> wrote:\n\nTh crim mils Rum Oh A in A Adin nen nacibnd An Antibintin Avian denn Cha ill ba ALIA bn AA dR Rab al bamneens:\n",
      "char_length": 3165
    },
    {
      "page_number": 2,
      "text": "8:52 of\n\n+1 (817) 546-3693\n\nSo what\nare we doing here?\n\nYou got a new wedding ring on the\neve of your 10 year wedding\nanniversary.\n\nLOL.. anyways.\n\nYesterday 8:11PM\n\n123_1.mp3\nAudio Recording - 598 KB\n\n123_1.mp3\nAudio Recording - 588 KB\n\n123_1.mp3\nAudio Recording - 348 KB\n\nToday 8:45AM\n\n123_1.mp3\nAudio Recording - 490 KB\n",
      "char_length": 323
    },
    {
      "page_number": 3,
      "text": "8:51\n\n+1 (817) 546-3693\n\nTuesday 4\n\n123_1.mp3\n\nAudio Recording -\n\n123_1.mp3\n\nAudio Recording -\n\n123_1.mp3\n\nAudio Recording -\n\nYesterday\n\n‘(OO PM\n\n593 KB\n\n578 KB\n\n593 KB\n\nJust need the girls stuff out ..\n(bunnies.. maybe tablets)\n\nYesterday 4:19PM\n\n123_1.mp3\n\nAudio Recording -\n\n123_1.mp3\n\nAudio Recording -\n\n595 KB\n\n598 KB\n",
      "char_length": 323
    },
    {
      "page_number": 4,
      "text": "From: Cooper Carter coopercarter@majadmin.com\nSubject: FW: Read the Orders CL-12105\n\nDate:\n\nTo\n\nNovember 24, 2025 at 10:55 AM\n\n: Cooper Carter attorneycoopercarter@gmail.com\n\n-- Forwarded message ---------\n\nFrom: FUDSTOP <chuckdustin|2@gmail.com>\nDate: Sun, Feb 2, 2025 at 11:37 PM\n\nSubject: Read the Orders\n\nTo: Morgan Wilson <morganmw02(@gmail.com>\n\nMorgan,\n\nYou built your life around the orders you obtained by fraud, so it would serve you well to\nactually read them. If any of my property is missing or damaged—which the court\nexplicitly protects as \"personal property\"—I will be filing a motion for contempt and\ncontacting law enforcement. This will be escalated to criminal charges if necessary.\n\nLegal Violations & Consequences\n\n1.\n\nYou are explicitly prohibited from destroying, concealing, selling, transferring,\nor otherwise disposing of any marital or separate property while the case is\npending.\n\no (Page 31, Section 6): \"J7 JS ORDERED that Petitioner and Respondent are\nenjoined from... destroying, removing, concealing, encumbering, transferring,\nor otherwise harming or reducing the value of the property of one or both of the\nparties.\"\n\nYou are prohibited from altering, deleting, or disposing of financial records or\nelectronically stored information related to marital assets.\n\no (Page 33, Section 26): “Destroying, disposing of, or altering any email, text\nmessage, video message, or chat message, or other electronic data or\nelectronically stored information relevant to the subject matter of this case.\".\n\nMarital and personal property includes but is not limited to furniture,\nelectronics, jewelry, tools, firearms, digital assets, vehicles, and all other\npersonal items.\n\no (Page 36, Section v-u): The order explicitly lists household items, digital\nassets, collectibles, and vehicles as protected property.\n\nIf you so much as touch my property in an attempt to get rid of it, you will immediately be\nin contempt of court. This is not a threat. This is a legal fact.\n\nWaeeee MO newnn Ta Wn ns\n",
      "char_length": 2017
    },
    {
      "page_number": 5,
      "text": "LUUL UWa@llit IS UVC\n\nMorgan, your entire case has been built on lies, deception, and fraudulent claims, and it’s\nfinally catching up with you. Your only evidence consists of fabricated text messages and\nbaseless accusations that you haven’t even backed up with official filings. You can ery\n“abuse” all you want, but reality doesn’t bend to your delusions, and no jury will ever buy\nyour case, because IT ISN'T ABOUT YOU. IT'S ABOUT THE KIDS.\n\nYou can’t run to your grandparents or manipulate people into covering for you this time.\nYou think you have power, but you don’t. You think you’re in control, but you’re playing\ncheckers in a chess match you’ve already lost.\n\nLet’s be clear\n\ne You lied to the court to obtain the orders you constantly reference and hold over my\nhead, yet have no problem blatantly violating them.\n\ne You ignored child support enforcement because your attorney can't prosecute the\ncase.\n\ne You violated the very same orders you praise because reality has finally started to\ncorner you.\n\nYou cannot win. And I am admitted into two federal courts for a reason. The exact\ncourts I need to hold you and Dan accountable for what you have done to our children IF I\nMUST DO SO.\n\nI'm admitted into two federal courts right now for a reason, and the exact courts I need to be\nadmitted into in order to hold you - and Dan - accountable for destroying the lives of my\ndaughters - OUR daughters.\n\nI filed every motion with a specific strategic intent, which was to ensure our children are\nprotected, and you have not filed a single response, argument, or defense against them.\n\n[ have been more than merciful with you in my requests for relief because it's best for the\nkids. You have been downright vile, malicious, and honestly childish.\n\nThese emails come off as a threat to you - a nuisance - but it's the only way I'm able to\ncommunicate given your complete detachment from reality.\n\nI honestly don't care about your feelings Morgan. Not anymore. I care about my kids, and\none day - whether it's now - or much later in the future - you'll realize that.\n\nIf I were really out to get you, why would I file a motion to dismiss, and not a motion for\nsanctions, contempt, or call the police and report your crimes?\n\nBECAUSE IT'S NOT BEST FOR THE KIDS.\n\nWake up Morgan. You've been asleep since November 30th, 2023. It is now February 2nd,\n2025, we've been married for almost ten years, are nowhere close to getting divorced, and if\nmy personal belongings are disposed of, it will only make the process take even longer.\n",
      "char_length": 2536
    },
    {
      "page_number": 6,
      "text": "CC Your attorney, I don't care. She's procedurally check-mated, and she knows it. This has\nall been strategy, and you have no moves left.\n\nI would imagine she values her legal career over this dumpster fire of a case.\nSo either take the loss, discuss this with me like an adult, like the partner and best friend I've\nhad for the last decade, or continue this path of destruction with no end in sight, no plan, and\n\nwith no regard to our children.\n\nI've already had everything taken from me, so I have nothing left to lose - and everything to\ngain.\n\nWhy would you not take this offer after everything you've done?\nWhat are you so scared of? Facing it? Look what I've had to do the last year - did you think\nI wasn't scared when I had to go into court in front of you and your friends who barely know\n\nme and argue with a judge to fight for my children and rights?\n\nIt's okay to be scared of Morgan. But you have to remember, even after all of this - it\nchanges nothing about who I am, who we were, and what we built for our kids.\n\nPlease make the right decision here. This can start turning around as quickly as it started.\n\nThe choice is YOURS.\n\nAt the end of the day, we both lost. So let's get over it and start showing our kids we\ncan do what's right by them.\n\nThis is the way.\n\nCharlie,\n\nYour Husband\n",
      "char_length": 1305
    },
    {
      "page_number": 7,
      "text": "subject: Fwd: [AppClose] Re: Can't login to appclose for account CHUCKDUSTIN12@GMAIL.COM\n\n) Charlie Vids <chuckdustin12@gmail.com> Sat, Dec 14, 2024, 6:55 PA\n: to Morgan Wilscn +\n\nForwarded message ------—-\n\nFrom: Michelle (AppClose) <support@appclose.zendesk.com>\n\nDate: Sat, Dec 14, 2024, 7:11AM\n\nSubject: [AppClose] Re: Can't login to appclose for account CHUCKDUSTIN12@GMAIL.COM\nTo: Mobile App User <chuckdustin12@gmail.com>\n\nYour request (71902) has been updated. To add additional comments. reply to this email.\n\nMichelle (AppClose)\n\nHello\nAre both the app and phone software fully updated?\n\nThank you\n\nAppClose Support Team\n\nMobile App User\n\nHello, I've put in a support ticket awhile back about an account login issue, but haven't gotten anything back. I'm not sure if it's because | attempted to create a ticket on the app itself, but am reiterating my issues\n\nhere.\nMy username is chuckdustin12 and | use the same email as provided here.\n| also have an issue with not recieving notifications on the app which has lead to many missed phone calls.\n\nThanks for any assistance.\n",
      "char_length": 1084
    },
    {
      "page_number": 8,
      "text": "subject: Fwd: This is who you let destroy our life\n\n?\n\nMorgan Myers <morganmwO2@gmail.com>\nto dmb575, Roxanne Wilson +\n\nForwarded message\nFrom: Charlie Vids <chuckdustin12@gmail.com>\nDate: Tue, Dec 10, 2024 at 11:24AM\n\nSubject: This is who you let destroy our life\n\nTo: Morgan Wilson <morganmw02@gmail.com>\n\nMakes sense.\n\nThis is not looking good.\n\nNot only has Dan violated multiple protective orders in the past, but he’s already plead guilty to similar conduct in the past, revealing a pattern of behavior.\n\nYou also fabricated the affidavit of inability to pay, which makes the case Dismissable under the Texas practice and remedies code and is a class C MISDEMEANOR.\n\nYou claimed both kids as dependants\nDon't say | didn't give you every opportunity to correct this,\nNow it's on you.\n\nOklahoma takes conspiracy to commit fraud very seriously.\n\nOne attachment + Scanned by Gmail@ 4) Add to Drive\n\nDaniel Kenneth Branthoover\n\nJ DanieikennethBr...\n\n© Tue, Dec 10, 2024, 12:42 PA\n",
      "char_length": 981
    },
    {
      "page_number": 9,
      "text": "subject: Fwd: Tomorrow\n\n?\n\nMorgan Myers <morganmw02@gmail.com>\nto Roxanne Wilson, dmb575 +\n\n~—------ Forwarded message\nFrom: Charlie Vids <chuckdustin12@gmail.com>\n\nDate: Wed, Dec 11, 2024 at 11:32AM\n\nSubject: Tomorrow\n\nTo: Morgan Wilson <morganmw02@gmail.com>\n\nMorgan,\n\nGiven your accomplice's most recent threat, | will not be picking up the girls tomorrow.\n\nIt is unclear what Dan means by his latest threat, so for my own safety and the girls own safety, i will not be subjecting them to any potential violence.\n\nIts crazy to think that you of all people would go to this level of egregiousness. Ironically, you're just strengthening me and the girls relationship long term and destroying yours.\nIts blatantly obvious to anyone not involved in this to see how disgusting you ail are acting.\n\nYou must have forgotten who | am if you thought | was going to do anything but fight for what's right.\n\nI've always done what | told you | was going to do. Here is no different.\n\nWe won't be getting divorced anytime soon, and you have yourself to thank for that alongside your accomplice.\n\nI've been totally up front with you regarding my actions in court yet you keep taking them as threats.\n\nBut in reality the threats keep coming from Dan, and you somehow think this helps your case?\n\nNow I can't even see my kids because | don't know what he means by \"Deal with me\" and what he's referring to when he says \"When things all over,\"\n\n| will not subject the girls to this possibility of violence, and this has been duly noted.\n\nStop letting a criminal influence your decisions. Look at the resulting situation.\n\nTell the girls i love them.\n\nMaybe have them call every once in awhile, you know, through normal means. The only reason I'm not there now with my children is for the simple reason that you won't let me.\n\nThe court order is void Morgan. It has no legal effect. This will never change especially given what's happened since it was first drafted.\n\n© Dec 11, 2024, 6:22 PA\n",
      "char_length": 1977
    },
    {
      "page_number": 10,
      "text": "subject: Girls\n\n> Charlie Vids <chuckdustin12@gmail.com> Sat, Dec 14, 2024, 718PS\n= to Morgan Wilson +\n\nAll right then..\n| guess there's no hope.\n\nJust keep in mind with this logic you're basically guaranteeing that they won't get to talk to you on Christmas if i cant get this fixed by then.. which makes no sense. I'll have them call because it’s the right thing to do.. through my\nnormal phone.\n\nGuess this is the way it's gonna be, so be it.\nHave a good night.\n\nTell the girls | love and miss them.\n",
      "char_length": 503
    },
    {
      "page_number": 11,
      "text": "» Charlie as\n\niODAY\n\nNew message\n\nAlso | won't be able to get them on\nThursdays after this week due to\ndistance.. and won't be able to take\nthem to school on Mondays.\n\nTried staying around here as long\nas | could but can't sustain.\n\n| sent you a certificate of\nconference for temporary orders\npursuant to the local rules in a\ngood faith effort on Tuesday.\n\nI'm filing it with the Court at 3:50\npm and won't be serving it to you\nuntil 10 days before the hearing as\nI'm requesting it be granted\nwithout notice and hearing given\nthe circumstances and whats\ntranspired over the case regarding\nthe disregard for procedural rules\nand the damage that's been done.\n\nI'm requesting the court strike all\npleadings prior to January 22nd, ap\n2024 other than the rule 12 motion\n",
      "char_length": 765
    },
    {
      "page_number": 12,
      "text": "Charlie\n\nTORAY\n\nI'm requesting the court strike all\npleadings prior to January 22nd,\n2024 other than the rule 12 motion\nto show authority and the summary\njudgement, and am asking for a\nreasonable amount of time to\ntransition which is what I've asked\nfor since the beginning.\n\nNot requesting any injunction or\ncustody determinations until a\nhearing on the merits can be held,\nand im requesting the court\ndispense with the necessity of a\nbond on behalf of the kids and on\nbehalf of us to preserve the status\nquo that's been destroyed without\na second thought.\n\nNothing against you just gotta do\nwhat | gotta do for the kids since\nnobody wants to communicate and\npretends like the current situation\nis what's best for them.\n\n| am requesting a temporary\nrestraining order for 14 days\n.* c » te\n\n\\V\n\nL\n",
      "char_length": 797
    },
    {
      "page_number": 13,
      "text": ")\n\nK “ Charlie -\n\nlam requesting a temporary\nrestraining order for 14 days\npreventing anyone from taking the\nkids out of the house while the\ncase is pending and preventing the\nPeace from being disturbed during\nthe recovery period and allow for\nthe status quo some time to be\nreset.\n\n| have all financial documents and\naffidavits needed and have several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n\nI'm also invoking laches doctrine\nwhich prevents any new claims that\nweren't served or disclosed before\nfrom being brought up due to\n\nbinrasacansahla dalau and ta nmraviant\n\n§\n",
      "char_length": 791
    },
    {
      "page_number": 14,
      "text": "im 2 Charlie\n\nalidavits needed and nave several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n\nI'm also invoking laches doctrine\nwhich prevents any new claims that\nweren't served or disclosed before\nfrom being brought up due to\nunreasonable delay and to prevent\nfurther disruption regarding\ntransitioning from the home.\n\nJust communicating this to you ina\ngood faith effort as required by the\nrules in case you didn't get the\nemail.\n",
      "char_length": 648
    },
    {
      "page_number": 15,
      "text": "So | ask to talk to our Children.. all\nthe time. They NEVER call me. Only\nif | ask you first.\n\n| get them phones for the purpose\nof being able to talk to them and\nso other members of my family can\ntalk to them during the week also..\nbut they never use them.\n\n| don't understand what else | can\ndo to try and have a relationship\nwith our kids during this horrible\ntime..\n\nAnd then when | do get to talk to\nthem.. you're always there\nhovering, whispering in the\nbackground as if they wouldn't\nknow what to say if you weren't\nhelping them talk to me.\n\nWhen the tables are turned, | won't\nbe this way. I'll foster a relationship\nbetween you and them and\nencourage you to have a\nrelationship and have them call\nyou.\n\n",
      "char_length": 712
    },
    {
      "page_number": 16,
      "text": "\\ ~S AAAYV 42\nYELL), VIAY $5\n\nrelationship and have them call\nyou.\n\nJust don't understand the point of\nthis. If it's to hurt me, yeah it works.\nBut you're also hurting them, too.\n\nI'll be homeless in 3 weeks. I'm not\nasking for sympathy just letting you\nknow in case | have to give up my\nsummer visitation with them.\n\nI'm going to try and figure\nsomething out by then, but it's not\nlooking good considering my\nincome is down over 65% from Feb\n1st, and don't make enough now to\nqualify for a house.\n\nJust wish | could talk to my kids\nwithout it being a chore.\n\nIf possible.. please tell them | love\nthem, and miss them very much..\n\nthat's all | want is for them to hear\nthat as much as possible.\n\n",
      "char_length": 696
    },
    {
      "page_number": 17,
      "text": "subject: Re: Girls necklaces\n\n? Charlie Vids <chuckdustin12@gmail.com> Fri, Dec 13, 2024, 6:56 PA\n“* * to Morgan Wilsan +\n\nShipping is arriving late now.\n\nSays tomorrow.\n\nThanks\n\nOn Fri, Dec 13, 2024, 5:59 PM Charlie Vids <chuckdustin 12@gmail.com> wrote:\nPlease ensure the girls get their necklaces | got for them and their prayer books.\n\nTheir necklaces should be there soon.\nMaras is the one where we are sitting down and Caroline's is the one where we are standing up holding hands.\nMiss them so much.\n\nHave a good night.\n",
      "char_length": 526
    },
    {
      "page_number": 18,
      "text": "subject: Re: Pick Up\n\n4 ~~ Morgan Myers <morganmw02@gmail.com> Sat, Dec 28, 2024, 6:34 PA\n= to FUDSTOP ~\n\nHere\n\nOn Sat, Dec 28, 2024 at 5:54 PM FUDSTOP <chuckdustin12@gmail.com> wrote:\n?\n\nDenton\n\nOn Sat, Dec 28, 2024, 2:25 PM Morgan Myers <morganmw02@gmail.com> wrote:\nPlease let me know where the girls are asap.\n\nOn Fri, Dec 27, 2024 at 4:43 PM Morgan Myers <morganmw02@gmail.com> wrote:\n| will be by to pick up the girls tomorrow at 6pm. The orders say my possession begins at noon, but I will be at work at that time. Are they still staying at the Denton address, or will they be somewhere else? Please let me know\n\nas soon as possible.\n",
      "char_length": 641
    },
    {
      "page_number": 19,
      "text": "subject: Re: Please have the girls call.\n\n?\n\nCharlie Vids <chuckdustini2@gmail.com>\nto Morgan Myers »\n\nAnd no - i'm not able to log into appclose.\n\nI've put in a support ticket and am waiting to hear back.\n\nRegardless, it's pretty messed up. You think you have the right to withhold them from me.. they're my daughters too.\n\nEven though you breathe down their necks when they call, I'm not calling for you. I'm calling for them.\nJust to hear their voices.\n\nIt's unreal that you're this detached from what's important in your life.\n\nOn Fri, Dec 13, 2024 at 8:37 PM Morgan Myers <morganmw02@gmail.com> wrote:\nAre you able to log into AppClose? They will call through the app.\n\nOn Fri, Dec 13, 2024 at 8:37 PM Charlie Vids <chuckdustin1 2@gmail.com> wrote:\nPlease have the girls call.\n\nThanks\n\nFri, Dec 13, 2024, 9:48 PA\n",
      "char_length": 818
    },
    {
      "page_number": 20,
      "text": "subject: Re: The girls\n\n2\n\nCharlie Vids <chuckdustini2@gmail.com>\nto Morgan Wilsen +\n\nHey their necklaces just arrived.\n\nStill working on getting appclose fixed the customer support has me going in circles.\n\nOn Sat, Dec 14, 2024, 8:28 AM Charlie Vids <chuckdustin12@gmail.com> wrote:\nI'd like to ask Mara how her field trip went.\n\nStill can't login.\nDon't resort to alienation it hurts them more than me long term.\nMore bad reviews came in on your attorney.\n\nIt's your guys’ move.. | thought yall were in a hurry?\n\nSat, Dec 14, 2624, 3:41 PN\n",
      "char_length": 542
    },
    {
      "page_number": 21,
      "text": "MW DRUGS-FORUM\nODICTION HELP & WARM REMECTION\n\n_ Koop this site oniine\n\nwEVICWS Bo MeiY 2 ARTICLES © WIKI | REROURCES FE\n\nwep | Loc eine =\n\ntye Jonnie # etreetebuntinn a's trratiat\n\n@ Meth Story That Brought Me Glory, My Unique Road That I Dent Understand\n\nWe ig my Heer poet On Mine Site and 1 DpOlOplyw «n advan lor es Henge\n\nNan { was eaghteon vases tid. | bund wth any very contrbiling father 1 nad ved with tum moat of “ny life WitU! rip pareree ape un.\nVES aeviary Feneaind hem, Liew oat cowry. L tried qoqctiaera 4nd loved 4. gerd ybit Amon & th then wary dey ts ast CO\nhat son ne avide from inows Saou, HW Nhat Mey own ZaeNly i who whubladd i. {would wut ty Meche om WaEbeRty, and iny step\n\nth iets\n\nthe tame sence toavly. Everniaarly, te tought | wean old mntaKg? to pertake, and Ne CHIME IND Ney tomnen hA | way Omer Oo\nteahtend, deat Ore) com & CDACUROn 2D imetaritly ccwpted, ard pond hist in the garmge Yetak Cdn’. now, wine chat Bae ooarnite\nat 2 blunt. Aer about tree rinses I fok my hoad etart C0 foal rery fg. arid My Uodty ttartad Meeting Vary atrarape {tid bwin | fer\n\n470 and wert 10 go lay down. A tew weekends passat avd every tite Id come Ove he mould ask if i wanted tO amobe ayaa, ena |\nWit no the frst couple of tomes, and the on the third | garam and sirmiked. From then on I was a “stoner” and would later try AOD\nedict, Eoxiaty, aisidéne, and feaily. - cre\n\nthhaad wrth for che fines rte inh ny cher bGtiee hee Fw 17. Come to find aut ny morter sits\na pole. Altar AenO Kang At and inty feeling winndae Wéfentn fence: what E fate for audler at, F reaveit 8 Chet areprimted. {ctf\n‘thar cling thw pipe hor one bacisurwe } Gideit ezwe rin how i chke a het, Me apiained i hence Giri bat) fave sewer gaducetand\nfret. Aner a few months of emoieng st wit him every now and then, the cat pot let aut-of the bag fo my starr! OF churve, at fem\n\nin nam upset, bet covidnt ravily do anything becasse of her own utape. They mould amays go-nto thar Dedvoom when { was\nOg UD. and Ick themselves away. Erid 1 Enatly restned thats what they must hove been doing this whole time So after i\nting, I would aa* to foun them. 1 get demyad at fret, but eventuatty, they let me come in and thus Sean the taaniy meth tending\n\neaciand t. [ feist Nhe whet pp cae\n\ndonk want tc Dune You Quy witty tue much dated, sa J will try to be more\n\ntit gosat feeven Nat oe\n\n‘ety much, evertualy my moms davier Became My Dobler, My dad started to Bnd paraphomaba ri my meet\nvd Dapcies!. Ona night, I wason my way Gownstory at my tathere, and E hae’ him and my stepmom taking\n\npoliowed our g\n\nfe rrtets to goo Te eutrati” I need ity stp ay.\nst rom Cath tis fen frat, Beit f agree, we Wel tater hier totes\n\nWh\" My acd reat\n\nrinere my tite was going and hacad wwwry aspect Of st ged rio t wan abut Ty bw adsritiad. | ennmdietaty\nWied my nom and tid her what t had heard, and ins was ust after I nad turned 20 and was eve%s in community college. That\nght 1 ran away to ner apartment, wnere ! would ive for the next two years and weeeee my ia would mange formver\n\nhad a jot at the bane, and upon my arrival I dropped out of cottege to work Ful bone This as wen tne Metn use became date Wen\nind iy aide Bota aNd AEN rf iawe NG wit SeoKEd innng Hear atid Aron MI, Ta\nuy De dese we have is extamaty rane on the Tact ne gees & LOT rere than what you psy mr, and haw conewtantiy fed t avedanle\nFaenORT SeIvON years re.)\n\nev ett Ou\n\n7 SIFY shorah, Lcammed & pipe wan me th work every meig’s day, and snowiag -n Ine Duthynor avery singe day. f became one of\n10 axcat tend empioyees m our dstract, and eventually morced my way up to restaurant manager. Onoe { became re-ager my boss\nrided it was tome for me to pret) cateee, 0 | didnt have to “wrage Pe people I Mae BY aEay Deen working with for so long as an\npel Grice t evetched, | met ony yefe (one of my pervers he tne) Aa soon ae I saw her for the feat Der | felt soorettre that I\nalld not wxpian. Two weeks efter that, we nung cut for the fies: tne, and tee weelee after chet nthe at\nmoved into her house, Bad than we got Our Ome apartenenit for e yaar at che end of thet yea’, she becare cregnant, wae fost the yore\nca 2 few wetks in, and piu decued we would try agan, but we manta to gee mustried fist, SumeMOW, ow girl Ih\nBridoor th her grandparents, and her g-andtother is a pastor at the church that they own. Mer graniparents decded to \"x\ndautitul wadding for un in their backyard, and offered us a great dee: f we mowad back ty my wife's house Lonned by Me\naandparecks}. We could not tum & down inowing Int we wanted a Owe soon, and ther: shorsy etter moving in, my wte becams\negrUnt agen. Trys tims. 10 months ‘ster, my beautiful daughter was tom 100% nesitny, She now 11 months vid and w tne most\nssutitul chong 1 have ever tad eves on, ! amt now a way i home dad and have mnohed meth every tmgiw day Hem wher [nae ty\nile untii nowy. She has no idea. Tha Qui™ is king me snd has bean for some Lime, but | am new Mm 6 SosKION in my fe Where I should\n» aole to stop, Ive Been trying to caper off for over a year rony, and wo Sr ity orogress iN moving. For six years | soled whomever\ndyed up Jate, aad didnt sleep much. Lately, since marrad, } have not seroluhd aMer Spar wo chat } chs sleep ath ry wife aad get us\n(iy daughter in the momings\n\nEe\n\nhow wets lie\n.\n\nfom ike math ratpedt ra crmate my Terri, and now thet T hive then, | dont wact crwth to aise hw\n90 potica ofBowr finding it an my way honte from my desier and itd af be over I dort know wher the nent ston a fenvow 1 Gan de\nentivat treatment. lee carne 3 ‘ong wank and don want to ¢ te ony wife or daughter. of exeryone in my fe anymore by Mding\n27 on tating my wife about my usage, but only after | have swpped. | dort think sta wil teawe me, a8 T aeee Lied to be 4 good\nSra07 wid fa like 1 have suceeded in that other than the deceptive o-va use that has viaved such avi weresteng ole in ry ife. f\n6 thet wes meane ty use this substance, a it was undoubtedly avodadis given my Crevwstances, art after\ntanges occur in my bie, | dider feel the need to ston Bur Ine meat vn years now | have wanted to, baceuse there 8 notmng wise to\nmit, onty everything to lone\n\nob destrop it AN st weed take me\n\nweeng 2 the ousitive\n\nease inform me it | a7 oy the right track, becaume af | nant + wats best for ny farrsly\nyou need anymore detaits or informat-on, 8 me xnom\n\nsupometoe\n\nena atireun\n\nNAL ENTHY\nTHFORMAT LON\n\nENTREE\nTAMING\n\nOkay #6 ready, wodare 104,\n\nrenga, ei\nwy mindset, | chowaght twa\naicne ten\n\nhas been 2 little over @ years\ned it's eleo been\n2 lithe over B yaern noe f\n\nBh er Or we Hort\n\nSo 1 want te be reductive\nWrant to do something anith\nmoyssit, ut £ feel fos: feat t\nhave oe,\n\nI just tork 2 joo back et\nscippers from tres ynarra and\nought 10 posts i0ng\n\nmn Cracked, Yo bee) cracking\nfor 25 years and f reckon out\nof tine 25 years {ve thaw ory\n\neee 1 rviaey\n\nSMARE Tas ENTRY\n\nranks for reading guys. «uw oe t\n1 sery my wetiting sucks. I nas trying ko spill @ years of Informaton into a themad entheit boring the curmmurety ot Te proces, 5\nfXwmMeP tHE\nReviltytimallyiienue May F320 =\nHey chuck How oid aim is! read thas long aw story i tho. TRH if she Loves you She wont Radge Ynu. Telling the ee :\ntruth wk hurt bur it took Courage , Dut Kawping it # wecract can Owstery your Fatty. Gaares W mot u gor Consol. My\nRoommate cone home Bid ditnk & few Leas EVERYDAY. Het! I come Home and went glass... TBH rmats the ditterance\neockeheetins 2 ayy 11\n| ees see 1 amr 26 years old. And | agree with you, as law a6 you dunt ‘et shaterer gowon of Choxe consume\nyour life, there isnt much of » difference. And yeah ny biggest asus that ms? Mes caused in erty hfe am che yuk\nthiniong aiout tating Mer gOO1, So Can have Mer support 1 auxtting. I could De wrong. Sut ft werent for meth woulda\nnever mat her, because | wouldve never gocten so fucumed on wurk. To @razy inen.. most owurs tak ebuut how meth has\nCant oyed wes, yet in my experience 4 hay Galt frene, | did believe i god Unb! ne came Lo me such an unartnaie\ntaahon\nPolyctot s\nLam proud of you, Your gasis are on pine ahd) belleve you are CagaDse Maybe a onescnotion for sid mits mous bes\nyood sague mee your sew fe\nnid 7,4\n& why the guilt? Ooviounty the Hecrety of your habe fam your wefe, weit dearly you love Also ihe sage: (rouble You Could\nwand up in, of you were CRUG and expomA. Neher w& chill. Ye, Mot to pity the dewt's advocate, Rave you conmiterad the\nposible negative consequences of adnathag thw truth? We all, Ten guessing, haww cut secretly Niet ve cnaybe a harhiore\nvie, at least Dy convermonal standards. What am I Dying to say here? Im net sure 1 guess | was Sutpreed Hen you sad\nThat you've been marctad to pour wile 10 years wud she doesnt hiow that you use math, and Im avercing, since you ware\n© math user when you first net her, she's eaveys known you, without being aware of 2, as ane. Seems ess dishonest or\nDinoyal ne oAcKtoRS, fry @ tongahot, than i you had parted using the drug ynace afer you ware cnamned, oF wher you'd had\nwivideen, [9 amy cay. pet to sound gills, but pachane what vhe denen? Know Wont hurl Mer. Seems to me that your newt\n1m Inve Right place so inng aa your drug use domes? sta:t ernating provlmmayand of yx enirenue to grantuaty cut bark une\nyou don’t uae anymore, which, f you could pun it off would ba asf you never ded. Than a yaar or we aher you've news\near #0 tong 5 ai! 18 wall im pansion, Broach the subject. T hope thar maser ridiculous advave\n? BY t:.8 = & > % 6\nCy Pet mime\not Ps Godan: Pes tteatinnd oXeeeal f\nRe Content ‘theelgefeat Ciankes Untormetion\nMemepous 4 About ie Flay exer\nse : 298.008 Mame\nenacts snsendenad 210,900 Nena RaAnaroer\nhaa 4 Ooamate\ntown soMetedonte\nKeconys Knnwteiton fate\nMede Satine Panaword\n\nRexorery tonrmels oy\n\nReviews « Wngister to Participate\nStes Site Bates\nwae, Ferme of Use\n\nConnect with os\n\n# x ©\n\n",
      "char_length": 9854
    },
    {
      "page_number": 22,
      "text": "From: Charlie Vids chuckdustin1 2@gmail.com\nSubject: Re: School Events\nDate: December 9, 2024 at 4:32 PM\nTo: Morgan Myers morganmw02@gmail.com\n\nMorgan,\n\n| only need you to put the bags outside on the days !'m able to see our daughters.\n\n| am fully aware of the girls school events, their obligations, and what she needs to do.\n\nGiven that you havent had the girls call on your own accord since the beginning, there's no need for you to contact me unless it's an\nemergency or if your intent is to start approaching this from an adult mindset and whats best for our kids, or if you actually plan to start\nfacilitating a relationship by encouraging contact.\n\nUntil then, I'm still pursuing relief and if | need any information regarding the girls | will contact the school or check their website.\n\n| will get them when | can.\n\nEvery 1st 3rd and 5th, and on Thursdays. If | won't be getting them on a Thursday, I'll let you know the day prior to ensure you are\nkept updated.\n\nEverything else is irrelevant.\nAlso, Mara missed school today and you forgot to mention it.\n\nI'll be getting the girls on Thursday depending on if | can get the suit filed against Dan. |'ll let you know here by Wednesday at 6pm if\nI'll be coming.\n\nThanks\n\nOn Mon, Dec 9, 2024, 4:07 PM Morgan Myers <morganmw02@gmail.com> wrote:\nKeeping you updated, since you still aren't able to see my messages in AppClose.\n\nMara has a few things coming up. This Thursday, December 12th, is the 3rd grade program. It's at the school at 6pm. She has a\nsmall speaking part. She also has a field trip to see the Nutcracker on Friday, December 13th. No chaperones needed, and her\nticket has already been paid for. They leave in the morning, and are back by 1pm.\n\nDue to the program, we need to make a plan for your Thursday visitation. If you still plan to pick them up from school, | will pack the\nclothes Mara needs to wear in her backpack so she can change. You will need to get her back to the school at 5:30. | will be there\nat 5:30 so | can fix her hair, if needed.\n\nShe also has a solar system project due on January 7th. Since the girls will be with you during most of the break, I'd appreciate it if\nyou made sure she spent some time working on it. There were multiple options for how she wanted to present it, and she chose\npowerpoint. Let her log into Canvas on any computer, and the tools she needs to complete it are there. I'll help her after she gets\nback home on the 28th. The info page for the project will be in her binder for reference.\n\nHere's the link for Canvas if you don’t already have it bookmarked:\nsslink.com/bisdtx\n\nThe holiday shop is going on this week at the school that the girls can shop at and buy gifts for family. If you want to send them with\nmoney, or shop with them during lunch, it closes mid-day on Friday.\n\nLastly, their class Christmas parties are next week. If you want to volunteer or provide snacks for the class, please email their\nteachers. | will not be able to attend due to work. Here are their teachers email addresses:\n\nriley.hamelwright@ birdvilleschools.net\n\nilleschools.net\n\n",
      "char_length": 3084
    },
    {
      "page_number": 23,
      "text": "From: Charlie Vids chuckdustin12@gmail.com\nSubject: Update\nDate: December 6, 2024 at 11:55 AM\nTo: Morgan Wilson morganmw02@gmail.com\n\nHey,\n\nThe federal case had posted.\n\nI'm sorry about what | said last night.\n\n| was angry and shouldn't have threatened CPS.\n\nJust please done leave the girls alone and talk to Caitlin about punishment.\n\nI'm reaching out to let you know the case has posted and you have 14 days to comply.\n| just want to make sure the process is fair for you and you're aware.\n\nOur case number is 4:24-cv-01185.\n\nI'm going to be filing suit against Dan seeking damages for the amount disclosed last email.\n\nAgain, sorry about CPS. | shouldn't have done that. We both know CPS is horrible.\n\nBut still.. | am very concerned about the kids.\n\nI'll be picking them up after school today and will bring them back Sunday.\n\nHave a good afternoon.\n",
      "char_length": 855
    },
    {
      "page_number": 24,
      "text": "From: Charlie Vids chuckdustint2@gmail.com @\nSubject: Re: AppClose\nDate: December 3, 2024 at 8:18 PM\nTo: Morgan Myers morganmw02@gmail.com\nCc: Cooper Carter coopercarter@majadmin.com\n\nHello,\n\nWhile | appreciate your transparency, it's interesting that you wish to follow the orders when convenient for you, however, refuse to\nhave our daughter call for multiple days around a critical time of year such as thanksgiving.\n\nAs far as your attorney, her authority has still not been proven, so it is unclear who is actually representing you.\n\nPage 2 of 2\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\n\nCooper Carter on behalf of Cooper Carter\nBar No. 24121538\ncoopercartergmajadmin. com\n\nEnvelope ID: 57578119\n\nStatus as of 9/24/2821 2:62 PM CST\n\nAssociated Case Party: KENYONBRIONCASSADAY\nName BarNumber Email TimestampSubmitted Status\n\nKENYON CASSADAY ocaisidegemail .com 9/24/2821 12:88:59 PM SENT\n\nThe above is a certificate of service by your attorney when she worked at Marx Altman and Johnson.\n\n2. As far as documentation, you have failed to respond to the discovery request served back on September 19th, 2024, which\nincluded admissions.\n\nWhen a party fails to respond to a request for admissions, the requests are deemed admitted \"without the necessity of a court order.\"\nTex.R.Civ.P. 198.2(c). Admissions of fact on file at the time of a summary judgment hearing constitute competent summary judgment\nevidence. Acevedo v. Comm'n for Lawyer Discipline, 131 S.W.3d 99, 105 (Tex. App.-San Antonio 2004, pet. denied); Mackie v.\nGuthrie, 78 S.W.3d 462, 468 (Tex. App.-Tyler 2001, pet. denied) (citing Tex.R.Civ.P. 166a(c)).\n\nThere is a pending summary judgement which is also unresponded to, filed and served on February 22nd, 2024.\n\nThis means that all admissions of fact will be admitted into evidence at the summary judgement hearing should the Federal District\nCourt for the Northern District of Texas remand the case for lack of jurisdiction.\n\nThe summary judgement hearing is the oldest motion on record, and will be the first motion scheduled for hearing if necessary on\nremand.\n3. As far as the orders are concerned, they also state the following:\n\n“That the marital address is 6641 Anns Court, which is not correct. This was pointed out prior to its rendition, and no amendment\nhas been filed.\n\n*That the parties must take the parenting class and file a notice of completion with the court, which you failed to do.\n\n*That the Petitioner receive exclusive use of the residency pending the divorce. In Pennsylvania, Texas, New Jersey, and most\nother states in the US, there’s an administrative order known as the status quo, which requires the soon-to-be ex-spouses to shun\nfrom disrupting the norm created throughout the length of the marriage. \"Exclusive\" - meaning excluding or not admitting other\nthings. By moving in your sister to the residence, you are not \"exclusively\" using the marital home with the children.\n",
      "char_length": 3261
    },
    {
      "page_number": 25,
      "text": "“That the Petitioner acquire healthcare for the children - there has been no indication that this has occurred.\n\n“That the Petitioner pay monthly rent costs to Margie Wilson. This has not been occurring as ordered as evidenced by\ndocumentation from Margie Wilson given in June of 2024.\n\n* That | agree to the orders, as evidenced by a signature that doesn't exist.\n\nYou can keep attempting to bury your wrongdoings and the reality of this situation, but until all of the above are followed, the texting\nover AppClose should be the least of your worries.\n\n| will be picking up the girls on Thursday after school.\nHave a good evening.\n| have CC'd your attorney for transparency and for my own documentation.\n\nOn Tue, Dec 3, 2024 at 6:28 PM Morgan Myers <morganmw02@gmail.com> wrote:\nGood evening.\n\nOur orders state that we are to exclusively communicate through AppClose. However, there are several messages in the app that\nhave not been opened for several days. Please check these messages at your earliest convenience.\n\n| have cc’d my attorney for transparency and documentation.\n\nMorgan\n",
      "char_length": 1088
    },
    {
      "page_number": 26,
      "text": "From: Morgan Myers morganmw02@gmail.com\nSubject: Fwd: A Final Reminder\nDate: December 10, 2024 at 1:39 PM\nTo: Roxanne Wilson lasher50@sbcglobal.net\n\nnreeenene Forwarded message ---------\n\nFrom: Charlie Vids <chuckdustin12@ gmail.com>\nDate: Thu, Dec 5, 2024 at 8:14PM\n\nSubject: A Final Reminder\n\nTo: Morgan Wilson <morganmw02@ gmail.com>\n\nMorgan,\n\nJust as a final reminder - here's the reality of damage you've caused yet remain completely silent on. None of this will just go away\ndespite your current set-up with the false sense of security granted to you by the court:\n\nMONETARY:\n\n1. Lost Income\n\nIncome at the start of the divorce: $4,600\n\nCurrent monthly income: $2,000\n\nMonthly income loss: $2,600/month and gaining.\n\nDuration of income loss: 12 months\n\nTotal lost income: $2,600 x 12 = $31,200 + forward looking losses\n\n2. Living Expenses\n\ne Airbnb costs (to remain near my daughters) for as long as possible: $14,000\ne Hotel Costs: $960.45\ne Total increased living expenses: $14,000 + $960.45 = $14,960.45\n\n3. Travel and Transportation Costs\n\ne Tolls for visitation and transportation to see daughters: $1,800\ne Car repairs caused by wife’s damage: $1,600\ne Total travel and transportation costs: $1,800 + $1,600 = $3,400\n\n4. Misappropriated Funds\n\ne Funds stolen from joint account by Morgan and Dan Branthoover: $1,576\n\n5. Business Opportunity Cost\n\ne Estimated lost revenue from business opportunities and advertisements: $46,000\n\n6. Legal and Related Costs\n\ne Legal fees and associated costs related to this situation: $3,000\n\n7. Emotional Distress\n\ne The financial and physical strain from being displaced, combined with the emotional distress of limited access to my\ndaughters, has caused significant emotional harm. A claim for emotional damages in the amount of $1,000 is being sought\nper month that this continues or until justification is provided.\n\nStart = March 6th, 2024.\ntoday = December 5th, 2024.\nAs of tomorrow, totaling to: $11,000\n",
      "char_length": 1957
    },
    {
      "page_number": 27,
      "text": "Total amount in emotional distress: $11,000\n\n8. Punitive Damages\n\nTo address and deter malicious or negligent actions. $50,000.\n\nTotal Damages\n\nLost Income: $31,200\n\nLiving Expenses: $14,960.45\n\nTravel and Transportation Costs: $3,400\nMisappropriated Funds: $1,576\nBusiness Opportunity Cost: $13,000\nLegal and Related Costs: $5,000\nEmotional Distress: $11,000\n\nPunitive Damages: $50,000\n\nTotal Damages: $123,136.45\n\nHow is this destruction what's best for our kids?\n\nCIVIL:\n\n1. | will be contacting child protective services to open an investigation for the foregoing:\n\na. reports of the children being hurt by Caitlin, grabbing their arms.\n\nb. the children being left home alone at night without an adult present.\n\nThis is inexscusable.\n\nCRIMINAL:\n\nConspiracy to Commit Fraud (Interstate Crime):\n\nOn December 14, 2023, you attempted to have me illegally removed from the marital home. This was not due to violence or\nany legitimate cause, but because | uncovered the unhealthy volume of communications between you, Debbie, and\nDamen, revealing your deceptive behavior and abandonment of marital responsibilities waived off as 'emotional support’.\n\ne Text records evidence daily, excessive correspondence with those two individuals, and other records prove a\n\"meeting of the minds\" with your grandparents and Dan Branthoover, who actively assisted you in defrauding the\ncourt.\n\no Interstate Travel for Fraudulent Purposes: You crossed state lines to recieve assistance in drafting falsified\npaperwork, directly causing my removal from the home. This constitutes interstate fraud and conspiracy, a\nfederal offense.\n\ne Your argument of \"emotional support\" is not believable especially given your infidelity in the past.\n\nDefrauding the Marital Estate:\nYou deliberately removed $1,576 from the marital estate under false pretenses. This theft was malicious, unjustified, and\ncompletely disregarded our children’s welfare around the Christmas holidays.\n\nFalse Indigence Declaration:\nYou misled the court by falsely claiming indigence, despite clear evidence that you had access to sufficient funds. This\nfraudulent act constitutes perjury, as it was intended to gain unlawful advantage through the court system.\n\nMalicious Conduct with Intent to Harm:\n\nYour actions were not isolated incidents but part of a larger pattern of calculated, malicious behavior designed to paint\nyourself as a victim while disregarding the truth and well-being of your family. These actions demonstrate a willful disregard\nfor legal, moral, and parental responsibilities.\n",
      "char_length": 2547
    },
    {
      "page_number": 28,
      "text": "Child Neglect:\ne Your actions demonstrate a willful disregard for the well-being of our children, including but not limited to:\n\n» Financial Neglect: You maliciously removed marital funds, depriving our children of basic financial support\nduring the holidays.\n\n» Emotional Neglect: Your preoccupation with deceptive actions and conspiracies left our children without\nthe parental stability and care they deserve.\n\n» Intentional Disruption: By orchestrating my removal from the home, you knowingly caused emotional\ndistress and instability to our children, prioritizing your fraudulent schemes over their needs.\n\nUnder Texas law, it is a crime to not report child neglect, so unless you are ready to start acting like an adult and address the\nabove,\nYou've destroyed the status quo of our children, and attempted to reduce me to a child support payment, which ultimately failed.\n\nYou have until December 13th, 2024 to either explain how all of the above are incorrect and provide details of how this situation is\nwhat's best for anyone. | will be contacting Child Protective Services regardless given the reports of physical abuse taking place.\n\nI'm not pursuing legal action against your attorney at this time given she was an unfortunate victim in all of this as well.\n\nThere's no amount of evidence or time that will absolve you of your actions. You must choose between right and wrong, or face the\nconsequences.\n\nIf the tables were turned, I'd never allow what has transpired to happen - even if | felt \"threatened\" by you.\n\nMake the call.\n\nCharlie\n",
      "char_length": 1552
    },
    {
      "page_number": 29,
      "text": "From\nSubject\n\nDate: January 31, 2025 at 4:48 PM\n\nTo\n\n: FUDSTOP chuckdustin12@gmail.com\n: Also\n\n: Morgan Wilson morganmw02@gmail.com\n\nHey,\nJust so you know - if you've been replying or sending me emails - | have you blocked.\n\nThe reason for this is you provide nothing for this co parenting relationship of value. You're just a toxic human being with no regard for\nanyone but yourself.\n\nYou aren't even aa parent anymore.\nWhat part of your brain thinks you're doing the right thing?\nYou realize you're still sleeping on the bed my mom gave us, so why haven't you thrown that out to the curb? Because you need it?\n\nOur kids have neither parent now. You're making less than | made before you destroyed everything, and you are doing EXACTLY what\n| said you would in the beginning.. using your grandparents just like you always have.\n\nThree reminders:\n\n1. | still live at 6641 Anne Ct, Watauga, TX 76148.\n\n2. We will not be divorced until you're held accountable by either the judges or a jury trial.\n\n3. You had an affair, got caught, and this is all a ruse to escape accountability.\n\nAttached will be the evidence showing that you took my personal property and threw it on the curb, clearly with anger.\nDespite all of this, | still pray for you each night.\n\nCya\n",
      "char_length": 1259
    },
    {
      "page_number": 30,
      "text": "From: Morgan Myers morganmw02@gmail.com\nSubject: Re: Stuff on curb\nDate: January 31, 2025 at 4:26 PM\nTo: FUDSTOP chuckdustin12@gmail.com\n\nAs stated in the temporary orders, | was given exclusive use of 6641 Anne Ct. There is no “community property”. That being said, it\nwill not be used as a storage location for your belongings. As a courtesy, | loaded all of your things into the Mazda3 that you left in the\ndrive way to stay out of the weather and protected, while not being stored in the house.\n\nWhen you took those belongings out of the car when you came to pick it up on January 30, 2025, it was then assumed to be\nabandoned property, and put on the curb for trash pick up this coming Tuesday, February 4th. You have an opportunity to collect your\nthings when you drop the girls off either with me or at school. Until then, they will be treated as abandoned property.\n\nAlso. If for any reason you aren’t able to pick up the girls from school on your scheduled days, contact me so | can make\narrangements. Do not contact my family again.\n\nThank you.\n\nOn Fri, Jan 31, 2025 at 4:19PM FUDSTOP <chuckdustini2@gmail.com> wrote:\nOn February 1st, 2024, | took an inventory of everything in the house that's mine.\n\n| know you feel entitled to everything, but you may not convert community property without my consent.\n\nKeep it up, digging your hole deeper.\n",
      "char_length": 1354
    },
    {
      "page_number": 31,
      "text": "From: Morgan Myers morganmw02@gmail.com\nSubject: Re: Stuff on curb\nDate: January 31, 2025 at 4:26 PM\nTo: FUDSTOP chuckdustin12@gmail.com\n\nAs stated in the temporary orders, | was given exclusive use of 6641 Anne Ct. There is no “community property”. That being said, it\nwill not be used as a storage location for your belongings. As a courtesy, | loaded all of your things into the Mazda3 that you left in the\ndrive way to stay out of the weather and protected, while not being stored in the house.\n\nWhen you took those belongings out of the car when you came to pick it up on January 30, 2025, it was then assumed to be\nabandoned property, and put on the curb for trash pick up this coming Tuesday, February 4th. You have an opportunity to collect your\nthings when you drop the girls off either with me or at school. Until then, they will be treated as abandoned property.\n\nAlso. If for any reason you aren’t able to pick up the girls from school on your scheduled days, contact me so | can make\narrangements. Do not contact my family again.\n\nThank you.\n\nOn Fri, Jan 31, 2025 at 4:19 PM FUDSTOP <chuckdustini2@gmail.com> wrote:\nOn February 1st, 2024, | took an inventory of everything in the house that's mine.\n\n| know you feel entitled to everything, but you may not convert community property without my consent.\n\nKeep it up, digging your hole deeper.\n",
      "char_length": 1355
    },
    {
      "page_number": 32,
      "text": "From:\nSubject:\nDate:\nTo:\n\nMorgan Myers morganmw02@gmail.com\nRe: Change of plans\n\nJanuary 22, 2025 at 5:38 PM\n\nFUDSTOP chuckdustin12@gmail.com\n\nYou're welcome to come pick up the Mazda 3 anytime. I'll leave the key outside.\n\nLease was re-possessed today by mazda.\nHave no way to come get the girls now.\n\nCya\n\n",
      "char_length": 308
    },
    {
      "page_number": 33,
      "text": "From: FUDSTOP chuckdustin12@gmail.com\nSubject: Reminder\nDate: January 22, 2025 at 4:42 AM\n\nTo\n\n: Morgan Wilson morganmw02@gmail.com\n\nI'll be getting the girls Thursday.\n\nAlso, just a reminder that we are still legally married, | still live at 6641 Anne Ct, Watauga, TX 76148, and it's been one year and six\ndays since this began.\n\nYou will need to start making plans for Caitlin to move out, and you may live with meme while | transition out.\nThat's your call.\nAll ill be doing is working and taking care of the kids while i find a nearby place, you can do what you want.\n\nI'm confident meme and papaw will be amicable for the kids as well.\n\nI'm only requesting ten months and that's extremely generous given the circumstances.\n\nCya\n",
      "char_length": 733
    },
    {
      "page_number": 34,
      "text": "From: FUDSTOP chuckdustin12@gmail.com\nSubject: Re: Maras Stomach\nDate: January 16, 2025 at 5:22 PM\nTo: Morgan Myers morganmw02@gmail.com\n\nIts the first thing she said when | picked her up.\n\nAlso, what you're doing with Damen is sickening.\n\nThey both specifically told me you're claiming we are divorced, that Damen is your new boyfriend, and that you kiss him in front of\nthem. Have you stopped to think about how this affects them? | didn't even ask. They brought it up because it makes them\n\nuncomfortable.. which any person with normal morals would understand.\n\n| mean.. gaslighting the kids now too? Really? We are not divorced.. and wont be until you're held accountable for what you've done..\nyou know this.\n\nThis just further showcases your complete disregard for their emotional well being and proves exactly what you swore up and down\nwasn't going on when | originally discovered the extent of your communication with Damen and Debbie.\n\nI'll keep you updated about Maras stomach, but wow.. truly disturbing behavior. What a class act you've found there.\nIts going to be interesting next time we are in court for sure given we haven't been since March 14, 2024.\n\nYou're either lying to Damen also about us being divorced, or you're just completely devoid of any typical human compassion and\nempathy.\n\nThis is where a jury trial will help, because nobody in their right mind would look at this situation and say that what's happened is in the\nkids best interests.\n\nMara just went to the bathroom so hopefully that's all it was.\n\nIf anything else comes up I'll let you know.\n\nOn Thu, Jan 16, 2025, 4:35 PM Morgan Myers <morganmw02@gmail.com> wrote:\n\nIe haard nathinn ahniit ctamach nain Che artitalhy hacn’t haan in anv nain at all far a Inna time naw Keen me iindated\n\n",
      "char_length": 1776
    },
    {
      "page_number": 35,
      "text": "BO IRE ERNE ASG AR REE AEE RAI ES SIR RA FUE CEE RY PE ER re Up,\n\nOn Thu, Jan 16, 2025 at 4:33 PM FUDSTOP <chuckdustin12@gmail.com> wrote:\n| picked Mara up and she immediately started complaining about her stomach,\n\nShe says this has been happening for two weeks.\nHas she told you anything about this?\nIf so, what have you been doing to treat it? Based on the description it sounds like cramps.\n\n| have her with a hot compress now.\n",
      "char_length": 432
    },
    {
      "page_number": 36,
      "text": "From: Morgan Myers morganmw02@gmail.com\nSubject: Re: Girls\nDate: January 20, 2025 at 7:03 PM\nTo: FUDSTOP chuckdustin12@gmail.com\n\nAre you bringing the girls home tonight or not? If not, they HAVE to be at school tomorrow. | need to know asap.\n\nOn Mon, Jan 20, 2025 at 2:33 PM Morgan Myers <morganmw02@gmail.com> wrote:\n| need to know when the girls will be home.\n\nOn Sun, Jan 19, 2025 at 8:10PM Morgan Myers <morganmw02@gmail.com> wrote:\nWhat time are you planning to bring the girls home tomorrow? | need to know because there’s a chance neither Caitlin or | will be\nhome. The tea room is open, so Caitlin will be working, and | will be at work from 8-5. Please let me know so | can plan with\n\nMeme and Papaw, if needed.\n\nOn Thu, Jan 16, 2025 at 11:25 AM FUDSTOP <chuckdustini2@gmail.com> wrote:\nNo. I'll get their bags tomorrow\n\nOn Thu, Jan 16, 2025, 11:23AM Morgan Myers <morganmw02@ gmail.com> wrote:\nNever mind, | don’t care. What | do care about is:\n\nAre you taking them to school Friday morning? And I’m assuming dropping them off at 6pm Monday? I’m at work until 5\ntoday, and don't have bags packed for them because this wasn’t discussed earlier. Would you be able to stay around the\narea until about 4 to give Caitlin time to back their bags?\n\nOn Thu, Jan 16, 2025 at 11:21 AM Morgan Myers <morganmw02@ gmail.com> wrote:\nHow are you sending emails with no internet?\n\nOn Thu, Jan 16, 2025 at 11:20 AM FUDSTOP <chuckdustin12@gmail.com> wrote:\nCan't. No internet here and my phone is disconnected.\n\nPlease reply in AppClose.\n\nOn Thu, Jan 16, 2025 at 11:07 AM FUDSTOP <chuckdustin12@ gmail.com> wrote:\nComing to get girls and will be keeping them through Monday morning.\n",
      "char_length": 1676
    },
    {
      "page_number": 37,
      "text": "From: FUDSTOP chuckdustin12@gmail.com\nSubject: | know what the orders say\nDate: January 12, 2025 at 1:24 PM\nTo: Morgan Wilson morganmw02@gmail.com\n\nYou have a one track mind.\n\nThe orders are void.\n\nMaybe you should get your attorney to prosecute your case.\n\nYour whole existence depends on these orders that you don't even follow and that you lied to obtain.\nIts truly pathetic.\n\nYou can't win this case. Period.\n\nThe longer you keep pretending, the worse it's going to be for all of us.\n\nlf only you could think for yourself we wouldn't even be in this spot.\n\nThink past the next 5 minutes and realize the reality of the situation you've created.\n\nThose orders are cookie cutter orders that are not in the best interests of our kids. They're in the best interest of you, which isn't a\nthing.\n\nGrow up and take the parenting class that \"tHe oRdeRs sAy\" maybe you'll learn something.\n",
      "char_length": 883
    },
    {
      "page_number": 38,
      "text": "From: FUDSTOP chuckdustini2@gmailcom @\nSubject: Service to Cooper / Research TX Platform Down\nDate: January 13, 2025 at 9:37 AM\nTo: Morgan Wilson morganmw02@gmail.com\n\nYou need to re assess yourself.\n\nTime is almost up.\n\n| gave you more than enough.\n\n| did what i needed to do for me. But what about you? What have you learned and accomplished in the last year?\nYour mind would be blown if you could only fathom what I've done in the last year.\n\nThe best part? | learned who you really are and that | don't need you, only them.\n\nCASE MEMO\nFINAL (2).pdf\n\n",
      "char_length": 554
    },
    {
      "page_number": 39,
      "text": "From: FUDSTOP chuckdustin12@gmail.com\nSubject: Also\nDate: January 12, 2025 at 10:36 AM\nTo: Morgan Wilson morganmw02@gmail.com\n\nWe need to seriously talk.\n\n| developed a trading algorithm that a company called tradytics wants to purchase to provide an initial line of equity for $1.6 million\ndollars after a 6 month testing period to power their upcoming products.\n\nI'm signing an NDA tomorrow at noon and won't be able to discuss any details after then.\n\nThat means in July they'll be read to close if everything goes well, and will extend the line of equity on a 2 year contract netting\n$800,000 per year minus taxes.\n\nThis is serious money that our kids and we could benefit from despite the divorce.\n\nI've been working nearly 20 hour days trying to survive in the current situation, they know about the divorce, and want it finalized\nbefore moving forward.\n\nAlso, if you're going to keep up this current narrative, I'm going to have to schedule depositions with you, Damen, and Debbie, and\nCaitlin with a court reporter somewhere in Tarrant county as soon as possible so | can get answers regarding the 16,500 text\nmessages exchanged from October 2022 to December 2023 and other matters. I'll serve you an official request through the EFM so\nyou'll have all of the details.\n\nIf | don't hear anything by Friday I'll have to issue subpoenas which I'd really prefer not to do.\n\nI've tried to contact cooper regarding this, but as always she never replies.\n\nI'd like to have it scheduled and done by the end of the week of the 20th, because | also have Dan's lawsuit to handle as well.\n\nThanks and have a good day.\n",
      "char_length": 1614
    },
    {
      "page_number": 40,
      "text": "From: FUDSTOP chuckdustin12@gmail.com @\nSubject: Context\nDate: January 12, 2025 at 11:00 AM\nTo: Morgan Wilson morganmw02@gmail.com\n\n10:58 BR & il sm WM A ull 29%\n\nBlotter > ° Pg\n\n“4 FUDSTOP\nwy\n\nFUDSTOP ALL OTHER PROS\nTotal Profit 1212.76 -117.94\nAverage Holding Period 0.2 4\nTotal Upvotes 4 0\nTotal Downvotes 0 0\nTotal Investment 270505.4 135829091.4\nAverage Profit per Trade 13.47511111 -11.794\nTotal Quantity Traded 1814 917682\nSentiment Distribution (Positive) 0 0\nentiment Distribution (Negative) 0\n\nBlotter\nlol you are keeping the blotter index alive, can't debate that &\n",
      "char_length": 577
    },
    {
      "page_number": 41,
      "text": "Pie # FuDsTOP\nge % we had unexpected economic data release today that made profit\n7am come protential tight.\n\nhoping to show you the full potential here soon\n\nBlotter |\n\nNothing to show honestly, | have full faith in what you've shown\nalready. Time to build some stuff together now. Very excited to see\nwhere it goes, keep me posted about how you feel about stuff,\nwhether we need to change anything, etc\n\nFUDSTOP\n\nAbsolutely, will do. I'm here whenever you need me as well. E WY\n\nseam\" = for the coming weeks\n\n+ 3 8\nHII <\n\n10:57 RM & il 3° m RS A: wll 29%\n\n> Blotter > © ee\n\n",
      "char_length": 576
    },
    {
      "page_number": 42,
      "text": "bullish | 2625-91-08\nhour bullish | 2025-01-08\nPAAS hour bullish | 2025-01-08 16\nPACW hour bullish | 2025-91-08 1\nPARA hour bullish | 2025-01-08 16\nhour | bullish 2025-81-08 1\nhour bullish 2025-91-08\nhour | bullish | 2025-01-08 16\nhour bullish | 2025-81-08 16\noversold hour | 2025-01-08\n| hour bullish 25-01-08\nhour | bullish 925~-01-08\nhour bullish 2025-01-08\nhour bullish | 2025-01-08\noversold hour bullish 2025-81-08\nhour bullish | 2025-01-08\nhour | bullish | 2025-01-08\nhour | bullish 2025-01-08\noversold hour 2025-01-08 1]\noverbought | hour | 2625-01-08\noversold | hour ; 2025-01-08\n| hour | bullish | 2025-01-08\nhour | bullish | 2025-01-08\nhour bullish 2025-01-08 leé\nhour bullish | 2025-91-08 16:42:5\nhour | bullish | 2025-01-08 :42:52\nhour bullish |} 2025-01-08 16:42\n\nir in ¢\nNR\n\nJ» ft\n\nS)\n\nno\nK\n\nu\n\nhI AG\n\nNO AO\n\nanon ow wn\n\nU\n2,NN BRO\n\non\n\nWy”\n\nwe would essentially distribute real-time strategies to employ the\ntrading that users can select from - which will query the\ncorresponding database based on their selection and find\n\nopportunities\n\nso this would be a slice of a strategy that we could mix with another\nstored in another database. they connect together when market\nconditions become available\n\nswrkhet_data=# select * from macd_rsi where sentiment is\n\nticker | status timespan\n\n+\n| oversold | hour\noversoid | hour\n| hour\n\n| minute\n\nminute\n\nminute\n\nminute\n\nminute\n\noverbought | minute\n\nmu\n| overbe\n\night | minute\n{ to\n\n",
      "char_length": 1439
    },
    {
      "page_number": 43,
      "text": "Blotter\n\nDo you think it makes sense to introduce only one strategy first? and\nthen once users start getting a hang of it, and we build our platform\naround it, we introduce a full portfolio of them?\n\nFUDSTOP\n\nabsolutely, and i have just the one!\n\nor if there are any youd wanna go with too, whichever is good with me\n\njust so long as they work\n\nBlotter\nyep you decide it, my only 2 cents would be that it needs to be\nof a day trade because people get to see their profits and it ci\n\nmore virality\n\n",
      "char_length": 498
    },
    {
      "page_number": 44,
      "text": "ce 2 Blotter > , & ae\n\nBlotter\n\n| wrote a msg and then my browser refreshes lol, let me write it again\n\nHere are some concrete things | have in my mind.\n\n| can put an X amount in a portfolio, and we trade it with your\ntrades. You keep 30% for now (happy to change this number), and\nincur any losses.\n\n10% of ALL blotter revenue goes to you for the next 6 months, we\ncan revise the number after that (revenue is not that much right\nnow just FYI :P, but we can work together to increase it)\n\nWe do a trading session with Tradytics 100k community every\nweek or two, and help traders learn to use data. This will allow us\nto merge FUD, BLOTTER & TRADYTICS. We just have to make sure\nthat we're using all three tools to showcase the impact so that we\ncan have users everywhere.\n\nYou get a dedicated section in blotter's discord and tradytics\ndiscord (you and strong) for questions, teaching etc.\n\nLet me know if there are things you'd like changed/added/removed\n\nAnd ofcourse add live trading on top.\n\nlf you know Umar Ashraf, he's a good friend, and is willing to invest in\n\nBlotter. If things take off, we can have him onboard as well\n\nFUDSTOP\n\nThis is great. Lemme process this for a minute but I'm willing to do\n\n",
      "char_length": 1212
    },
    {
      "page_number": 45,
      "text": "what's needed of me, and provide what's needed to make it work.\n' ©\n\nBlotter\n\nTake your time, discuss with strong as well since i'd love to have you\nboth. | can't let go of the thought that stocktwits has 5 million users\nand is almost unusable at times. There's a huge opportunity in the\nsocial media space that no one is targeting.\n\nOne final thing, I'd be happy to offer some equity as well but | p\natleast 6 months for that, still learning all kinds of legalities a WV\ngiving equity, and similar things.\n\n10:57 BR & il) s° me RX A ull 29%\n\nGa\n\nBlotter > © ones\n\nBlotter\n\nyep you decide it, my only 2 cents would be that it needs to be more\nof a day trade because people get to see their profits and it creates\nmore virality\n\nyou are the trading guru here! i'm the product manager &\ne' ©\n\nFUDSTOP\nyeah these wont be instant snipers, more or less day-swingers but\nwill be provided with intra-day instructions\n\n",
      "char_length": 911
    },
    {
      "page_number": 46,
      "text": "| 4\nf\n\nae\n\nBlotter\n\nwe want to get to a stage where there's minimal work at users end,\nand once the market is over, they see 1-2% profits (i know a bit\nunusual but atleast for targeting). That is what will sell the platform\n\nlike crazy\n\nand we must do options\n\nFUDSTOP\n\noverall win rate is 81-85%.\nyeah i agree man.\n\ndefinitely options\n\nBlotter :\n\nlove it! let me start working on the tradier part. please do spend some\nmore time on the legal side. what happens if we miss a trade's exit\nand the user incurs a bit of loss, can they sue? i know we will have\n\n\"af\n\n",
      "char_length": 563
    },
    {
      "page_number": 47,
      "text": "From:\nSubject:\nDate:\nTo:\n\nFUDSTOP chuckdustin12@gmail.com\nPhone off\n\nJanuary 8, 2025 at 3:24 PM\n\nMorgan Wilson morganmw02@gmail.com\n\nJust letting you know my phone got cut off.\n\nNot sure when I'll be able to get a new one.\n\nCharlie\n\n",
      "char_length": 233
    },
    {
      "page_number": 48,
      "text": "From: FUDSTOP chuckdustini2@gmail.com\nSubject: Thursday\nDate: January 7, 2025 at 4:48 PM\nTo: Morgan Wilson morganmw02@gmail.com\n\nDue to the possibility of inclement weather, | don't think it would be safe for the girls to come all the way out here and potentially get\nstuck.\n\nl'll keep an eye on the roads between now and then.\n\nAs far as the Divorce.. not sure what you're doing, but we're just wasting time. I'm really running out of patience here. Might as well\njust be an adult and deal with what we need to deal with sooner than later.. because it's coming whether you like it or not, and whether\nit takes two years, five years or ten, we can't move forward until we deal with what we need to deal with.\n\nOne day, I'll be back in the home we built our children's lives in.. where all my stuff is, my kids are, and what | need to provide for\nthem. Same song and same dance. That was our matrimonial home since day 1, and it would be a lot easier for everyone if you would\nput your fake new life with Damen on hold for a minute so we can take care of business, | can be given time to fix this and transition\nNEAR-BY the kids, and we can move on.\n\nYou can't just take all of that away from someone because you feel entitled to it. What if the same happened to you? How would you\nfeel?\n\nAnyways,\n\nBye\n",
      "char_length": 1302
    },
    {
      "page_number": 49,
      "text": "From: Cooper Carter coopercarter@majadmin.com @\nSubject: FW: New information CL-12105\nDate: November 24, 2025 at 10:58 AM\nTo: Cooper Carter attorneycoopercarter@gmail.com\n\nFrom: Morgan Myers [mailto:morganmw02@gmail.com]\nSent: Monday, December 9, 2024 1:00 PM\n\nTo: Cooper Carter\n\nSubject: Fwd: New information CL-12105\n\n---------- Forwarded message ---------\n\nFrom: Charlie Vids <chuckdustin12(@gmail.com>\nDate: Mon, Dec 9, 2024 at 12:56 PM\n\nSubject: New information\n\nTo: Morgan Wilson <morganmw02(@gmail.com>\n\nMorgan,\n\nSo at the start of case, you not only traveled across state lines to receive assistance in filing\nfraudulent paperwork to secure an advantage in the divorce, made false allegations leading\nto the destruction of our kids status quo, but you went as far as claiming the case was\nuncontested?\n\nIn what universe did you think you would get away with this?\n\nI've requested the affidavit of inability you filed, and if it comes back with fraudulent\nstatements such as claiming the girls as dependants or fabricating my income and your\nfinancial obligations or my financial obligations, I will be contacting local law enforcement\nbecause this is atrocious and blatant criminal activity.\n\nI've already verified dmb575 is Dan's paypal.\n\nYou really need to start thinking about the big picture here Morgan.\n\nT pe Vi\nSELF REPRES LIT NT WIT H\n\nTHE COURT REQUIRES YOU SUBMIT A COPY OF YOUR PAPERWORK TO THE DRO ON THE 2°”\nFLOOR OF THE FAMILY LAW CENTER OR AT DRO-Leeal@ untytx.cov\n\nAn attorney employed by Tarrant County will review your paperwork. This process will ensure that the form of your order\nmeets the sia s standards. The attorney does not represent you or your spouse. The attorney will not give you legal advice.\n\nThin netnmnnes etl infaews wines Af the naaliaian and nenfasannan Af tha Mase ad eeri TTD wrenel eeth arnce tan omaat the anuet to\n",
      "char_length": 1865
    },
    {
      "page_number": 50,
      "text": "AMG GLAD Y Whats sesaueeiee Yu wa Lae prviiwvise GMM PICISICULCS VL LER RAUUAL GLE WT ELE WHER Yates TVS Ws) AUSE FEY BOD @\nexpectations. Providing information does not constitute an attomey client relationship between you and the DRO. You may\nseek independent legal counsel at any time. You may also consult www.texaslawhelp.org for legal information. By signing\n\nbelow, you acknowledge the rposg of this service to the court and understand the instructions as outlined below.\nPetitioner’s Signature : Date:_(2 (18 (202?\n\nPhone Number (£17) A40 - 0&8S2 Cause No._222 7144 243 23\n\na: SS &\nORE YOU SEND IN THE PAPERW U_MUST HESE TH. :56 =\n— et we\n1) Show the Court that the other party has notice of the lawsuit by cither: Ee bi) i\n\na. Getting the other party to sign, notarize, and file a Waiver of Service with the Court, OR\nb. Getting the other party to file an Answer with the Court, OR\nc. , Getting the other party formally served with the paperwork by cither:\ni. Getting the constable or a private process server to serve the other party, OR\nii. Getting the Court to approve a method of alternative service, and then proving to the Court that you have\nfulfilled the requirements for that alternative service,\n\nNote If you serve ae spouse by — there are many steps that must be completed. Please see\n\n2) Complete the mandatory waiting period before cubmitting your final paperwork.\na. In divorce cases, you MUST wait 60 days after you filed the petition.\nb. In other default cases, you may have to wait 27 days after service was completed.\n\nWHEN YOU SEND IN THE PAPERWORK, DO THESE THINGS:\n\n1) Leave a completed Final Order on 2% floor of Family Law Center or email to DRO-legal@tarrantcountytx.gov\n\n2) Include a possession schedule, You can find templates at texaslawhelp.org.\n\n3) Include an Austin Form.\n\n4) Include a signed copy of this document with your case information on it.\n\n5) Include a copy of any prior orders involving the children.\n\n6) For default judgements, include proof of service as filed with the court, a signed Certificate of Last Known Address,\nand a signed Military Status Affidavit.\n\n7) Ifyour case involves child support, include both a completed Record of Child Support and Income Withholding Order.\n\n8) Only scanned copies will be accepted. Photos of the paperwork will be rejected.\n\na\nAFTER YOU SEND IN THE PAPERWORK: An attormey or Legal Support Officer will contact you in around 10 days\n\nto start the review. After the review is complete, the attomey will forward your paperwork to the judge for approval or give\nyou further instructions on how to present your paperwork to the Court.\n",
      "char_length": 2621
    },
    {
      "page_number": 51,
      "text": "From: Cooper Carter coopercarter@majadmin.com @\nSubject: FW: You're going to have to explain yourself eventually CL-12105\nDate: November 24, 2025 at 11:06 AM\nTo: Cooper Carter attorneycoopercarter@gmail.com\n\n---------- Forwarded message ---------\n\nFrom: Morgan Wilson <morwil3 |(@gmail.com>\n\nDate: Sun, Sep 29, 2024 at 5:51 PM\n\nSubject: Fwd: You're going to have to explain yourself eventually\nTo: <morganmw02@gmail.com>\n\nSent from my iPhone\n\nBegin forwarded message:\n\nFrom: Charlie Vids <chuckdustin!2@gmail.com>\nDate: September 29, 2024 at 12:11:50 PM CDT\n\nTo: morwil31@gmail.com\nSubject: You're going to have to explain yourself eventually\n\nMorgan,\n\nWhen you first announced your desire for a divorce, you told me that you had a\nplan in place.\n\nYou said the marriage was destroyed because of how I talked to you and\nassured me that the girls’ lives wouldn’t be worse, just “different.”\n\nYou insisted there were no affairs, and that this decision was in the best interest\nof the kids. But then you dismissed over 16,000 texts between Debbie and\nDamen as “emotional support\" and brought Damen around our children daily.\n\nHe’s been telling my children good night, acting as though he belongs in their\nlives after I was removed.\n\nYou promised stability for the girls, but all I see is chaos. You’ ve introduced\nsomeone into their world who doesn’t belong, and their security has been\nshattered. Everything you've done since then contradicts your original reasons.\n\nYou then proceeded to create a false narrative of protection. You changed\nphones, got this second email, and got mace.\n\nThis was never about what’s best for the kids—it’s about your priorities, and\nsadly, they revolve around everyone except our family.\n",
      "char_length": 1717
    },
    {
      "page_number": 52,
      "text": "You've reduced your own employment, made no effort to find full-time work,\nand continually put your selfish agenda ahead of the kids’ well-being.\n\nYou claim to have an attorney, yet she only surfaces to ambush me in court. You\njustify your actions because you can’t think for yourself—you’ve let others, like\nDebbie and Damen, dictate your life and decisions. They’ve injected\nthemselves into our family’s situation without understanding or caring about the\nconsequences, and then you hire an attorney who has never had children and\nshares the same flaws: no communication and can't think for herself (compelled\nby Kaitcer to represent you)\n\nFor years, you took advantage of me—never carrying your weight, always\nputting everything else above the kids.\n\nYou used to be a great mom, but since Debbie and Damen entered your life,\nyou've become someone entirely different.\n\nYou blame me for everything, but the evidence tells a different story.\n\nYou cling to false allegations of violence and drug use, bringing them up only\nwhen it benefits you. If these concerns were real, you would’ve acted long ago.\nAnd if you weren't hiding something, you wouldn't be telling Mara things like,\n“you still love me deep down inside\", which only confuses them further. You\nshould listen to your heart, because that's the only good thing I've heard from\nyou since this all started.\n\nYou're hurting and confusing our children. You’ve destroyed the work I\ndedicated countless hours to build for them, and you have neither the ability nor\nthe ambition to replace it. You’re doing exactly what I feared—treverting to\nsomeone who relies on her grandparents and uses those around her. But this\ntime, it’s not just about you—your decisions are directly impacting our\nchildren’s future.\n\nYou don’t help them with school. You don’t take them anywhere fun. You\nconsistently prioritize your friends, Debbie and Damen, over the kids, who are\nleft feeling neglected. You point fingers at me, but your actions have left a trail\nof destruction.\n\nWhen I’m nearby, Damen suddenly disappears. You think you're covering up\nyour actions, but I know the truth. I've known the truth this entire time. You’ve\ndone all of this to hide your own mistakes, including extramarital affairs, while\ngaslighting me—the only person who ever tried to provide for you—into\nbelieving everything was fine.\n\nYou lie and deceive both your family and the court to avoid being held\naccountable, and you think you hold power because of the court’s errors and\nyour attorney’s personal connections.\n\na w° 4 94 on | at ‘ 1 1 Fs 1 sc 1 4\n",
      "char_length": 2575
    },
    {
      "page_number": 53,
      "text": "you dian I even take tne court-orderea parenung Class, wnicn proves you aon t\ncare about the kids. If you did, we wouldn’t be here. You’d own up to your\nmistakes like an adult, not place the blame on me while running from\naccountability like a child.\n\nThe statute of limitations is running out to protect myself against the actions\ntaken against me, and I’ve been more than patient. I've been taunted by Dan\nwho says egregious things like he's been \"thoroughly enjoying watching me get\ndenied\", and your own grandmother has called expressing her concerns about\nthe kids and that \"you're not acting like yourself.\"\n\nYou can’t undo the damage you’ve caused, and one day the kids will see it all.\nThey already tell me how you never spend time with them, how you're always\non the phone with friends, and how they’re constantly pawned off on your\ngrandparents.\n\nWho are you? You're becoming the person you always said you'd never be.\n\nI'll always give Morgan a chance, but this isn’t you. Your complete lack of\ncommunication is inexcusable. You got what you wanted by lying, and now you\nthink you can reduce me to nothing more than a child support payment and live\nyour new fantasy with Damen.\n\nWhen will you understand that I will never stop fighting to protect our children\nand secure their future?\n\nYou, on the other hand, are lost, and will have to explain to these girls one day\nwhy you chose to destroy their family at such a critical time of year and without\never providing any real answers, only introduce a new figure into their life as a\nreplacement for their Father.\n\nBut you know what? Despite all of this.. I still love you. And I'm sorry for\neverything I did regarding the marriage. And no, not somewhere deep down.\nStill strong on the surface of my heart. These words come from there and\nnowhere else.\n\nThe critical difference is what you've done here is unrepairable on your own.\nIt's a total disregard for the last decade of effort. You need my help fixing what\nyou've damaged.\n\nThe point is - if I'm able to go through all of this - and still be here and am able\nto realize that there's a better way for our kids than the current path.. why can't\nyou?\n\nThe world doesn't have to know.\n\nYou married me for a reason Morgan, the same as I did you.\n\nWialtern had nase taaian hanst nn Aann Atraewrrann Onn thing ta Faw anetaine vin intl all\n",
      "char_length": 2349
    },
    {
      "page_number": 54,
      "text": "Wo VO lidu VUL ISNDUGdS, VUL DY UUODS CVOLyyune, Vue Lillie Id LUL UCLLAILLI. up UllLil all\nof this started - we provided a perfect life for our kids.\n\nBut your fantasy world is more important now and it's sad to see.\nYou blamed me for the marriage, but whos' fault is it now? Is it still mine? Have\nyou tried putting yourself in my shoes, or the kids' shoes? Doing so makes the\n\ncurrent situation anything but logical. It's sickening.\n\nWe all make mistakes. That doesn't mean we can destroy everything so we may\nrun away from them.\n\nThat doesn't mean we tell our kids that their vacations weren't good.\n\nIt's not too late to turn this around, but we're running out of time.\n\nYou're going to have to explain yourself eventually, and to the kids as well. Will\nyou lie to them, too? Because again, the evidence tells a different story, and\nwhen they are old enough to think for themselves, they'll see it clearly.\n\nThe only people who don't are the ones you associate with, your attorney who\ncan't follow the law, and the judges who got caught condoning this behavior\n\nwhen I fired Dan Bacalis.\n\nThere is no legal basis to justify the current arrangement, and it will inevitably\nbe corrected. Each day you allow yourself to go by is another day the kids lose.\n\nIt's time to grow up, Morgan. You're almost in your mid 30s, and expect a\nlifestyle that was afforded to you by the Husband you discarded like trash, lied\nto, and cheated on multiple times.\n\nThe reality you see around you now is the stability that's lacking which was\nprovided by my efforts to support you and the kids. You expect that same level\nof stability and support while depriving me of my vehicle to make it happen,\nand this can't change until time is given.. no matter how much time passes.\nAnd yet, again, I still love you.\n\nThat's how I know I'm going in the right direction.\n\nPlease wake up. These kids only have one childhood.\n\nAll I know is that at the end of the day - I can tell our children I did everything\nin my power to ensure that their future was protected.\n\nCan you say the same?\n\nYou can't fix this. I can't fix this.\n",
      "char_length": 2101
    },
    {
      "page_number": 55,
      "text": "We can fix this.\n\nNobody else can.\n\nWhether we're married or not. For our children.\nBesides, what's the end goal here?\n\nThe bubble you're currently living in May support your decisions. Will the\nworld?\n\nI've rejected 4 media interviews because #1 you know 1 hate that shit, and #2\nout of respect for your privacy.\n\nPeople are interested in this story. Not because of the things leading up to it -\nbut because of what's happening in the court given Tarrant county has been\nknown for abusive practices in family law.\n\nI'm interested in my kids future.\nPeriod.\nThis is my last attempt to get through to you.\n\nI've done all I can, and I'll be able to prove it to the kids when they're older and\nhave questions that I tried my very hardest.\n\nCASE\nMEMO...UM. pdf\n",
      "char_length": 757
    },
    {
      "page_number": 56,
      "text": "From: Charlie Vids chuckdustin12@gmail.com\nSubject: Re: Federal Removal to the Northern District of Texas\nDate: November 26, 2024 at 10:25 AM\nTo: Morgan Wilson morganmw02@gmail.com, Cooper Carter coopercarter@majadmin.com\n\nDue to the size, | couldn't send via email.\n\nropbox.com/scl/i/efgpijels\n\noom50é&di=0\n\nRegards,\n\nCharlie\n\nOn Tue, Nov 26, 2024, 10:23AM Charlie Vids <chuckdustin1 2.@gmail.com> wrote:\nApologies,\n\nThe full exhibit is attached below for your review.\nCharlie\n\nOn Tue, Nov 26, 2024, 10:15AM Charlie Vids <chuckdustini2@ gmail.com> wrote:\nGood morning,\n\nToday, case number 322-744263-23 has been removed to the Northern District of Texas via certified mail.\n\nUpon acceptance by the clerk of the court, a copy of the removal will be filed via the electronic filing manager approved by the\nTexas Supreme Court with the State court and served in accordance with Tex. R. Civ. P. 21(a).\n\nRespectfully,\nCharles Dustin Myers\n817-507-6562\n\nchuckdustini2@gmail.com\n6641 Anne Ct, Watauga, TX 76148\n\nExhibit Ais attached to this email.\n",
      "char_length": 1042
    },
    {
      "page_number": 57,
      "text": "From: Morgan Myers morganmw02@gmail.com @\nSubject: Fwd: Certificate of Conference - Temporary Orders\nDate: September 26, 2024 at 1:42 PM\nTo: Cooper Carter coopercarter@majadmin.com, Victoria Weaver victoriaweaver@majadmin.com\n\nCharlie\n\nNew message\n\nAlso | won't be able to get them on\nThursdays after this week due to\ndistance.. and won't be able to take\nthem to school on Mondays.\n\nTried staying around here as long\nas i could but can't sustain.\n\n| sent you a certificate of\nconference for temporary orders\npursuant to the local rules ina\ngood faith effort on Tuesday.\n",
      "char_length": 570
    },
    {
      "page_number": 58,
      "text": "I'm filing it with the Court at 3:50\nom and won't be serving it to you\nuntil 10 days before the hearing as\nI'm requesting it be granted\nwithout notice and hearing given\nthe circumstances and whats\ntranspired over the case regarding\nthe disregard for procedural rules\nand the damage that's been done.\n\nI'm requesting the court strike all\npleadings prior to January 22nd, AF\n2024 other than the rule 12 motion\n\nCharlie\n\n",
      "char_length": 418
    },
    {
      "page_number": 59,
      "text": "TODAY\n\nI'm requesting the court strike all\npleadings prior to January 22nd,\n2024 other than the rule 12 motion\nto show authority and the summary\njudgement, and am asking for a\nreasonable amount of time to\ntransition which is what I've asked\nfor since the beginning.\n\nNot requesting any injunction or\ncustody determinations until a\nhearing on the merits can be held,\nand im requesting the court\ndispense with the necessity of a\nbond on behalf of the kids and on\nbehalf of us to preserve the status\nquo that's been destroyed without\na second thought.\n\nNothing against you just gotta do\nwhat | gotta do for the kids since\nnobody wants to communicate and\n",
      "char_length": 651
    },
    {
      "page_number": 60,
      "text": "Cri a Se SV ee J eS ee RAL INA UITEINY VV EN!\n\nthe status quo some time to be\nreset.\n\n| have all financial documents and\naffidavits needed and have several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n\nI'm also invoking laches doctrine\nwhich prevents any new claims that\nweren't served or disclosed before\nfrom being brought up due to\n\nrinraacnanahla alalay: and tn nroaviant\n",
      "char_length": 592
    },
    {
      "page_number": 61,
      "text": "pretends like the current situation\nis what's best for them.\n\nlam requesting a temporary\nrestraining order for 14 days Vv\n\n« Charlie\n\n| am requesting a temporary\nrestraining order for 14 days\npreventing anyone from taking the\nkids out of the house while the\ncase is pending and preventing the\nPeace from being disturbed during\n\ntha rAaACO\\AITN narind and allaws far\n",
      "char_length": 366
    },
    {
      "page_number": 62,
      "text": "allidavits needed and nave several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n\nI'm also invoking laches doctrine\nwhich prevents any new claims that\nweren't served or disclosed before\n\n©\n",
      "char_length": 404
    },
    {
      "page_number": 63,
      "text": "trom being brought up due to\nunreasonable delay and to prevent\nfurther disruption regarding\ntransitioning from the home.\n\nJust communicating this to you ina\ngood faith effort as required by the\nrules in case you didn't get the\nemail.\n\n4.Q%° A DRA\ni,t.“ VI\n\nA\n\nAttaching these screenshots to this thread since he is speaking about the same email below. | just received this message from Mr\nMyers a few minutes ago.\n\nsoneecenee Forwarded message ---------\n\nFrom: Morgan Myers <morganmw gmail.com>\n\nDate: Tue, Sep 24, 2024 at 6: 15PM\n\nSubject: Fwd: wanigeinoane of Conference - Temporary Orders\nTo: Cooper Carter <coopercarter@ majadmin.com>\n\nGood evening!\n| just saw this email from Mr Myers. | don’t plan on responding, unless you think there’s something specific | should say. | obviously do\nnot agree to his terms. Would it be best to let the 48 hours run out and force his hand to make a motion? Would that work the same\n\nway as if he were to schedule a hearing for the Rule 12?\n\nThank you!\n",
      "char_length": 993
    },
    {
      "page_number": 64,
      "text": "From: Charlie Vids <chiuckaustini 2 gmail.com>\nDate: Tue, Sep 24, 2024 at 3:47PM\n\nSubject: Certificate of Conference - Temporary Orders\nTo: Morgan Wilson <morganmw02@ gmail.com>\n\nMorgan,\n\nPursuant to Tarrant County Local Rule 4.01(10)(b) and in accordance with the provisions of the Texas Family Code, this\nletter serves as formal notice of Respondent's intent to file for temporary orders with the Court on 09/26/2024. This communication\nconstitutes a good faith effort to resolve the matters at hand without necessitating judicial intervention.\n\n1. Residency and Custodial Arrangements\n\nThe Respondent will not seek an injunction for exclusive use of the residence during the recovery period, as the primary\nconcern for maintaining the residency is based on financial necessity rather than any intention to deprive you of your home or\naccess to the children. The Respondent will request primary joint conservatorship during the recovery period to protect the status\nquo of the children. This arrangement will remain in place until Respondent is able to secure alternative housing in close proximity,\nshould you choose to waive the option of cohabitation, as described below, to ensure the children remain in their home during the\ntransition.\n\n2. Business Losses and Financial Impact\n\nThe abrupt exclusion from the residence has significantly hindered Respondent's ability to operate his business, resulting in a\n41% loss of clientele and a 50% decrease in revenue. This not only affects Respondent's financial stability but also impedes the\nability to support the minor children.\n\nTo remedy this, the Respondent will demand a recovery schedule that grants 1.25 days for each day of missed parenting\ntime and property deprivation. This is to address not only the lost time with the children but also the financial losses incurred due to\nthe combined actions of your attorney and the trial court which stemmed from your initial pleadings. You may remain in the residence\nduring this period; however, if this arrangement proves impractical or undesirable, Respondent will petition the Court for primary\nconservatorship under Texas Family Code § 156.101, thereby modifying the current custodial order to reverse the conservatorship\nroles.\n\nUpon your response, Respondent will furnish documentation substantiating these losses, including financial statements, client\ntermination records, and revenue reports, in compliance with Texas Rules of Civil Procedure Rule 194 regarding disclosure of\ninformation.\n\n3. Validity of Current Temporary Orders\n\nGiven that the current orders have been filed by an attorney potentially lacking proper authority to represent you, they potentially\ncontravene Texas Rules of Civil Procedure Rule 12 and the Texas Disciplinary Rules of Professional Conduct. Furthermore,\nRespondent was not served with any supporting motion as mandated by Texas Rules of Civil Procedure Rule 21a, and the orders\nwere entered as \"agreed\" despite Respondent's prior withdrawal of consent, rendering them voidable under Texas precedent.\n\nGiven these procedural deficiencies, the ongoing appeal to the Supreme Court of Texas, and the question of authority regarding\nyour attorney - there exists a substantial likelihood that the current temporary orders may be declared rightfully void ab initio, which will\nrequire new orders be put in place. Respondent seeks to address and rectify this matter amicably, without further court involvement\nwith orders that truly suit the children's best interests.\n\nThe rushed nature of the decisions made here now have wasted an extraordinary amount of time, and Respondent believes\nthe terms of these orders are the quickest way to a final decree of divorce at this time.\n\n4. Financial Support Obligations\nTo promote the welfare of Mara and Caroline during the recovery window, Respondent agrees to:\n\n- Resume payment of $800 per month in rent for the marital residence to Margie Evonne Wilson and will seek a temporary injunction\nenjoining her from harassing, threatening, or otherwise disturbing the peace of the Respondent or the Children during the recovery\nperiod.\n\n- Assume financial responsibility for both vehicles, including payment for associated insurance and Respondent's phone services.\n- Secure health insurance coverage for the minor children.\n\n- Cover 100% of all medical, dental, and psychological expenses incurred on behalf of the children.\n\nThe Respondent will further seek that the court requires child support payments amounting to 10% of your net monthly income during\nthe recovery period.\n\n5. Damages Incurred\n\nTa dain Mannan dant BAR TAAL een ab damn nnn bate e BAN FAN 2222 ARH.\n",
      "char_length": 4647
    },
    {
      "page_number": 65,
      "text": "1U Udie, MESPVUCIIt tad HiGuireu Udlliayes ULAHIY 9v94,90Y, tI ICUINIpasoiliy.\n- Business losses due to decreased clientele and revenue.\n- Additional living expenses stemming from the change in residence.\n- Other related costs directly associated with the current situation regarding the ability to exercise visitation with Mara and Caroline.\n\n- Detailed documentation supporting these damages, including expense reports and financial records, will be provided upon your\nresponse for purposes of transparency and potential restitution.\n\n6. Request for Temporary Injunction\n\nThe Respondent will seek a temporary injunction to preserve the status quo and protect the financial interests of the minor\nchildren during the recovery period. Respondent will request that the Court waive the requirement of a bond under 105.001(d) of the\nTexas Family Code for the welfare of Mara and Caroline given that the injunction aims solely to safeguard the welfare of the children.\n\n7. Next Steps and Request for Response\n\nIn light of the pending Rule 12 motion challenging the authority of your current counsel, Respondent is directing this correspondence\nto you personally. You may forward this correspondence to Ms. Carter if you deem necessary.\n\nUpon your response, Respondent is prepared to provide all relevant documentation and answer any questions pertaining to:\n- The calculated damages and financial losses incurred.\n\n- The loss of clients and revenue impacts.\n\n- Any other pertinent information necessary for the resolution of this matter.\n\n- The need for the residency\n\n- The logistics moving forward\n\nRespondent remains committed to reaching an equitable and swift resolution in the best interests of Mara and Caroline, in accordance\nwith Texas Family Code § 153.002. The current trajectory must be reassessed, and this is another opportunity to do so.\n\nIf no response is given within 48 hours, or if no meaningful conversation can be obtained, | will be filing the Motion for Temporary\nOrders with the court.\n\nDespite the damage done, that doesn't mean that things can't begin to turn around for Mara and Caroline's sake.\n\nAfter the recovery, we can revisit custody arrangements and visitation schedules to determine what's best for all parties once an\nalternate residency is secured to preserve the financial stability of the children.\n\nPlease provide a written response within 48 hours of receipt of this letter. Failure to respond will compel Respondent to proceed with\nfiling the motion and to certify to the Court that reasonable efforts were made to resolve these matters without judicial intervention, as\nrequired by Tarrant County Local Rule 4.01(10)(b).\n\nBest,\n\nCharlie\n\nCharlie\n\nae\n\n",
      "char_length": 2690
    },
    {
      "page_number": 66,
      "text": "TODAY\n\n|am requesting a temporary\nrestraining order for 14 days\npreventing anyone from taking the\nkids out of the house while the\ncase is pending and preventing the\nPeace from being disturbed during\nthe recovery period and allow for\nthe status quo some time to be\nreset.\n\n| have all financial documents and\naffidavits needed and have several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n",
      "char_length": 603
    },
    {
      "page_number": 67,
      "text": "I'm also invoking laches doctrine\n\nwhich prevents any new claims that\nweren't served or disclosed before\n\nfrom being brought up due to L\n\nbArAacaAnahia aAnlay ann tan nmroiant\n\n))\n\nCharlie\n\n©\n\nNew message\n\nAlso | won't be able to get them on\nThursdays after this week due to\ndistance.. and won't be able to take\nthem to school on Mondays.\n",
      "char_length": 339
    },
    {
      "page_number": 68,
      "text": "Tried staying around here as long\nas i could but can't sustain.\n\n| sent you a certificate of\nconference for temporary orders\npursuant to the local rules ina\ngood faith effort on Tuesday.\n\nI'm filing it with the Court at 3:50\npm and won't be serving it to you\nuntil 10 days before the hearing as\nI'm requesting it be granted\nwithout notice and hearing given\nthe circumstances and whats\ntranspired over the case regarding\nthe disregard for procedural rules\nand the damage that's been done.\n\nI'm requesting the court strike all\npleadings prior to January 22nd, de\n2024 other than the rule 12 motion ~\n\n",
      "char_length": 599
    },
    {
      "page_number": 69,
      "text": "- “ ae\n\nI'm requesting the court strike all\npleadings prior to January 22nd,\n2024 other than the rule 12 motion\nto show authority and the summary\njudgement, and am asking for a\nreasonable amount of time to\ntransition which is what I've asked\nfor since the beginning.\n\nNot requesting any injunction or\ncustody determinations until a\nhearing on the merits can be held,\nand im requesting the court\ndispense with the necessity of a\n",
      "char_length": 428
    },
    {
      "page_number": 70,
      "text": "bond on behalf of the kids and on\nbehalf of us to preserve the status\nquo that's been destroyed without\na second thought.\n\nNothing against you just gotta do\nwhat | gotta do for the kids since\nnobody wants to communicate and\npretends like the current situation\nis what's best for them.\n\nlam requesting a temporary\nrestraining order for 14 days\n\nCharlie\n\n",
      "char_length": 353
    },
    {
      "page_number": 71,
      "text": "TODAY\nallidavits needed and nave several\npeople willing to fly to Texas to\ntestify on my behalf regarding\nwork.\n\n| also have an expert witness that\nwill be testifying as well if we go to\ntrial, which I'll file the necessary\ndocuments for prior to the next\nscheduled hearing in accordance\nwith statute.\n\nI'm also invoking laches doctrine\nwhich prevents any new claims that\nweren't served or disclosed before\nfrom being brought up due to\nunreasonable delay and to prevent\nfurther disruption regarding\ntransitioning from the home.\n\nJust communicating this to you in a\ngood faith effort as required by the\n\nwoelove In eACN VIRAL AiAdn'+ Ant tha\n",
      "char_length": 641
    },
    {
      "page_number": 72,
      "text": "PUITO TI LCase yvu UIUTE & yet uit\n\nemail.\n",
      "char_length": 43
    },
    {
      "page_number": 73,
      "text": "From: Morgan Myers morganmw02@gmail.com\nSubject: Re: AppClose Invite\nDate: October 9, 2024 at 5:04 PM\nTo: Charlie Vids chuckdustin12@gmail.com\n\nIn case you didn't get a notification, | accepted and reconnected. | will be messaging exclusively on the app from here on.\n\nOn Wed, Oct 9, 2024 at 4:41 PM Charlie Vids <chuckdustini2@ gmail.com> wrote:\nHi! You have been invited to join AppClose.\nOur FREE mobile app provides you and your co-parent with the necessary tools to co-parent better together within a single location\nand without the worry of another expense.\nTo download this app and connect to your co-parent, click here:hitps //appclose app link DYEwP4A2yNb\nIf you have questions or need further assistance, please contact AppClose Support at support.app :\nsupport@ appclose.com.\n\n",
      "char_length": 788
    }
  ]
}