{"id": "a38de3ef230f994982ebfd4bcbbed66fc2cb0fdc", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "NO. 322 -744263-23 \nIN THE 322ND DISTRICT COURT OF TARRANT COUNTY , \nTEXAS  \nTO THE HONORABLE JAMES MUNFORD OF THE 322nd \nDISTRICT COURT OF TARRANT COUNTY:  \n-In this document, \"the Couple\" refers collectively to the Petitioner and Respondent.\nThe Respondent respectfully objects to the Title- IV Agency intervention for \nthe foregoing reasons:  \nI. BACKGROUND\n1. In January of 2021, the decision to pursue a career from home came from a\ndeep desire within the Respondent to provide a dual role for his Children – being that \nof a provider and a caregiver. Leading up to that point, the Couple had alternated \nroles in providing for their children: one parent worked to support the family Morgan Michelle Myers,  \nPetitioner,  \nv. OBJECTION TO TITLE -IV \nINTERVENTION  \nCharles Dustin Myers,  \nRespondent  \n2024-06-30 \n1\n\nfinancially while the other assumed a full- time caretaker role.  However, this decision \nended up being in the best interest of the children. \n2.The harmonious arrangement was greatly facilitated by the support of\nMargie and Jesse Wilson —next- door neighbors, landlords, and great -grandparents to \nthe children involved in this case. The Wilsons provided a stable and affordable \nhome at a discounted rental rate of $800 per month, laying a foundation for a \nnurturing and stable environment for the children. With regular, daily access to \nboth parents and the added benefit of their great grandparents living next door on a \ntranquil cul -de-sac in Watauga —the children benefit ted from a uniquely supportive \nand loving environment , which created an ideal situation for the children's growth \nand well -being.  \n3. The new arrangement afforded the Petitioner a significant amount of time,\nwhich she allocated to becoming more involved with the PTA, eventually becoming President. The Respondent continued to pursue growth and expand his knowledge in \nthe fields of market finance, programming, SEC law, and legal transcription via \nCrowd Surf and similar platforms while"}
{"id": "f46763288e6466099ed73f321964e93c0a3ce8c4", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "resident. The Respondent continued to pursue growth and expand his knowledge in \nthe fields of market finance, programming, SEC law, and legal transcription via \nCrowd Surf and similar platforms while both parents remained daily figures in all facets of their day -to-day lives. \nII.STATUTORY PROTECTIONS\n4.The Texas Family Code references “the best interest of the child” 109\nt\nimes throughout its’ 1,627 pages. The word “always” appears just once – within  Id § \n153.002.  \n5. The language provided by Id – being unambiguous on its’ face – shows a\nclear requirement by the State to meet its’ statutory requirement : \n2\n\n“[t]he best interest of the child shall always be the primary \nconsideration of the court in determining the issues of conservatorship and \npossession of and access to the child. “ Id. \n6. The\nse statutory protections “…are [clearly ] indicative of the wide\ndiscretion the Legislature has granted the courts to act  when the best interest of the \nchild would be served thereby.\" Lutheran Social Service, Inc. v. Meyers , 460 S.W.2d \n887 (Tex. 1970) . Despite this wide discretion, this court has chosen not to use it. \n7. Long ago, in Holley V. Adams, 544 S.W.2d 367 (Tex. 1976) the Supreme\nCourt of Texas  provided this State with a non- exhaustive list of factors that the court \nmay use in determining the best interest of the Child.  Despite these factors, the court \nhas taken into consideration none of them. \n8.In more recent jurisprudence, the United States Supreme Court in Troxel v.\nGranville , 530 U.S. 57 (2000), affirmed that under the Fourteenth Amendment, \nparents have a fundamental right to direct the care, custody, and control of their \nchildren.  \n9. When contested issues are at hand, the Texas Family Code affords litigants\nwith a reporter of record  to preserve the ability to make an effective appeal . Id \n§105.003. This  statutory mandate was ignored.\n10.When a Petitioner waives the 60 -day waiting period  for divorce claiming\nan active order of prot"}
{"id": "9d19cb99692c93935917d71c6d96de108cf825a1", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "eserve the ability to make an effective appeal . Id \n§105.003. This  statutory mandate was ignored.\n10.When a Petitioner waives the 60 -day waiting period  for divorce claiming\nan active order of protection exists against the Respondent, the Petitioner is required to attach the order to the Petition prior to any hearing. Id § 6.405(b). Despite no such \norder existing, no hearing should have ever taken place. \nIII. STATE INTERVENTION\n3\n\n1 1. On January 16th, 2024, the State simply did what it cannot do , and failed\nto offer the State mandated protections afforded by Id. \n12. The decision rendered on 01/16/2024 was a de facto  temporary\ntermination of parental rights  prior to any evidentiary hearing taking place. \n13. The subsequent order rendered on 01/22/2024 by Judge Kaitcer\nprolonged the initial orders. \n14. On February 1st, 2024, a settlement agreement was drafted by the\nRespondent’s own legal counsel, who advised the Respondent to sign the agreement, \nresulting in his immediate termination and challenge of the original agreement on \nreconsideration. A true and accurate copy of this agreement has been attached hereto as Exhibit A.  \n15. A hearing wasn’t scheduled until March 14th, 2024, due to delays by our\nfriends on the other side, who have filed no opposition to any claims for relief made \nby the Respondent or allegations asserted. In fact, this was the only hearing that took \nplace in t his case.  \n16.Despite invoking the statutory protections mentioned above  at the\nhearing , the court rendere d temporary orders which were permitted to be redu ced to \nwriting  outside of their own procedural requirements ordered by the same judge by \nan attorney who had no initial desire to represent the Petitioner in the first place . \n17.Despite the hearing being contested, and notwithstanding the statutory\nrequirement for the court to provide a court reporter in such cases, this requirement was once again ignored. This omission rendered it impossible to properly raise an"}
{"id": "41fc789830fdac5e4fe6aaea67aaa8a22c439688", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "nd notwithstanding the statutory\nrequirement for the court to provide a court reporter in such cases, this requirement was once again ignored. This omission rendered it impossible to properly raise an \n4\n\nobjection to the deprivation, as the essential element needed to make the objection \nwas not provided. \n18.Given the State’s initial failure to uphold its mandated requirements set\nforth in the Texas Family Code, any further Sta te intervention would lead to and has \nled to the same failure  giving the magnitude of the decision made at the onset. \n19.This court has no facts regarding the decisions made affecting the parent -\nchild relationship and therefore has not considered the best interest of the child. \nIV.CONTINUOUS DEFECT\n20.The last contact with the opposing counsel occurred on May 19th in\nresponse to a defective IWO  regarding the relevance of the orders in question. A true \nand accurate copy of these  emails has been attached hereto as Exhibit B.  \nA true and accurate copy of the defective IWO has been attached hereto as Exhibit C.  \nV.CONSENT\n21.The  consent from the Respondent is what this court relies on. Without it –\nthere ’s no basis for any decision made. \"Once the trial court renders an agreed \njudgment, a party may not withdraw his consent if the trial court was unaware of any objection at the time of rendition. ” In re D.S., 76 S.W.3d 512 (Tex. App. 2002) ; see \nFirst Heights Bank, FSB v. Marom , 934 S.W.2d 843 (Tex.App.-Houston [14th Dist.] \n1996, no writ). In this instance, at the time of rendition, Judge Jeffrey Kaitcer was \nwell aware of consent not being present at the time of rendition , but rendered them \nanyway . \n5\n\nVI.PREMATURITY\n22. The intervention request made by the Title-IV Agency is premature. The\ncase is currently pending review in the Supreme Court of Texas, and the Agency has \nno facts pertaining to this case  as outlined in the language of their pleading.  \n23. Rather than intervening on an erroneous and fraudulently rendered\n"}
{"id": "d0b643be4734c0d7bf76d54fc7a7d9ed6aca0def", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "he Supreme Court of Texas, and the Agency has \nno facts pertaining to this case  as outlined in the language of their pleading.  \n23. Rather than intervening on an erroneous and fraudulently rendered\ntemporary order prior to any factual understanding of the case - the agency should \nconsider filing an amicus brief in support of the Respondent  with the Supreme Court \nof Texas  given the destruction c aused by the State thus far – or request findings of \nfact and conclusio ns of law from the trial court. The State ’s mandate to enforce  and \nestablish child support should come only second to and after affirmation that the current custodial arrangements are in the best interest of the child.  \n24. The Respondent timely requested findings of fact and conclusions of law\nregarding the current orders in question over 90 days ago which have yet to be \nanswered.  \nVII. CONCLUSION\n25. This request for intervention i s another attempt by our friends on the other\nside to have the work which should already be on file with the court completed for \nthem.  \n26. After seven months of litigation, our friends on the other side have done\nnothing but delay proceedings, file fraudulent and inaccurate pleadings, ignore civil \nprocedure, and are now trying to enforce a void order rendered outside of their own \nprocedural requirements. \n6\n\n27.The unacceptable negligence on behalf of Cooper L. Carter and the trial\ncourt as a whole all stems from the intentional, malicious, and deceptive pleadings \nfiled by the Petitioner, and \ninfluenced by Daniel Branthoover, and Margie Wilson \nresulting in direct interference with the Respondent’ s constitutional rights.  \n28.No am ount of chil d support ca n replace what this State and the Petitioner\nhave willingly de stroyed with the  assistance of  Cooper L . Ca rter, who should be \nrequire d to disqualif y herself from the case due t o the inabilit y to perform her duti es \ncompetently . Given she was require d to represent  the Petitioner  in the  fi"}
{"id": "6c7c917c4fd09e94f2b285efc01e33a9e0100060", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "L . Ca rter, who should be \nrequire d to disqualif y herself from the case due t o the inabilit y to perform her duti es \ncompetently . Given she was require d to represent  the Petitioner  in the  first place \nagainst her own wishes – the same requirement to withdrawal is appropriate here. \nVIII\n.PRAYER\nRespondent respectfully prays for the following: \n1.Deny further state intervention until the facts of the case are before the\ncourt.\n2.Provide \nfindings of fact and conclusions of law for the orders in question as\nrequested on March 26th, 2024, and how they are in the b est interest of the\nChild.\n3.Conduct any future hearings  in the District Court furnished with a court\nreporter\n as mandated by the Texas F amily Code.\n4.Provide \nany other equitable relief the court deems necessary.\nRespectfully Submitted,  \n/s/ Charles Dustin Myers \nCharles Dustin Myers \nChuckdustin12@gmail.com  \n1-817- 507- 6562\n7\n\nCERTIFICATE OF SERVICE\nI certify that a true copy of this document was served in accordance \nwith Rule 21a of the Texas Rules of Civil Procedure on the following \non June 23rd, 2024:\nMorgan Michelle Myers by electronic filing manager at \nmorganmw02@gmail.com.\nCooper L. Carter by electronic filing manager at \ncoopercarter@majadmin.com.\nCSD Filer 914 by electronic filing manager at csd-\nfiler-914@texasattorneygeneral.gov\n8\n\nEXHIBIT A\n\"agreed\" associate judge's report\n(02.01.2024)\n9\n\n.• \n?9j&?&rb \nASSOCIATE JUDGE'S REPORT FOR TEMPORARY ORDERS \n(Suit Affecting the Parent-Child Relationship, Property and Debts) \nDIVORCE WITH CHILDREN \nCAUSE NUMBER: 322-7 l( r 2 ~ 3 -;;2._ 2 \n§ \n§ \n§ IN THE DISTRICT COURT \nTARRANT COUNTY, TEXAS \n322ND JUDICIAL DISTRICT \nRESET DATE: ______________________________ _ \n1. Appearances: \n~itioner/Movant appeared in person and by attomey __ c~·~{)~6~~--r~(~ __ y ___ R_ffi _ _,IJZ __ _ \n~espondent appeared in person and by attomey ____ D~tt~tU~---,,_p_4::~c~;1-~)~r_s ___ _ \n( ) _______________________ _ \n2. Temporary Conscrvatorship: \nA. ~oint Manag"}
{"id": "63c96decaece262aca44d87e42fc7312ce1fa472", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "-r~(~ __ y ___ R_ffi _ _,IJZ __ _ \n~espondent appeared in person and by attomey ____ D~tt~tU~---,,_p_4::~c~;1-~)~r_s ___ _ \n( ) _______________________ _ \n2. Temporary Conscrvatorship: \nA. ~oint Managing Conservators: Primary Possession to ~other ( )Father ( )Other: _____ _ \n+other and Father have the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, 153.074 \n( )Other has the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, 153.074 \n( )Mother ( )Father ( )Other have the rights, duties and privileges as set forth in TEX. FAM. CODE \nANN.§ 153.132 except as follows: \nThe {½Mother ( )Father ( )Other shall have the exclusive right to establish the residence of the \nchild(ren) and residence of the child(ren) will be Tarrant County or counties contiguous to \nTarrant County, TX and/or ______________________ _ \nThe~otherk.fFather ( )Other are enjoined from removing the child(ren) from Tarrant County \nor counties contiguous to Tarrant County, TX for the purpose of establishing the residence of the \nchild(ren) and/or _________________________ _ \nThe right to make educational decisions shall be by the ~Mother ( )Father ( )Other. \n1 322-744263-23FILED\nTARRANT COUNTY\n2/8/2024 2:29 PM\nTHOMAS A. WILDER\nDISTRICT CLERK\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n10\n\nThe right to make invasive surgical decisions shall be by mutual consent of the partied and failing \nto agree by the (,-O°Mother ( )Father ( )Other. The term \"invasive\" means elective surgical \ndecisions. \nThe right to receive child support shall be by the~)Mother ( )Father ( )Other ______ _ \nB. ( )Sole Managing Conservator: ( )Mother ( )Father ( )Other: ______________ _ \n( )Possessory Conservator: ( )Mother ( )Father ( )Other: ________________ _ \n( )Mother ( )Fa~her ( )Other have the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, \n153.074 \n( )Mother ( )Father and/or ( )Other have the rights,"}
{"id": "48f7e3e4a5ff54f9eabc51c2229e79a3436eb2dc", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": "ther ( )Father ( )Other: ________________ _ \n( )Mother ( )Fa~her ( )Other have the rights and duties under TEX. FAM. CODE ANN.§§ 153.073, \n153.074 \n( )Mother ( )Father and/or ( )Other have the rights, duties and privileges as set forth in TEX. FAM. \nCODE ANN.§ 153.132. \n( )Residency Restriction to ( )Tarrant County ( )Tarrant & contiguous counties. \n3. Temporary Possession Schedule: \n( )Texas Standard Family Code TEX. FAM. CODE ANN.§§ 153.311 THROUGH 153.316. All \npossession times begin and end at 6:00 p.m. except for Thursdays which ends at 8:00 p.m. \nMrexas \"Extended\" Standard Family Code TEX. FAM. CODE ANN.§§ 153.311 THROUGH 153.316. \nAll possession times begin and end at the time school recesses or begins. Thursdays overnight, during the \nregular school year. \n( )Other:. ______________________________ _ \nAA other ( )Father ( )Other shall surrender the child to the other person at the residence of ~other \n( )Father ( )Other at the beginning of each period of possession. \n• ( )Mother ()o'Father ( )Other shall surrender the child to the other person at the residence of ( )Mother \n~ather ( )Other at the end of each period of possession. \n4. Temporary Child Support: \n( )Mother AfFather shall pay through the Texas State Disbursement Unit, P.O. Box 659791, San \nAntonio, TX 78265-9791 of$ q 7,3, / '1 per h1 CJ)( .,Cfg beginning t./,... I -;)o'J.. 1/ \n2 \n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n11\n\nMedical Insurance on Child Provided by: \nInsurance Cost Paid by: \nUncovered Medical, Dental & Vision Costs: ( )Mother ( Jf!ther \n( )Mother-~Father Mo-flu ft?~ 11(,/f Ct/v \n/4/E or c~r 1> \n~qually ( ) ___________ _ \n5. Additional Orders: ______________________ _ \n6. Temporary Spousal Support: ;t//r. \n( )Wife ( )Husband shall pay direct to Spouse $ ______ per ______ beginning \n7. Temporary Possession of Property: / \nHusband: {lv ;2.. r BiJ::2:1> 15; /11 5 1'7/70 .,"}
{"id": "5b0ef84017f83335b2ebe74a8c831280289633a4", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": "emporary Spousal Support: ;t//r. \n( )Wife ( )Husband shall pay direct to Spouse $ ______ per ______ beginning \n7. Temporary Possession of Property: / \nHusband: {lv ;2.. r BiJ::2:1> 15; /11 5 1'7/70 .,v~ / f?ro£, \n9--c::.,/c; r P etvy a o~ 2 Aft lf:P 1 Ck --? (Ir t??t: .J) ') \n/2.c~/?~<V/JcA/[ &> f/,fef (P ho~t ~t wC, 'fl r}A11V7 ~,.-j-\n/);11:174:r; 6'.,, by fo(,1 fl. cf; .:L 7 ;;o ~ y \n3 \n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n12\n\n8. Temporary Payment of Debts and Bills: \nHusband: His living expenses: C ,1-(l f 1f' 1(£? dt'r \nhh b: /:t_fh,,,. p1y.a;;i_. • \n9. Temporary Injunctions: \n~utual Temporary Injunctions as to Persons pursuant to the Texas Family Practice Manual. \n~utual Temporary Injunctions as to Property pursuant to the Texas Family Practice Manual. \nrlt L ff~ 6 ;-/ lo co /bf -\"'I .-f/A/r uh \n10. MISCELLANEOUS: 'J-/4 yav7 f, ,1.r7f (~_re \nwrhe parti~s are to attend \"Children in the Middle\" part 1 and/or 2 by \ncertificate with the Court. Each to pay for their own costs. gmy-and to file a \n~either party shall consu~~, use or have in their possession any illegal drug or drugs at any time nor shall \nthey have, at any time, a legal drug or drugs in their possession for which that party does not have a \nprescription. \nNeither party shall consume alcohol at least 12 hours prior to their time for possession of the child(ren). \nNeither party shall consume alcohol during their period of possession with the child(ren). \nNeither party shall attend one of the child(ren)'s activities if they have consumed alcohol or they are \nunder the influence of alcohol. \nNeither party shall leave the child(ren) with a person who is consuming alcohol at least 12 hours prior to \ntaking possession of the child(ren) or has in their possession an illegal drug(s), including prescription drugs, \nas a childcare provider. No disparaging remarks in the presence of the child(re"}
{"id": "9abfbda6c2478d96ebd243bc3722b19f257fddf3", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "or to \ntaking possession of the child(ren) or has in their possession an illegal drug(s), including prescription drugs, \nas a childcare provider. No disparaging remarks in the presence of the child(ren) and no discussion of \nlitigation or issues of the case with the child(ren). \n4 \n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n13\n\n9( The parties are not to discuss the litigation or issues with the child(ren) about the other party. The \naforementioned sentence means that neither party shall belittle, talk bad, refer to the other party using a \nprofane name or names, profanity or curse words. \nThe parties are not to discuss the litigation or issues with the child(ren). This paragraph presumes the \nchild(ren) is old enough to communicate with a party. The aforementioned sentence means that neither party \nshall discuss what occurred in Court including the testimony of any witness or witnesses with the child(ren). \nA party is allowed to reasonably offer an age-appropriate statement to discuss the effect of an Order with \nthe child(ren) with a brief statement or sentence. For example, a party is not allowed to show a document to \nthe child(rehfand attempt to comprehensively discuss the ca·se in detail with the child(ren). \nA typed written Order conforming to this Report will follow within 20 days from the date this \nReport is signed. The Temporary Order shall be prepared by P/f:11./ i3(fc.,f V 5 . \nEach attorney should approve the Order. The parties do not need to approve the Order. The \nattorney reviewing the proposed Order shall have five (5) days to do so. There arc no ten (10) day \nletters. If an agreement is not reached, a Motion to Sign shall be filed and set within thirty (30) days \nfrom the signing of this Report. \nAGREED AS IP. FORM AND SUBSTANCE \ncy for_Pctitioncr ().{.Z7.£if.{L4 \nPctd/4~Q· Respondent \nSO, ORDERED: \n-------322ND Associate Judge \nDatc:_7"}
{"id": "8bc46c6d938be4f2097c34aa9f98d9beeee0b953", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "ithin thirty (30) days \nfrom the signing of this Report. \nAGREED AS IP. FORM AND SUBSTANCE \ncy for_Pctitioncr ().{.Z7.£if.{L4 \nPctd/4~Q· Respondent \nSO, ORDERED: \n-------322ND Associate Judge \nDatc:_7_L ____ -U3\"'\"\"---rv._'/9-l'~v-(f--'c___,;:;::k2;;........;; ~ /./ 7 I \n5 \n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n14\n\nAutomated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 84305097\nFiling Code Description: No Fee Documents\nFiling Description: AGD AJ REP\nStatus as of 2/8/2024 3:12 PM CST\nAssociated Case Party: MORGANMICHELLEMYERS\nName\nCooper L.CarterBarNumber Email\ncoopercarter@majadmin.comTimestampSubmitted\n2/8/2024 2:29:20 PMStatus\nSENT\nAssociated Case Party: CHARLESDUSTINMYERS\nName\nDaniel Bacalis\nTammy L.Johnson\nDaniel R.Bacalis\nCHARLES MYERSBarNumber Email\nservice@dbacalis.com\ntjohnson@dbacalis.com\ndbacalis@dbacalis.com\nchuckdustin12@gmail.comTimestampSubmitted\n2/8/2024 2:29:20 PM\n2/8/2024 2:29:20 PM\n2/8/2024 2:29:20 PM\n2/8/2024 2:29:20 PMStatus\nSENT\nSENT\nSENT\nSENT\n   A CERTIFIED COPY  \n  ATTEST:   \n THOMAS A. WILDER \n     DISTRICT CLERK    \n         TARRANT COUNTY, TEXAS \n          BY: /s/  \n04/15/2024\nCatherine Saenz\n15\n\nEXHIBIT B\nemail correspondence (IWO)\n16\n\n17\n\n18\n\nEXHIBIT C\ndefective IWO\n19\n\nDocument Tracking ID  INCOME WITHHOLDING FOR SUPPORT \nDate:  I.Sender Information:  (Completed by the Sender)\nNOTE:  This IWO must be regular on its face. Under certain circumstances you must reject this  IWO and return it to the \nsender (see IWO instructions www.acf.hhs.gov/css/resource/income-wit hholding-for-support- instr"}
{"id": "f4e4eca38f196e9d3bf1b06be65bb2c292e8667d", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "ust be regular on its face. Under certain circumstances you must reject this  IWO and return it to the \nsender (see IWO instructions www.acf.hhs.gov/css/resource/income-wit hholding-for-support- instructions).  If you receive \nthis document from someone other than a state or tribal CSE agency or a court, a copy of the underlying support order \nmust be attached. \nRE:\nfor a Total Amount to Withhold  of $ per \nIV.Amounts to Withhold:  (Completed by the Sender)\nYou do not have to vary  your pay cycle to be in compliance with the Order  Information.  If your pay cycle does  not m atch\nthe ordered payment cycle, withhold one of the following amounts:\n$  per weekly pay period $ \n$  per biweekly pay  period (every two weeks)                $per semimonthly pay period (twice a month)\n$  Lump Sum Payment:  Do not stop any existing IWO unless you receive a termination order.OMB 0970-0154\nExpi ration Date: 09/30/2023\n Income Withholding for  Support (IWO) Child Support Enforcement (CSE) Agency Court Attorney \nII.Employer and Case Information:  (Completed by the Sender)\nEmployer/Income Withholder’s Name\n(State/Tribe).III.Order Information: (Completed by the Sender)\nThis document is based on the support order from\nYou are required by law to deduct these amounts f rom the employee/obligor's income  until further notice. \nPer\nPer\nPer\nPer \nPer\nPer\nPer \nPAPERWORK REDUCTION ACT OF 1995 (Pub. L. 104-13) STATEMENT OF PUBLIC BURDEN: The purpose of this information collection is to provide uniformity and \nstandardization. Public reporting burden for this collection of information is estimated to average two to five minutes per response, including the time for reviewing \ninstructions, gathering and maintaining the data needed, and reviewing the collection of information. This is a mandatory collection of information in accordance with 45 \nCFR 303.100 of the Child Support Enforcement Program.  An agency may not conduct or sponsor, and a person is not required to respond to, a collection of "}
{"id": "230dc90ac24f4dd9319e70fbfe517b42db8d3158", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "llection of information in accordance with 45 \nCFR 303.100 of the Child Support Enforcement Program.  An agency may not conduct or sponsor, and a person is not required to respond to, a collection of information \nsubject to the requirements of the Paperwork Reduction Act of 1995, unless it displays a currently valid OMB control number. If you have any comments on this collection \nof information, please contact the Employer Services Team by email at employerservices @acf.hhs.gov .AMENDED IWO \nTERMINATION OF IWOINCOME WITHHOLDING ORDER/NOTICE FOR SUPPORT (IWO)  \nONE-TIME ORDER/NOTICE FOR LUMP  SUM PAYMENT\nState/Tribe/Territory\nCity/County/Dist./Tribe\nPrivate Individual EntityRemittance ID (include w/payment)  \nOrder ID\nCase ID\nEmployer/Income Withholder's AddressEmployee/Obligor’s Name (Last, First, Middle) \nEmployee/Obligor's Social Security Number  \nEmployee/Obligor’s Date of Birth \nCustodial Party/Obligee’s Name (Last, First, Middle)\nEmployer/Income Withholder’s FEIN\nChild(ren)’s Birth Date(s) Child(ren)’s Name(s) (Last, First, Middle)\ncurrent child support \npast-due child support - Arrears greater than 12 weeks?\ncurrent cash medical support \npast-due cash medical support\ncurrent spousal support\npast-due spousal support\nother (must specify)Yes  No\nper monthly pay period$\n$\n$\n$\n$\n$\n$\nPage 1 of 4.Private Individual/Entity   (Check One)\n20\n\nIncome Withholding for Support (IWO)  Page 2 of 4 Remit payment to    (SDU/Tribal Order Payee) \nat      (SDU/Tribal Payee Address)  \nInclude the Remittance ID with the payment and if necessary this locator  code of the SDU/Tribal order payee  \non the payment. \nTo set up electronic  payments or to learn state requirements for  checks, contact the State Disbursement Unit  (SDU).  \nContacts and information are found at www.acf.hhs.gov/css/resource/sdu-eft-cont acts-and-prog ram-requ irements. Employer/Income Withholder’s Name:\nEmployee/Obligor’s Name:\nCase ID:Employer/Income Withholder’s  FEIN:   \nIf the employee/obligor’s principal p"}
{"id": "be08a8390f3263ef61702c2e622101d75a756cd3", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": "/resource/sdu-eft-cont acts-and-prog ram-requ irements. Employer/Income Withholder’s Name:\nEmployee/Obligor’s Name:\nCase ID:Employer/Income Withholder’s  FEIN:   \nIf the employee/obligor’s principal place of employment is  (State/Tribe), you must begin withholding no \nlater than the first pay period that occurs  days after the date of                         of the order/notice.  Send payment \nwithin  business days of the pay date.  If you cannot withhold the full amount of support for any or all orders for this \nemployee/obligor, withhold  % of disposable income for all orders.  If the employee/obligor’s principal place of \nemployment is not        (State/Tribe), obtain withholding limitations, time requirements, the appropriate \nmethod to allocate among multiple child support cases/orders and any allowable employer fees from the jurisdiction of \nthe employee/obligor’s  principal place of em ployment.\nState-specific withholding limit information is  available at www.acf.hhs.gov/css/resource/state-income-withholding-\ncontacts-and-program-requirements.  For tribe-specific contacts, payment addresses, and withholding limitations, please \ncontact the tribe at www.acf.hhs.gov/sites/default/files/programs/css/tribal_agency_contacts_printable_pdf.pdf or  \nwww.bia.gov/tribalmap/DataDotGovSamples/tld_map.html\n.\nYou may not withhold more than the lesser of:  1) the amounts allowed by the Federal Consumer Credit Protection Ac t \n(CCPA) [15 USC §1673 (b)]; or 2) the amounts  allowed by the law of the state of the employee/obligor’s princ ipal place of \nemployment if the place of employment is in a state; or the tribal law of the employee/obligor’s principal place of \nemployment if the place of employment is under tribal jurisdiction.  The CCPA is available at www.dol.gov/sites/dolgov/\nfiles/WHD/legacy/files\n/garn01.pdf.  If the Order Information section does not indicate that the arrears are greater than 12 \nweeks, then the employer should calculate the CCPA limit using the lo"}
{"id": "1e7dcad5824e7bef05077e985e298203af88c973", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": "gov/\nfiles/WHD/legacy/files\n/garn01.pdf.  If the Order Information section does not indicate that the arrears are greater than 12 \nweeks, then the employer should calculate the CCPA limit using the lower percentage.\nIf there is more than one IWO against this employee/obligor and you are unable to fully honor all IWOs due to federal, \nstate, or tribal withholding limits, you must honor all IWOs to the greatest extent possible, giving priority to current support \nbefore payment of any past-due support. \nIf the obligor is a nonemployee, obtain withholding limits from the Supplemental Information section in this IWO.  This \ninformation is also available at www.acf.hhs.gov/css/resource/state-income-withho lding -contac ts-and-progra m-\nrequirements\n. SSN:\nOrder ID:\nV.Remittance Information:  (Completed by the Sender except for the “Return to Sender” check box.)\nIf checked, the employer/income withholder must provide a copy of this form to the employee/obligor.Return to Sender (Completed by Employer/Income Withholder).  Payment must be directed to an  SDU in \naccordance\n with sections 466(b)(5) and (6) of the  Social Security  Act or Tribal  Payee (see Payments  in Section VI).  If \npayment is \nnot directed \nto an \nSDU/Tribal Payee or this IWO is not regular on its face, you must check this box and return \nthe IWO to the sender.\nIf Required by State or\n Tribal Law: \nSignature of Judge/Issuing Official:  \nPrint Name of Judge/Issuing Official:\nTitle of Judge/Issuing Official: \nDate of Signature: \nIf the employee/obligor works i n a state or f or a tribe that i s differ ent from t he state  or tribe that i ssued this or der, a c opy of \nthis I WO \nmust be provid ed to the employee/obligor. \n21\n\nEmployer/Income Withholder’s Name: Employer/Income Withholder’s  FEIN: \nEmployee/Obligor’s Name:   SSN: \nCase ID:  Order ID: \nIncome Withholding for Support (IWO)  Page 3 of 4 VI.Additional Information for Employers/Income Withholders:  (Completed by the Sender)\nPriority:  Withholding"}
{"id": "26f7caf11289e25cd5a44dca5e5b63dc62a671cb", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "gor’s Name:   SSN: \nCase ID:  Order ID: \nIncome Withholding for Support (IWO)  Page 3 of 4 VI.Additional Information for Employers/Income Withholders:  (Completed by the Sender)\nPriority:  Withholding for support has priority over any other legal process under State law  against the same income \n(section 466(b)(7) of the S\nocial Security  Act). If a fed eral  tax levy is in effect, please notify the sender.  \nPayments:  You must send child support payments payable by income withholding to the appropriate Sta te Dis bursement \nUnit or to a \ntribal CSE agency within 7  business days, or fewer if required by state law, after the date the income would \nhave been paid to the employee/obligor and include the date y\nou withheld the support from his or her income.  You may \ncombine withheld amounts from more than one employee/obligor’s income in a single payment as long as you s eparately \nidentify each employee/obligor’s portion of the \npayment.  Child support payments may not be made through the federal \nOffice of Chi ld Support Enf orcement (OCSE) Child Support Portal. \nLump\n Sum Payments:  You may be required to notify  a sta te or tri bal CSE a gency of upcoming lump sum payments to \nthis employee/obligor such \nas bonuses, commissions, or severance pay.  Contact the sender to determine if you are \nrequired to report and/or withhold lump sum payments.  Employers/income withholders may use OCSE’s Child Support \nPortal (ocsp.acf.hhs.gov/csp/) to provide information about\n employees  who are eligible to receive lump s um payments  and \nt\no provide contacts, addresses, and other i\nnformation about their companies .  Child support payments may not be made \nthrough the federal OCSE Child Support Portal. \nLiability:  If you have any doubts about the validity of this IWO, contact the sender.  If you fail to withhold income from the \nemployee/obligor’s income as the IWO directs, you are liable for both the accumulated amount you should hav e withheld \nand any penalties set\n by s"}
{"id": "affb898be95a66606f23512dd5b1ebe67b018ae7", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 2000, "text": "he sender.  If you fail to withhold income from the \nemployee/obligor’s income as the IWO directs, you are liable for both the accumulated amount you should hav e withheld \nand any penalties set\n by state  or tri bal law/procedure.   __________________________________________________________________\n________________________________________________________________________________________________________________________ \n________________________________________________________________________________________________________________________  \n_______________________________________________________________________________________________________________________  \n________________________________________________________________________________________________________________________ \nAnti-di scrimination:  You are subject to a fine determined under state  or tri bal law for d ischarging an employee/obligor \nfrom employment, refusing to employ, or taking disciplinary action against an employee/obligor because of this IWO. \n ________________________________________________________________________________________________________________________  \n________________________________________________________________________________________________________________________  \n________________________________________________________________________________________________________________________   \n________________________________________________________________________________________________________________________\nSupplemental Information:  __________________________________________________________________________ \n _________________________________________________________________________________________________ \n_________________________________________________________________________________________________ \n ________________________________________________________________________________________________\n_ \n _______________________________________________________________________"}
{"id": "c8247ba1c2b9dfe3b3746fa353d24188429769f8", "vector_id": 17, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 17, "char_len": 2000, "text": "_________________________ \n ________________________________________________________________________________________________\n_ \n _________________________________________________________________________________________________ \n \n_________________________________________________________________________________________________ \n ________________________________________________________________________________________________\n_\n22\n\nIncome Withholding for Support (IWO)   Page 4 of 4 Employer/Income Withholder’s Name:          Employer/Income Withholder’s  FEIN: \nEmployee/Obligor’s Name:    SSN: \nCase ID:  Order ID:  \nVII.Notification of Employment Termination or Income Status:  (Completed by the Employer/Income Withholder)\nIf this employee/obligor never worked for you or you are no longer  withholding income for  this employee/obligor, you must \npromptly\n notify the CSE agency and/or\n the sender by returning this form to the address  listed in the Cont act Info rmation  \nsection below or using\n OCSE’s Child Support Portal ( ocsp.acf.hhs.gov/ csp/).  Please report the new employer or incom e \nwithholder, if known. \nThis person has never worked for this  employer no r received periodic income.\n This person no longer works for this employer no r receives periodic income.\nPlease provide the following information for the employee/obligor:  \nTermination date:  Last known telephone number:  \nLast known address:    \nFinal payment date to SDU/Tr ibal Pa yee:  Final payment amount: \nNew employer’s  or income withholder’s name:  \nNew employer’s  or income withholder’s address: \nVIII. Contact Information:  (Completed by the Sender)\nTo Employer/Income Withholder:  If you have questions, contact   (sender name) by \ntelephone:   , by fax: , by email or website:   . \nSend termination/income status notice and other correspondence to:  \n (sender address). \nTo Employee/Obligor:  If the employee/obligor has questions, contact (sender name) \n. by telephone:                              , by"}
{"id": "6c969e3ee27b0b5be5146f035af4d58848611a81", "vector_id": 18, "source_txt": "extracted_text_full\\case_docs_by_filer\\charles_dustin_myers\\06_23_24_objection_to_title_iv_1\\06_23_24_objection_to_title_iv_1.txt", "source_pdf": "CASE DOCS\\CHARLES DUSTIN MYERS\\06.23.24 Objection to Title IV-1.pdf", "source_exists": true, "page": null, "chunk_index": 18, "char_len": 871, "text": "e status notice and other correspondence to:  \n (sender address). \nTo Employee/Obligor:  If the employee/obligor has questions, contact (sender name) \n. by telephone:                              , by fax:        , by email or webs ite:  \nIMPORTANT:   The person  completing  this form is advised that  the information may  be shared with the employee/obligor.  \nEncryption Requirements: \nWhen communicating t\nhis form through electronic transmission,  precautions must be  taken to ensure the security of t he data. Child \nsupport  agenci es are e ncouraged to us e the electronic applications provided by the  federal Office of Child S upport Enforcement.  \nOther ele\nctronic means,  such\n as encrypted attachments  to emails, may be used if the encryption method is compliant with Federal \nInformation Processing Standard (FIPS) Publication 140-2 (FIPS PUB 140-2 ).\n23"}