{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\01.24.25 - MOTION FOR DWOP-1.pdf",
  "base_name": "01_24_25_motion_for_dwop_1",
  "page_count": 8,
  "pages": [
    {
      "page_number": 1,
      "text": "NO. 322 -744263-23 & NO. 322- 744538 -23 \n \nITMOMO  Morgan Michelle Myers v Charles Dustin Myers  \nMOTION TO DISMISS  \nFOR WANT OF PROSECUTION \n \nIn the 322nd District Court of Tarrant County, Texas  \nHonorable Judges:  \nJames B. Munford, Jeff Kaitcer  \n \n200 E. Weatherford St. 4th Floor  \nFort Worth, TX  \nTel.: (817) 884-1427 \n \n \nRespectfully submitted by:  \nCharles Dustin Myers, Respondent  \n \n \n 322-744263-23 FILED\nTARRANT COUNTY\n1/24/2025 8:29 PM\nTHOMAS A. WILDER\nDISTRICT CLERK",
      "char_length": 487
    },
    {
      "page_number": 2,
      "text": "SUMMARY  \nRespondent, CHARLES DUSTIN MYERS, respectfully submits this Motion to Dismiss for \nWant of Prosecution and in support thereof states as follows:  \n1. The Supreme Court of Texas, through its promulgated time standards, provides clear \nguidelines for the timely disposition of cases, including dissolution of marriage.  \n2. The proposed time standards are based on national studies, including those conducted by the ABA and the NCSC, which establish a 12- month maximum time frame for divorce \ncases as achievable and reasonable, with intermediate standards for temporary orders, responsive pleadings, and trials. \n3. In this case, the time standards have been exceeded, with no substantial progress toward resolution or final disposition.  \n4. Rule 165a  (2) of the Texas Rules of Civil Procedure permits the dismissal of cases that \nare not disposed of within the prescribed time standards, ensuring the proper administration of justice and preventing undue delays caused by party inaction. \nFACTS SUPPORTING DISMISSAL  \n5. Notwithstanding the above, t he Petitioner’s Original Petition for Divorce in this matter \nand all subsequent pleadings submitted to the court bearing her signature should be stricken from the record because they are fundamentally fraudulent, and given the circumstances of the case, the Petitioner cannot prevail at trial , and granting a divorce \nunder the current circumstances would prove detrimental to the Respondent, and the children.  \n6. The Petitioner’s submissions include an affidavit of inability to pay, an original divorce petition, and a protective order . These documents were l everaged to secure the current",
      "char_length": 1660
    },
    {
      "page_number": 3,
      "text": "temporary orders which claim to be agreed despite lacking the Respondent’s signature \nand were prepared by an attorney not authorized to represent the Petitioner. \n7. The Respondent has raised claims of fraud, perjury, deception, and child neglect against the Petitioner, and her counsel has failed to address, defend, or file any response \nregarding these claims.  \n8. The Respondent has submitted discovery and admissions which have not been responded to by the opposing party, and despite filing a motel to compel discovery, no action has \nbeen taken by the court.  \n9. The opposing counsel’s authority has been under challenge pursuant to Rule 12 of the Texas Rules of Civil Procedure since September 20\nth, 2024, yet she was permitted to \nattend the recusal hear ing and raise objections despite no indication of her position on the \nmotion prior to the hearing.  \n10. The opposing counsel is unable to file anything on her client’s behalf in this matter because her electronic filing manager account is registered under her former employer’s email .  \n11. The opposing counsel has not filed any documents on her client’s behalf in this matter but \nhas rather had individuals unrelated to the case file documents for her on her behalf.  \n12. The opposing counsel is unable to file the required notice of remand with the clerk of the \ncourt, and the case is unable to proceed given these circumstances.  \nFURTHER STATUTORY PROVISIONS WARRANTING DISMISSAL  \nRespondent, CHARLES DUSTIN MYERS, asserts that the Petitioner has violated Sec. \n12.002 of the Texas Civil Practice and Remedies Code . Specifically:",
      "char_length": 1610
    },
    {
      "page_number": 4,
      "text": "13. Petitioner knowingly made and presented fraudulent claims to the Court regarding \nRespondent's property, with the intent to deprive him of his interest in his home, a property essential for his ability to work and provide for the children.  \n14. Petitioner acted with the intent that these false claims be given the same legal effect as \nvalid court orders, misleading the Court and causing Respondent to be wrongfully deprived of his home and livelihood. \n15. The Respondent , as the person directly affected by this fraudulent conduct, reserves the \nright  to bring a  cause of action under Sec. 12.003(a)(8)  as an equal owner to the \ncommunity property impacted by the Petitioner’s  fraudulent claims.  \n16. Petitioner’s actions have caused significant harm, including:  \n1. Financial injury  resulting from the loss of property and work opportunities. \n2. Mental anguish  and emotional distress  caused by being deprived of his home \nand stability.  \n17. Given the Petitioner is unable to account for the damages she has caused, the court should impose the appropriate sanctions for the following reasons:  \ni. For signing multiple fraudulent documents which she knew to be false , \nincluding the affidavit of inability to pay and original petition for divorce  \nfiled December 18, 2023, the Application for Protective Order filed December 22, 2023, and the current temporary orders prepared by her current unauthorized attorney, which should be stricken from the docket pursuant to Rule 12 given that they are not agreed.",
      "char_length": 1531
    },
    {
      "page_number": 5,
      "text": "ii. For failing to take her court -ordered parenting class, which permits the \ncourt to issue an appropriate sanction pursuant to Tex. Fam. Code § \n105.009(g).  \niii. For putting her own selfish agenda before her own children’s future and \nemotional stability , disregarding them entirely  \niv. For any other actions or inaction taken by the Petitioner in this matter. \n \nCONCLUSION AND PRAYER \n18. In conclusion, this case should be dismissed as a matter of law. It has yet to be \nadjudicated fairly in over a year, exceeding the Texas Supreme Court guidelines. It further was founded on fraud, including an affidavit of inability to pay, making the case dismissible pursuant to the Tex. Prac. Rem. Code Sec. 13.001. Finally, given the fundamentally flawed decisions made in this case in regard to the children – the current situation damages their well -being, and a \nre-assessment of the facts are needed for th e court to properly adjudicate this matter. \n Therefore, the respondent respectfully requests that this honorable court:  \ni. Dismiss this case without prejudice and impose the appropriate sanctions on the Petitioner.  \nii. Adopt the emergency temporary orders filed by the Respondent in September of 2024 which reflect the reality of the current situation and preserves the status quo of the children in accordance with Texas law. \niii. Provide clear, written instructions in the dismissal order permitting the \nRespondent to return to 6641 Anne Court, Watauga, TX giving the Petitioner",
      "char_length": 1502
    },
    {
      "page_number": 6,
      "text": "the choice to either co -habitat or live next -door while the Respondent repairs \nthe significant damage caused by her actions. \niv. Give the Respondent sole managing custody of the children and exclusive use \nof the residency while the case is pending.  \nv. Require that the Petitioner provide the documents requested that will allow the court to establish child support payments for the children and require that the Petitioner make these payments to aid in the rebuilding process for the Children. \nvi. Require a response to be filed by the opposing party within the next ten days . \nvii. Provide any further relief that the court finds just and equitable given the unusual circumstances of this matter.  \n Respectfully submitted,  \n \n  Charles Dustin Myers  \n  6641 Anne Court, Watauga TX 76148  \n  817-546-3693  \n  Chuckdustin12@gmail.com  \n  Pro-se",
      "char_length": 854
    },
    {
      "page_number": 7,
      "text": "Certificate of Service  \n \nI certify that a true copy of this MOTION TO DISMISS  was served in accordance with \nRule 21a of the  Texas Rules of Civil Procedure on the following on January 24th, 2025 to:  \n \nMorgan Michelle Myers by electronic filing manager at morganmw02@gmail.com . \nCooper L. Carter by electronic filing manager at coopercarter@majadmin.com   \nHolly Hayes by electronic filing manager at csd -filer-914@texas.oag.com  \n   /s/ Charles Dustin Myers \n   Charles Dustin Myers  \n   Chuckdustin12@gmail.com  \n   817-507-6562",
      "char_length": 537
    },
    {
      "page_number": 8,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 96596367\nFiling Code Description: Motion (No Fee)\nFiling Description: MOTION TO DISMISS\nStatus as of 1/27/2025 8:53 AM CST\nCase Contacts\nName\nCHARLES MYERS\nMORGAN MICHELLEMYERS\nCooper L.Carter\nHOLLY HAYESBarNumber Email\nchuckdustin12@gmail.com\nmorganmw02@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.govTimestampSubmitted\n1/24/2025 8:29:12 PM\n1/24/2025 8:29:12 PM\n1/24/2025 8:29:12 PM\n1/24/2025 8:29:12 PMStatus\nSENT\nSENT\nSENT\nSENT",
      "char_length": 849
    }
  ]
}