{"id": "a049af1bef34835b0a3d1809d50ebc2c3823c817", "vector_id": 0, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 0, "char_len": 2000, "text": "CAUSE NUMBER: 322-744263-23\n\nIN THE MATTER OF THE\nMARRIAGE OF\n\nIN THE DISTRICT COURT\n\nMORGAN MICHELLE MYERS\nAND\n\nCHARLES DUSTIN MYERS TARRANT COUNTY, TEXAS\nAND IN THE INTEREST OF\nMARA MYERS AND\nCAROLINE MYERS\nMINOR CHILDREN\n\nNe Nee Ne Ne Ne ee ee ee ee ee\n\n322NP JUDICIAL DISTRICT\nORDER OF REFERRAL\nOn the 7th day of October, 2024 a Joint Motion to Recuse was filed by Charles Dustin\nMyers in the above styled and numbered cause. A copy of the Motion is attached to this Order.\nThe Presiding Judge against whom the motion was filed declines to recuse himself and hereby\nrefers this matter to the Presiding Judge of the Eight Administrative Judicial District, Honorable\n\nDavid L. Evans, to decide the Motion.\n\nSIGNED this_3 day of clobe a\n\n, 2024.\n\n322-744263-23\n\nTARRANT COUNTY\n10/7/2024 7:30 AM\n\nNO. 24-0395 me eee\n\nNO. SW3d__, 04-10-24\nNO. 322-744263-23 & NO. 322-744538-23\n\nMorgan Michelle Myers v Charles Dustin Myers\n\nJOINT MOTION |\nTO RECUSE\n\nProceedings arising from the 322™ District Court\n-&-\n\nOn Petition for Writ of Mandamus from the Second Court of\nAppeals,\n\nTarrant County, Texas\n\n-&-\nIn the Supreme Court of Texas,\nAustin.\n\nTABLE OF CONTENTS\n\nI. BASIS FOR RECUSAL\n\nA. Challenging impartiality via motion to reCUSE ..........ccceceeeceseseeeeseeeeees 2\n\nB. Form, content, timing, and grounds for recusal..............cccccceeeeeeeeees 2,3\nII. QUESTIONING THE IMPARTIALITY OF JAMES MUNFORD\n\nA. The discovery of the TCDC Facebook post on Jan 15, 2024............00. 3\n\nB. James Munford presided in place of Jeffrey Kaitcer who arrived late ...3\n\nC. Continuance, consolidation, and rulings within the same order ............ 4\nD. Custody decisions were made prior to notice and hearing .................... 4\nE. Rule 6.405(b) of the Texas Family Code was overlooked... 5\nF. Injunctions are meant preserve the status quo, not destroy it .............. 5,6\nG. James Munford deprived respondent of a fair trial... eee 6\nH. The threshold for recusal is satisfied ..........c.ccceccccssssceessec"}
{"id": "fa2f31ba10fe5c679c6c4803797d315750f83192", "vector_id": 1, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 1, "char_len": 2000, "text": "meant preserve the status quo, not destroy it .............. 5,6\nG. James Munford deprived respondent of a fair trial... eee 6\nH. The threshold for recusal is satisfied ..........c.ccceccccssssceessecsssceesssecessseenes 6\nI. James Munford’s only explanation was extrajudicial... 6,7\n\nII. QUESTIONING THE IMPARTIALITY OF JEFFREY KAITCER\nA. Petitioner is awarded a second continuance and further delays............. 7\nB. Respondent’s counsel encourages settlement without a valid reason .7,8\nC. The details of the settlement displace the children from home.............. 8\nD. Respondent terminates his counsel and challenges the agreement........ 8\n\nE. The procedural timeline of the agreement expireS.............cc:cceeceeeeeeeees 8\n\nF, Petitioner locks the Respondent outside of the residency ...............::000 9\nG. Parties appeared before Jeffrey Kaitcer on March 14, where Respondent was\npresented with formal agreed temporary just before the hearing began......... 9\nH. Jeffrey Kaitcer refused to hear facts prior to Feb 1, 2024.0... eee 9\nI. Jeffrey Kaitcer directed extrajudicial statements at the Respondent ..9,10\nJ. Jeffrey Kaitcer ordered the Respondent to sign the agreement............. 10\nK. Jeffrey Kaitcer has shown an inability to remain impartial ............ 10,11\nIV. THE AFTERMATH\nA. The case becomes a one-sided pursuit for relief... ec cecccceeeseeeeees 11\nB. The orders erode the status quo as better alternatives are sought ... 11,12\nC. The petitioner reduces her employment, introduces chaos .............06 12\n\nD. The petitioner’s grandmother contacts Respondent with concerns......12\n\nV. QUESTIONS THAT REMAIN UNANSWERED ....... cc ceeesceeeseeeteees 12,13\nVI. CONCLUSION oo... eeceeseeeeseececeeseceeenecsseesseceseesseesreeeseteesseeeeaeensaes 14\nVIL. PRAYER ooo. cescecessecsesecseeceseerseeeeneseseeecaeereecaeesaeeeaneseauecneesensnes 15,16\nVII. CERTIFICATE OF CONFERENCE ......cccccsssssecetsesseeeseeessesenseesenees 17\nIX. CERTIFICATE OF SERVICE... cceeeccessee"}
{"id": "1ef415e2c55dc9d9a8f5671904260314c45c34c8", "vector_id": 2, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 2, "char_len": 2000, "text": "cecessecsesecseeceseerseeeeneseseeecaeereecaeesaeeeaneseauecneesensnes 15,16\nVII. CERTIFICATE OF CONFERENCE ......cccccsssssecetsesseeeseeessesenseesenees 17\nIX. CERTIFICATE OF SERVICE... cceeeccesseesscesecssseeeeeesseesseeeesseesseeeeseees 17\n\nNO. 322-744263-23\nIN THE 322%” DISTRICT COURT OF TARRANT COUNTY, TEXAS\n\nIN THE MATTER\n\nOF THE MARRIAGE OF\nMORGAN MICHELLE MYERS\nAND CHARLES DUSTIN MYERS\n\nMOTION FOR RECUSAL\n\nAND IN THE INTEREST OF MARA\nMYERS AND CAROLINE MYERS,\nCHILDREN\n\nTO THE HONORABLE DAVID EVANS\nOF THE 8TH ADMINISTRATIVE JUDICIAL REGION OF TEXAS:\n\nIn February of 2018, response to a question posed by the Republican Club Political\nAction Committee, the now elected District Judge James Munford stated:\n\n“I’m running for this office because I’ve worked many, many years in the family law field. I want\n\nto help and work with the citizens of Tarrant County and the families of Tarrant County to\n\nprovide a good and accurate judiciary that follows the rules of law.”\nHowever, in this case, Respondent, CHARLES DUSTIN MYERS, has encountered a\nseries of judicial determinations that fundamentally contradict this objective. The\nassurance to uphold a judiciary that follows the rule of law has been replaced with\ndecisions that have deprived the Respondent of due process, equitable hearings, and his\nfundamental paternal rights. Respondent respectfully moves to recuse District Judge\n\nJames Munford and Associate Judge Jeffrey Kaitcer pursuant to TAC §155.152 & TEX.\n\nR. CIV. P § 18b(b)(1) and in support thereof , states the following un-opposed facts:\n\nI. BASIS FOR RECUSAL\n\nA. The impartiality of a judge may be challenged in the trial court by a motion to\nrecuse. TEX. R. CIV. P. 18a, 18b. The Respondent respectfully moves to recuse Honorable\nJudge James Munford and Honorable Associate Judge Jeffrey Kaitcer from presiding over\ncause number 322-744263-23! for their collective inability to remain impartial in this\nmatter by depriving the Respondent of a fair trial on four separat"}
{"id": "6e558823985fff2a9809a7500f7cff38215a6c97", "vector_id": 3, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 3, "char_len": 2000, "text": "iate Judge Jeffrey Kaitcer from presiding over\ncause number 322-744263-23! for their collective inability to remain impartial in this\nmatter by depriving the Respondent of a fair trial on four separate appearances. “Texas\nrequires the recusal of a judge in any case where his or her impartiality might reasonably\nbe questioned, regardless of any actual bias which may be held in a case.” Aguilar v,\n\nAnderson., 855 S.W.2d 799, 815.\n\nB. This motion has been filed at the earliest practicable opportunity, as the\nRespondent has exhausted all other available legal avenues without receiving any response,\nexplanation, or opposition. Respondent has given the trial court every opportunity to\ncorrect the errors made in this case and has recently discovered pertinent information\nrelated to the initial proceeding that took place on January 16th, 2024, as outlined below.\nThere are no current settings or upcoming hearings, and the case has not yet been scheduled\nfor a final trial. The Respondent’s motion is verified and asserts grounds for recusal\npursuant to TEX. CIV. R. P. 18(b)b1. These grounds are not predicated solely on the judges’\nprior rulings. Instead, this motion presents detailed, particularized facts based on the\nRespondent's direct knowledge that are admissible as evidence and are self-authenticating\n\n&&\nage\n\n' This case was consolidated on January 16\", 2024, by District Judge James Munford with cause number\n322-744538-23, a protective order suit initiated by the Petitioner, Morgan Michelle Myers.\n\n2\n\nunder Rule 902(4) of the Texas Rules of Evidence and are sufficient to warrant recusal.\nMoreover, where facts are presented based on information and belief, the foundation for\n\nsuch beliefs is explicitly stated. See TEX. R. CIV. P. 18a(a)(1)-(4); 18a(b)(1)\nIl. QUESTIONING THE IMPARTIALITY OF JAMES MUNFORD\n\nA. On September 29th, 2024, the Respondent discovered a Facebook post made by\nthe Tarrant County District Courts which stated the following:\n\n“The following Tarrant Count"}
{"id": "4e6b82c17fec279d0fdd56594535c9bb7cd23c79", "vector_id": 4, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 4, "char_len": 2000, "text": "MPARTIALITY OF JAMES MUNFORD\n\nA. On September 29th, 2024, the Respondent discovered a Facebook post made by\nthe Tarrant County District Courts which stated the following:\n\n“The following Tarrant County District Courts will be closed tomorrow, Tuesday, January 16,\n2024.\nThis list is evolving as individual Judges are making informed decisions based on their dockets,\n\ninclement weather, and the safety and welfare of litigants, Court staff, counsel, and the general\n\npublic.” — Tarrant County District Courts on January 15, 2024.\n\nThe Fort Worth Independent School District also announced that they would remain\nclosed due to inclement weather in the area. https://www.fox4news.com/news/dallas-fort-\nworth-school-closings-jan-16. On December 14\", 2024, the petitioner requested a\nprotective order from James Munford, which was denied. Exhibit A. However, one month\nand two days later, Judge James Munford made an initial decision that has been\nunexplained for the last ten months.\n\nB. The initial decision at issue arose during a show cause hearing concerning an\norder of protection initiated by the petitioner, Morgan Michelle Myers, on December 22,\n2023. This hearing was originally scheduled to be presided over by Associate Judge\nJeffrey Kaitcer in the 322\" District Court of Tarrant County at 9:00 A.M. on January 16\",\n\n2024. However, due to delays caused by inclement weather as mentioned above, the\n\nproceedings were instead conducted by District Judge James Munford, as Associate\n\nJudge Jeffrey Kaitcer arrived late.\n\nC. Both parties were present and appeared without legal representation. During the\nproceedings, Judge Munford presented the parties with an agreed continuance, which\nboth parties accepted, and which was subsequently granted by Judge Munford as\nreflected in his order. However, despite granting the continuance, Judge Munford went\nfurther, issuing a series of rulings where he sua sponte consolidated the protective order\ncase with the divorce case previously filed by the pe"}
{"id": "414ec4a7403ebb81700721653565801e4dab0f1d", "vector_id": 5, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 5, "char_len": 2000, "text": "r, despite granting the continuance, Judge Munford went\nfurther, issuing a series of rulings where he sua sponte consolidated the protective order\ncase with the divorce case previously filed by the petitioner on December 18, 2023.\nExhibit B. He ordered the Respondent to vacate the residency that same day by 2:00 p.m.,\ndivested him of the custody of his children, and the hearing was then rescheduled for\n\nJanuary 22, 2024, to be presided over by Associate Judge Jeffrey Kaitcer. Exhibit C.\n\nD. This decision by Judge Munford undeniably raises serious questions regarding\nhis impartiality in this matter. Due process of law requires that an individual receive\nnotice and hearing before being deprived of a property right. In re the Guardianship of\nBays, 355 $.W.3d 715, 720 (Tex. App. 2011); See Grannis v. Ordean, 234 U.S. 385, 394,\n348. Ct. 779, 783, 58 L. Ed. 1363 (1914) (\"a fundamental requisite of due process of law\nis the opportunity to be heard\"). Furthermore, the Texas Family Code prohibits such an\norder before notice and hearing. TEX. FAM. CODE 105.001 (“...an order may not be\nrendered under Subsection (a)(1)... except after notice and a hearing...”) (referencing\n\nchild custody).\n\nE. Moreover, 6.405(b) of the Texas Family Code was not satisfied, which is a\nmandatory requirement before any hearing can take place given the original petition for\ndivorce claimed an active order of protection was currently in effect against the\nRespondent. Exhibit B, p. 7. (‘The petitioner shall attach to the petition a copy of each\norder described by Subsection (a)(1) in which a party to the suit or the child of a party to\nthe suit was the applicant or victim of the conduct alleged in the application... if a copy\nof the order is not available at the time of filing, the petition must state that a copy of the\norder will be filed with the court before any hearing.) All of the procedural safeguards\n\nabove were disregarded by James Munford.\n\nF, The purpose of temporary orders with injunctive r"}
{"id": "2a491bd85793679971aef9d55e06d7d2c9cec1af", "vector_id": 6, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 6, "char_len": 2000, "text": "t a copy of the\norder will be filed with the court before any hearing.) All of the procedural safeguards\n\nabove were disregarded by James Munford.\n\nF, The purpose of temporary orders with injunctive relief is not to destroy the\nstatus quo, but rather to preserve it. See Iranian Muslim Organization v. City of San\nAntonio, 615 S.W.2d 202, 208 (Tex. 1981); Davis v. Huey, 571 S.W.2d 859, 862 (Tex.\n1978); Citizens of Texas Sav. v. Fox Jacobs, 718 S.W.2d 2, 3 (Tex. App. 1985). Similarly\nto how the temporary injunction in Coyote Lake Ranch, LLC v. City of Lubbock, 498\nS.W.3d 53 (Tex. 2016) improperly denied the City its undisputed right to access\ngroundwater—an essential resource—Judge Munford's rulings have deprived the\nRespondent of his residency, which has served not only as the family home since 2015\nbut also as the headquarters for his business which provided for the children — an\nessential resource to their wellbeing. Furthermore, the Respondent was divested of\ncustodial rights to his children without justification. Like the injunction in Coyote, rather\n\nthan preserving the status quo, these initial rulings have done the opposite by depriving\n\nthe Respondent of his constitutional rights to property prior to due process of law. US\nCONST. AMEND XIV, § 1; TEX CONST. ART. I, § 19. Furthermore, James Munford\nprejudged critical matters that require full evidentiary hearings. TEX. FAM. CODE\n105.001(b) (...an order may not be rendered under Subsection (a)(1), (2), or (5) except\nafter notice and a hearing.) (in regard to the temporary conservatorship for a child, for the\n\ntemporary support of the child, or for payment of attorney’s fees.)\n\nG. The Respondent’s burden of showing of bias or impartiality to such an extent\nthat the movant was deprived of a fair trial is satisfied from Judge Munford’s initial\nruling. See Rodriguez v. JPMorgan Chase Bank, N.A., No. 04-14-00342-CV, 22 (Tex.\n\nApp. Jun. 17, 2015).\n\nH. The threshold for recusal is \"whether a reasonable member of the pub"}
{"id": "c0c0681abdb2e41c44642028fddee44ad5d6e5a1", "vector_id": 7, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 7, "char_len": 2000, "text": " Judge Munford’s initial\nruling. See Rodriguez v. JPMorgan Chase Bank, N.A., No. 04-14-00342-CV, 22 (Tex.\n\nApp. Jun. 17, 2015).\n\nH. The threshold for recusal is \"whether a reasonable member of the public at\nlarge, knowing all the facts in the public domain concerning the judge's conduct, would\nhave a reasonable doubt that the judge is actually impartial.\" Hansen v. JPMorgan Chase\nBank, N.A., 346 S.W.3d 769, 776 (Tex. App.—Dallas 2011, no pet.); Rodriguez v.\nJPMorgan Chase Bank, N.A., No. 04-14-00342-CV, 22 (Tex. App. Jun. 17, 2015). The\nRespondent asserts that a reasonable member of the public would indeed reasonably\ndoubt James Munford was actually impartial given that he deprived the Respondent of a\nfair trial. Thus, the Respondent’s burden and threshold for recusal has been met, and\n\nJudge James Munford should be recused from this matter.\n\nI. The only reasoning provided was an oral statement regarding his personal\n\nopinion regarding the Respondent living next door to his ex-partner’s grandparents,\n\nwhich is extrajudicial and comes from a biased perspective which discounted the facts of\nthe case relevant to the children’s well-being. In the context of this case, recusal is\nwarranted if the trial judge's impartiality might reasonably be questioned, or he has a\npersonal bias. TEX. R. CIV. P. 18b(2). This opinion or bias was irrelevant to the well\nbeing of the children, as the grandmother, much like the children, relied on the\nRespondent’s income in order to provide financial stability, and further justifies his\n\nrecusal.\nITI. QUESTIONING THE IMPARTIALITY OF JEFFREY KAITCER\n\nA. The initial ruling reset the case to January 224, 2024. The Respondent retained\nthe services of Dan Bacalis, while the Petitioner arrived without any legal representation\nand retained the services of Cooper Carter in the lobby of the courtroom. Much like the\nfirst setting, Associate Judge Jeffrey Kaitcer granted a continuance which only benefitted\nthe petitioner by allowing her legal represent"}
{"id": "66de54096807bba4ee898ffb05fad21fb07354eb", "vector_id": 8, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 8, "char_len": 2000, "text": " of Cooper Carter in the lobby of the courtroom. Much like the\nfirst setting, Associate Judge Jeffrey Kaitcer granted a continuance which only benefitted\nthe petitioner by allowing her legal representation more time to become familiar with the\ncase while simultaneously extending the initial orders of Judge James Munford to\nFebruary 1“, 2024, which significantly impacted the Respondent and his children. Exhibit\nD. Neither party appeared before the Jeffrey Kaitcer, and this decision was made without\n\nany input from the Respondent and without any opportunity to contest it.\n\nB. At the third trial setting on February 1, 2024, the parties arrived only to be\npresented with a settlement agreement from the Respondent’s own counsel. Given that\nthe case had been delayed twice already and the ongoing damage from being unable to\nwork at full capacity was compounding by the day, the Respondent contested this\n\n7\n\nstrategy. He was informed by his attorney that the orders could be modified later and was\nurged to sign it. Left with no better alternative, the Respondent signed the agreement\nunder duress after already being deprived of his residency, children, and business since\n\nJanuary 16\", 2024. Exhibit E\n\nC. The agreement removed the children from their own home that they had resided\nin their entire life and allowed the Respondent back into the home until March 1, 2024. It\nalso established child support, and allocated financial responsibilities to the parties, to\nwhere the Respondent was left with both car payments, an unreasonable amount of time\n\nto transition from the home and with the addition of child support obligations. Exhibit E\n\nD. Due to the Respondent’s counsel drafting a settlement agreement rather than\nrepresenting the interests of his client, he was terminated shortly after the third setting on\nFebruary 5, 2024, where the Respondent began to represent himself pro se. Exhibit F He\nfiled a motion to reconsider the associate judge’s report for temporary orders on February"}
{"id": "79535290de33f327e30f6edff6acf3e9c6e2706d", "vector_id": 9, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 9, "char_len": 2000, "text": "r the third setting on\nFebruary 5, 2024, where the Respondent began to represent himself pro se. Exhibit F He\nfiled a motion to reconsider the associate judge’s report for temporary orders on February\n9, 2024, which wasn’t set for hearing until March 14 due to unnecessary delay by the\nopposing counsel, Cooper Carter, who has not filed any pleadings in this case on behalf\n\nof the petitioner. Exhibit G\n\nE. Given that Dan Bacalis had been terminated, and that the associate judge’s\nreport signed on February 1, 2024, had clear stipulations regarding its’ reduction to\nwriting Exhibit G, p.5, the Respondent filed notice with the court on March 4\", 2024,\nstating that he would not be leaving the marital residence as it was not in the best\n\ninterests of his children. Exhibit H\n\nF. This decision prompted the petitioner to run inside the family residence on\nMarch 6\", 2024, while the Respondent was walking his daughters to school on her\nvisitation time and lock the petitioner out of the home. Since this day, the Respondent has\npursued relief to no avail, without argument, and without any response or findings of\n\nfacts from either judge or Cooper Carter, petitioner’s counsel.\n\nG. On March 14, 2024, the parties appeared before Associate Judge Jeffrey Kaitcer\nto address the Respondent's motion to reconsider. Just minutes prior to the hearing, the\nRespondent was served formally reduced temporary orders by Cooper L. Carter, which\ncontained significant clerical discrepancies and deviated from the original orders signed\non February 1, 2024. These orders are currently in effect today as ‘agreed orders’. Exhibit\n\nI. The orders also reference a hearing that was never conducted in this case.\n\nH. During the hearing, the Respondent was precluded from addressing the events\nleading up to February 1, 2024, due to sustained objections based on relevance. Despite\nsigning off on the Associate Judge’s Report which non-suited the protective order, the\nopposing counsel was nonetheless permitted to el"}
{"id": "529eb9b4dfedff0617b1730dac58be73037f9b2b", "vector_id": 10, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 10, "char_len": 2000, "text": "1, 2024, due to sustained objections based on relevance. Despite\nsigning off on the Associate Judge’s Report which non-suited the protective order, the\nopposing counsel was nonetheless permitted to elicit testimony from their client\nregarding her purported fear for safety should Respondent be allowed near the residency,\n\nwhich has not been supported by any evidence to date.\n\nI. Judge Kaitcer refused to admit the Respondent's exhibits, which included\naffidavits from business clients prepared to attest to his need for residency and his close\nrelationship with his daughters. Exhibit J. Judge Kaitcer further stated in open court,\n\nwhile drafting his ruling on the Respondent's motion, \"You don’t care about your kids.\n\nYou just care about your business.\" This remark, devoid of any evidentiary basis, exposed\na deep-seated bias that rendered impartial adjudication impossible. A neutral and\nimpartial evaluator would have acknowledged the interconnected nature of the\nRespondent's business, residency, and familial relationships as well as the impact of the\ninitial proceedings leading up to that point. Further, an impartial judge would have\nrealized that there is no logical explanation to remove a parent who relies on the\nresidency to provide for the children while simultaneously denying the evidence that\n\nwould have corroborated this need.\n\nJ. The Respondent's motion for reconsideration concluded with an illegible order,\nrequiring him to sign the temporary orders served just moments earlier by 1:30 p.m. that\nsame day. Exhibit K. Again, the order was designated as \"agreed\" despite lacking the\nRespondent's signature, was reduced outside of its’ own procedural requirements ordered\nby the same judge, was reduced without any underlying motion for temporary orders ever\nserved to the Respondent and differed from the associate judge’s report signed on\nFebruary 1, 2024. Rather than holding the opposing counsel and the petitioner in\ncontempt for violating Rule 13 of the Texas Rules of C"}
{"id": "1e8d68df63a1c2267bf4dff3f197d9abdd251c13", "vector_id": 11, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 11, "char_len": 2000, "text": "pondent and differed from the associate judge’s report signed on\nFebruary 1, 2024. Rather than holding the opposing counsel and the petitioner in\ncontempt for violating Rule 13 of the Texas Rules of Civil Procedure for signing a\nfictitious pleading which contained false statements, Jeffrey Kaitcer deprived the\n\nRespondent of a fair trial, thus warranting his recusal from this matter.\n\nK. It is evident, based on common sense and objective evaluation of the public\nfacts regarding Jeffrey Kaitcer’s conduct that no reasonable person would believe that he\n\nwas actually impartial knowing all of the facts of the case. After eight months of seeking\n\n10\n\nrelief throughout the Texas judiciary, the collective actions of Judge James Munford and\nAssociate Judge Jeffrey Kaitcer remain unexplained, and the damage is ongoing. Their\njoint recusal is necessary to ensure a fair resolution of this matter and to ensure the\n\npersistent favoritism directed towards the petitioner is abolished.\nIV. THE AFTERMATH\n\nA. Since the March 14\" hearing, the case has stalled. There has been no\nparticipation from the opposing party, and all attempted communications have failed.\nThere hasn’t been any explanation for the denials in the Second Court of Appeals, leaving\nthe Respondent to continue seeking every remedy available to him to correct the\n\ndecisions presented above or receive a valid legal basis that justifies them.\n\nB. The joint managing conservatorship that the current orders outline has put the\nRespondent in massive amounts of debt. He had to stay in hotels on Thursday nights in\norder to take his Children to school on Friday mornings for his visitation period, and for\nthe extended summer visitation, rented an AIR BNB in order to provide the Children with\na stable living space. The Respondent was able to have the owner of the AIRBNB located\nat 6608 Dewsbury St. that was only 1.3 miles from the Respondent’s home allow him to\nport forward the router, allowing him to work to some degree, where he"}
{"id": "593c13d19c400cf0a0ec3f2bf5775cd8bab66066", "vector_id": 12, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 12, "char_len": 2000, "text": "able to have the owner of the AIRBNB located\nat 6608 Dewsbury St. that was only 1.3 miles from the Respondent’s home allow him to\nport forward the router, allowing him to work to some degree, where he stayed until\nSeptember 14\", 2024. Given the requirements to operate his business, an alternative\nresidency would take a fair amount of time to transition to, and likewise the petitioner\n\nwould need equal amount of time to obtain full employment in order to maintain the\n\n11\n\ncurrent household. All of this was explained in the Respondent’s pleadings that were\n\nbefore the court on January 16\", 2024, but were not considered. Exhibit L, Exhibit M\n\nC. Since the March 14\" hearing, the petitioner has moved additional family\nmembers into the home, has not paid rent, and has reduced her employment while\nsignificantly reducing the Respondents. On top of both James Munford and Jeffrey\nKaitcer’s disregard for the law and the best interests of the children, the inadvertent\nfavoritism towards the petitioner has allowed her to further her own interests at the\nexpense of the status quo of the children. An impartial judge is required in this matter to\n\nensure that this one-sided favoritism does not continue at the expense of the children.\n\nD. On June 2 of 2024, the petitioner’s grandmother contacted the Respondent\nreiterating the above. She stated that the children were not being taken care of, that the\npetitioner was not acting like herself, and that she was not paying rent. This information\nwas relayed to the Supreme Court of Texas, where the Respondent’s motion for rehearing\non petition for writ of mandamus is still pending before the court, asking them to compel\nJames Munford to vacate the current orders which were entered by Associate Judge\nJeffrey Kaitcer as agreed without consent and referenced a hearing that has never taken\n\nplace.\nV. QUESTIONS THAT REMAIN UNANSWERED\nThroughout this case, several concerning questions have arisen regarding the conduct\n\nof both judges:\n\n12\n\n. What"}
{"id": "4e72f783eafea995e09e8d55129b3f2f4d29de7d", "vector_id": 13, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 13, "char_len": 2000, "text": " referenced a hearing that has never taken\n\nplace.\nV. QUESTIONS THAT REMAIN UNANSWERED\nThroughout this case, several concerning questions have arisen regarding the conduct\n\nof both judges:\n\n12\n\n. What dire circumstance compelled Judge James Munford to take up a case on\nshort notice and grant injunctions and make child custody decisions without\nknowing the facts or considering the pleadings, particularly on a day the court was\nclosed due to inclement weather when he had denied a similar request a month\n\nearlier?\n\n. Why did Judge Munford grant an agreed continuance at a protective order hearing\nand simultaneously rule against one of the parties on divorce issues without taking\n\ninto consideration the preponderance of the evidence before him?\n\n. What factual basis on the record compelled Jeffrey Kaitcer to openly make\n\nnegative statements about the Respondent regarding his children?\n\n. Why has Cooper Carter failed to respond to any of the Respondent’s pleadings and\n\nneglected to file any documents on behalf of her client?\n\n. What factual basis exists on the record to supports the petitioner being granted full\n\ncustody of the children and sole use of the residence?\n\n. How can an order be issued as an \"agreed order\" after consent was explicitly\nwithdrawn, referencing a hearing that never occurred, and served to the\n\nRespondent before a scheduled hearing meant to challenge the very order?\n\n13\n\nVI. CONCLUSION\n\nThis case, as detailed in the pending motion for rehearing before the Supreme\nCourt of Texas, revolves around the core issue of accountability. What began with\nMorgan Michelle Myers attempting to avoid responsibility has now evolved into a\ntroubling scenario where both judges have repeatedly failed to recognize and correct their\nserious missteps. Attorney Cooper Carter’s authority to represent the petitioner, currently\nbeing challenged through a Rule 12 motion, further deepens concerns about the integrity\n\nand fairness of these proceedings.\n\nRecusing both judges is n"}
{"id": "a1a73764fabf99d0ef4c845996390c6b87ffe19e", "vector_id": 14, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 14, "char_len": 2000, "text": " authority to represent the petitioner, currently\nbeing challenged through a Rule 12 motion, further deepens concerns about the integrity\n\nand fairness of these proceedings.\n\nRecusing both judges is not just a procedural necessity, but a crucial step toward\nensuring that this case is reviewed impartially and that the facts are properly considered.\nThis will allow the court to focus on the petitioner’s pattern of deception and, more\nimportantly, what truly serves the best interests of the children. The petitioner’s actions\nhave caused unnecessary delays, destabilized her family, and inflicted significant\nemotional and financial harm on all involved. The ongoing litigation, exacerbated by a\n\nlack of judicial transparency and accountability, has only added to the hardship.\n\nDespite these issues, the Respondent holds no ill will toward any party involved.\nHis primary concern has always been, and continues to be, doing what is right for his\nchildren. The Respondent believes that with impartial judges and a renewed focus on\nfairness, this case can still be resolved justly, allowing all parties to move forward with\ndignity and integrity. The Respondent remains diligent in his commitment to securing a\n\nfair outcome that reflects the best interests of his children as the Family Code mandates.\n\n14\n\nVII. PRAYER FOR RELIEF\n\nThe Respondent respectfully requests the following relief:\n\n1. That the clerk of the court deliver a copy of the motion for recusal to both the\nrespondent judges and the regional presiding judge, and deliver any signed orders\n\nof recusal or referral to the regional presiding judge immediately upon filing.\n\n2. That the respondent judges either recuse themselves or refer the motion to the\nregional presiding judge within three business days after the motion is filed, and\nrefrain from taking any further action in the case until the motion is decided,\n\nunless good cause is shown in writing or on the record.\n\n3. That the regional presiding judge issue interim orde"}
{"id": "a9456ef87833c287e4e646782ad036ebbd88324e", "vector_id": 15, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 15, "char_len": 2000, "text": "d, and\nrefrain from taking any further action in the case until the motion is decided,\n\nunless good cause is shown in writing or on the record.\n\n3. That the regional presiding judge issue interim orders to reset the status quo by\nallowing the Respondent’s immediate return to his home and business, thereby\n\ninitiating a peaceful transitionary period for the family’s well-being and stability.\n\n4. That the motion for recusal be conducted by telephone, as permitted by Rule\n18(g)(6)(C), to expedite the process and ensure all documents submitted by\nfacsimile or email, if otherwise admissible under the rules of evidence, are\n\nconsidered.\n\n5. That, if the motion is granted, the regional presiding judge reassign the case to\nanother court or assign another judge to ensure fairness and impartiality moving\n\nforward.\n\n15\n\nThe Respondent seeks this relief to ensure that the case proceeds in a just manner,\n\nrestoring stability and allowing a fair resolution to the matter at hand during the pendency\n\nof the case.\nRespectfully submitted,\n\n/s/ Charles Dustin Myers\nCHARLES DUSTIN MYERS\n6641 Anne Court\n\nWatauga, TX 76148\nChuckdustin]12@gmail.com\n817-507-6562\n\nPro-se\n\n16\n\nVU. CERTIFICATE OF SERVICE\n\nRespondent certifies that a true copy of this Joint Motion for Recusal was served in\naccordance with Rule 21a of the Texas Rules of Civil Procedure on the following\non 10/07/2024:\n\nCooper L. Carter (Counsel for real party in interest)\nby EMAIL/ESERVE at COOPERCARTER@MAJADMIN@COM\n\nMorgan Michelle Myers (real party in interest)\nby EMAIL/ESERVE at MORGANMW02@GMAIL.COM\n\nHOLLY HAYES (OAG)\nBy EMAIL/ESERVE at CSD-Legal-914@oag.texas.gov\n\n/s/ Charles Dustin Myers\nCHARLES DUSTIN MYERS\n6641 Anne Court\n\nWatauga, TX 76148\nChuckdustin]2@gmail.com\n817-507-6562\n\nPro-se\n\nIX. CERTIFICATE OF CONFERENCE\nA conference was not held with Cooper Carter on the merits of this Motion\nbecause the Respondent failed to reach via her provided telephone number on the\n\ncase docket after two attempts. Respondent has communic"}
{"id": "99bcab063053301150e9d93db7168a61aa5c89c7", "vector_id": 16, "source_txt": "extracted_text_full\\case_docs_by_filer\\district_judge\\10_08_24_order_of_referral_munford_1\\10_08_24_order_of_referral_munford_1.txt", "source_pdf": "CASE DOCS\\DISTRICT JUDGE\\10.08.24 Order of Referral Munford-1.pdf", "source_exists": true, "page": null, "chunk_index": 16, "char_len": 361, "text": "ce was not held with Cooper Carter on the merits of this Motion\nbecause the Respondent failed to reach via her provided telephone number on the\n\ncase docket after two attempts. Respondent has communicated the merits to the petitioner\n\n/s/ Charles Dustin Myers\nCHARLES DUSTIN MYERS\n6641 Anne Court\n\nWatauga, TX 76148\nChuckdustin]12@gmail.com\n817-507-6562\n\nPro-se"}