{
  "source": "C:\\code\\LEGAL_DESTROYER\\CASE DOCS\\CHARLES DUSTIN MYERS\\04.15.2025_DOMINANT JURISDICTION ANALYSIS-1.pdf",
  "base_name": "04_15_2025_dominant_jurisdiction_analysis_1",
  "page_count": 13,
  "pages": [
    {
      "page_number": 1,
      "text": "322-744623-23\nDOMINANT \nJURISDICTION \nANALYSIS\n04.15.25M.2088 M.2088\nM.2088 M.2088 M.2088 M.2088",
      "char_length": 96
    },
    {
      "page_number": 2,
      "text": "NO. 322-744263-23 \nIN THE 322nd DISTRICT COURT OF TARRANT COUNTY , TEXAS  \nTO THE HO NORABLE COURT:  \nUnder Texas law, the doctrine of dominant jurisdiction dictates that when two suits \ninvolving the same parties and subject matter are filed in courts of concurrent jurisdiction, the \ncourt where the suit was first filed typically acquires exclusive control.  However, this \npresumption can be overcome by showing that the first suit was initiated in bad faith or for the purpose of delay. Texas courts, following the rule established in Wyatt v. Shaw Plumbing Co., recognize exceptions where the first suit was filed merely to establish procedural priority, in anticipation of subsequent litigation, or to stall the opposing party’s legitimate claims. These principles provide a vital check against strategic abuse of court processes and ensure jurisdictional fairness when forum manipulation is evident.  \nThis analysis looks into the cir cumstances surrounding this matter, and is presented in a \ngood- faith effort to provide insight to the court. ITMOMO  \n(AITIO M.E.M., C.R.M., two children) \nMORGAN MICHELLE MYERS  \nPetitioner,  \nCHARLES DUSTIN MYERS , DOMINANT JURISDICTION ANALYSIS  \nRespondent.  \n2025 -04-15 322-744263-23 FILED\nTARRANT COUNTY\n4/15/2025 10:38 AM\nTHOMAS A. WILDER\nDISTRICT CLERKM.2089 M.2089\nM.2089 M.2089 M.2089 M.2089",
      "char_length": 1347
    },
    {
      "page_number": 3,
      "text": "Dominant Jurisdiction Analysis with Bad Faith Focus  \nI. Legal Framework for Dominant Jurisdiction \nA. General Principles  \nUnder Texas law, the doctrine of dominant jurisdiction provides that when two suits are \npending in courts of concurrent jurisdiction involving the same parties and subject matter, the \ncourt in which the suit was first filed acquires dominant jurisdiction to the exclusion of the other court. This doctrine is established in the seminal case of Curtis v. Gibbs , 511 S.W.2d 263 (Tex. \n1974), where the Texas Supreme Court held that any subsequent suit involving the same parties and controversy must be dismissed if a party to that suit calls the second court's attention to the pendency of the prior suit. \nB. Bad Faith Exception \nHowever, Texas courts recognize an important exception to the dominant jurisdiction \ndoctrine: when the first-filed suit was brought in bad faith or for the purpose of delay. As \nestablished in Wyatt v. Shaw Plumbing Co., 760 S.W.2d 245, 248 (Tex. 1988), the first court's \ndominant jurisdiction can be defeated by showing that the first suit was filed: \n1. As a mere pretext to establish priority; \n2. In anticipation of the second suit; \n3. For the purpose of delay; or \n4. In bad faith. \nWhen this exception applies, the second court may proceed with its case despite the pendency of the first- filed suit.  M.2090 M.2090\nM.2090 M.2090 M.2090 M.2090",
      "char_length": 1409
    },
    {
      "page_number": 4,
      "text": "II. Evidence of Bad Faith in the Initial Suit\nA. Chronology Demonstrating Premeditated Legal Strategy\n1.Pre-Filing Coordination with Dan Branthoover (December 14-17, 2023)\n•Morgan exchanged 92 text messages with Dan Branthoover on December 14,\n2023\n•Dan persuaded Charles to allow Morgan to bring children to his residence underfalse pretenses\n•While at Dan's residence, Morgan prepared divorce papers with his assistance\n•Dan purchased a second phone for Morgan and pepper spray mace\n2.Financial Misconduct Prior to Filing (December 15 -16, 2023)\n•Morgan transferred $1,576 from joint account to Dan's PayPal account\n•When confronted, Dan falsely claimed Morgan transferred money to her ownaccount\n•Morgan then claimed to be indigent in her divorce filing despite having justtransferred these funds\n3.False Claims in Initial Filings (December 18 -22, 2023)\n•Morgan filed for divorce on December 18, 2023, claiming to be indigent\n•She falsely claimed an active protection order already existedM.2091 M.2091\nM.2091 M.2091 M.2091 M.2091",
      "char_length": 1034
    },
    {
      "page_number": 5,
      "text": "•She falsely claimed family violence had occurred during the marriage to waive\nthe 60- day waiting period\n•She falsely claimed financial responsibility for bills that Charles paid\n•Despite claiming an active protective order already existed, she filed for anotherone on December 22, 2023\nB. Misrepresentations to the Court\n1.False Allegations of Family Violence\n•No evidence of family violence was ever presented\n•Morgan claimed family violence occurred on December 18, 2023, which wasdemonstrably false\n•These allegations were strategically included to waive the 60 -day waiting period\nfor divorce\n2.False Financial Affidavits\n•Morgan claimed indigent status immediately after transferring $1,576 from jointaccount\n•She misrepresented financial responsibilities, claiming to make both car payments\n•She falsely claimed to have no money despite the recent transfer\n3.Fabricated Protective Order Status\n•Morgan's grandmother served an eviction notice claiming a protective order hadbeen filed when none existedM.2092 M.2092\nM.2092 M.2092 M.2092 M.2092",
      "char_length": 1050
    },
    {
      "page_number": 6,
      "text": "•Initial divorce filing claimed an active protective order existed when none did\n•These misrepresentations were designed to prejudice the court against Charles\nC. Procedural Manipulation\n1.Strategic Delays and Attorney Changes\n•At the January 22, 2024 hearing, Morgan appeared without counsel\n•She hired Cooper L. Carter on the spot in the courtroom lobby to cause further\ndelay\n•This tactic successfully delayed the case until February 1, further prejudicingCharles\n2.Self-Help Tactics Outside Legal Process\n•On March 6, 2024, Morgan illegally locked Charles outside the home\n•This occurred after Charles had filed notice with the court that he would not leaveuntil after the hearing\n•This demonstrated willingness to circumvent legal process\n3.Systematic Non -Prosecution\n•After securing favorable temporary orders, Morgan's counsel ceased prosecutingthe case\n•Last action in the divorce matter was April 24, 2024, nearly one year agoM.2093 M.2093\nM.2093 M.2093 M.2093 M.2093",
      "char_length": 977
    },
    {
      "page_number": 7,
      "text": "•This pattern suggests the initial filing was not intended to resolve the dispute but\nto secure tactical advantages\nIII. Application of Bad Faith Exception to Current Case\nA. Legal Analysis\nThe facts of this case align precisely with the bad faith exception outlined in Wyatt v. Shaw \nPlumbing Co. The initial divorce filing shows clear evidence of being: \n1.A mere pretext to establish priority : The coordinated preparation of documents with\nDan Branthoover before any legitimate attempt at reconciliation or mediationdemonstrates the filing was pretextual.\n2.Filed in anticipation of potential action by Charles : The timing of the filing after\nCharles discovered evidence of an affair suggests anticipatory filing to gain tacticaladvantage.\n3.For the purpose of delay : The systematic non -prosecution of the case for nearly a year\nafter securing favorable temporary orders demonstrates the purpose was not resolutionbut delay.\n4.In bad faith : The numerous false statements in court filings, including claims about\nprotective orders, family violence, and financial status, constitute clear bad faith.\nB. Case Law Support\n1.In re Henry , 274 S.W.3d 185, 193 (Tex. App.—Houston [1st Dist.] 2008, pet. denied)M.2094 M.2094\nM.2094 M.2094 M.2094 M.2094",
      "char_length": 1252
    },
    {
      "page_number": 8,
      "text": "•Court held that \"filing a lawsuit for an improper purpose, such as to harass, cause\nunnecessary delay, or needlessly increase the cost of litigation, is sanctionableconduct.\"\n•The pattern of behavior in the initial divorce filing aligns with this standard.\n2.Perry v. Del Rio , 66 S.W.3d 239, 252 (Tex. 2001)\n•The Texas Supreme Court recognized that \"the first-filed rule should not beapplied inflexibly or when doing so would reward gamesmanship or ill motive.\"\n•Morgan's coordinated preparation of divorce filings while misleading Charlesabout her intentions constitutes precisely the kind of gamesmanship courts shouldnot reward.\n3.Gonzalez v. Reliant Energy, Inc. , 159 S.W.3d 615, 622 (Tex. 2005)\n•Court held that dominant jurisdiction does not apply when the first suit is filed \"inanticipation of the second suit and in an effort to subvert the second action.\"\n•The timing and coordination with Dan Branthoover suggest the divorce was filedin anticipation of potential action by Charles after discovering the affair.\nC. Family Law Context\nIn family law matters, courts have been particularly vigilant about bad faith filings due to their \nimpact on children and families: \n1.In re Marriage of Allen , 593 S.W.3d 133, 137 (Tex. 2019)M.2095 M.2095\nM.2095 M.2095 M.2095 M.2095",
      "char_length": 1281
    },
    {
      "page_number": 9,
      "text": "•The Texas Supreme Court emphasized that in family law matters, courts must be\nparticularly vigilant about procedural gamesmanship that affects children'swelfare.\n•The false allegations of family violence and protective orders directly implicatethis concern.\n2.In re Sims , 88 S.W.3d 297, 303- 04 (Tex. App.—San Antonio 2002, orig. proceeding)\n•Court held that in SAPCR cases, the best interest of the child can override strictapplication of dominant jurisdiction.\n•The systematic non-prosecution of the case has prevented resolution, contrary tothe children's best interests.\nIV . Implications for Current Proceedings\nA. Legal Consequences of Bad Faith Finding\nIf the court determines the initial divorce filing was made in bad faith, several significant legal \nconsequences follow: \n1.Dominant Jurisdiction Defeated : The 233rd District Court would not be bound by the\ndominant jurisdiction of the 322nd District Court where the divorce was filed.\n2.Consolidation Order Invalidated : The consolidation order would be invalid not only for\nprocedural defects but also because it erroneously applied dominant jurisdictionprinciples to a bad faith filing.\n3.Independent Proceeding Permitted : Charles's SAPCR filing in the 233rd District Court\ncould proceed independently, unaffected by the prior divorce filing.M.2096 M.2096\nM.2096 M.2096 M.2096 M.2096",
      "char_length": 1351
    },
    {
      "page_number": 10,
      "text": "4.Potential for Sanctions : The court could consider sanctions against Morgan and/or her\ncounsel for the bad faith filing and misrepresentations to the court.\nB. Strategic Approach for Rehearing Motion\nIn the motion for rehearing, the bad faith analysis should be presented as an independent, \nalternative ground for mandamus relief: \n1.Primary Argument : The consolidation order should be vacated due to procedural defects\n(lack of notice, hearing, proper transfer).\n2.Alternative Argument : Even if procedurally proper, consolidation was improper\nbecause the first -filed suit's dominant jurisdiction was defeated by bad faith.\n3.Relief Requested : The court should:\n•Vacate the consolidation order\n•Recognize the 233rd District Court's authority to proceed independently with theSAPCR\n•Order the trial court to hear Charles's emergency TRO on its merits\nV . Conclusion\nThe doctrine of dominant jurisdiction is not an absolute rule but a principle of judicial \nefficiency that yields when its application would reward bad faith or procedural gamesmanship. The extensive evidence of coordination before filing, false statements in court documents, and systematic non -prosecution after securing favorable orders demonstrates that the initial divorce \nfiling was made in bad faith. M.2097 M.2097\nM.2097 M.2097 M.2097 M.2097",
      "char_length": 1323
    },
    {
      "page_number": 11,
      "text": "Under Texas law, this bad faith defeats any claim of dominant jurisdiction by the 322nd District \nCourt. Consequently, the consolidation order was not only procedurally defective but substantively erroneous in its application of dominant jurisdiction principles. The Court of Appeals should grant rehearing and issue mandamus relief to prevent the trial court from rewarding this bad faith through improper consolidation. M.2098 M.2098\nM.2098 M.2098 M.2098 M.2098",
      "char_length": 463
    },
    {
      "page_number": 12,
      "text": "CERTIFICATE OF SERVICE  \nRelator certifies that on April 15, 2025, a true and correct copy of the \nforegoing DOMINANT JURISDICTION ANALYSIS was served on all parties \nand counsel of record as follows: \nPETITIONER\nMorgan Michelle Myers \nReal Pa rty in Interest \nMORGANMW02@GMAIL.COM \nCooper L. Carter  \nMarx, Altman & Johnson  \n2905 Lackland Road \nFort Worth, TX 76116  \ncoopercarter@majadmin.com  Holly H ayes \n2001 Beach St \nFort Worth, T X 76103- 2308 \n817-459-6878\nCSD -Legal -914@oag.texas.gov \nTEXAS O .A.G.M.2099 M.2099\nM.2099 M.2099 M.2099 M.2099",
      "char_length": 553
    },
    {
      "page_number": 13,
      "text": "Automated Certificate of eService\nThis automated certificate of service was created by the efiling system.\nThe filer served this document via email generated by the efiling system\non the date and to the persons listed below. The rules governing\ncertificates of service have not changed. Filers must still provide a\ncertificate of service that complies with all applicable rules.\nEnvelope ID: 99677214\nFiling Code Description: No Fee Documents\nFiling Description: Dominant Jurisdiction Analysis\nStatus as of 4/15/2025 12:58 PM CST\nCase Contacts\nName\nCHARLES MYERS\nCooper L.Carter\nHOLLY HAYES\nMORGAN MICHELLEMYERSBarNumber Email\nchuckdustin12@gmail.com\ncoopercarter@majadmin.com\ncsd-filer-914@texasattorneygeneral.gov\nMORGANMW02@GMAIL.COMTimestampSubmitted\n4/15/2025 10:38:48 AM\n4/15/2025 10:38:48 AM\n4/15/2025 10:38:48 AM\n4/15/2025 10:38:48 AMStatus\nSENT\nSENT\nSENT\nSENTM.2100 M.2100\nM.2100 M.2100 M.2100 M.2100",
      "char_length": 909
    }
  ]
}